{"id": "03/587-1", "name": "Bai Wang 0001", "Article": {"conf/aaai/JiZWSWTLH21": {"title": "Who You Would Like to Share With? A Study of Share Recommendation in Social E-commerce.", "url": "https://ojs.aaai.org/index.php/AAAI/article/view/16097", "year": "2021", "author": {"Houye Ji": "223/8227", "Junxiong Zhu": "220/4084", "Xiao Wang 0017": "49/67-17", "Chuan Shi": "64/3041", "Bai Wang 0001": "03/587-1", "Xiaoye Tan": "156/3686", "Yanghua Li": "260/0773", "Shaojian He": "234/6897"}, "abstract": "The prosperous development of social e-commerce has spawned diverse recommendation demands, and accompanied a new recommendation paradigm, share recommendation. Signiﬁcantly different from traditional binary recommendations (e.g., item recommendation and friend recommendation), share recommendation models ternary interactions among 〈 User, Item, Friend 〉 , which aims to recommend a most likely friend to a user who would like to share a speciﬁc item, progressively becoming an indispensable service in social e-commerce. Seamlessly integrating the social relations and purchase behaviours, share recommendation improves user stickiness and monetizes the user inﬂuence, meanwhile encountering three unique challenges: rich heterogeneous information, complex ternary interaction, and asymmetric share action. In this paper, we ﬁrst study the share recommendation problem and propose a heterogeneous graph neural network based share recommendation model, called HGSRec. Speciﬁcally, HGSRec delicately designs a tripartite heterogeneous GNNs to describe the multifold characteristics of users and items, and then dynamically fuses them via capturing potential ternary dependency with a dual co-attention mechanism, followed by a transitive triplet representation to depict the asymmetry of share action and predict whether share action happens. Ofﬂine experiments demonstrate the superiority of the proposed HGSRec with signiﬁcant improvements (11.7%-14.5%) over the state-of-the-arts, and online A/B testing on Taobao platform further demonstrates the high industrial practicability and stability of HGSRec.\n\t\t\t\t"}, "conf/ijcnn/SunWW21": {"title": "Automated Graph Representation Learning for Node Classification.", "url": "https://doi.org/10.1109/IJCNN52387.2021.9533811", "year": "2021", "author": {"Junwei Sun": "85/3281", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1"}, "abstract": " Abstract:Graphs are ubiquitous and play an essential role in the real world. A vital prerequisite for analyzing graphs is to learn their effective representations. Most existing graph representation learning models are hand-crafted, which lack the scalability to different kinds of graphs. In this paper, we present AutoGRL, an AUTOmated Graph Representation Learning Framework for node classification. We first design an appropriate search space with four critical components in the automated machine learning (AutoML) pipeline: data augmentation, feature engineering, hyper-parameter optimization, and neural architecture search. Then we search for the best graph representation learning model in the search space on given graph data using an efficient searching algorithm. We conduct extensive experiments on four real-world node classification datasets to demonstrate that AutoG Rlcan automatically find competitive graph representation learning models on specific graph data effectively and efficiently."}, "conf/ijcnn/ZhanNZLWW21": {"title": "Disentangled-based Adversarial Network for Multiplex Network Embedding.", "url": "https://doi.org/10.1109/IJCNN52387.2021.9534065", "year": "2021", "author": {"Shimeng Zhan": "292/2102", "Nianwen Ning": "225/1421", "Kai Zhao": "72/2621", "Lianwei Li": "45/8497", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Multiplex networks contain multiple types of relations between nodes, where each relation type is modeled as one layer. In the real world, a relation type may only depend on certain attribute features of nodes. Most existing multiplex network embedding methods only focus on preserving consistent information or complementary information from multiplex networks. However, these methods ignore the dependency between node attributes and the topology of each relation. To address the problem, we propose a model called DAME (Disentangled-based Adversarial Network for Multiplex Network Embedding). We utilize generative adversarial learning to preserve the consistent and complementary information between different relation types. Meanwhile, we develop a disentangled graph convolution network (DGCN) based on disentangled learning, enabling DAME to capture the dependency between node attributes and each relation type. We conduct extensive experiments on five realworld datasets. Experimental results indicate the effectiveness of DAME on link prediction and node classification tasks."}, "conf/seke/GuoWWLSN21": {"title": "Complementary Representation of ALBERT for Text Summarization.", "url": "https://doi.org/10.18293/SEKE2021-084", "year": "2021", "author": {"Wenying Guo": "273/2740", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Lianwei Li": "45/8497", "Junwei Sun": "85/3281", "Maham Nazir": "329/0985"}, "abstract": ""}, "conf/www/JiZSWWZZZL21": {"title": "Large-scale Comb-K Recommendation.", "url": "https://doi.org/10.1145/3442381.3449924", "year": "2021", "author": {"Houye Ji": "223/8227", "Junxiong Zhu": "220/4084", "Chuan Shi": "64/3041", "Xiao Wang 0017": "49/67-17", "Bai Wang 0001": "03/587-1", "Chaoyu Zhang": "256/7393", "Zixuan Zhu": "218/7058", "Feng Zhang": "48/1294", "Yanghua Li": "260/0773"}, "abstract": "\n\t\t Promotion recommendation, as a new recommendation paradigm in recent years, plays an important role in stimulating the purchase desire of users and maximizing the total revenue. Different from previous recommendations (e.g., item/group recommendation), promotion recommendation aims to select a set of K items based on all user preferences in selection phase and maximize the total revenue in delivery phase. Although these two phases are closely related with each other, existing methods usually focus on item selection in selection phase, largely ignoring the delivery phase and leading to sub-optimal performance. To solve the promotion recommendation problem, we propose the comb-K recommendation model, a constrained combinatorial optimization model which seamlessly integrates the selection phase and delivery phase with delicately designed constraints. When selecting K items, the comb-K recommendation is able to simultaneously search the optimal combination of item selection and delivery with the full consideration of all user preferences. Specifically, we propose a novel heterogeneous graph convolutional network to estimate user preference and propose the user-level comb-K recommendation model through solving a binary combination optimization problem. In order to handle combination explosion for large-scale users, we furtherly cluster massive users into limited groups and present a group-level comb-K recommendation model in which a novel heterogeneous graph pooling network is proposed to perform user clustering and estimate group preference. In addition, considering the ”long tail” phenomenon in e-commerce, we design a restricted neighbor heuristic search to accelerate the solving process. Extensive experiments on four datasets demonstrate the superiority of comb-K model for large-scale promotion recommendation. On billion-scale data, when clustering 2.5 × 107 users into 103 groups, our model is able to preserve 98.7% personalized preferences in group-level and significantly improves the Total Click and Hit Ratio by 9.35% and 7.14%, respectively.\n\t"}, "conf/asse/ZengWW20": {"title": "Call Attention to Stances: Detect Rumor with a Stance Attention Network.", "url": "https://doi.org/10.1145/3399871.3399890", "year": "2020", "author": {"Lingyu Zeng": "293/4862", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tWith the advent of web2.0 era, social media such as microblogging platforms have become important information distribution channels. Considering the amount of users on microblogging platforms, the rumor spreading on microblogging platform could have a negative effect on individuals, groups and the whole society. Hence, automatic rumor detection method is required. Stance features are a crucial for rumor detection, because users discussing rumors tend to express more querying and denying stances. However, different user stances have different importance. Motivated by this inspiration, in this paper, we propose a Rumor Detection Model with a Stance Attention Network (RDM-SAN). The RDM-SAN consists of three modules: stance module, rumor module and integrate module. The first module is a stance module, in which recurrent neural network and convolutional neural network are used to capture grammatical and event-related information released by individual users respectively. Then attention mechanism is leveraged to make sure that the most valuable information is contained in the event stance latent representation. The second module is a rumor module in which the content features and temporal features of a microblogging event are captured. The third module is an integrate module in which stance representations and rumor representations are concatenated together to detect rumors. Experiments on a real-world dataset from Weibo platform demonstrate that our proposed model RDM-SAN improves the performance of rumor detection in terms of both efficiency and accuracy compared to other methods, and the accuracy of our model achieves 94.6%.\n\t"}, "conf/dsc/GuanWWL20": {"title": "Personality2vec: Network Representation Learning for Personality.", "url": "https://doi.org/10.1109/DSC50466.2020.00013", "year": "2020", "author": {"Zhanming Guan": "273/2725", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Hezi Liu": "221/8449"}, "abstract": " Abstract:Online social networks have made tremendous progress in recent years. People generate a large amount of text information in which the linguistic and the semantic information could convey a great deal of information about the users' personality. Studies on personality analysis based on text information from online social networks have gradually increased in recent years. However, the previous works do not leverage the text information comprehensively and thus limits the prediction accuracy. In this paper, we propose personality2vec, a novel model that is based on network representation learning and makes full use of the semantic, the personality, and the structural information in users' texts. The model utilizes a new biased walk algorithm and an improved skip-gram algorithm to train on the network and eventually generates a personality vector for each user. We feed the personality vectors into regression algorithms to predict users' Big Five personality scores. Experimental results show that personality2vec outperforms seven popular methods on three personality datasets."}, "conf/dsc/ZhuWW20": {"title": "Deepfake Detection with Clustering-based Embedding Regularization.", "url": "https://doi.org/10.1109/DSC50466.2020.00046", "year": "2020", "author": {"Kui Zhu": "273/2749", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:In recent months, AI-synthesized face swapping videos referred to as deepfake have become an emerging problem. False video is becoming more and more difficult to distinguish, which brings a series of challenges to social security. Some scholars are devoted to studying how to improve the detection accuracy of deepfake video. At the same time, in order to conduct better research, some datasets for deepfake detection are made. Companies such as Google and Facebook have also spent huge sums of money to produce datasets for deepfake video detection, as well as holding deepfake detection competitions. The continuous advancement of video tampering technology and the improvement of video quality have also brought great challenges to deepfake detection. Some scholars have achieved certain results on existing datasets, while the results on some high-quality datasets are not as good as expected. In this paper, we propose new method with clustering-based embedding regularization for deepfake detection. We use open source algorithms to generate videos which can simulate distinctive artifacts in the deepfake videos. To improve the local smoothness of the representation space, we integrate a clustering-based embedding regularization term into the classification objective, so that the obtained model learns to resist adversarial examples. We evaluate our method on three latest deepfake datasets. Experimental results demonstrate the effectiveness of our method."}, "conf/dsc/XingWW20": {"title": "An Efficient Parallel Stochastic Gradient Descent for Matrix Factorization On GPUS.", "url": "https://doi.org/10.1109/DSC50466.2020.00047", "year": "2020", "author": {"Tianyu Xing": "273/2755", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Matrix factorization (MF) is an essential method used in recommender systems, database systems, word-embedding, Graph-mining, and others. Stochastic gradient descent (SGD) is a widely-used method of solving the MF problem because it has effective accuracy in dealing with large datasets and high computing speed. SGD is hard to be parallelized as it is a sequential algorithm, but there are also some effective parallel methods proposed by researches. In this research, we propose EMF-SGD, an effective GPU-based method of large-scale recommender systems. EMF-SGD accelerated the SGD algorithm by utilizing the GPU shared-memory and warp operations. Besides, we focus on maintaining the relationship between users and items in preprocessing data to gain higher accuracy. Finally, we parallelize the EMF-SGD on multi-GPUS and proved it gains 1.8-4.3x speed up and higher accuracy over the most state-of arts algorithm GPU-MF-SGD, based on the different amount of GPUS we used."}, "conf/dsc/GuoWWY20": {"title": "Two-stage encoding Extractive Summarization.", "url": "https://doi.org/10.1109/DSC50466.2020.00060", "year": "2020", "author": {"Wenying Guo": "273/2740", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Yuanyu Yang": "233/7784"}, "abstract": " Abstract:Pre-trained language model can express the semantics of word or text span, is widely applied in many NLP tasks, and text summarization is no exception. It is created using fine-tuning or feature-based method on pre-training model. Since Bidirectional Encoder Representations from Transformers (BERT; Devlin et al. 2019), many works model text summarization based on BERT, and fine tune all the parameters end-to-end. Notably, multiple research proposed different strategies to create enhanced versions of BERT further, which achieve the state-of-the-art performance in many NLP tasks. In this paper, we explore the potential of multiple versions of BERT to handle text summarization. We present a two-stage encoder model (TSEM) for extractive summarization. The first stage applies A Lite BERT (ALBERT; Lan et al. 2019) to secure sentence-level embedding, identify valuable content based on A Lite BERT (ALBERT; Lan et al. 2019). The second stage proposes a new strategy to fine-tune BERT deriving meaningful document embedding, then select the best-matched combination of important sentences with source document to compose summarization. Experimental result on the CNN/Daily Mail dataset demonstrates that our model is competitive with the state-of-the-art result."}, "conf/icwe/LingyuBB20": {"title": "Detecting Rumor on Microblogging Platforms via a Hybrid Stance Attention Mechanism.", "url": "https://doi.org/10.1007/978-3-030-50578-3_24", "year": "2020", "author": {"Lingyu Zeng": "293/4862", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Microblogging platforms are important social media in the Internet age. Considering the amount of users on microblogging platforms, the rumor spreading on microblogging platform could have a negative effect on individuals, groups and the whole society. Hence, automatic rumor detection is an important research issue. Stance information contains crucial features for rumor detection, because users discussing rumors tend to express more querying and denying stances. Moreover, different user stances have different importance. Motivated by this inspiration, in this paper, we propose a Rumor Detection Model with a Hybrid Stance Attention Mechanism (RDM-HSAM). The RDM-HSAM consists of four modules. The first module is a stance module, in which the tweet-level stance representation is constructed. The second module is the attention module in which a hybrid attention mechanism is used to construct the event-level stance representation of a microblogging event. The hybrid attention mechanism is consisted of two attention mechanisms, i.e. content attention mechanism and user attention mechanism which are applied at the stance information and user profile respectively. The third module is a rumor module which captures the content features and temporal features of a microblogging event. The fourth module is an integrate module in which event-level stance representations and rumor representations are concatenated together to detect rumors. Experiments on a real-world dataset from Weibo platform demonstrate that our proposed model RDM-HSAM improves the performance of rumor detection in terms of both efficiency and accuracy compared to other methods, and the accuracy of our model achieves 94.9%.KeywordsRumor detectionStance miningAttentionNeural networks"}, "conf/ijcai/WangFKSLW20": {"title": "Decorrelated Clustering with Data Selection Bias.", "url": "https://doi.org/10.24963/ijcai.2020/301", "year": "2020", "author": {"Xiao Wang 0017": "49/67-17", "Shaohua Fan": "93/1263", "Kun Kuang": "194/4245", "Chuan Shi": "64/3041", "Jiawei Liu": "12/8228", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "conf/ksem/ZhangBWW20": {"title": "A Time Interval Aware Approach for Session-Based Social Recommendation.", "url": "https://doi.org/10.1007/978-3-030-55393-7_8", "year": "2020", "author": {"Youjie Zhang": "244/4918", "Ting Bai": "140/4333", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Users on social media like Facebook and Twitter are influenced by their friends. Social recommendation exploits users’ social activities for modeling their interests to enhance the activeness and retention of users. Besides, their interests change from time to time. Session-based recommendation divides users’ interaction history into sessions and predict users’ behaviors with the context information in each session. It’s essential but challenging to model the social activities and the dynamic property in an unified model. Besides, most of existing session-based recommendation approaches model users’ interaction history as ordered sequence in regardless of real timestamps of those interactions. To solve the above issues together, we design a heterogeneous graph for modeling the complex interactions among users and items and propose a Time Interval aware graph neural network-based Recommendation approach(TiRec) to model both the social activities and the dynamic property of users’ interaction with items. Furthermore, to capture users’ dynamic preference, we propose a time interval aware and self-attention based aggregator to model users’ preference in each session. Experimental results on several real-world datasets demonstrates the effectiveness of our proposed approach over some competitive baselines.KeywordsSession-based recommendationTime IntervalSocial recommendation"}, "conf/www/ZhaoBWWZYN20": {"title": "Deep Adversarial Completion for Sparse Heterogeneous Information Network Embedding.", "url": "https://doi.org/10.1145/3366423.3380134", "year": "2020", "author": {"Kai Zhao": "72/2621", "Ting Bai": "140/4333", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Youjie Zhang": "244/4918", "Yuanyu Yang": "233/7784", "Jian-Yun Nie": "n/JianYunNie"}, "abstract": "\n\t\tHeterogeneous information network (HIN) contains multiple types of entities and relations. Most of existing HIN embedding methods learn the semantic information based on the heterogeneous structures between different entities, which are implicitly assumed to be complete. However, in real world, it is common that some relations are partially observed due to privacy or other reasons, resulting in a sparse network, in which the structure may be incomplete, and the ”unseen” links may also be positive due to the missing relations in data collection. To address this problem, we propose a novel and principled approach: a Multi-View Adversarial Completion Model (MV-ACM). Each relation space is characterized in a single viewpoint, enabling us to use the topological structural information in each view. Based on the multi-view architecture, an adversarial learning process is utilized to learn the reciprocity (i.e., complementary information) between different relations: In the generator, MV-ACM generates the complementary views by computing the similarity of the semantic representation of the same node in different views; while in the discriminator, MV-ACM discriminates whether the view is complementary by the topological structural similarity. Then we update the node’s semantic representation by aggregating neighborhoods information from the syncretic views. We conduct systematical experiments1 on six real-world networks from varied domains: AMiner, PPI, YouTube, Twitter, Amazon and Alibaba. Empirical results show that MV-ACM significantly outperforms the state-of-the-art approaches for both link prediction and node classification tasks. \n\t"}, "conf/www/FanWSLLW20": {"title": "One2Multi Graph Autoencoder for Multi-view Graph Clustering.", "url": "https://doi.org/10.1145/3366423.3380079", "year": "2020", "author": {"Shaohua Fan": "93/1263", "Xiao Wang 0017": "49/67-17", "Chuan Shi": "64/3041", "Emiao Lu": "162/9591", "Ken Lin": "156/3996", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tMulti-view graph clustering, which seeks a partition of the graph with multiple views that often provide more comprehensive yet complex information, has received considerable attention in recent years. Although some efforts have been made for multi-view graph clustering and achieve decent performances, most of them employ shallow model to deal with the complex relation within multi-view graph, which may seriously restrict the capacity for modeling multi-view graph information. In this paper, we make the first attempt to employ deep learning technique for attributed multi-view graph clustering, and propose a novel task-guided One2Multi graph autoencoder clustering framework. The One2Multi graph autoencoder is able to learn node embeddings by employing one informative graph view and content data to reconstruct multiple graph views. Hence, the shared feature representation of multiple graphs can be well captured. Furthermore, a self-training clustering objective is proposed to iteratively improve the clustering results. By integrating the self-training and autoencoder’s reconstruction into a unified framework, our model can jointly optimize the cluster label assignments and embeddings suitable for graph clustering. Experiments on real-world attributed multi-view graph datasets well validate the effectiveness of our model.\n\t"}, "conf/adma/Qiao00Z19": {"title": "MLCA: A Multi-label Competency Analysis Method Based on Deep Neural Network.", "url": "https://doi.org/10.1007/978-3-030-35231-8_59", "year": "2019", "author": {"Guohao Qiao": "253/0739", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Baoli Zhang": "68/7449"}, "abstract": "The goal of human resource management is to select the right people to the right positions, no matter by recruitment, assessment or promotion. To achieve this goal, competency analysis is an effective way. We can obtain the employee’s competency and the position’s requirements by the analysis. The competency analysis also provide a strong intellectual support in the downstream works, such as assessing or promoting employees, or establishing employee files. The multi-label text classification model, which is proposed in this paper based on deep neural network, can successfully complete the competency analysis, and its performance is much better than the current text multi-label classification method. We also construct a multi-label classification dataset in human resource field, which is the first one focused on competency analysis, as far as we know.KeywordsCompetency analysisMulti-label text classificationDeep neural network"}, "conf/asunam/SunW0NW19": {"title": "A hierarchical insurance recommendation framework using GraphOLAM approach.", "url": "https://doi.org/10.1145/3341161.3345643", "year": "2019", "author": {"Sirui Sun": "256/6166", "Bin Wu 0001": "98/4432-1", "Zixing Zhang 0002": "02/10648-2", "Nianwen Ning": "225/1421", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tGraph has been widely used for modeling complex relationship datasets in different application fields. Social networks based recommendation system have obtained satisfactory results in Business Intelligence(BI). However, current personalized recommendation methods based on graph structure generally lack interactivity and seldom consider efficient data management. To address these problems, Graph OnLine Analytical Mining (GraphOLAM) is a promising method, which combines OLAP technology with social networks. We first propose an efficient recommendation framework based on GraphOLAM data cube technology for the recommendation in the insurance service. Based on this framework, a new algorithm framework named RU-GOLAM for insurance is proposed, which combines GraphOLAM dimensional aggregation operation and specific recommendation methods. A series of graphs can be generated by GraphOLAM dimensional aggregation operations, which reflect the relationships of nodes under the constraints of different hierarchical dimensions. Node similarities are calculated to generate the Top-N sequential recommendation based on all of these graphs, which can achieve the balance between the topology of the original graph and high-dimensional information of the nodes. Experiments show that our approach outperforms other baseline algorithms on an insurance service dataset.\n\t"}, "conf/dsc/LingyuCBB19": {"title": "SMAM: Detecting Rumors from Microblogs with Stance Mining Assisting Task.", "url": "https://doi.org/10.1109/DSC.2019.00044", "year": "2019", "author": {"Lingyu Zeng": "293/4862", "Chenguang Song": "243/4021", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:With the rapid development of the Internet, the Microblogging platform has become an important social media as well as an ideal platform for rumor spreading. Existing approaches mainly rely on the hand-crafted features which require daunting manual effort. Deep learning methods require less manual effort but none of them take full advantage of stance information. Stance information is an important feature for rumor detection because users exposed to rumors tend to express more querying and denying stances. A Stance Mining Assisting Model (SMAS) making full use of stance information is proposed in this paper. First, all the posts in a microblog event are divided into N subevents. Second, two deep learning network structures are proposed to learn hidden representations about stance mining and rumor detection respectively. Third, two hidden representations are concatenated into an integrated representation to detect rumor. The experimental results on dataset from Weibo platforms demonstrate that SMAS is effective in rumor detecting and the accuracy of our model achieves 93.9%."}, "conf/dsc/QiaoWWZ19": {"title": "Competency Analysis in Human Resources Using Text Classification Based on Deep Neural Network.", "url": "https://doi.org/10.1109/DSC.2019.00056", "year": "2019", "author": {"Guohao Qiao": "253/0739", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Baoli Zhang": "68/7449"}, "abstract": " Abstract:Competency analysis is the focus of attention in modern enterprise human resource management. Companies select the right person to work in the right position by matching the competency requirements of the position with the competency of the employees. In order to achieve this goal, this paper uses a deep neural network to implement a text classifier. Through bi-LSTM and convolution structure, the performance in the competency analysis task is significantly better than the current mainstream classification method. In other common classification tasks the model can also achieve good performance. At the same time, this paper creates a Chinese corpus and data set in the field of competency analysis by crawling millions of recruitment information on well-known recruitment websites. To the best of our knowledge, this is the first data set in the field of competency analysis."}, "conf/dsc/HongWWZ19": {"title": "STNS-CSG: Syntax Tree Networks with Self-Attention for Complex SQL Generation.", "url": "https://doi.org/10.1109/DSC.2019.00065", "year": "2019", "author": {"Miaomiao Hong": "257/2783", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Pengpeng Zhou": "205/7633"}, "abstract": " Abstract:Text-to-SQL tasks that translate natural questions into corresponding SQL queries aim to help users easily query vast amounts of data stored in relational databases. Most existing studies do not require generating complex SQL queries with subqueries or multiple clauses. However, these complex queries exist widely in real life. Syntax tree network model is proposed to generate complex SQL queries. It suffers from the low accuracy of column prediction. In this paper, we propose a novel model, Syntax Tree Networks with Self-attention for Complex SQL Generation, which develop the syntax tree network model in twofold. The one is applying self-attention mechanism to better capture information in questions, the other is a table predictor that can get table information from questions directly. Experimental results show that our method outperforms the previous state-of-the-art model by 1.9% in exact matching accuracy."}, "conf/iov/LanSWZS19": {"title": "A Lightweight Time Series Main-Memory Database for IoT Real-Time Services.", "url": "https://doi.org/10.1007/978-3-030-38651-1_19", "year": "2019", "author": {"Lina Lan": "05/10049", "Ruisheng Shi": "118/4779", "Bai Wang 0001": "03/587-1", "Lei Zhang 0049": "64/5666-49", "Jinqiao Shi": "53/10661"}, "abstract": "With the rapid development of Internet of things (IoT), a large number of IoT sensing devices produces amounts of sensing data in every second. These data should be processed in real-time to support IoT real-time services. The growth of IoT real-time services has been hampered due to the barriers of data storage efficiency and data processing performance with the traditional database system architecture. This paper proposes a lightweight time series main-memory database (TSMMDB) system for IoT real-time services. Firstly, we propose a tree structure of IoT sensing data model based on the IoT real-time monitoring business. The leaves of the tree are three-dimension tables. The data can be retrieved according to time, resource and measure. Based on the data model, we propose a customized virtual heap and virtual heap memory allocator. The applications can access the whole data in the database in their own processes based on shared memory without transferring data, and can achieve data persistence automatically based on memory mapping. The flexible data locality memory allocation makes the adjacent time series data storing in the continuous memory space which improves the data clustered analysis performance. The data access algorithm of TSMMDB has ideal time complexity, and experimental results show that TSMMDB has better performance significantly than the traditional main-memory database and disk-based relational database.KeywordsMain-memory databaseInternet of thingsReal-time serviceTime series dataVirtual heap memory allocator"}, "conf/pakdd/WangWWT19": {"title": "Complaint Classification Using Hybrid-Attention GRU Neural Network.", "url": "https://doi.org/10.1007/978-3-030-16148-4_20", "year": "2019", "author": {"Shuyang Wang": "16/8387", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Xuesong Tong": "208/4736"}, "abstract": "Recently, a growing number of customers tend to complain about the services of different enterprises on the Internet to express their dissatisfaction. The correct classification of complaint texts is fairly important for enterprises to improve the efficiency of transaction processing. However, the existing literature lacks research on complaint texts. Most previous approaches of text classification fail to take advantage of the information of specific characters and negative emotions in complaint texts. Besides, some grammatical and semantic errors caused by violent mood swings of customers are another challenge. To address the problems, a novel model based on hybrid-attention GRU neural network (HATT-GRU) is proposed for complaint classification. The model constructs text vectors at character level, and it is able to extract sentiment features in complaint texts. Then a hybrid-attention mechanism is proposed to learn the importance of each character and sentiment feature, so that the model can focus on the features that contribute more to text classification. Finally, experiments are conducted on two complaint datasets from different industries. Experiments show that our model can achieve state-of-the-art results on both Chinese and English datasets compared to several text classification baselines.KeywordsText classificationRecurrent neural networkAttention"}, "conf/www/WangJSWYCY19": {"title": "Heterogeneous Graph Attention Network.", "url": "https://doi.org/10.1145/3308558.3313562", "year": "2019", "author": {"Xiao Wang 0017": "49/67-17", "Houye Ji": "223/8227", "Chuan Shi": "64/3041", "Bai Wang 0001": "03/587-1", "Yanfang Ye": "07/4509", "Peng Cui 0001": "31/891-1", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "\n\t\tGraph neural network, as a powerful graph representation technique based on deep learning, has shown superior performance and attracted considerable research interest. However, it has not been fully considered in graph neural network for heterogeneous graph which contains different types of nodes and links. The heterogeneity and rich semantic information bring great challenges for designing a graph neural network for heterogeneous graph. Recently, one of the most exciting advancements in deep learning is the attention mechanism, whose great potential has been well demonstrated in various areas. In this paper, we first propose a novel heterogeneous graph neural network based on the hierarchical attention, including node-level and semantic-level attentions. Specifically, the node-level attention aims to learn the importance between a node and its meta-path based neighbors, while the semantic-level attention is able to learn the importance of different meta-paths. With the learned importance from both node-level and semantic-level attention, the importance of node and meta-path can be fully considered. Then the proposed model can generate node embedding by aggregating features from meta-path based neighbors in a hierarchical manner. Extensive experimental results on three real-world heterogeneous graphs not only show the superior performance of our proposed model over the state-of-the-arts, but also demonstrate its potentially good interpretability for graph analysis.\n\t"}, "conf/apweb/ZhangHSWW18": {"title": "Matrix Factorization Meets Social Network Embedding for Rating Prediction.", "url": "https://doi.org/10.1007/978-3-319-96890-2_10", "year": "2018", "author": {"Menghao Zhang": "188/5710", "Binbin Hu": "150/1977", "Chuan Shi": "64/3041", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Social recommendation becomes a current research focus, which leverages social relations among users to alleviate data sparsity and cold-start problems in recommender systems. The social recommendation methods usually employ simple similarity information as social regularization on users. Unfortunately, the widely used social regularization cannot make a good analysis of the users’ social relation characteristics. In order to overcome the shortcomings of social recommendations, we propose a new framework for which combines network embedding and probabilistic matrix factorization. We make use of social relation features extracted from social networks, on top of which we learn an additional layer that uncovers the social dimensions that explain the variation in people’s feedback. Furthermore, the influence of different social network embedding strategies on our framework are compared. Experiments on three real datasets validate the effectiveness of the proposed solution.KeywordsNetwork embeddingMatrix factorizationSocial recommendation"}, "conf/ijcai/ChenLSHWC18": {"title": "NeuCast: Seasonal Neural Forecast of Power Grid Time Series.", "url": "https://doi.org/10.24963/ijcai.2018/460", "year": "2018", "author": {"Pudi Chen": "222/7852", "Shenghua Liu": "32/2527", "Chuan Shi": "64/3041", "Bryan Hooi": "169/9975", "Bai Wang 0001": "03/587-1", "Xueqi Cheng": "44/912"}, "abstract": ""}, "conf/ijcnn/SheWWC18": {"title": "Distant Supervision for Relation Extraction with Hierarchical Attention and Entity Descriptions.", "url": "https://doi.org/10.1109/IJCNN.2018.8489631", "year": "2018", "author": {"Heng She": "228/1610", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Renjun Chi": "225/1491"}, "abstract": " Abstract:Distant supervision for relation extraction is an effective method to find novel relational facts from plain text. However, distant supervision inevitably suffers from wrong label problem, and most existing methods generally focus on direct sentences containing entity pairs, but ignore massive information from background knowledge. To tackle these problems, we propose a novel hierarchical attention model to select valid instances and capture vital semantic information in them. Furthermore, we incorporate entity descriptions extracted from Wikipedia into the hierarchical attention model to provide supplementary background knowledge. The proposed architecture can not only combat the noise introduced by distant supervision, but also adequately extract latent and helpful background information. The experimental results on both Chinese and English datasets show that the proposed approach consistently achieves significant improvements on relation extraction as compared with strong baselines."}, "conf/pricai/JiSW18": {"title": "Attention Based Meta Path Fusion for Heterogeneous Information Network Embedding.", "url": "https://doi.org/10.1007/978-3-319-97304-3_27", "year": "2018", "author": {"Houye Ji": "223/8227", "Chuan Shi": "64/3041", "Bai Wang 0001": "03/587-1"}, "abstract": "Recently, there is a surge of network embedding algorithms, which embed information network into a low dimensional space. However, contemporary network embedding algorithms focus on homogeneous networks, while we know that many real-world systems can be constructed with heterogeneous information networks (HINs). Compare to homogeneous networks, HINs contain heterogeneity types of nodes and edges, which leads to new challenges for traditional network embedding: handing mixed heterogeneous nodes and fusing rich semantic information. Although several HIN embedding algorithms have been proposed, these challenges have not been well dressed. How to explore the rich semantic information and integrate these information still remain to be solved. In this paper, we propose a novel attention based meta path fusion model for HIN embedding (called AMPE). In order to handle node heterogeneity and extract rich information, AMPE first extracts multiple homogeneous networks from HIN with meta paths, and then employs adopted AutoEncoders to embed these homogeneous networks. After that, AMPE fuses these embeddings learned from homogeneous networks with attention mechanism. Experimental results on two real-world datasets demonstrate the effectiveness of the proposed model."}, "conf/apweb/XieWW17": {"title": "New Word Detection in Ancient Chinese Literature.", "url": "https://doi.org/10.1007/978-3-319-63564-4_21", "year": "2017", "author": {"Tao Xie": "181/2328", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Mining Ancient Chinese corpus is not as convenient as modern Chinese, because there is no complete dictionary of ancient Chinese words which leads to the bad performance of tokenizers. So finding new words in ancient Chinese texts is significant. In this paper, the Apriori algorithm is improved and used to produce candidate character sequences. And a long short-term memory (LSTM) neural network is used to identify the boundaries of the word. Furthermore, we design word confidence feature to measure the confidence score of new words. The experimental results demonstrate that the improved Apriori-like algorithm can greatly improve the recall rate of valid candidate character sequences, and the average accuracy of our method on new word detection raise to 89.7%.KeywordsNew word detectionAncient chinese literatureApriori-likeNeural networkWord confidence"}, "conf/cyberc/WuWW17": {"title": "P&D Graph Cube: Model and Parallel Materialization for Multidimensional Heterogeneous Network.", "url": "https://doi.org/10.1109/CyberC.2017.56", "year": "2017", "author": {"Xinyu Wu": "21/1079", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:We consider extending decision support facilities toward large-scale sophisticated networks, upon which multidimensional attributes are associated variety of entities, forming the so-called Multidimensional heterogeneous network. Multidimensional heterogeneous network has become important tool for modelling information networks, meanwhile, OLAP (Online Analytical Processing) has proven to beeffective tool on relational data, however, it is computationally an enormous challenge to manage and analyse Multidimensional heterogeneous network to support effective decision making and OLAP operations. In this paper, we enrich the semantics of the traditional OLAP and propose a P&D (Path and Dimension) Graph Cube Model framework, which can support multi-type queries and graph OLAP operations. Furthermore, on the basis of P&D Graph Cube Model, we divide the graph cube materialization into two parts described as Path related Materialization and Dimensionrelated Materialization. On Path Materialization, by taking account of structure summarization, we design the Pathrelated Materialization Algorithm based on the definition of relation path set, thus resulting in a more insightful and structure-enriched network. On Dimension Materialization, we provide a Graph Frag-shell Algorithm to compute graph shell fragments for fast high-dimension Graph OLAP. Finally, we implement the related algorithms on Spark. The results of experiments on real data set confirm the effectiveness and scalable of P&D Graph Cube Model with materialization algorithms."}, "conf/dsc/WuW17": {"title": "Extracting Topics Based on Word2Vec and Improved Jaccard Similarity Coefficient.", "url": "https://doi.org/10.1109/DSC.2017.70", "year": "2017", "author": {"Chunzi Wu": "189/8511", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:To extract key topics from news articles, this paper researches into a new method to discover an efficient way to construct text vectors and improve the efficiency and accuracy of document clustering based on Word2Vec model. This paper proposes a novel algorithm, which combines Jaccard similarity coefficient and inverse dimension frequency to calculate the importance degree between each dimension in text vector and the corresponding document. Text vectors is constructed based on the importance degree and improve the accuracy of text cluster and key topics extraction. The algorithm is also implemented on MapReduce and the efficiency is improved."}, "conf/icnc/LiuWGMW17": {"title": "A multidimensional time-series association rules algorithm based on spark.", "url": "https://doi.org/10.1109/FSKD.2017.8393066", "year": "2017", "author": {"DongYue Liu": "221/8825", "Bin Wu 0001": "98/4432-1", "Chao Gu": "77/793", "Yan Ma": "31/1970", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Fault prediction of industrial systems has been a hot research orientation in recent years, which allows the maintainer to know the operation conditions and the fault to be occurred in advance so as to reduce the risk of fault and the economic loss. In general, association rules learning is one of the most effective methods in fault prediction of industrial systems, however, traditional methods based on association rules are not suitable for sparse time-series data that are common in industrial systems (e.g. transmission line data). Although some methods based on clustering to reduce the dimension of data have been proposed, these methods may lose some of the key rules from the dataset and reduce the effectiveness of the results. In order to solve the problem, we propose a novel algorithm called Multidimensional Time-series Association Rules(MTAR) in this paper, which can fully utilize the information and find out more valuable rules from multidimensional time-series data. Meanwhile, we implement the parallelization of the algorithm based on the parallel computing framework Spark, which can improve the performance of the algorithm greatly. Experiments are conducted on the transmission line dataset in Power Grid System to show the effectiveness and the efficiency of the proposed approach."}, "conf/www/ZhangHSW17": {"title": "Local Low-Rank Matrix Approximation with Preference Selection of Anchor Points.", "url": "https://doi.org/10.1145/3041021.3051148", "year": "2017", "author": {"Menghao Zhang": "188/5710", "Binbin Hu": "150/1977", "Chuan Shi": "64/3041", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tMatrix factorization is widely used in personalized recommender systems, text mining, and computer vision. A general assumption to construct matrix approximation is that the original matrix is of global low rank, while Joonseok Lee et al. proposed that many real matrices may be not globally low rank, and thus a locally low-rank matrix approximation method has been proposed.[11] However, this kind of matrix approximation method still leaves some important issues unsolved, for example, the randomly selecting anchor nodes. In this paper, we study the problem of the selection of anchor nodes to enhance locally low-rank matrix approximation. We propose a new model for local low-rank matrix approximation which selects anchor-points using a heuristic method. Our experiments indicate that the proposed method outperforms many state-of-the-art recommendation methods. Moreover, the proposed method can significantly improve algorithm efficiency, and it is easy to parallelize. These traits make it potential for large scale real-world recommender systems.\n\t"}, "conf/adma/WuWW16": {"title": "Event Evolution Model Based on Random Walk Model with Hot Topic Extraction.", "url": "https://doi.org/10.1007/978-3-319-49586-6_42", "year": "2016", "author": {"Chunzi Wu": "189/8511", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "To identify the evolution relationship between events, this paper presents a new model which utilizes random walk model to weight the cosine similarity of events according to the chronological order. This model is proved to be effective and accurate in identifying relationship of events through comparisons with other models. This paper also puts forward an innovative method to detect hot topics which applies the concept of related events. This paper introduces parallel computing, including Spark and MapReduce, to significantly improve the efficiency of the event evolution calculation and hot topic detection.KeywordsEvent evolutionHot topicRandom walk modelMapReduceSpark"}, "conf/besc/LiuWZW16": {"title": "Overlapping community detection via self-constrained symmetric non-negative matrix factorization.", "url": "https://doi.org/10.1109/BESC.2016.7804477", "year": "2016", "author": {"Yu Liu": "97/2274", "Bin Wu 0001": "98/4432-1", "Yunlei Zhang": "173/9377", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:A number of approaches based on symmetric nonnegative matrix factorization (SNMF) have been proposed to improve the performance and the interpretability of community detection. Due to the nature of NMF, the partition results obtained by conventional NMF without post processing are soft assignments of nodes w.r.t. communities, which demonstrates overlapping of communities. Based on the traditional SNMF method, we propose a self-constrained symmetric non-negative matrix factorization (SC-SNMF) with tuning ability to control the degree of community overlapping, which controls if the community partition result is \"most overlapping\", \"nearly overlapping\" or \"nearly non-overlapping\". We use both traditional and overlapping version of modularity and partition density to investigate community overlapping on five real-world social network datasets. The experimental results show that SCSNMF has the ability of interpretation for overlapping degree of communities."}, "conf/dsc/HuWGWQX16": {"title": "Social Recommendation with Tag Side Information.", "url": "https://doi.org/10.1109/DSC.2016.30", "year": "2016", "author": {"Xiang Hu": "81/6204", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Bai Wang 0001": "03/587-1", "Xirong Que": "27/8431", "Hongke Xia": "28/7805"}, "abstract": " Abstract:Social recommendation is the recommendation process by using social information. Being created to annotate and categorize items, tags are shared by users to find, organize and understand online entities, and provide the inherent flexibility to predict users' preference. In this paper, tag information and social relations are combined into recommendation, and a new tag information aided social recommendation method is proposed. By means of matrix factorization and regularization technology, we calculate the feature vectors and predict the rating of users. Also a new similarity measuring method is put forward when exploiting tag information through link prediction. Experiments show that our method generates better performance than state-of-the-art methods."}, "conf/dsc/SaiWW16": {"title": "BPPGD: Budgeted Parallel Primal Gradient Descent Kernel SVM on Spark.", "url": "https://doi.org/10.1109/DSC.2016.36", "year": "2016", "author": {"Jinchen Sai": "198/7213", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1"}, "abstract": " Abstract:Stochastic Gradient Descent (SGD) is the best known method to optimize the primal objective for linear support vector machines (SVM) to dispose large data. However, when equipped with kernel functions, SGD performance is vulnerable that causes unbounded linear growth in model size and update time with data size. This paper describes a budgeted parallel pack gradient descent algorithm (BPPGD) that can improve SVM optimize problem with Gaussian Radial Basis Function (RBF) to large-scale data and run efficiently on Apache Spark with high degree of parallelization. Apache Spark is a fast and general engine for large-scale data processing which has advantage on big data parallel computing and dealing with iterative algorithms. BPPGD algorithm has constant time complexity per update. It uses a new distributed hash table -- IndexedRDD to increase the parallel degree, packing strategy to improve SGD performance with reducing the number of communication and removal budget maintenance method to keep the number of support vectors (SVs). The experiment results show that BPPGD achieves higher accuracy than P-packSVM (Zhu et al., 2009) and BSGD (Zhuang et al., 2012) algorithms on Spark environment, and it takes shorter time."}, "conf/icycsee/LiuWWZSZ16": {"title": "CoGrec: A Community-Oriented Group Recommendation Framework.", "url": "https://doi.org/10.1007/978-981-10-2053-7_24", "year": "2016", "author": {"Yu Liu": "97/2274", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Xuelin Zeng": "175/5587", "Jing Shi": "92/4638", "Yunlei Zhang": "173/9377"}, "abstract": "Recently, group recommendation becomes substantially significant when it frequently happens that a group of users need to determine which item (e.g. movie, music, restaurant, etc.) to choose. In this paper we employ the information of friend network to propose a Community-Oriented Group Recommendation framework (CoGrec) consisting of non-negative matrix factorization based user profile generation, community detection based group identification, and overlapping community membership based group decision. Along with four inherent aggregation and allocation strategies, our proposed framework is evaluated through extensive experiments on real-world datasets. The experimental results show that the proposed framework is promising and more accurate when the given friend network is much denser, which is suitable for modern review and rating systems.KeywordsGroup recommendationOverlapping communityNon-negative matrix factorization"}, "conf/recsys/HuZLSYW16": {"title": "RecExp: A Semantic Recommender System with Explanation Based on Heterogeneous Information Network.", "url": "https://doi.org/10.1145/2959100.2959112", "year": "2016", "author": {"Jiawei Hu": "49/792", "Zhiqiang Zhang 0012": "67/2010-12", "Jian Liu": "35/295", "Chuan Shi": "64/3041", "Philip S. Yu": "y/PhilipSYu", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tIn recent years, there is a surge of research on recommender system to alleviate the information overload. Many recommendation techniques have been proposed and they have achieved great successes in many applications. However, the explanation of recommendation results is an important but seldom addressed problem. In this paper, we organize the objects and relations in a recommender system with a heterogeneous information network, which integrates more informations and contains rich semantics. Then we employ a semantic meta path based personalized recommendation model and design a recommender system with explanation, called RecExp. The RecExp system has two unique features. (1) Semantic recommendation. RecExp provides different recommendation models to comply with users' requirements through setting of meta paths. (2) Interpretive recommendation. Under a hybrid recommendation model, RecExp provides the explanations for the recommendation results.\n\t"}, "conf/bigdataconf/LiuWW15": {"title": "Characterizing super spreading in microblog: An epidemic-based model.", "url": "https://doi.org/10.1109/BigData.2015.7364020", "year": "2015", "author": {"Yu Liu": "97/2274", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Microblogs play an important role in online social communications. Different from ordinary pieces of information, some hot topics and emerging news will become much more popular in a very short time with the help of this information spreading platform of microblogs. In these \"super spreading events\", messages are transmitted to a vast range of individuals through a small portion of users engaged in the information diffusion process, a.k.a. super spreaders. Gaining an awareness of super spreading phenomena and an understanding of patterns of vast-ranged information diffusion process is worthy for several tasks such as hot topic detection, predictions of information propagation, harmful information monitoring and intervention. In this paper, inspired by the analogous patterns of super spreading in both information diffusion and spread of a contagious disease, we build a parameterized model based on well-known epidemic models to characterize super spreading phenomenon of tweet message diffusion accompanied with super spreaders. Through a fitting process, parameter settings under different scenarios are obtained and the corresponding basic reproduction number is also analyzed, which indicates the degree super spreader will affect the spreading. With the help of the SAIR model, some feasible applications can be exploited."}, "conf/dsaa/WangWW15": {"title": "TSMH Graph Cube: A novel framework for large scale multi-dimensional network analysis.", "url": "https://doi.org/10.1109/DSAA.2015.7344826", "year": "2015", "author": {"Pengsen Wang": "171/6249", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:As a representation of information, Multi-dimension network is more and more popular, such as web data and social network. With the increment of data source, the entities of the network become diverse. How to analyze these multi-dimensional heterogeneous networks effectively and efficiently is a big challenge. In this paper, we propose a Two-Step Multi-dimensional Heterogeneous (TSMH) Graph Cube framework. We use the meta path in heterogeneous network to guide the aggregation of the network and build the Entity Hyper Cube. For the cuboid in Entity Hyper Cube, we do dimension roll-up/drill down to build the Dimension Cube. In Entity Hyper Cube, we design meta path aggregation algorithms and propose materialization strategy. In Dimension Cube, we use hierarchical coding for entities and dimensions and it saves the process of join operations of entities and dimensions which greatly improve the efficiency of dimension operations. In addition, we propose more new Graph OLAP operations which can make network analysis more diverse. At last, we implement the framework in Spark. The results of experiments on real data set and synthetic data set confirm the efficiency and effectiveness of our framework."}, "conf/kdd/DongZTCW15": {"title": "CoupledLP: Link Prediction in Coupled Networks.", "url": "https://doi.org/10.1145/2783258.2783329", "year": "2015", "author": {"Yuxiao Dong": "17/9267", "Jing Zhang 0001": "05/3499-1", "Jie Tang 0001": "t/JieTang", "Nitesh V. Chawla": "c/NiteshVChawla", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tWe study the problem of link prediction in coupled networks, where we have the structure information of one (source) network and the interactions between this network and another (target) network. The goal is to predict the missing links in the target network. The problem is extremely challenging as we do not have any information of the target network. Moreover, the source and target networks are usually heterogeneous and have different types of nodes and links. How to utilize the structure information in the source network for predicting links in the target network? How to leverage the heterogeneous interactions between the two networks for the prediction task? We propose a unified framework, CoupledLP, to solve the problem. Given two coupled networks, we first leverage atomic propagation rules to automatically construct implicit links in the target network for addressing the challenge of target network incompleteness, and then propose a coupled factor graph model to incorporate the meta-paths extracted from the coupled part of the two networks for transferring heterogeneous knowledge. We evaluate the proposed framework on two different genres of datasets: disease-gene (DG) and mobile social networks. In the DG networks, we aim to use the disease network to predict the associations between genes. In the mobile networks, we aim to use the mobile communication network of one mobile operator to infer the network structure of its competitors. On both datasets, the proposed CoupledLP framework outperforms several alternative methods. The proposed problem of coupled link prediction and the corresponding framework demonstrate both the scientific and business applications in biology and social networks.\n\t"}, "conf/pakdd/WangWLWW15": {"title": "A Simhash-Based Generalized Framework for Citation Matching in MapReduce.", "url": "https://doi.org/10.1007/978-3-319-25660-3_7", "year": "2015", "author": {"Pengsen Wang": "171/6249", "Bin Wu 0001": "98/4432-1", "Xiaoming Li": "36/3071", "Lin Wang": "17/6729", "Bai Wang 0001": "03/587-1"}, "abstract": "Citation matching is to find the cited papers according to only a small amount of information. There have been some works on citation matching. Most of the solutions require expensive model processing to achieve good results. However, when dealing with millions of citations in large digital libraries, these solutions may not be efficient enough. To address this problem, we propose a simhash-based generalized framework in MapReduce for citation matching. In the framework, we use title exact matching and distance-based short text similarity metrics to implement citation matching. Moreover, customizing citation fields, citation field weights and word segmentation weights are used for improving the accuracy. We also design a heuristic algorithm which can automatically calculate the weights of each citation field. For disposing the large-scale datasets, we implement the framework in Hadoop, a popular parallel computation platform. We do our experiments with real datasets from a Chinese Medicine Digital Library, and a comparative experiment with Cora corpus (McCallum’s citation matching test set). The results of experiments confirm the efficiency and effectiveness of our framework.KeywordsCitation matchingParallelizationShort text similarityMapReduce"}, "conf/waim/LiWW15": {"title": "A Distributed RDF Storage and Query Model Based on HBase.", "url": "https://doi.org/10.1007/978-3-319-23531-8_1", "year": "2015", "author": {"Keran Li": "169/6134", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Now we are living in an interconnected world and the amount of heterogeneous information data such as RDF is continually increasing. A lot has been done to find the solution to manage huge amount of RDF data. The solutions based on RDBMS have significant scalability issues considering the magnitude of data in modern time. In this paper we describe our solution to store and query RDF data in the cloud based on HBase and MapReduce. A vertical-partitioning-like model is used in HBase to reduce the table size and to obtain a good performance of SPARQL query. For complex query on large data, we propose to use cascading MapReduce job on HBase to enhance efficiency. Our experiments on LUBM show that our system can store large RDF graphs and can obtain good query efficiency.KeywordsRDFHeterogeneousHbaseVertical partitionMapreduce"}, "conf/apscc/LanLWZS14": {"title": "An Event-Driven Service-Oriented Architecture for the Internet of Things.", "url": "https://doi.org/10.1109/APSCC.2014.34", "year": "2014", "author": {"Lina Lan": "05/10049", "Fei Li 0002": "87/3534-2", "Bai Wang 0001": "03/587-1", "Lei Zhang 0049": "64/5666-49", "Ruisheng Shi": "118/4779"}, "abstract": " Abstract:IoT (Internet of Things) bridges the physical world and information space. IoT services are environment sensitive and event-driven. The new IoT service architecture should adapt to these features. This paper analyses IoT sensing service characteristics and proposes the future services architecture. It is focused on the middleware architecture and the interface presentation technology. In the middleware layer, the traditional SOA architecture is insufficient in the real-time response and parallel process of services execution, this paper proposes that the new sensing service system based on EDSOA (Event Driven SOA) architecture to support real-time, event-driven, and active service execution. At presentation layer, this paper presents the new IoT browser features including using augmented reality technology to input and output, and realize the superposition presentation of the physical world and abstract information. Through a use case and proof-of-concept implementation-road manhole covers monitoring system - we verify the feasibility of the proposed ideas and frameworks."}, "conf/asunam/YuWZW14": {"title": "Overlapping community detection in large networks from a data fusion view.", "url": "https://doi.org/10.1109/ASONAM.2014.6921570", "year": "2014", "author": {"Le Yu": "23/7122", "Bin Wu 0001": "98/4432-1", "Shuai Zhao 0001": "116/8682-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Community detection is one of the most important problems in social network analysis in the context of the structure of the underlying graphs. Many researchers have proposed their own methods for discovering dense regions in social networks. Such methods are only designed with links of the underlying social network. However, with the development of recent applications, rich edge content can be available to give another view to the community detection process. In this study, we focus on improving community detection with the edge content in social networks. In order to regulate the effect of both linkage structure and edge content, we propose two feature integration strategies. Experiment results illustrate that the presence of edge content provides unprecedented opportunities and flexibility for the community detection process."}, "conf/asunam/LiuWWL14": {"title": "SDHM: A hybrid model for spammer detection in Weibo.", "url": "https://doi.org/10.1109/ASONAM.2014.6921699", "year": "2014", "author": {"Yu Liu": "97/2274", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Guanchen Li": "153/2874"}, "abstract": " Abstract:As the microblogging service (such as Weibo) is becoming popular, spam becomes a serious problem of affecting the credibility and readability of Online Social Networks. Most existing studies took use of a set of features to identify spam, but without the consideration of the overlap and dependency among different features. In this study, we investigate the problem of spam detection by analyzing real spam dataset collections of Weibo and propose a novel hybrid model of spammer detection, called SDHM, which utilizing significant features, i.e. user behavior information, online social network attributes and text content characteristics, in an organic way. Experiments on real Weibo dataset demonstrate the power of the proposed hybrid model and the promising performance."}, "conf/kdd/QiuWWY14": {"title": "Gibbs Collapsed Sampling for Latent Dirichlet Allocation on Spark.", "url": "http://proceedings.mlr.press/v36/qiu14.html", "year": "2014", "author": {"Zhuolin Qiu": "150/0807", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Le Yu": "23/7122"}, "abstract": ""}, "conf/apcc/LuWGQ013": {"title": "Empirical analysis of different hierarchical addressing deployments.", "url": "https://doi.org/10.1109/APCC.2013.6765943", "year": "2013", "author": {"Xuan Lu": "51/3865", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Currently the increasing prevalence of multi-homing and traffic engineering leads to an explosive growth of the global routing table. It is well known that hierarchical addressing could improve the routing scalability. Hence, some proposals exploring the routing architecture for future Internet reuse the hierarchical addressing for the locator assignment. However, this may result in some ASes assigned too many prefixes which would consequently make hosts, routers, Internet Service Providers and Domain Name System faced with big challenges. By modeling the Internet AS-level topology using a hierarchical graph, we define the processes of prefix assignment and routing advertisement in different hierarchical addressing deployment ways. Then, we quantify the impact of these deployments on the prefix assignment and the routing scalability based on the real routing data. we find that when the deploying position gets lower, the prefix amount of arbitrary AS is getting smaller, while the size of the global Forwarding Information Base is monotonically increasing. Comparing with the actual Internet's data, suitable deployment ways for hierarchical addressing are obtained. With these deployment ways, the excessive prefix problem is solved and the size of the global Forwarding Information Base could be reduced into 56% or even 32% of the one in current Internet."}, "conf/asunam/YuWW13": {"title": "Topic model-based link community detection with adjustable range of overlapping.", "url": "https://doi.org/10.1145/2492517.2492581", "year": "2013", "author": {"Le Yu": "23/7122", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tComplex networks have attracted much research attentions. Community detection is an important problem in complex network which is useful in a variety of applications such as information propagation, link prediction, recommendations and marketing. In this paper, we focus on discovering overlapping community structure using link partition. We proposed a LDA-based link partition (LBLP) method which can find communities with adjustable range of overlapping. This method employs topic model to detect link partition, which can calculate the community belonging factor for each link. Based on the belonging factor, link partitions with bridge links can be found efficiently. We validate the effectiveness of our solution on both real-world and synthesized networks. The experiment results demonstrate that the approach can find meaningful and relevant link community structure.\n\t"}, "conf/greencom/ZhangWWG13": {"title": "Privacy Disclosure Identification in Social Networks.", "url": "https://doi.org/10.1109/GreenCom-iThings-CPSCom.2013.156", "year": "2013", "author": {"Feng Zhang": "48/1294", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Feng Gao": "10/2674"}, "abstract": " Abstract:In online social network, users are much more likely to be influenced by their neighbor nodes and/or connected nodes which have comment interesting. Consequently, the nodes in social network are more easily to accepted the forwarded/recommended online applications from their familiar/trusted nodes. Although most online application have their own privacy policy and claim that they won't disclose users' privacy without users' consent, also, the user can choose pushed information forbidden to the certain online application, user may receive some pushed information from the third party. In this scenario, it is clearly that the online application has disclosed users' privacy information maybe with users' preferences/behavior to the third party for their commercial interests. In this paper, we study a novel privacy disclosure phenomenon that privacy disclosure by users' forwarded/recommended online application. We concrete with this privacy disclosure issue and propose a privacy identification method inspirited from Secure Multi-Party Computation (SMC) with both passive mode and active mode for this type of privacy disclosure identification. According to the analyze, our method can solve the privacy disclosure identification effectively."}, "conf/kdd/YuZSWWQZ12": {"title": "BC-PDM: data mining, social network analysis and text mining system based on cloud computing.", "url": "https://doi.org/10.1145/2339530.2339764", "year": "2012", "author": {"Le Yu": "23/7122", "Jian Zheng": "49/3161", "Wei Chong Shen": "117/4271", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Long Qian": "117/4249", "Bo Ren Zhang": "117/4360"}, "abstract": "\n\t\tTelecom BI(Business Intelligence) system consists of a set of application programs and technologies for gathering, storing, analyzing and providing access to data, which contribute to manage business information and make decision precisely. However, traditional analysis algorithms meet new challenges as the continued exponential growth in both the volume and the complexity of telecom data. With the Cloud Computing development, some parallel data analysis systems have been emerging. However, existing systems have rarely comprehensive function, either providing data analysis service or providing social network analysis. We need a comprehensive tool to store and analysis large scale data efficiently. In response to the challenge, the SaaS (Software-as-a-Service) BI system, BC-PDM (Big Cloud-Parallel Data Mining), are proposed. BC-PDM supports parallel ETL process, statistical analysis, data mining, text mining and social network analysis which are based on Hadoop. This demo introduces three tasks: business recommendation, customer community detection and user preference classification by employing a real telecom data set. Experimental results show BC-PDM is very efficient and effective for intelligence data analysis.\n\t"}, "conf/kdd/ShiZKYLW12": {"title": "HeteRecom: a semantic-based recommendation systemin heterogeneous networks.", "url": "https://doi.org/10.1145/2339530.2339778", "year": "2012", "author": {"Chuan Shi": "64/3041", "Chong Zhou": "42/5942", "Xiangnan Kong": "06/8315", "Philip S. Yu": "y/PhilipSYu", "Gang Liu": "37/2109", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tMaking accurate recommendations for users has become an important function of e-commerce system with the rapid growth of WWW. Conventional recommendation systems usually recommend similar objects, which are of the same type with the query object without exploring the semantics of different similarity measures. In this paper, we organize objects in the recommendation system as a heterogeneous network. Through employing a path-based relevance measure to evaluate the relatedness between any-typed objects and capture the subtle semantic containing in each path, we implement a prototype system (called HeteRecom) for semantic based recommendation. HeteRecom has the following unique properties: (1) It provides the semantic-based recommendation function according to the path specified by users. (2) It recommends the similar objects of the same type as well as related objects of different types. We demonstrate the effectiveness of our system with a real-world movie data set.\n\t"}, "conf/sdm/ShiKYW12": {"title": "Multi-Objective Multi-Label Classification.", "url": "https://doi.org/10.1137/1.9781611972825.31", "year": "2012", "author": {"Chuan Shi": "64/3041", "Xiangnan Kong": "06/8315", "Philip S. Yu": "y/PhilipSYu", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "conf/asunam/YeWZW11": {"title": "Detecting Link Communities in Massive Networks.", "url": "https://doi.org/10.1109/ASONAM.2011.53", "year": "2011", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Zhixiong Zhao": "65/9993", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Most of the existing literature which has entirely focused on clustering nodes in large-scale networks. To discover multi-scale overlapping communities quickly, we propose a highly efficient multi-resolution link community detection algorithm to detect the link communities in massive networks based on the idea of edge labeling. First, we will get the node partition of the network based on a new multi-resolution node detection algorithm. After that, we can find the link community in a linear time by the labels of nodes. Its time complexity is near linear and its space complexity is linear. The effectiveness of our algorithm is demonstrated by extensive experiments on lots of computer generated artificial graphs and real-world networks. The results show that our algorithm is very fast and highly reliable. Tests on real and artificial networks also give excellent results comparing with the newly proposed link partition algorithm."}, "conf/asunam/DongKWW11": {"title": "Link Prediction Based on Local Information.", "url": "https://doi.org/10.1109/ASONAM.2011.43", "year": "2011", "author": {"Yuxiao Dong": "17/9267", "Qing Ke": "87/9993", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1"}, "abstract": " Abstract:Link prediction in complex networks is an important issue in graph mining. It aims at estimating the likelihood of the existence of links between nodes by the know network structure information. Currently, most link prediction algorithms based on local information consider only the individual characteristics of common neighbors. In this paper, first, we study the link prediction results as the change of the exponent on the degree of common neighbors, and find some regular pattern between different networks and different exponent. After that, we come up with a new algorithm exploiting the interactions between common neighbors, namely Individual Attraction Index. To reduce the time complexity, we design a simple edition, called Simple Individual Attraction Index. We compare nine well-known local information metrics on eight real networks. The result proves well the best overall performance of these two new algorithms."}, "conf/ccis/DuanWWY11": {"title": "Design and implementation of parallel statiatical algorithm based on Hadoop's MapReduce model.", "url": "https://doi.org/10.1109/CCIS.2011.6045047", "year": "2011", "author": {"Songqing Duan": "193/2601", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1", "Juan Yang": "22/815"}, "abstract": " Abstract:The rapid growth of data promotes the development of parallel computing. MapReduce, which is a simplified programming model of distributed parallel computing, is becoming more and more popular. In this paper, we design and implementation of parallel statistical algorithm based on Hadoop's MapReduce model. The algorithm, which is used to grasp the overall characteristics of massive data, involves the calculation of central tendency, dispersion and distribution tendency. By experiment, we come to the conclusion that the algorithm is suitable for dealing with large-scale data."}, "conf/closer/WuDQKW11": {"title": "KANGAROO: A Distributed System for SNA - Social Network Analysis in Huge-scale Networks.", "url": "", "year": "2011", "author": {"Bin Wu 0001": "98/4432-1", "Yuxiao Dong": "17/9267", "Lei Qin": "20/1306", "Qing Ke": "87/9993", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "conf/fskd/WuLW11": {"title": "Event detection and evolution based on entity separation.", "url": "https://doi.org/10.1109/FSKD.2011.6019835", "year": "2011", "author": {"Bin Wu 0001": "98/4432-1", "Chao Li": "66/190", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:By computing the relevance of follow-up stories, the traditional topic tracking approaches could track the stories. However, subtopics derived from one topic and the evolution process of these subtopics could not be identified with traditional approaches. A method is proposed to detect event and subtopics and get the evolution process of event from media data. Firstly creating entity vectors with entities in the media data and computing similarity between two entity vectors to separate single event. Then creating full vectors with all keywords in the dataset of an event and computing similarity between two full vectors to get several subtopics of an event and the evolution process of the event. Experiments show that this method can get events and subtopics of them effectively."}, "conf/icdm/DongKRWW11": {"title": "Random Walk Based Resource Allocation: Predicting and Recommending Links in Cross-Operator Mobile Communication Networks.", "url": "https://doi.org/10.1109/ICDMW.2011.143", "year": "2011", "author": {"Yuxiao Dong": "17/9267", "Qing Ke": "87/9993", "Jun Rao": "r/JunRao", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1"}, "abstract": " Abstract:Link prediction is an important issue in social network analysis. It aims at estimating the likelihood of the existence of links between nodes by the known network information. Although this problem has been extensively studied, many significant factors about how to calculate the similarity between two nodes remains unexplored and largely open, especially for the mobile phone networks. We are first to take the link prediction task for missing calls in cross-operator communication networks. This task is of interest from not only a purely scientific point of view but also an excellent scenario for the marketing of telecom operators. We develop several algorithms based on a physical concept: resource allocation that treats all nodes in a network differently by allocating resource to each one. We use the call attributes of each node as resources which are owned by themselves. The process of resource allocation is guided by weighted random walk which naturally combines the information from network structure with call attributes of nodes and edges. Our experiments on the cross-operator networks show that our newly proposed algorithms outperform the other state-of-the-art unsupervised approaches as well as the supervised HPLP method."}, "conf/icws/ZhuWW11": {"title": "Reputation-Driven Web Service Selection Based on Collaboration Network.", "url": "https://doi.org/10.1109/ICWS.2011.23", "year": "2011", "author": {"XiLu Zhu": "31/9078", "Bai Wang 0001": "03/587-1", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:Most of trustworthy web service selection simply focus on individual reputation and ignore the collaboration reputation between services. To enhance the collaboration trust during web service selection, a reputation model called collaboration reputation is proposed. The reputation model is built on web service collaboration network(WSCN), which is constructed in terms of the composite service execution log. Thus, the WSCN aims to maintain the trustworthy collaboration alliance among web services, In WSCN, the collaboration reputation can be assessed by two metrics, one called invoking reputation is computed by recommendation, which is selected from the community structure hiding in WSCN, the other is assessed by the invoked web service. In addition, the web service selection based on WSCN is designed."}, "conf/pkdd/ShiKYW11": {"title": "Multi-label Ensemble Learning.", "url": "https://doi.org/10.1007/978-3-642-23808-6_15", "year": "2011", "author": {"Chuan Shi": "64/3041", "Xiangnan Kong": "06/8315", "Philip S. Yu": "y/PhilipSYu", "Bai Wang 0001": "03/587-1"}, "abstract": "Multi-label learning aims at predicting potentially multiple labels for a given instance. Conventional multi-label learning approaches focus on exploiting the label correlations to improve the accuracy of the learner by building an individual multi-label learner or a combined learner based upon a group of single-label learners. However, the generalization ability of such individual learner can be weak. It is well known that ensemble learning can effectively improve the generalization ability of learning systems by constructing multiple base learners and the performance of an ensemble is related to the both accuracy and diversity of base learners. In this paper, we study the problem of multi-label ensemble learning. Specifically, we aim at improving the generalization ability of multi-label learning systems by constructing a group of multi-label base learners which are both accurate and diverse. We propose a novel solution, called EnML, to effectively augment the accuracy as well as the diversity of multi-label base learners. In detail, we design two objective functions to evaluate the accuracy and diversity of multi-label base learners, respectively, and EnML simultaneously optimizes these two objectives with an evolutionary multi-objective optimization method. Experiments on real-world multi-label learning tasks validate the effectiveness of our approach against other well-established methods.KeywordsMulti-label learningensemble learningmulti-objective optimizationnegative correlation learning"}, "conf/adma/YeWW10": {"title": "Distance Distribution and Average Shortest Path Length Estimation in Real-World Networks.", "url": "https://doi.org/10.1007/978-3-642-17316-5_32", "year": "2010", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "The average shortest path length is one of the most important and frequent-invoked characteristics of real-world complex networks. However, the high time complexity of the algorithms prevents us to apply them to calculate the average shortest path lengths in real-world massive networks. In this paper, we present an empirical study of the vertex-vertex distance distributions in more than 30 artificial and real-world networks. To best of our knowledge, we are the first to find out the vertex-vertex distance distributions in these networks conform well to the normal distributions with different means and variations. We also investigate how to use the sampling algorithms to estimate the average shortest path lengths in these networks. Comparing our average shortest path estimating algorithm with other three different sampling strategies, the results show that we can estimate the average shortest path length quickly by just sampling a small number of vertices in both of real-world and artificial networks.KeywordsSocial Network AnalysisAverage Shortest Path lengthVertex-vertex DistanceSampling"}, "conf/adma/YeWW10a": {"title": "Multiple Level Views on the Adherent Cohesive Subgraphs in Massive Temporal Call Graphs.", "url": "https://doi.org/10.1007/978-3-642-17316-5_42", "year": "2010", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "In this paper, we present a multi-level empirical study of locality structures of several temporal call graphs containing both mobile and fixed-line call graphs emphasizing on comparing the patterns of these two types of call graphs. We investigate the topological patterns of the cohesive subgraphs in a mesoscopic scale, and we find several novel patterns in these call graphs. We study the correlation between the link weights and their localities. To our surprise, we can find there is nearly no correlation between link weights and their edge betweenness values. We also find that in the network of communities, communities’ sizes and betweenness centralities are highly positively correlated, which indicates large communities tend to be in the center of the call networks. Our analysis also suggests that ‘small-world’ phenomenon still exists in the community-based networks. We believe that our analysis results will help Telecom operators have better understanding of their customers.KeywordsData MiningSocial Network AnalysisCommunity DetectionVisual Analytics"}, "conf/apscc/DengWZ10": {"title": "Reconstruct and Evaluate of Telecom CRM for Full Service.", "url": "https://doi.org/10.1109/APSCC.2010.66", "year": "2010", "author": {"Xiaolong Deng": "15/4732", "Bai Wang 0001": "03/587-1", "XiLu Zhu": "31/9078"}, "abstract": " Abstract:In order to promote efficiency of electronic business operating, the newly founded three Telecom operators in China began to reconstruct their CRM of OSS (Operation Support Systems) which offering full telecom service including Fixed and Mobile telephone services. Aiming to support continuous release of new telecom products and services, it is necessary for Telecom operators to offer flexible combination and separation of telecom business in the reconstruction of Telecom CRM among distributed heterogeneous OSS. A novel service atomization method has been proposed in this paper which foucus on resource modeling and service evaluating based on SOA and workflow technology to decrease maintenance complexity of business logic code from Telecom CRM. Experiments demonstrated the effectiveness of the proposed method in performance promotion basing on the real CRM reconstruction project in province branch of China Unicom."}, "conf/apscc/ZhuW10": {"title": "A Distributed Quality of Service Index Framework.", "url": "https://doi.org/10.1109/APSCC.2010.80", "year": "2010", "author": {"XiLu Zhu": "31/9078", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:To efficiently support customers to find web service which satisfies the non-functional requirement, a distributed quality of service (QoS) index framework is proposed in this paper. The framework consists of two kinds of structured distributed system, one is chord overlay network which is assigned to classify the web services according to the similarity of web services descriptions, the other is a tree-structured distributed network named DQoS tree which manages the classified web services' QoS. Since there is a dominance relation among multi-dimension QoS, therefore, a guideline based on this relation to construct a QoS tree managed by a sub peer is designed. Through the dominance relation, it's easily find the qualified QoS among web services with less compare times, thus, the query effectiveness is guaranteed. Additionally, to avoid the load imbalance of query load in the DQoS tree, a load balance strategy is introduced which can balance work load efficiently. Experimental results validate the effectiveness and efficiency of the proposed approaches."}, "conf/asunam/YeWGW10": {"title": "Detecting Communities in Massive Networks Based on Local Community Attractive Force Optimization.", "url": "https://doi.org/10.1109/ASONAM.2010.32", "year": "2010", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Yuan Gao": "76/2452", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Currently, community detection has led to a huge interest in data analysis on real-world networks. However, the high computationally demanding of most community detection algorithms limits their applications. In this paper, we propose a heuristic algorithm to extract the community structure in large networks based on local community attractive force optimization whose time complexity is near linear and space complexity is linear. The effectiveness of our algorithm is demonstrated by extensive experiments on lots of computer generated graphs and public available real-world graphs. The result shows our algorithm is extremely fast, and it is easy for us to explore massive networks interactively."}, "conf/webi/WuZWYW10": {"title": "Group-Level Analysis by Extracting Semantic Relations from Query Graph.", "url": "https://doi.org/10.1109/WI-IAT.2010.77", "year": "2010", "author": {"Bin Wu 0001": "98/4432-1", "Tian Zhu 0001": "39/4247-1", "Weiduo Wang": "33/9075", "Qi Ye": "19/6124", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Recently, a growing number of researches have focused on the issues raised by the knowledge discovery of online information, particularly the problems of tracking topics, ideas, and users' spreading influence across the Web. In this paper, the search-engine query logs on Topic Detection and Tracking (TDT) is analyzed other than study of the quality of the search result or query recommendation. By constructing a novel bi-type heterogeneous query graph, the queries' semantic similarity and query-URL relation are combined together. Utilizing social network analysis (SNA) method to analyze the query graph with optimization of the community discovery algorithm LPA by grouping the nodes who are linked with the same URL initially, we can find the topics in the query logs. To evaluate the topic evolution pattern, we group the similar communities over each adjacent time stamps into clusters. Extensive experiments demonstrate the effectiveness and efficiency of the methods."}, "conf/webi/YeWGW10": {"title": "Empirical Analysis and Multiple Level Views in Massive Social Networks.", "url": "https://doi.org/10.1109/WI-IAT.2010.48", "year": "2010", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Yuan Gao": "76/2452", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:With the emergence of massive social media, massive social networks have led to a huge interest in data analysis. In this paper, we propose an empirical study on several massive social networks including 4 mobile call graphs, a fixed-line call graph, two co-authorship networks and two Email networks. We find that call graphs tend to be more locality than the co-authorship networks and Email networks. To our surprise, we even find that there is no significant relations between community sizes and their quality scores for most extracted communities. We also find that some very huge community with high mean quality values, and we can not find the universal \"V\" shape in their mean quality values."}, "conf/adma/HuWYW09": {"title": "Structure Correlation in Mobile Call Networks.", "url": "https://doi.org/10.1007/978-3-642-03348-3_47", "year": "2009", "author": {"Deyong Hu": "94/7130", "Bin Wu 0001": "98/4432-1", "Qi Ye": "19/6124", "Bai Wang 0001": "03/587-1"}, "abstract": "So far researchers have done a large amount of work on the structure of social network, but neglected the correlation between two connected nodes from structure perspective. In this paper, our primary goal is to acquire structural properties and detect anomalies in mobile call networks. In order to investigate the structural properties, we define some metrics which are based on the clique size vectors of mobile call users. To evaluate our metrics, we explore several real-world mobile call networks. We find that people tend to communicate with the one who has similar structure. Moreover, we find that the connected people have similar structural changes on the whole. Utilizing these results, we detect anomalies and use a visualization toolkit to give a view of the anomalous scenarios in static and dynamic networks.KeywordsSocial NetworkCorrelationStructural PropertyClique Size VectorAnomalyVisualization"}, "conf/adma/ZhuWW09": {"title": "Social Influence and Role Analysis Based on Community Structure in Social Network.", "url": "https://doi.org/10.1007/978-3-642-03348-3_84", "year": "2009", "author": {"Tian Zhu 0001": "39/4247-1", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Recent graph-theoretic approaches have demonstrated remarkable success for ranking networked entities, including degree, closeness, betweenness, etc. They are mainly considering the local link factors only, while not so much work concentrates on the social influence ranking based on the local structure in social network. In this paper, two new social influence ranking metrics, InnerPagerank and OutterPagerank are proposed based on the concept of modified Pagerank, by considering the community structure knowledge. It is well adapted to direct and weighted networks also. Using the two metrics, we also show how to assign community-based node roles to the nodes, which is an effective supplement for single metric used as social influence measure. Identifying and understanding the node’s social influence and role is of tremendous interest from both analysis and application points of view. This method is shown to give rasonable results than previous metrics both on test networks and real networks.Keywordssocial networkcommunitynode rolePageRank"}, "conf/cikm/WuYYW09": {"title": "Group CRM: a new telecom CRM framework from social network perspective.", "url": "https://doi.org/10.1145/1651274.1651277", "year": "2009", "author": {"Bin Wu 0001": "98/4432-1", "Qi Ye": "19/6124", "Shengqi Yang": "11/4785", "Bai Wang 0001": "03/587-1"}, "abstract": "\n\t\tThe structure of customer communication network provides us a natural way to understand customers' relationships. Traditional customer relationship management (CRM) methods focus on various customer profitability models, and they are short of ways to understand the social interactions. Graph mining and social network analysis provide ways to understand the relationships between customers, and there are already a few applications in CRM using these methods. To transform the traditional CRM methods from individuals to social groups, we propose a novel technical framework (GCRM) to manage the social groups in massive telecom call graphs. Our framework is based on a series of newly emerged methods for social network analysis, such as group detecting, group evolution tracking and group life-cycle modeling in telecom applications. We analyze the relationships between social groups and propose a method to find potential customers in these groups. To evaluate GCRM, we present a comprehensive study to explore the group evolutions in real-world massive telecom call graphs. Empirical results show that by taking this framework, analysts can gain deeper insights into the communication patterns of social groups and their evolutionary patterns which makes the management of these social groups much easier in real-world telecom applications.\n\t"}, "conf/cloudcom/YangWZGW09": {"title": "DisTec: Towards a Distributed System for Telecom Computing.", "url": "https://doi.org/10.1007/978-3-642-10665-1_19", "year": "2009", "author": {"Shengqi Yang": "11/4785", "Bai Wang 0001": "03/587-1", "Haizhou Zhao": "14/7502", "Yuan Gao": "76/2452", "Bin Wu 0001": "98/4432-1"}, "abstract": "The continued exponential growth in both the volume and the complexity of information, compared with the computing capacity of the silicon-based devices restricted by Moore’s Law, is giving birth to a new challenge to the specific requirements of analysts, researchers and intelligence providers. With respect to this challenge, a new class of techniques and computing platforms, such as Map-Reduce model, which mainly focus on scalability and parallelism, has been emerging. In this paper, to move the scientific prototype forward to practice, we elaborate a prototype of our applied distributed system, DisTec, for knowledge discovery from social network perspective in the field of telecommunications. The major infrastructure is constructed on Hadoop, an open-source counterpart of Google’s Map-Reduce. We carefully devised our system to undertake the mining tasks in terabytes call records. To illustrate its functionality, DisTec is applied to real-world large-scale telecom dataset. The experiments range from initial raw data preprocessing to final knowledge extraction. We demonstrate that our system has a good performance in such cloud-scale data computing.KeywordsCloud ComputingSocial Network AnalysisHadoop Distribute File SystemTelecom OperatorCall RecordThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/complex/YangWW09": {"title": "Tracking the Evolution in Social Network: Methods and Results.", "url": "https://doi.org/10.1007/978-3-642-02466-5_67", "year": "2009", "author": {"Shengqi Yang": "11/4785", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Contrary to previous static knowledge, our dynamic view in social network is so limited. Recent uncovering those hidden dynamic patterns has posed a series of challenging problems in network evolution. To make effective exploration, we present a fundamentally novel framework for uncovering the intricate properties of evolutionary networks. Different from static snapshots methods, we firstly trace the timelines of networks, which could explicitly characterize the network to several evolving segments. Then based on extracted smooth segments from the timeline, a graph approximation algorithm is devised to capture the frequent characteristics of the network and reduce the noise of interactions. Moreover, by employing the relationship between multi-attributes, an innovative community detection algorithm is proposed for detailed analysis on the approximate graphs. Besides the algorithms, to track these dynamic communities, we also introduce a community correlation and evaluation criterion. Finally, applying this framework to several synthetic and real-world datasets, we demonstrate the critical relationship between event and social evolution, and find that close-knit relationship with well-distributed tie strengths among members of large communities will contribute to a longer life span.KeywordsSocial NetworkDynamic patternsCommunity Detection"}, "conf/fcst/WuYZW09": {"title": "A Distributed Algorithm to Enumerate All Maximal Cliques in MapReduce.", "url": "https://doi.org/10.1109/FCST.2009.30", "year": "2009", "author": {"Bin Wu 0001": "98/4432-1", "Shengqi Yang": "11/4785", "Haizhou Zhao": "14/7502", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Structure mining plays an important part in the researches in biology, physics, Internet or telecommunications in recently emerging network science. As a main task in this area, the problem of maximal clique enumeration has attracted much interest and been studied in variant avenues in prior works. However, most of these works mainly rely on single chip computational capacity and have been constrained by local optimization. Thus it is an impossible mission for these methods to process terabytes datasets. In this paper, to extract maximal cliques from graphs, we propose a general enumeration process in a distributed manner on cluster system with the help of MapReduce. Graph is firstly split into small subgraphs automatically. Then a novel key-based clique enumeration algorithm is proposed based on subgraphs. We demonstrate that our algorithm has a high parallelism and a prominent performance on extremely huge graphs. Our method is implemented to fully utilize MapReduce execution mechanism and the experiments are soundly discussed as using such a powerful distributed platform. However we not only show the scalability and efficiency of the algorithm but also share some critical experience in using MapReduce computing model."}, "conf/fskd/YangWLW09": {"title": "CommTrend: An Applied Framework for Community Detection in Large-Scale Social Network.", "url": "https://doi.org/10.1109/FSKD.2009.581", "year": "2009", "author": {"Shengqi Yang": "11/4785", "Bin Wu 0001": "98/4432-1", "Haiyan Long": "92/4884", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Community detection and tracking in social network is an important research area for many applications which are widely applied in complex systems. Recently there has been a surge of investigation in this area, fueled largely by interest in social networks, but also by interest in bibliographic citations and telecommunication records. However, due to the computational cost of the traditional algorithm for large-scale networks, most of them are not applied to industrial applications. In this paper, we present a novel framework, as CommTrend, for uncovering the community structure of networks. Our method not only has a prominent advantage over the efficiency but also can effectively reveal the underlying community structures. With respect to real-world application, our algorithm is applied to several massive datasets. Moreover, we integrate CommTrend into a bibliographical service system. By employing it to a large-scale bibliographical dataset, we demonstrate the comprehension of our work and its effectiveness for practical problems."}, "conf/fskd/YeWHW09": {"title": "Exploring Temporal Egocentric Networks in Mobile Call Graphs.", "url": "https://doi.org/10.1109/FSKD.2009.617", "year": "2009", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Deyong Hu": "94/7130", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:The structure of customer communication network provides us the insights into the function of customers' relationships. In this paper, we use egocentric social network to explore how people manage their personal and group communications over time. Our primary goal is that our findings can provide business insights and help devise strategies for telecom service providers. We are interested in tracking changes in large-scale mobile networks and examining the evolution processes of customer egocentric networks. By defining several statistical metrics, we can investigate the egocentric networks' evolution trends and their communication patterns. We explore several temporal real-world mobile call graphs and find an interesting phenomenon in these temporal networks which is the neighboring vertices' egocentric networks have assortiative evolution trends. By taking a visual analytics approach, we track the changes in the customer egocentric networks and explore some highly correlated customers' egocentric networks visually. We detect several interesting communication patterns by visualizing the egocentric networks which may give us more hints on customers' communication trends in their egocentric networks."}, "conf/icdm/YangWZW09": {"title": "Efficient Dense Structure Mining Using MapReduce.", "url": "https://doi.org/10.1109/ICDMW.2009.48", "year": "2009", "author": {"Shengqi Yang": "11/4785", "Bai Wang 0001": "03/587-1", "Haizhou Zhao": "14/7502", "Bin Wu 0001": "98/4432-1"}, "abstract": " Abstract:Structure mining plays an important part in the researches in biology, physics, Internet and telecommunications in recently emerging network science. As a main task in this area, the problem of structure mining on graph has attracted much interest and been studied in variant avenues in prior works. However, most of these works mainly rely on single chip computational capacity and have been constrained by local optimization. Thus it is an impossible mission for these methods to process massive graphs. In this paper, we propose an unified distributed method in solving some critical graph mining problems on top of a cluster system with the help of MapReduce. These problems include graph transformation, subgraph partition, maximal clique enumeration, connected component finding and community detection. All of these methods are implemented to fully utilize MapReduce execution mechanism, namely the ¿map-reduce¿ process. Moreover, considering how our algorithms can be applied in further ¿cloud¿ service, we employ several large scale datasets to demonstrate the efficiency and scalability of our solutions."}, "conf/kdd/DuFWA09": {"title": "Large human communication networks: patterns and a utility-driven generator.", "url": "https://doi.org/10.1145/1557019.1557054", "year": "2009", "author": {"Nan Du": "86/4539", "Christos Faloutsos": "f/CFaloutsos", "Bai Wang 0001": "03/587-1", "Leman Akoglu": "02/6979"}, "abstract": "\n\t\tGiven a real, and weighted person-to-person network which changes over time, what can we say about the cliques that it contains? Do the incidents of communication, or weights on the edges of a clique follow any pattern? Real, and in-person social networks have many more triangles than chance would dictate. As it turns out, there are many more cliques than one would expect, in surprising patterns. In this paper, we study massive real-world social networks formed by direct contacts among people through various personal communication services, such as Phone-Call, SMS, IM etc. The contributions are the following: (a) we discover surprising patterns with the cliques, (b) we report power-laws of the weights on the edges of cliques, (c) our real networks follow these patterns such that we can trust them to spot outliers and finally, (d) we propose the first utility-driven graph generator for weighted time-evolving networks, which match the observed patterns. Our study focused on three large datasets, each of which is a different type of communication service, with over one million records, and spans several months of activity.\n\t"}, "conf/pkdd/YeWSZHW09": {"title": "TeleComVis: Exploring Temporal Communities in Telecom Networks.", "url": "https://doi.org/10.1007/978-3-642-04174-7_57", "year": "2009", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Lijun Suo": "65/7134", "Tian Zhu 0001": "39/4247-1", "Chao Han": "27/5302", "Bai Wang 0001": "03/587-1"}, "abstract": "By the structure of call graphs derived from huge amounts of Call Detail Records, we can find out the social communities in the call graphs and make different market strategies for these social communities in real telecom applications. However, traditional telecom business intelligence methods are short of ways to understand the social interactions. To fill this gap, we propose a Telecom Community Visual Analysis prototype tool, called TeleComVis, to analyze the call graphs derived from Call Detail Records. In the demo, we will show (1) the functions of TeleComVis; (2) the critical techniques of finding statistically significant communities in real-world telecom applications. Using TeleComVis, users can both analyze the statistical properties of massive call graphs and explore the statistically significant communities and the temporal links interactively.KeywordsVisual AnalyticsCommunityCall GraphSocial Network"}, "conf/ssiri/DengWWY09": {"title": "Research and Evaluation on Modularity Modeling in Community Detecting of Complex Network Based on Information Entropy.", "url": "https://doi.org/10.1109/SSIRI.2009.15", "year": "2009", "author": {"Xiaolong Deng": "15/4732", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Shengqi Yang": "11/4785"}, "abstract": " Abstract:Detecting the community of complex networks became the hot research fields of Graph Ming in recent years and most community detecting methods current try to find correct community structure basing on optimization of Modularity Q. In this article, the author constructs a new theoretic model of Q based on information entropy by simulation and evaluation on some classic dataset and comparison with the classic social network experimental results such as karate network, musicians network, email network and dolphin network by GN and Fast GN algorithm to cast some new light on community detecting. In the implementation, the author developed a visualization evaluation tool to analyze the community relationship in entities of complex networks in large scale mobile calling networks and gained some novel results in this area with visualization evaluation tool."}, "conf/adma/YeWW08": {"title": "JSNVA: A Java Straight-Line Drawing Framework for Network Visual Analysis.", "url": "https://doi.org/10.1007/978-3-540-88192-6_70", "year": "2008", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Although information visualization technologies are indispensable in complex data analysis, wide-spread tools still need to be developed, as successful information visualization applications often require domain-specific customization. In this paper we introduce a software framework JSNVA for network visual analysis in different applications. JSNVA has a clear architecture and supports a more systematic way of implementing different straight-line graph drawing algorithms which show different networks on different views. JSNVA can be used as a front-end for visualization and a back-end for analysis in applications, and it can be customized for different applications. To evaluate JSNVA, we will give its applications in different graph mining tasks. Through visual analyzing these networks by different interactive visualization techniques and algorithms, we can get their underlying structure intuitively and quickly.KeywordsComputerize Physician Order EntrySubspace ClusterGiant ComponentInformation VisualizationAlgorithm ModuleThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/cikm/DuWW08": {"title": "Overlapping community structure detection in networks.", "url": "https://doi.org/10.1145/1458082.1458285", "year": "2008", "author": {"Nan Du": "86/4539", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1"}, "abstract": "\n\t\tMany systems in nature and human society take the form of networks with community structures. In this paper, we describe a simple algorithm COCD(Clique-based Overlapping Community Detection) to efficiently mine the overlapping communities in large-scale networks, which is useful for us to have a better understanding of the nested sub-structures embedded in the whole network.\n\t"}, "conf/fskd/YeWW08": {"title": "Visual Analysis of a Co-authorship Network and Its Underlying Structure.", "url": "https://doi.org/10.1109/FSKD.2008.436", "year": "2008", "author": {"Qi Ye": "19/6124", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:An interesting property of network is that the information is not only contained in the entities, but also in the links between them. As the structure of the co-authorship network can greatly influence its function and reflect how the internal information is exchanged. We attempt to get deep insight of the features in a co-authorship network at a university. This is done by the following two steps. First, we will explore the basic statistical properties of the co-authorship network and try to present these properties by different graph drawing techniques. Second, to gain more insight of the co-authorship network, we will use a community detecting algorithm to find the clusters of the network. By filtering the unstable links and detecting the clusters, we find there are many stable links in these clusters and many unstable links take the role of \"bridges\"' between these clusters. By labeling these communities with different department names, we can get an overview of the main research fields of the university and their relations."}, "conf/ieeevast/YeZHWDW08": {"title": "Cell phone mini challenge award: Social network accuracy - exploring temporal communication in mobile call graphs.", "url": "https://doi.org/10.1109/VAST.2008.4677389", "year": "2008", "author": {"Qi Ye": "19/6124", "Tian Zhu 0001": "39/4247-1", "Deyong Hu": "94/7130", "Bin Wu 0001": "98/4432-1", "Nan Du": "86/4539", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:In the mobile call mini challenge of VAST 2008 contest, we explored the temporal communication patterns of Catalano/Vidro social network which is reflected in the mobile call data. We focus on detecting the hierarchy of the social network and try to get the important actors in it. We present our tools and methods in this summary. By using the visual analytic approaches, we can find out not only the temporal communication patterns in the social network but also the hierarchy of it."}, "conf/webi/DuWWW08": {"title": "Overlapping Community Detection in Bipartite Networks.", "url": "https://doi.org/10.1109/WIIAT.2008.98", "year": "2008", "author": {"Nan Du": "86/4539", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Yi Wang 0010": "67/6649-10"}, "abstract": " Abstract:Researches have discovered that rich interactions among entities in nature and human society bring about complex networks with community structures. In this paper, we propose a novel algorithm BiTector (bi-community detector) to mine the overlapping communities in large-scale sparse bipartite networks. We apply the algorithm to various real-world datasets, showing that BiTector can identify the overlapping community structures in the bipartite networks efficiently and effectively."}, "conf/gcc/ZhaoWX07": {"title": "Grid Application Scheduling Model Based on Petri Net with Changeable Structure.", "url": "https://doi.org/10.1109/GCC.2007.71", "year": "2007", "author": {"Xiangang Zhao": "64/6130", "Bai Wang 0001": "03/587-1", "Liutong Xu": "47/5193"}, "abstract": " Abstract:This paper proposes a scheduling net based on a hierarchical color Petri net and a job net based on a Petri net with changeable structure. According to the granularity of grid applications, the scheduling net is designed into four levels, which makes it easy to deploy distributed schedulers in grid environment and benefits the management of different application granularities. The job net model is based on Petri net with changeable structure, which can change its structure dynamically according to the real-time state of running jobs. This model supports the dynamic mergence and division of subtasks and has ability to handle the running exceptions of subtasks. Finally, we validate the liveness and reachability of the scheduling net and the job net by analyzing their reachability trees. A transition tree algorithm is also presented to analyze the cost and time properties of job net, which can be used for the optimization of resource allocation."}, "conf/gcc/ZhaoXW07": {"title": "A Dynamic Price Model with Demand Prediction and Task Classification in Grid.", "url": "https://doi.org/10.1109/GCC.2007.5", "year": "2007", "author": {"Xiangang Zhao": "64/6130", "Liutong Xu": "47/5193", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:In the market-oriented grid systems, price management is one of the significant parts, which is used to balance the resource load and adjust the profits of resource providers. This paper proposes a dynamic price model based on demand prediction and task classification. We apply Markov chain to predict the future demands of grid resources and propose a resource price-adjusting mechanism based on the future demands, which takes into the interdependence of price and demand into consideration. Therefore, the mechanism can balance resource loads and guarantee the profits of resource providers at the same time. In addition, we classified the tasks into two categories: exclusive tasks and shared tasks. According to the differences between them, we provide two different task-pricing strategies. Based on these, we introduce a novel task-pricing mechanism, which takes serving time, the workload and the type of the task into consideration at the same time. Compared with time-based pricing model, it is more reasonable and more feasible. Simulation results show the applicability and effectiveness of our work."}, "conf/ifip8/WuLXW07": {"title": "A Mechanism of Timely Knowledge Push on Demand Based on ECA and Multi-Agent Techniques.", "url": "https://doi.org/10.1007/978-0-387-75902-9_33", "year": "2007", "author": {"Jianlin Wu": "69/4257", "Shuangshuang Lou": "06/1596", "Yan Xiong": "70/880", "Bai Wang 0001": "03/587-1"}, "abstract": "The knowledge organizations have already deployed or are deploying their Knowledge Management systems. And the knowledge service is the key mechanism for knowledge sharing in an organization. There are two mechanisms to implement knowledge service: “Pull” and “Push”. The “Push” mechanism is widely used to push the right knowledge to the right person at the right time actively. At present, the publish/subscribe strategy is adopted mostly to implement the active push of knowledge. However, it can not guarantee the timely knowledge push. Based on the ECA and Multi-Agent techniques, a framework to implement Timely Information & Knowledge Push Service (TIKPS) is put forward in this paper. In the framework, ECA rules are utilized to represent the knowledge consumers’ requirements. And a rule engine is designed to implement the timely knowledge push mechanism integrated with Multi-Agent techniques. Finally, an application example of the mechanism is given under telecom enterprise information and knowledge service environment.KeywordsKnowledge managementKnowledge pushECAMulti-Agent"}, "conf/ifip8/WuXLW07": {"title": "Research on Customer Profile Integration of Telecom Enterprises Based on Ontology.", "url": "https://doi.org/10.1007/978-0-387-75902-9_87", "year": "2007", "author": {"Jianlin Wu": "69/4257", "Yan Xiong": "70/880", "Shuangshuang Lou": "06/1596", "Bai Wang 0001": "03/587-1"}, "abstract": "In the product-centered marketing times of telecom industry, BOSS (Business Operations Supporting System) was established step by step, which resulted in the two critical difficulties in customer profile integration: semantic inconsistency and semantic conflict. In this article, ontology theory is introduced to solve these problems. Firstly, the skeleton method is adopted to build telecom customer profile ontology. Besides, a web based ontology building and query environment—Webtege is developed to give the formal definition in OWL. Then a new approach is proposed to achieve customer profile integration in telecom enterprise in both new system and legacy system scenarios from functional and data view. Therefore, this customer profile ontology could give a guideline in constituting and exchanging unified customer profile data through various systems.KeywordsOntologyCustomer relationship managementOWL"}, "conf/ifip8/YuanWZW07": {"title": "SOA-Based Telecom Product Management System Framework.", "url": "https://doi.org/10.1007/978-0-387-76312-5_51", "year": "2007", "author": {"Yanni Yuan": "57/2786", "Bai Wang 0001": "03/587-1", "Lei Zhang 0049": "64/5666-49", "Jianlin Wu": "69/4257"}, "abstract": "By researching the telecom operations support system and the business support system, a telecom product management framework is presented via integrated with the customer management system (CRM), especially integrated with the analytic CRM and the business intelligence system (BI). It includes five layers, information resource object layer, metadata database layer, basic services layer, information services layer, and user interface layer. In addition, a metadata model is presented to solve the heterogeneous issues at the product data fields name, data type, meaning, database management system, etc. The diversified product information could be logical integrated via metadata service. And based on the unified product definition model, the sharing product analyzing information services could be provided in the whole enterprise angle of view. The framework function services are designed according to the Service Oriented Architecture (SOA), and implemented via Web services. The framework is a new try to improve the efficiency of enterprise macroscopic product analyzing, design, and information serving. It’s has good flexibility, and expansibility in system function services.KeywordsProduct data management systemsService-oriented architecture (SOA)Business information integrationMetadataBusiness intelligence (BI)Customer relationship management (CRM)"}, "conf/imsccs/XiaoDWW07": {"title": "Community Ranking in Social Network.", "url": "https://doi.org/10.1109/IMSCCS.2007.31", "year": "2007", "author": {"Ding Xiao": "76/2094", "Nan Du": "86/4539", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Social network is one of the most important true-life networks in our real world scenarios. A typical feature of the social network is the dense sub-structure (quasi-clique or community) which is essential for understanding the network's internal structure and function. Traditional social network analysis usually focuses on the centrality and power of a single individual or entity, however, in people's daily life, a group or an organization often holds a more influential position and plays a more important role. Therefore, in this paper, we first present a parallel algorithm for the detection of quasi-cliques, and then we describe the techniques that are useful for evaluating the centrality and significance of a quasi-clique. Computational results on a real call graph from a telecom career and a collaboration network of co-authors are given in the end."}, "conf/snpd/ZhaoXW07": {"title": "A Resource Allocation Model with Cost-Performance Ratio in Data Grid.", "url": "https://doi.org/10.1109/SNPD.2007.341", "year": "2007", "author": {"Xiangang Zhao": "64/6130", "Liutong Xu": "47/5193", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Resource allocation for data transfer is a fundamental issue for achieving high performance in data grid environments. In this paper, we survey the existing researches on allocation problems in grid environment and propose a resource allocation model based on the cost-performance ratio for commerce environments. This ratio takes both price and quality of data resource into consideration at the same time. According to the optimization objective we define two types of ratios: Price-aware ratio and quality-aware ratio. They are suitable for the environments where allocations put more emphasis on quality or price of resource respectively. Based on the maximal cost-efficiency, we formulize the allocation optimization problem and present two theorems and a deduction about its solutions. The corresponding proofs are also given in the paper. Finally, we present two algorithms to allocate and re-allocate data resources. The analysis shows that the algorithms can satisfy our requirements."}, "conf/webi/DuWW07": {"title": "Backbone Discovery in Social Networks.", "url": "https://doi.org/10.1109/WI.2007.36", "year": "2007", "author": {"Nan Du": "86/4539", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Recent years have seen a thriving development of the World Wide Web as the most visible social media which enables people to share opinions, experiences and expertise with each other across the world. People now get involved in many different social networks simultaneously, which are often large intricate web of connections among the massive entities they are made of. As a result, the challenge of collecting and analyzing large-scale data among social members has left most basic questions about the global composition and function of such networks largely unresolved: What is the essential organization of a social network? who are the influential individuals whose voice is echoed by others? To address these questions, this paper presents an algorithm called sketcher to discover and describe the overall backbone of a specific network. Experimental results on the American College Football, Scientific Collaboration, and Telecommunications Call networks show that sketcher can extract the essential composition of a social network both efficiently and intuitively."}, "conf/apscc/ZhaoWXD06": {"title": "GOI-Based Information Service Architecture in Grid.", "url": "https://doi.org/10.1109/APSCC.2006.62", "year": "2006", "author": {"Xiangang Zhao": "64/6130", "Bai Wang 0001": "03/587-1", "Liutong Xu": "47/5193", "Nan Du": "86/4539"}, "abstract": " Abstract:Grid information service (GIS) provides the function of discovering and monitoring resources, which is the foundation of the grid infrastructure. It is important to ensure its reliability and efficiency. This paper proposes a novel information service architecture based on group of interest (GOI) mechanism, which is completely distributed and has high scalability and reliability. In a GOI, all GIS nodes have the uniform view of information by exchanging their information periodically for efficient service discovery and fault-tolerance. A super GIS node is selected in each GOI to take full responsibility for the queries submitted to this GOI. This mechanism can reduce the query distance and enhance the query efficiency. Experimental results show that the mechanism satisfies the expectations"}, "conf/gcc/ZhaoWDZX06": {"title": "Qos-based Algorithm for Job Allocation and Scheduling in Data Grid.", "url": "https://doi.org/10.1109/GCCW.2006.75", "year": "2006", "author": {"Xiangang Zhao": "64/6130", "Bai Wang 0001": "03/587-1", "Nan Du": "86/4539", "Congyun Zhao": "66/3499", "Liutong Xu": "47/5193"}, "abstract": " Abstract:Job allocation and scheduling for data transfer is a fundamental issue for achieving high performance in data grid environments. In this paper, we propose a new algorithm that combines job allocation with scheduling dynamically based on resource quality. The algorithm takes resource failure into consideration and provides a re-allocation mechanism, so it can utilize limited amounts of resources efficiently and enhance the reliability of data transfer in data grid. A definition of resource quality is given in the paper as well, which consists of information about CPU and bandwidth of the grid storage node that resource resides. To reflect historical performance of resource, a new instance of ant algorithm is designed for calculating and updating this resource quality. Based on this quality, the job allocation and scheduling algorithm can take full advantage of the high performance resources and balance the load among resources at the same time. Experimental results show that the algorithm satisfies the expectations"}, "conf/icdm/DuWXWP06": {"title": "A Parallel Algorithm for Enumerating All Maximal Cliques in Complex Network.", "url": "https://doi.org/10.1109/ICDMW.2006.17", "year": "2006", "author": {"Nan Du": "86/4539", "Bin Wu 0001": "98/4432-1", "Liutong Xu": "47/5193", "Bai Wang 0001": "03/587-1", "Xin Pei": "18/5904"}, "abstract": " Abstract:Efficient enumeration of all maximal cliques in a given graph has many applications in graph theory, data mining and bio informatics. However, the exponentially increasing computation time of this problem confines the scale of the graph. Meanwhile, recent researches show that many networks in our world are complex networks involving massive data. To solve the maximal clique problem in the real-world scenarios, this paper presents a parallel algorithm Peamc (parallel enumeration of all maximal cliques) which exploits several new and effective techniques to enumerate all maximal cliques in a complex network. Furthermore, we provide a performance study on a true-life call graph with up to 2,423,807 vertices and 5,317,183 edges. The experimental results show that Peamc can find all the maximal cliques in a complex network with high efficiency and scalability"}, "conf/imsccs/DuXZZW06": {"title": "Resource Merging and Synchronization in FTPGrid*.", "url": "https://doi.org/10.1109/IMSCCS.2006.120", "year": "2006", "author": {"Nan Du": "86/4539", "Liutong Xu": "47/5193", "Xiangang Zhao": "64/6130", "Congyun Zhao": "66/3499", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:FTPGrid incorporates traditional FTP system with grid technology to implement large-scale resource sharing with high performance and reliability. FTP servers that geographically neighbor with each other form communities, which in turn constitute the FTPGrid. In this paper, we propose a resource merging mechanism to establish a well-organized resource directory in each community by merging duplicated resources according to their message digest. Different resources with the same names would be treated separately while the same resources with different names would be merged. Moreover, we design a synchronization protocol that keeps the resource directory of each community synchronized to give a unified view to end users. Experiment shows that the resource merging mechanism and the synchronization protocol could make a group of FTP servers as a single one so that any user connecting to any one of them can retrieve all the resources expediently and efficiently"}, "conf/egc/XuWA05": {"title": "WebGrid: A New Paradigm for Web System.", "url": "https://doi.org/10.1007/11508380_119", "year": "2005", "author": {"Liutong Xu": "47/5193", "Bai Wang 0001": "03/587-1", "Bo Ai": "85/6463"}, "abstract": "World Wide Web is one of the most important applications on the Internet. Net surfers can browse the Web pages by tracing the links embedded in the hypertexts. However, one will be stuck when there are no hyperlinks or the hyperlinks are broken. This paper proposes a new paradigm for Web system called WebGrid, which consists of a dynamic collection of Web servers that work cooperatively. WebGrid synchronizes the Web contents that are usually stored in the underlying database systems in order to provide a uniform view of all resources. Net surfers can retrieve all resources in the WebGrid through one local Web server. The paper addresses WebGrid architecture and some related concepts. Key issues such as the WebGrid topology, the resource synchronization mechanism and strategy, as well as the Web site customization are also discussed in the paper.KeywordsNews ReportDynamic CollectionSynchronization MechanismAuthority ResourceResource SynchronizationThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "journals/corr/abs-2201-07708": {"title": "Debiased Graph Neural Networks with Agnostic Label Selection Bias.", "url": "https://arxiv.org/abs/2201.07708", "year": "2022", "author": {"Shaohua Fan": "93/1263", "Xiao Wang 0017": "49/67-17", "Chuan Shi": "64/3041", "Kun Kuang": "194/4245", "Nian Liu": "30/2704", "Bai Wang 0001": "03/587-1"}, "abstract": "\n      Abstract:  Most existing Graph Neural Networks (GNNs) are proposed without considering\nthe selection bias in data, i.e., the inconsistent distribution between the\ntraining set with test set. In reality, the test data is not even available\nduring the training process, making selection bias agnostic. Training GNNs with\nbiased selected nodes leads to significant parameter estimation bias and\ngreatly impacts the generalization ability on test nodes. In this paper, we\nfirst present an experimental investigation, which clearly shows that the\nselection bias drastically hinders the generalization ability of GNNs, and\ntheoretically prove that the selection bias will cause the biased estimation on\nGNN parameters. Then to remove the bias in GNN estimation, we propose a novel\nDebiased Graph Neural Networks (DGNN) with a differentiated decorrelation\nregularizer. The differentiated decorrelation regularizer estimates a sample\nweight for each labeled node such that the spurious correlation of learned\nembeddings could be eliminated. We analyze the regularizer in causal view and\nit motivates us to differentiate the weights of the variables based on their\ncontribution on the confounding bias. Then, these sample weights are used for\nreweighting GNNs to eliminate the estimation bias, thus help to improve the\nstability of prediction on unknown test nodes. Comprehensive experiments are\nconducted on several challenging graph datasets with two kinds of label\nselection biases. The results well verify that our proposed model outperforms\nthe state-of-the-art methods and DGNN is a flexible framework to enhance\nexisting GNNs.\n\n    "}, "journals/corr/abs-2111-10657": {"title": "Generalizing Graph Neural Networks on Out-Of-Distribution Graphs.", "url": "https://arxiv.org/abs/2111.10657", "year": "2021", "author": {"Shaohua Fan": "93/1263", "Xiao Wang 0017": "49/67-17", "Chuan Shi": "64/3041", "Peng Cui 0001": "31/891-1", "Bai Wang 0001": "03/587-1"}, "abstract": "\n      Abstract:  Graph Neural Networks (GNNs) are proposed without considering the agnostic\ndistribution shifts between training and testing graphs, inducing the\ndegeneration of the generalization ability of GNNs on Out-Of-Distribution (OOD)\nsettings. The fundamental reason for such degeneration is that most GNNs are\ndeveloped based on the I.I.D hypothesis. In such a setting, GNNs tend to\nexploit subtle statistical correlations existing in the training set for\npredictions, even though it is a spurious correlation. However, such spurious\ncorrelations may change in testing environments, leading to the failure of\nGNNs. Therefore, eliminating the impact of spurious correlations is crucial for\nstable GNNs. To this end, we propose a general causal representation framework,\ncalled StableGNN. The main idea is to extract high-level representations from\ngraph data first and resort to the distinguishing ability of causal inference\nto help the model get rid of spurious correlations. Particularly, we exploit a\ngraph pooling layer to extract subgraph-based representations as high-level\nrepresentations. Furthermore, we propose a causal variable distinguishing\nregularizer to correct the biased training distribution. Hence, GNNs would\nconcentrate more on the stable correlations. Extensive experiments on both\nsynthetic and real-world OOD graph datasets well verify the effectiveness,\nflexibility and interpretability of the proposed framework.\n\n    "}, "journals/fcsc/XieWJW20": {"title": "Graph-ranking collective Chinese entity linking algorithm.", "url": "https://doi.org/10.1007/s11704-018-7175-0", "year": "2020", "author": {"Tao Xie": "181/2328", "Bin Wu 0001": "98/4432-1", "Bingjing Jia": "194/7486", "Bai Wang 0001": "03/587-1"}, "abstract": "Entity linking (EL) systems aim to link entity mentions in the document to their corresponding entity records in a reference knowledge base. Existing EL approaches usually ignore the semantic correlation between the mentions in the text, and are limited to the scale of the local knowledge base. In this paper, we propose a novel graphranking collective Chinese entity linking (GRCCEL) algorithm, which can take advantage of both the structured relationship between entities in the local knowledge base and the additional background information offered by external knowledge sources. By improved weighted word2vec textual similarity and improved PageRank algorithm, more semantic information and structural information can be captured in the document. With an incremental evidence mining process, more powerful discrimination capability for similar entities can be obtained. We evaluate the performance of our algorithm on some open domain corpus. Experimental results show the effectiveness of our method in Chinese entity linking task and demonstrate the superiority of our method over state-of-the-art methods."}, "journals/corr/abs-2006-15874": {"title": "Decorrelated Clustering with Data Selection Bias.", "url": "https://arxiv.org/abs/2006.15874", "year": "2020", "author": {"Xiao Wang 0017": "49/67-17", "Shaohua Fan": "93/1263", "Kun Kuang": "194/4245", "Chuan Shi": "64/3041", "Jiawei Liu": "12/8228", "Bai Wang 0001": "03/587-1"}, "abstract": "\n      Abstract:  Most of existing clustering algorithms are proposed without considering the\nselection bias in data. In many real applications, however, one cannot\nguarantee the data is unbiased. Selection bias might bring the unexpected\ncorrelation between features and ignoring those unexpected correlations will\nhurt the performance of clustering algorithms. Therefore, how to remove those\nunexpected correlations induced by selection bias is extremely important yet\nlargely unexplored for clustering. In this paper, we propose a novel\nDecorrelation regularized K-Means algorithm (DCKM) for clustering with data\nselection bias. Specifically, the decorrelation regularizer aims to learn the\nglobal sample weights which are capable of balancing the sample distribution,\nso as to remove unexpected correlations among features. Meanwhile, the learned\nweights are combined with k-means, which makes the reweighted k-means cluster\non the inherent data distribution without unexpected correlation influence.\nMoreover, we derive the updating rules to effectively infer the parameters in\nDCKM. Extensive experiments results on real world datasets well demonstrate\nthat our DCKM algorithm achieves significant performance gains, indicating the\nnecessity of removing unexpected feature correlations induced by selection bias\nwhen clustering.\n\n    "}, "journals/access/LanSWZ19": {"title": "An IoT Unified Access Platform for Heterogeneity Sensing Devices Based on Edge Computing.", "url": "https://doi.org/10.1109/ACCESS.2019.2908684", "year": "2019", "author": {"Lina Lan": "05/10049", "Ruisheng Shi": "118/4779", "Bai Wang 0001": "03/587-1", "Lei Zhang 0049": "64/5666-49"}, "abstract": " Abstract:With the rapid development of the Internet of Things (IoT), a large number of heterogeneous sensing devices are accessed in their proprietary ways to IoT applications, formed “silos” application mode. The growth of IoT applications has been hampered by this mode due to the barriers of resource sharing of heterogeneous sensing devices. This paper proposes an IoT access platform deployed at the network edge near the sensing devices. This architecture can enable more responsive IoT applications and provide efficient privacy protection for sensitive data. We propose a general ontology-based resource description model of IoT devices to provide a consistent view of heterogeneous sensing devices for IoT applications in the cloud. Based on this model, we propose an adaptive access method to provide unified access, control, and management of IoT devices with various intelligence levels. The access platform turns the “silos” application mode of IoT into a horizontal application mode, supports applications to share and reuse the resources of IoT devices. We demonstrate the efficacy of our architecture with an application case study that highlights our proposed resource description model and adaptive access method and evaluate performance improvement with experiments."}, "journals/access/LanSWZJ19": {"title": "A Universal Complex Event Processing Mechanism Based on Edge Computing for Internet of Things Real-Time Monitoring.", "url": "https://doi.org/10.1109/ACCESS.2019.2930313", "year": "2019", "author": {"Lina Lan": "05/10049", "Ruisheng Shi": "118/4779", "Bai Wang 0001": "03/587-1", "Lei Zhang 0049": "64/5666-49", "Ning Jiang": "74/2686"}, "abstract": " Abstract:The tremendous number of sensors and smart objects deployed in the Internet of Things (IoT) pose a huge potential for the IoT real-time monitoring applications to detect and react to the real world. The insufficient capacity of the IoT data real-time processing has hampered the growth of the IoT real-time monitoring applications. We focus on two issues of the IoT data real-time processing: 1) how to efficiently transform a large number of raw sensing data into meaningful complex event, and 2) how to adapt to the complexity and changeability of monitoring business logic. This paper proposes a universal complex event processing (CEP) mechanism for the IoT real-time monitoring. We propose a formalized hierarchical complex event model including raw event, simple event, and complex event, which reduces the complexity of event modeling. The model supports complex time and space semantics to define flexible complex events by a programming way. Based on this model, we propose a CEP system architecture, in which the system is deployed on the network edge between sensing devices in terminal and applications in the cloud. The complex event definition can be mapped to the CEP rule logic script to detect the potential abnormal event timely. The proposed CEP mechanism is universal and suitable to any heterogeneous sensing devices and CEP engine. We demonstrate the efficacy of the mechanism with two application case studies that highlight our proposed complex event model and evaluate the performance improvement with experiments."}, "journals/corr/abs-1903-07293": {"title": "Heterogeneous Graph Attention Network.", "url": "http://arxiv.org/abs/1903.07293", "year": "2019", "author": {"Xiao Wang 0017": "49/67-17", "Houye Ji": "223/8227", "Chuan Shi": "64/3041", "Bai Wang 0001": "03/587-1", "Peng Cui 0001": "31/891-1", "Philip S. Yu": "y/PhilipSYu", "Yanfang Ye": "07/4509"}, "abstract": "\n      Abstract:  Graph neural network, as a powerful graph representation technique based on\ndeep learning, has shown superior performance and attracted considerable\nresearch interest. However, it has not been fully considered in graph neural\nnetwork for heterogeneous graph which contains different types of nodes and\nlinks. The heterogeneity and rich semantic information bring great challenges\nfor designing a graph neural network for heterogeneous graph. Recently, one of\nthe most exciting advancements in deep learning is the attention mechanism,\nwhose great potential has been well demonstrated in various areas. In this\npaper, we first propose a novel heterogeneous graph neural network based on the\nhierarchical attention, including node-level and semantic-level attentions.\nSpecifically, the node-level attention aims to learn the importance between a\nnode and its metapath based neighbors, while the semantic-level attention is\nable to learn the importance of different meta-paths. With the learned\nimportance from both node-level and semantic-level attention, the importance of\nnode and meta-path can be fully considered. Then the proposed model can\ngenerate node embedding by aggregating features from meta-path based neighbors\nin a hierarchical manner. Extensive experimental results on three real-world\nheterogeneous graphs not only show the superior performance of our proposed\nmodel over the state-of-the-arts, but also demonstrate its potentially good\ninterpretability for graph analysis.\n\n    "}, "journals/ci/LiHWXW18": {"title": "Group behavior diffusion model of social hotspots based on triadic structure and factor graphs.", "url": "https://doi.org/10.1111/coin.12176", "year": "2018", "author": {"Qian Li 0009": "69/5902-9", "Kai Huang": "86/489", "Bin Wu 0001": "98/4432-1", "Yunpeng Xiao": "13/4816", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "journals/ieicet/ZhuWWZ17": {"title": "Emotional Community Detection in Social Network.", "url": "https://doi.org/10.1587/transinf.2016EDP7473", "year": "2017", "author": {"Jiang Zhu": "91/500", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Weiyu Zhang": "10/2885"}, "abstract": ""}, "journals/ijoe/LanWZSL15": {"title": "An Event-driven Service-oriented Architecture for Internet of Things Service Execution.", "url": "https://doi.org/10.3991/ijoe.v11i2.3842", "year": "2015", "author": {"Lina Lan": "05/10049", "Bai Wang 0001": "03/587-1", "Lei Zhang 0049": "64/5666-49", "Ruisheng Shi": "118/4779", "Fei Li 0002": "87/3534-2"}, "abstract": ""}, "journals/ci/ShiYYHW14": {"title": "Comparison and Selection of objective Functions in multiobjective Community Detection.", "url": "https://doi.org/10.1111/coin.12007", "year": "2014", "author": {"Chuan Shi": "64/3041", "Philip S. Yu": "y/PhilipSYu", "Zhenyu Yan 0001": "57/1273-1", "Yue Huang": "48/2209", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "journals/isci/ZhuWWZ14": {"title": "Maximizing the spread of influence ranking in social networks.", "url": "https://doi.org/10.1016/j.ins.2014.03.070", "year": "2014", "author": {"Tian Zhu 0001": "39/4247-1", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Chuanxi Zhu": "38/5521"}, "abstract": "Information flows in a network where individuals influence each other. In this paper, we study the influence maximization problem of finding a small subset of nodes in a social network that could maximize the spread of influence. We propose a novel information diffusion model CTMC-ICM, which introduces the theory of Continuous-Time Markov Chain (CTMC) into the Independent Cascade Model (ICM). Furthermore, we propose a new ranking metric named SpreadRank generalized by the new information propagation model CTMC-ICM. We experimentally demonstrate the new ranking method that can, in general, extract nontrivial nodes as an influential node set that maximizes the spread of information in a social network and is more efficient than a distance-based centrality."}, "journals/corr/DongTCLYW14": {"title": "Inferring social status and rich club effects in enterprise communication networks.", "url": "http://arxiv.org/abs/1404.3708", "year": "2014", "author": {"Yuxiao Dong": "17/9267", "Jie Tang 0001": "t/JieTang", "Nitesh V. Chawla": "c/NiteshVChawla", "Tiancheng Lou": "74/4677", "Yang Yang 0008": "48/450-8", "Bai Wang 0001": "03/587-1"}, "abstract": "\n      Abstract:  Social status, defined as the relative rank or position that an individual\nholds in a social hierarchy, is known to be among the most important motivating\nforces in social behaviors. In this paper, we consider the notion of status\nfrom the perspective of a position or title held by a person in an enterprise.\nWe study the intersection of social status and social networks in an\nenterprise. We study whether enterprise communication logs can help reveal how\nsocial interactions and individual status manifest themselves in social\nnetworks. To that end, we use two enterprise datasets with three communication\nchannels --- voice call, short message, and email --- to demonstrate the\nsocial-behavioral differences among individuals with different status. We have\nseveral interesting findings and based on these findings we also develop a\nmodel to predict social status. On the individual level, high-status\nindividuals are more likely to be spanned as structural holes by linking to\npeople in parts of the enterprise networks that are otherwise not well\nconnected to one another. On the community level, the principle of homophily,\nsocial balance and clique theory generally indicate a \"rich club\" maintained by\nhigh-status individuals, in the sense that this community is much more\nconnected, balanced and dense. Our model can predict social status of\nindividuals with 93% accuracy.\n\n    "}, "journals/ijdsn/DingWCGW13": {"title": "Moving Target Oriented Opportunistic Routing Algorithm in Vehicular Networks.", "url": "https://doi.org/10.1155/2013/692146", "year": "2013", "author": {"Yu Ding": "77/6871", "Wendong Wang": "80/4406", "Yong Cui 0001": "91/2346-1", "Xiangyang Gong": "04/8431", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "journals/eswa/ZhuWWZ12": {"title": "Topic correlation and individual influence analysis in online forums.", "url": "https://doi.org/10.1016/j.eswa.2011.09.112", "year": "2012", "author": {"Tian Zhu 0001": "39/4247-1", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Chuanxi Zhu": "38/5521"}, "abstract": "Over the last few years, online forums have gained massive popularity and have become one of the most influential web social media in our times. The forum document corpus can be seemed to be composed of various topics evolved over time, and every topics is reflected on a volume of keywords and social actors. In this paper, we attempt to study the interesting problem: for the evolving topics, were there any correlation between them? We propose a method for discovering the dependency relationship between the topics of documents in adjacent time stamps based on the knowledge of content semantic similarity and social interactions of authors and repliers. We introduce mutual information measure to estimate the correlation between the topics. Applied to the realistic forum data, we show how topics are related and which postings can be recommended to another as similar topics. We also show how the authors impact the topics and propose a new way for evaluating author impact."}, "journals/eswa/ZhuWWZ11": {"title": "Role defining using behavior-based clustering in telecommunication network.", "url": "https://doi.org/10.1016/j.eswa.2010.09.051", "year": "2011", "author": {"Tian Zhu 0001": "39/4247-1", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1", "Chuanxi Zhu": "38/5521"}, "abstract": "Understanding the individual behavior has shown to be of paramount importance to the triumph of the telecommunication operators to retain customers, enhance their purchasing capacity, and predict the churn rate. Different behavior patterns can be observed for different groups of users. Hence, there is an interesting problem posted in telecommunication network that how to define the users’ role according to their behavior patterns. Traditionally, user behavior characterization methods generally based on their call detail record (CDR), which are user’s individual features, are not appropriate to identify the role in network. In this paper, we develop a new methodology for identifying users’ role based on their behaviors in telecommunication network using the social features instead of their individual features. Experiments have tested on synthetic data and large real datasets, and reveal good results on both of them. Finally, the methodology is not only limited to call graphs but also apply to other networks for role defining."}, "journals/fcsc/YangWW09": {"title": "Multidimensional views on mobile call network.", "url": "https://doi.org/10.1007/s11704-009-0056-9", "year": "2009", "author": {"Shengqi Yang": "11/4785", "Bin Wu 0001": "98/4432-1", "Bai Wang 0001": "03/587-1"}, "abstract": "Recent studies on social network have spurred significant interests in human behaviors. Nowadays, various kinds of interpersonal human interactions, from mobile calls to emails, provide particular avenues to explore the inherent properties of communication patterns. In this article, we present a comprehensive study on a massive anonymous call records obtained from a major mobile service operator. The important difference laid in our work and previous mainly topological analyses is that we report on multiple aspects of the dataset. By investigating the calls of the users, we find out that most calls tend to last within one minute. Call duration between two females is much longer than that of two males. But calls of males generally involve more stations than that of female, indicating a larger mobile range of the males. We also observed that people tend to communicate more with each other when they share similar characters. Besides, the network is well-connected and robust to random attack. We also demonstrate that the close-knit sub-groups with little discrepancy in the characteristics of its involved users usually evoke more calls. Another interesting discovery is that call behaviors among people between workdays and weekends is obviously distinct. Generally speaking, the goal that we research on call network through multidimensional analyses is to uncover the intricate patterns of human communications and put up reasonable insights into future service intelligence."}, "journals/fcsc/WuHYW09": {"title": "Correlation in mobile call networks from structure perspective.", "url": "https://doi.org/10.1007/s11704-009-0043-1", "year": "2009", "author": {"Bin Wu 0001": "98/4432-1", "Deyong Hu": "94/7130", "Qi Ye": "19/6124", "Bai Wang 0001": "03/587-1"}, "abstract": "Researchers have done considerable work on the structure of social network recently, but mostly neglected the correlation between two connected nodes. In this paper, our primary goal is to acquire users’ structural properties in mobile call networks. We take a novel perspective-structure correlation between two connected users perspective to study the structural properties. To investigate the structural properties in static and dynamic mobile call networks, we define some metrics which are based on the clique size vectors of mobile call users. By exploring several real-world mobile call networks, which contain hundreds of thousands of mobile call users respectively, we find that people tend to communicate with the one who has a similar structure in static mobile call networks. Moreover, It is found that the connected people have similar structural changes on the whole in dynamicmobile call networks, and the structures of some two connected persons both have growing or shrinking trends. We use a visualization toolkit to give a view of the growing or shrinking scenarios temporally."}, "journals/isci/ShiYLSW09": {"title": "A dominance tree and its application in evolutionary multi-objective optimization.", "url": "https://doi.org/10.1016/j.ins.2009.06.035", "year": "2009", "author": {"Chuan Shi": "64/3041", "Zhenyu Yan 0001": "57/1273-1", "Kevin Lü 0001": "70/1130", "Zhongzhi Shi": "52/1213", "Bai Wang 0001": "03/587-1"}, "abstract": "Most contemporary multi-objective evolutionary algorithms (MOEAs) store and handle a population with a linear list, and this may impose high computational complexities on the comparisons of solutions and the fitness assignment processes. This paper presents a data structure for storing the whole population and their dominating information in MOEAs. This structure, called a Dominance Tree (DT), is a binary tree that can effectively and efficiently store three-valued relations (namely dominating, dominated or non-dominated) among vector values. This paper further demonstrates DT’s potential applications in evolutionary multi-objective optimization with two cases. The first case utilizes the DT to improve NSGA-II as a fitness assignment strategy. The second case demonstrates a DT-based MOEA (called a DTEA), which is designed by leveraging the favorable properties of the DT. The simulation results show that the DT-improved NSGA-II is significantly faster than NSGA-II. Meanwhile, DTEA is much faster than SPEA2, NSGA-II and an improved version of NSGA-II. On the other hand, in regard to converging to the Pareto optimal front and maintaining the diversity of solutions, DT-improved NSGA-II and DTEA are found to be competitive with NSGA-II and SPEA2."}, "journals/jcst/DuWW08": {"title": "Community Detection in Complex Networks.", "url": "https://doi.org/10.1007/s11390-008-9163-6", "year": "2008", "author": {"Nan Du": "86/4539", "Bai Wang 0001": "03/587-1", "Bin Wu 0001": "98/4432-1"}, "abstract": "With the rapidly growing evidence that various systems in nature and society can be modeled as complex networks, community detection in networks becomes a hot research topic in physics, sociology, computer society, etc. Although this investigation of community structures has motivated many diverse algorithms, most of them are unsuitable when dealing with large networks due to their computational cost. In this paper, we present a faster algorithm ComTector, which is more efficient for the community detection in large complex networks based on the nature of overlapping cliques. This algorithm does not require any priori knowledge about the number or the original division of the communities. With respect to practical applications, ComTector is challenging with five different types of networks including the classic Zachary Karate Club, Scientific Collaboration Network, South Florida FreeWord Association Network, Urban Traffic Network, North America Power Grid and the Telecommunication Call Network. Experimental results show that our algorithm can discover meaningful communities that meet both the objective basis and our intuitions."}}}