{"id": "80/6229", "name": "Budan Wu", "Article": {"conf/hpcct/WuLL18": {"title": "DMOMVP: A Business-Process-Oriented Data Model Optimization Method Based on Database Vertical Partition.", "url": "https://doi.org/10.1145/3234664.3234670", "year": "2018", "author": {"Budan Wu": "80/6229", "Rongheng Lin": "35/3624", "Ran Liu": "65/2726"}, "abstract": "\n\t\tBusiness process provides the capability of business logic customization, and it is used widely. However, current business process modeling technology mainly focuses on the process model itself, which ignores the data model inside the process. The separation of process model and data model might lead to the gap of each other. This problem may cause data access conflicts and decrease the performance of the business process. To solve the problem, this paper provides an algorithm, called DMOMVP, to find the parallel activity collection in business process and a data model optimization algorithm based on vertical partition. The DMOMVP optimizes the data model in the database dynamically. And this paper gives a business process of online exam system as a scenario to illustrate the application of the algorithm.\n\t"}, "conf/IEEEscc/HuWC17": {"title": "The Mining of Activity Dependence Relation Based on Business Process Models.", "url": "https://doi.org/10.1109/SCC.2017.64", "year": "2017", "author": {"Guangchang Hu": "144/9390", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the development of process recommendation, dynamic adaptation and automatic modeling, the requirement of explicit and formalized expression of activity dependence relation in the business domain is becoming more and more urgent. However, these relations more exist in the minds of domain experts or in the unstructured documents, which leads process modeling and adaptation are a time-consuming and error-prone process. To solve this problem, a relation mining method is proposed for obtaining activity dependence relations. The formal description of these relations is defined in control flow perspective, which is expressed as serial-dependence relations and parallel-dependence relations in the form of three tuples after analyzing all the control flow patterns. And a mining algorithm is proposed for mining these two types of relations based on the process model. The correctness and performance of this algorithm are verified by a large number of experiments, and the experimental results show this method can quickly and accurately extract all the activity dependence relations from the existing process models in a business domain."}, "conf/chinacom/ZhouLFZW17": {"title": "A SDN Security Transmission Service Using Multi-connection and Time-Slot Scheduling.", "url": "https://doi.org/10.1007/978-3-319-78130-3_47", "year": "2017", "author": {"Shiqi Zhou": "46/1657", "Rongheng Lin": "35/3624", "Shuquan Fan": "223/2172", "Hua Zou": "66/3384", "Budan Wu": "80/6229"}, "abstract": "SDN (Software-Defined Networking) provides a new approach to improve network security. In this paper, we design and implement a security service of transmission channels in SDN, which will efficiently lower the percentage of information leakage on the data plane of SDN networks. The core of the service is forwarding strategies based on multi-connection and time-slot scheduling, which functions on SDN controllers. According to the time-slot strategy, every data flow is transmitted on one path in a network at a certain moment, then in next time-slot it will be transmitted on another path, and so on. The multi-connection strategy allows to transmit data through multiple links at a same time. There is a client-side subsystem deployed in user terminals to process the data to send or receive. The processing of data including splitting and encrypting in application layer, coordinating with the forwarding strategies, reduces probability of the whole data flow being intercepted.KeywordsSDNSecurityMulti-connectionTime-slot scheduling"}, "conf/chinacom/FanLZZWS17": {"title": "A Novel Path Selection Algorithm Based on Graph-Cut to Ensure Security in SDN.", "url": "https://doi.org/10.1007/978-3-319-78130-3_56", "year": "2017", "author": {"Shuquan Fan": "223/2172", "Rongheng Lin": "35/3624", "Shiqi Zhou": "46/1657", "Hua Zou": "66/3384", "Budan Wu": "80/6229", "Yun Su": "152/6119"}, "abstract": "To ensure the safety of data transmission in SDN network, a practical approach is to forward data by time division in multiple reachable paths. Considering multiple data transmission processes between the sender and the receiver based on the mechanism above, the overlap of the paths is inevitable, which may make the utilization rate of some switches or critical paths too high and other switches are relatively idle, then the transmission efficiency would be too low. This paper put forward a path selection algorithm based on graph-cut to solve the problem. Also, taking switch weight under consideration. In addition, effectiveness is taken into account. Considering to the large scale of actual networks and uneven occupancy rate of switches, this algorithm reflects its advantage.KeywordsSDNPath selectionGraph cutWeight of switchMultiplied topology extension"}, "conf/es/YeLZWG17": {"title": "The Location and Capacity of Distributed Generation Based on Genetic Algorithm.", "url": "https://doi.org/10.1109/ES.2017.7", "year": "2017", "author": {"Zezhou Ye": "210/3894", "Rongheng Lin": "35/3624", "Hua Zou": "66/3384", "Budan Wu": "80/6229", "Naiwang Guo": "92/7648"}, "abstract": " Abstract:Distributed generation (DG) has a certain impact on grid power flow, network loss, and power supply reliability when it accesses power gird. Its location directly affects operating efficiency of distribution network. The traditional location optimization algorithm is generally studied for the constant output of distributed generation. Based on the original research, a genetic algorithm based on total cost of grid operation as objective function is proposed. The algorithm simplifies and evaluates the external characteristics of the distributed generation and establishes the analysis model. The chromosome coding, crossover, mutation and other operations about distributed generation is achieved based on this implementation, and then match the genetic algorithm model. By analyzing power grid system of IEEE 33 nodes and comparing the existing research, the method proposed in this paper has been proved. This model with genetic algorithm has practical significance in reducing economic operating costs and optimizing parameters of power grid with distributed generation."}, "conf/IEEEscc/HuangHWYHC16": {"title": "An Ontology-Based Semantic Service Markup for Content-centric Networking.", "url": "https://doi.org/10.1109/SCC.2016.109", "year": "2016", "author": {"Yuze Huang": "185/1545", "Jiwei Huang": "57/7478", "Budan Wu": "80/6229", "Tianxiang Yao": "24/259", "Shuqing He": "185/1471", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the rapid development of Internet technology, a new architecture named Content-Centric Networking (CCN) has emerged recently. With powerful abilities of data caching and multicast, it has been increasingly popular especially for multimedia applications. However, service markup, in-network caching and routing are not inherently addressed in CCN. In this paper, we make an attempt at filling this gap by designing an ontology-based semantic service markup for CCN. Two components which are Service Identifier (SID) and Service Behavior Description (SBD) are presented in order to decouple the service entity with its original physical location, making it possible for service discovery and caching in CCN environments. Detailed designs are introduced, and a case study of an online multimedia conference system is presented to validate the effectiveness of our approach."}, "conf/IEEEscc/WuLWC16": {"title": "Dynamic Business Process Generation and Verification.", "url": "https://doi.org/10.1109/SCC.2016.118", "year": "2016", "author": {"Budan Wu": "80/6229", "Rongheng Lin": "35/3624", "Pengjie Wang": "71/7813", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Business process dynamics in services computing has become more and more important to satisfy today's variable enterprise requirements. Existing business process systems lack support for business process flexibility in practice, it has become increasingly difficult to cope with variable enterprise needs. To solve this problem, a dynamic business process model is introduced in this paper, and a dynamic business process generation algorithm is proposed. The verification of the generated business process is based on the Kripke structure to verify the proposed correctness properties specified in Computational Tree Logic (CTL). We implement a dynamic expansion module for dynamic business process engine based on jBPM5, in that way, a black box in the business process definition can be generated dynamically according to the Drools rules. We demonstrate the proposed approach in a real auditing business process system project. Our approach is generic and can reduce the maintenance costs and the risks during the project."}, "conf/IEEEscc/LinWZG16": {"title": "A Hybrid Process-Data Model to Avoid Data Conflicting in BPMN.", "url": "https://doi.org/10.1109/SCC.2016.119", "year": "2016", "author": {"Rongheng Lin": "35/3624", "Budan Wu": "80/6229", "Hua Zou": "66/3384", "Naiwang Guo": "92/7648"}, "abstract": " Abstract:Typically, BPMN Designer only needs to consider the business process without knowing the detail of invoked service, which helps them to simplify the design procedure. However, in some data centric workflow scenario, if designer didn't know about the data model of the invoked service, the BPMN workflow execution will be inefficient due to data conflict. There is lack of dynamically data modeling capability in BPMN, which means some data conflicts might happen in the designed workflow. To solve the problem, this paper introduced a hybrid model combining process and data, which is called process-data (PD) model. PD model defined several data conflict scenarios, which transformed the conflicting problem into parallel collection constructing problem. A novel collection generating method is introduced for the parallel collection creation. Based on the output of method, user can find a way to optimize the data conflict and increase the performance of the workflow."}, "conf/IEEEcloud/LinWSXYZ14": {"title": "A Security PaaS Container with a Customized JVM.", "url": "https://doi.org/10.1109/CLOUD.2014.142", "year": "2014", "author": {"Rongheng Lin": "35/3624", "Budan Wu": "80/6229", "Sen Su": "63/2499", "Peng Xu": "84/586", "Shasha Yang": "155/7180", "Yao Zhao 0004": "45/2091-4"}, "abstract": " Abstract:PaaS is known as an application engine which third party developers can deploy their application onto. Security of PaaS becomes important as applications shares resources. How to secure and isolation the resources become an important topic. In this paper, a security PaaS container is proposed which is based on a customized JVM. This container is fully implemented and evaluated in real setting."}, "conf/IEEEscc/LinWZZ14": {"title": "EKMPC: Enhanced KMP Allocation for Virtual Network Service Provision in Cloud.", "url": "https://doi.org/10.1109/SCC.2014.113", "year": "2014", "author": {"Rongheng Lin": "35/3624", "Budan Wu": "80/6229", "Yao Zhao 0004": "45/2091-4", "Hua Zou": "66/3384"}, "abstract": " Abstract:Resource Virtualization is one of major capabilities in cloud. Computing and Storage virtualization is widely used in cloud. Networking virtualization becomes a trend of cloud computing. In past, user can only request a networking resource offline, virtual network can be allocation as needed. Allocating the network on demand will become a challenge for network. In this work in progress study, we propose an Enhanced KMP (Knuth-Morris-Pratt) algorithm for Virtual Network Allocation in cloud (EKMPC), which use the concept of KMP."}, "conf/IEEEscc/HuWZC14": {"title": "Dynamic Integration Mechanism of Business Process for Internet of Things.", "url": "https://doi.org/10.1109/SCC.2014.121", "year": "2014", "author": {"Guangchang Hu": "144/9390", "Budan Wu": "80/6229", "Hua Zou": "66/3384", "Junliang Chen": "63/6051"}, "abstract": " Abstract:For adapting to the dynamic characteristics of Internet of Things, a dynamic integration mechanism of business process has been proposed. The mechanism realizes redirecting and restructuring of process logic using rules that can be edited at runtime. A dynamic integration algorithm is designed to implement this mechanism. First, the algorithm creates a state transition digraph based on the current rules. Then, it finds a path to meet business objectives according to the current states. Finally, it performs services sequence obtained from the path to complete the business objectives. Our proposed method has a high flexibility, and process logic can easily be redirected according to different requirements."}, "conf/IEEEscc/HuWCC14": {"title": "A Service Migration Mechanism for Web Service Discovery.", "url": "https://doi.org/10.1109/SCC.2014.124", "year": "2014", "author": {"Guangchang Hu": "144/9390", "Budan Wu": "80/6229", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With meeting the demand of the higher recall ratio and precision ratio of service discovery, a service migration mechanism is proposed to achieve efficient service search. In this paper, service migration architecture is proposed for realizing semantic annotation and service migration. And an ontology alignment mechanism is proposed for maintaining the consistency of ontology concepts. In order to realize efficient service discovery, an algorithm based on semantic annotation is proposed. The experiments show that our proposed method solves the search problem of low efficiency based on keyword, and it effectively improves the recall ratio and precision ratio of web service discovery."}, "conf/IEEEscc/WuLWC14": {"title": "Automatic Code Generation for Business Process System Based on Artifact.", "url": "https://doi.org/10.1109/SCC.2014.118", "year": "2014", "author": {"Budan Wu": "80/6229", "Rongheng Lin": "35/3624", "Bao Wang": "40/10304", "Junliang Chen": "63/6051"}, "abstract": " Abstract:New value-added services, generated by business process systems that composes services to fulfill user requirements, provide more powerful and flexible features. In most traditional process-centric business process design methods, developing work is largely devoted to data operating in back end business logic and front UI, while control flow design gives less information than implementing a complete business process that may require a much greater level of detail. It's a big challenge to automate these code generations in business process system development. This paper proposes an automatic code generation approach for web based business process software systems based on artifact-oriented business process application development, which can generate front UI and back end business logic code. The approach is applied to developing a practical heating repair business process software system, and the experimental data verify the advantages the proposed approach brought to us in generating code effectively, saving labor force and avoiding coding mistakes."}, "conf/icde/SunSWY14": {"title": "Modeling data for business processes.", "url": "https://doi.org/10.1109/ICDE.2014.6816722", "year": "2014", "author": {"Yutian Sun": "98/10492", "Jianwen Su": "s/JWSu", "Budan Wu": "80/6229", "Jian Yang 0001": "y/JianYang1"}, "abstract": " Abstract:An important omission in current development practice for business process (or workflow) management systems is modeling of data & access for a business process, including relationship of the process data and the persistent data in the underlying enterprise database(s). This paper develops and studies a new approach to modeling data for business processes: representing data used by a process as a hierarchically structured business entity with (i) keys, local keys, and update constraints, and (ii) a set of data mapping rules defining exact correspondence between entity data values and values in the enterprise database. This paper makes the following technical contributions: (1) A data mapping language is formulated based on path expressions, and shown to coincide with a subclass of the schema mapping language Clio. (2) Two new notions are formulated: Updatability allows each update on a business entity (or database) to be translated to updates on the database (or resp. business entity), a fundamental requirement for process implementation. Isolation reflects that updates by one process execution do not alter data used by another running process. The property provides an important clue in process design. (3) Decision algorithms for updatability and isolation are presented, and they can be easily adapted for data mappings expressed in the subclass of Clio."}, "conf/icws/HuWCC14": {"title": "Component-Based Information Service Platform for Heating Industry.", "url": "https://doi.org/10.1109/ICWS.2014.105", "year": "2014", "author": {"Guangchang Hu": "144/9390", "Budan Wu": "80/6229", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:To solve the problem of low information integration for heating industry, a framework of information service platform is proposed. The framework realizes information sharing and integration control of central heating. Four core components are designed to implement process development, service collaboration, publish/subscribe and event rule. A heating management system has been designed based on these components, which realizes intelligent and security of the production management. And three application subsystems have been developed to realize heating maintenance service, multi-level alarm service and heating charging service. The information service platform effectively achieves information integration and rapid service development."}, "conf/services/LinWZZL14": {"title": "Critical Nodes Detecting in Virtual Networking Environment.", "url": "https://doi.org/10.1109/SERVICES.2014.62", "year": "2014", "author": {"Rongheng Lin": "35/3624", "Budan Wu": "80/6229", "Yao Zhao 0004": "45/2091-4", "Hua Zou": "66/3384", "Li Liu": "33/4528"}, "abstract": " Abstract:As cloud computing goes, How to provide a security cloud becomes an important problem. Virtual networking plays an important role in cloud computing infrastructure. To identify which node is a critical node become an important research question. In this study, our team analyzed the fat tree network and small-world network, and proposed a network modeling method for the virtual networking. On this basis, we analyze time performance and detecting accuracy of the two critical nodes detecting algorithms. One is based on depth-first search, while the other concentricity analysis."}, "conf/IEEEcloud/LinZWZ13": {"title": "An Auto Window Filter Algorithm for Resource Monitoring in Cloud.", "url": "https://doi.org/10.1109/CLOUD.2013.30", "year": "2013", "author": {"Rongheng Lin": "35/3624", "Yao Zhao 0004": "45/2091-4", "Budan Wu": "80/6229", "Hua Zou": "66/3384"}, "abstract": " Abstract:Cloud computing provide computing resource on demand which helps people to make full use of legacy computing asset. Resource provision is transparent to user but not to provider. Computing provider need to aware of resource utilization. How to monitoring resource utilization become an important problem in cloud computing. In this study, we propose a monitoring architecture and a monitoring model. An Auto window filter algorithm is introduced to help reduce the network traffic."}, "conf/IEEEscc/XueWC13": {"title": "lightEPC: A Formal Approach for Modeling Personalized Lightweight Event-Driven Business Process.", "url": "https://doi.org/10.1109/SCC.2013.65", "year": "2013", "author": {"Sida Xue": "130/3123", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:A considerable number of business process modeling approaches are developed for end-users in recent years. The core issue of end-user oriented business process modeling is how to fill the gap between end-user friendly business process model and professional IT process model. In our previous work, a wizard based lightweight event-driven modeling method is designed for end-users to create their own personalized process. We observe that such a process created by end-users often cause execution time errors, which cannot be effectively detected by existing modeling languages. In this paper, we propose a formal model based on extended event-driven process chain (eEPC), which is named lightweight event-driven process chain (lightEPC). We give complete formalization of lightEPC and present two error patterns and corresponding detection algorithms to perform design-time model checking based on this model. These approaches effectively help end-users to create correct business process satisfying their personalized requirements."}, "conf/IEEEscc/WuLC13": {"title": "Integrating RESTful Service into BPEL Business Process on Service Generation System.", "url": "https://doi.org/10.1109/SCC.2013.70", "year": "2013", "author": {"Budan Wu": "80/6229", "Rongheng Lin": "35/3624", "Junliang Chen": "63/6051"}, "abstract": " Abstract:New value-added business, generated by Web service composition in BPEL, provides more powerful and flexible features. SOAP-based web services invoked in BPEL are heavy with redundant information and lower performance. RESTful Web service is brought forward to new value-added business as an alternative solution. However, it's a big challenge to compose RESTful Web services with SOAP-based Web Services in SOA BPEL business processes. BPEL is not designed to use RESTful Web services because these types of services do not use WSDL to describe themselves. This paper proposes a novel approach for integrating RESTful Web services and SOAP-based Web services in business processes described in BPEL. The approach is applied to a practical multimedia conference BPEL process, and the experimental data show the stability of the new RESTful BPEL process with a higher performance."}, "conf/icsoc/XueWC13": {"title": "An End-User Oriented Approach for Business Process Personalization from Multiple Sources.", "url": "https://doi.org/10.1007/978-3-642-37804-1_10", "year": "2013", "author": {"Sida Xue": "130/3123", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": "Current service oriented enterprise business process modeling and development technology is conducted by professional IT department, which cannot fulfill the growing requirements of personalized business application by end users. Recent research works about enterprise mashups enable end users to create own business application by assembling and composing widgets, which emphasizes the front-end interface rather than the logical process of business activities. In this paper, we propose an approach for end users to create personalized business process from multiple sources. An integrated framework for modeling, monitoring personalized business process and automated execution is designed. Internal business processes, external web APIs and communication services are all wrapped into this framework for end users to select and compose in a lightweight event-driven fashion. We also design a wizard-based development workspace helping end users without programming skills to build lightweight business application. In addition, an actual business project case is presented to show how our approach is used practically in an enterprise environment.Keywordsbusiness processespersonalizationlightweight service compositionend-user development"}, "conf/icsoc/HuWC13": {"title": "Dynamic Adaptation of Business Process Based on Context Changes: A Rule-Oriented Approach.", "url": "https://doi.org/10.1007/978-3-319-06859-6_43", "year": "2013", "author": {"Guangchang Hu": "144/9390", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": "In a dynamic environment, business process needs to be adjusted and evolved in response to the changeable internal policies and external environment. However, it is a time-consuming and laborious way by redesigning process model and executing the process instance. In this paper, we propose a rule-oriented approach to dynamically generate business process according to the current context at runtime. To enable dynamic and context-aware adaptation, the relationship between services and context is described as rules, which are then used to generate the solution with a mapping mechanism. Two algorithms are designed to generate the activity sequence at runtime, which is the solution of process adaptation. In order to achieve the preference selection, a process assessment strategy has been proposed to constrain the generated activity sequence. Simulation experiments have been conducted to demonstrate the efficiency of our approach.KeywordsBPMadaptationdynamic assemblyservice compositioncontext- aware"}, "conf/ACISicis/WangWC12": {"title": "A Solution to Extending Dynamic Web Project Wizard.", "url": "https://doi.org/10.1109/ICIS.2012.18", "year": "2012", "author": {"Rong Wang": "66/4610", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Java Business Process Management (JBPM) is a popular open source Java workflow platform. Eclipse is used as the platform to host the jBPM Process Definition Language (jPDL) graphical process designer. JBPM provides an Eclipse plug in called Graphical Process Designer(GPD) to create and edit the jPDL source file. But a developer cannot create a comprehensive JBPM project that include both jBPM configuration source files and Web project files related to the workflow. This paper proposes a model to resolve Web Tools Platform(WTP) Wizard extending problems in JBPM. With this model, extending Dynamic Web Project Wizard is possible and can provide a JBPM Project Wizard. A JBPM developer can create a JBPM project including jBPM configuration source files and Web project files by following the JBPM Project Wizard. The wizard will save developers a lot of time. This paper shows the details of the model. An example is illustrated to explain the complicated aspects about WTP, meantime, we summarize the details that should be taken care of."}, "conf/ACISicis/FangWC12": {"title": "Service Management Model Based on Ontology.", "url": "https://doi.org/10.1109/ICIS.2012.98", "year": "2012", "author": {"Lili Fang": "44/11521", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:The widespread use of SOA (Service-oriented architecture) is making Web services, which now is used more frequently to manage interfaces and resources, more popular. The new value-added services, generated by Web service composition, provide more powerful and flexible features. It's a big challenge to manage these increasing services efficiently for providing a convenient developing environment, which could allow developers to find desired services quickly and accurately. This paper proposes a novel approach to service management by using semantic annotation and classification based on ontology. An efficient service management platform is implemented by analyzing the semantic information among services."}, "conf/IEEEscc/ShiZCCQW12": {"title": "Summary Instance: Scalable Event Priority Determination Engine for Large Scale Distributed Event-Based System.", "url": "https://doi.org/10.1109/SCC.2012.44", "year": "2012", "author": {"Ruisheng Shi": "118/4779", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051", "Bo Cheng 0001": "05/2700-1", "Xiuquan Qiao": "66/4187", "Budan Wu": "80/6229"}, "abstract": " Abstract:With the advent of ubiquitous sensor-rich environments and location-based services, distributed event-based systems based on the publish/subscribe communication paradigm are becoming very important and crucial. In many large-scale distributed mission critical areas, publish/subscribe systems must support a large number of geographically distributed publishers and subscribers and ensure real-time event data to be delivered timely. The concern is that a large number of low priority events may clog the channel thereby causing high priority events to get delayed. The challenge raised for the event-based middleware in large-scale distributed system is that event priority determination engine must be efficient and scalable in term of priority rule size and event throughputs. Checking every rule for priority on-the-fly is not friendly to the cache. This paper proposed an innovative approach based on Bloom filter technique. This approach is cache friendly and the online computation time of event priority determination is independent of the rule size. This approach is based on two ideas: make the online queries as simple as possible and exploit the power of cache on the broker. The rule instantiation engine (RIE) is made offline while online part is the priority determination engine (PDE). A Bloom filter data structure is used by RIE to store the rule instances and their priorities. The complex rule evaluation is reduced to set membership testing as queries on Bloom filters. The PDE makes the querying simplified by event discretization. Results are then cached in the broker caches. Finally, we have an analysis on the system complexity and some open issues. The further evaluation with prototype experiments are under development and the results may be found in our later publication."}, "conf/IEEEscc/WuC12": {"title": "A Semantic Extended Multi-layer Model for BPEL Process Generation.", "url": "https://doi.org/10.1109/SCC.2012.102", "year": "2012", "author": {"Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:BPEL is a popular standard language in SOA enterprise for specifying business process. A developer has to use specific programming technologies to construct process structure and specify Web services inputs and outputs in the process. It is time-consuming to specify every business process from low-level Web services. This paper proposes a semantic extended BPEL model for SOA process generation, and implements the model in a practical BPEL IDE. The new BPEL IDE supports efficient visual design of SOA processes, and helps developers focus more on business logic. A real multimedia conference SOA application is given to demonstrate the efficiency of SOA process generation with semantic extended BPEL model on the new BPEL IDE. And a Load Runner evaluation is given to validate the efficient BPEL process generation has no negative effect on execution efficiency of the generated BPEL code."}, "conf/icws/ChengQWWSC12": {"title": "RESTful Web Service Mashup Based Coal Mine Safety Monitoring and Control Automation with Wireless Sensor Network.", "url": "https://doi.org/10.1109/ICWS.2012.106", "year": "2012", "author": {"Bo Cheng 0001": "05/2700-1", "Xiuquan Qiao": "66/4187", "Budan Wu": "80/6229", "Xiaokun Wu 0002": "89/9924-2", "Ruisheng Shi": "118/4779", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Due to complex environment of the coal mine, it's necessary to monitor the information of underground environment, device and miner instantly in order to ensure the safety of coal mine production. However, the exiting coal mine can not meet the requirements of coverage without blind spots as it is developed by the wired network. This paper proposes a RESTful Web services mashup augmented coal mine safety monitoring and control automation using ZigBee wireless sensor network, which can collect the underground temperature, humidity methane values and personal position through sensor nodes in the coal mine, and also collects the personnel position information inside the mine, and then implement a RESTful Application Programming Interface (API) on sensor nodes to provide access to sensors and actuators, allowing for them to be easily combined with other enterprise information resources based on the success of mashup applications. We also illustrated three different of scenarios for RESTful Web service mashups representing for coal mine safety monitoring and control automation. Finally, we give the conclusions."}, "conf/services/WuLZ12": {"title": "SNS Based Web Caching Algorithm for PaaS SNS Hosting.", "url": "https://doi.org/10.1109/SERVICES.2012.50", "year": "2012", "author": {"Budan Wu": "80/6229", "Rongheng Lin": "35/3624", "Hua Zou": "66/3384"}, "abstract": " Abstract:Web2.0 and Cloud Computing are two hot topics in current internet research. PaaS (Platform as a Service) hosts the users' service in an elasticity way and provides the load balance support, but there is not optimizing in load balance for web2.0 application, especially for SNS like website. Load balance optimizing can be divided in two aspects: web cache optimizing and load balance strategy designing. We propose a PUR-SNS (prediction on user requests for social networking services) algorithm for web cache optimizing, which organize web cache based on the social relations. Simulation shows that PUR-SNS can improve caching hit ratio in SNS like environment."}, "conf/IEEEscc/WuC11": {"title": "An Ontology Based Service Creation Process.", "url": "https://doi.org/10.1109/SCC.2011.61", "year": "2011", "author": {"Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Service creation specifies and generates the model of a SOA application, which drives the subsequent activities in the SOA development lifecycle. Contemporary service creation is mostly done manually. Ontology technology can enhance the degree of automation and semantics of service creation, however, most works on ontology focus on ontology usage in fields other than software service development. This paper proposes an ontology based service creation process framework to apply ontology really for software service development. An ontology system that facilitates reuse in service creation process was designed, a four-phase service creation process was proposed, and a shipping case was carried out on our service creation tool to show the increasing service reuse rate under the ontology based service creation process framework."}, "conf/apscc/YangWYYC11": {"title": "A Three-Step Service Experience Approach with Feedback for Service Provider.", "url": "https://doi.org/10.1109/APSCC.2011.47", "year": "2011", "author": {"Zhi Yang": "90/5587", "Budan Wu": "80/6229", "Nan Yu": "42/6220", "Gang Yu": "75/1683", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Web Service is one of implementation modes of distributed systems and is becoming the next generation web-based application. As the amount of Web services is increasing, service experience problem is emerging. After Web services are implemented and published, service providers do not know their running effect and user satisfactory degree. So in order to provide better services and improve user experience quality, this paper proposes a three-step service experience approach with feedback to service accessing, in which service experience coefficient is used to measure the running effect of service and user satisfaction degree. At the same time, the test data of the feedback are sent to service providers to create new services or improve services in order to provide better services. With the data of the web site WS-DREAM, the service experience approach to service accessing is designed and implemented. The result indicates that the approach is useful to improve better services."}, "conf/emeit/WangWC11a": {"title": "A research on optimization algorithm for BPEL process based on synchronization and concurrency analysis.", "url": "https://doi.org/10.1109/EMEIT.2011.6023739", "year": "2011", "author": {"Qiwei Wang": "58/10186", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Business Process Execution Language(BPEL) is widely used in service composition and orchestration. However, sometimes it is time-consuming to handle several sequences executing concurrently. This paper proposes an optimization algorithm for BPEL process, which is based on synchronization and concurrency analysis. Our approach first scans and reconstructs all the synchronization structures based on a synchronization analysis, following with construction of data dependence and control dependence, representing in process dependence graph. By decreasing quantity of sequences and increasing concurrency degree, an algorithm is proposed to enhance efficiency of a given process. At the end of this paper, a BPEL process instance shows the algorithm validity."}, "conf/services/YangWC11": {"title": "A Measure Standard for Ontology-Based Service Recommendation.", "url": "https://doi.org/10.1109/SERVICES.2011.39", "year": "2011", "author": {"Zhi Yang": "90/5587", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Web Service is becoming the next generation of web-based application. With enhancement of quality of services and increasing quantity of services, how to recommend the suitable services according to personalized requirement becomes an urgent question. In the existing approaches of service recommendation, the result of service recommendation is the service list in which there is no evaluation standard that we can use to distinguish services with high relevancy and low relevancy. So in real-world, the user may obtain low relative services. To address the problem, in this paper, membership function is analyzed and recommendation measure standard is proposed. With dynamic programming theory, an ontology based approach of service recommendation is provided. In the result of service recommendation, membership as measure index is used to divide high relative services, medium relative services and low relative services. High relative services are recommended to the user. So the recommended services are accurate and available."}, "conf/services/YangCW10": {"title": "A New Ontology-Based Service Matching Algorithm.", "url": "https://doi.org/10.1109/SERVICES.2010.101", "year": "2010", "author": {"Zhi Yang": "90/5587", "Junliang Chen": "63/6051", "Budan Wu": "80/6229"}, "abstract": " Abstract:Service discovery is the process of finding suitable services and selecting the best alternative for a given task, and service matching algorithm is the kernel technology of the step. Nowadays there are no quantity index of service Query Complete Rate (QCR) and Query Accuracy Rate (QAR), and the efficiency of service matching is low. This paper defines QCR and QAR, and provides a new ontology-based service matching algorithm that uses the theory of query rewriting from key-words to ontology to select suitable services."}, "conf/compsac/WuJ08": {"title": "Service-Oriented Modeling: An Extensive Reuse Method.", "url": "https://doi.org/10.1109/COMPSAC.2008.30", "year": "2008", "author": {"Budan Wu": "80/6229", "Zhi Jin": "22/3510"}, "abstract": " Abstract:Service-oriented modeling is defined as a comprehensive practice encompassing analysis, design and architecture of all organizational software entities. Currently, service-oriented modeling receives more attention in SOA project lifecycle, since SOA application is model-driven and can be fast developed after modeling. However, existing service-oriented modeling approaches reuse only service which is considered to be building blocks of cross-domain applications. This usually falls into the field of OO analysis, just using service to realize function at design and implementation phase, which disobeys the soul of SOA that fast developing roots in extensive reuse. This paper proposes a domain-specific hierarchical ontology system supporting reuse of various service-oriented assets, such as application template, collaboration pattern, workflow and service. The paper also presents a service-oriented modeling process based on the ontology, which accelerates SOA application developing by searching and reusing assets from the first to last modeling phase, instead of starting everything from scratch."}, "conf/icws/WuJZ08": {"title": "A Modeling Approach for Service-Oriented Application Based on Extensive Reuse.", "url": "https://doi.org/10.1109/ICWS.2008.95", "year": "2008", "author": {"Budan Wu": "80/6229", "Zhi Jin": "22/3510", "Bin Zhao": "73/4325"}, "abstract": " Abstract:This paper proposes an extensive reuse approach for SOM, which utilizes a multi-facets ontology system supporting reuse of various service-oriented assets, such as business processes, collaboration templates and services. The paper also presents an iterative service-oriented modeling process based on the ontology and assets repository, which reuses assets from the first to last modeling phase by matching between assets descriptions, and results in a service model that represents the specification of the required service-oriented application."}, "conf/icebe/WuJ07": {"title": "Service-Oriented Modeling: An Ontology-based Approach.", "url": "https://doi.org/10.1109/ICEBE.2007.85", "year": "2007", "author": {"Budan Wu": "80/6229", "Zhi Jin": "22/3510"}, "abstract": " Abstract:Service-oriented computing has been obtaining more and more attention recently. Current works mainly concentrate on the service products and the standards to realize service-oriented computing. An important unaddressed problem is service-oriented modeling that is one of the fundamental elements you need to support SOA. This paper proposes an ontology-based approach for service-oriented modeling. This approach introduces hierarchical ontology systems in specific domain, which not only facilitate service reuse, but also facilitate reuse of application templates, collaboration patterns and workflows. This paper also presents an iterative process for service-oriented modeling."}, "conf/icebe/TsaiJWW07": {"title": "Requirement Engineering in Service-Oriented System Engineering.", "url": "https://doi.org/10.1109/ICEBE.2007.116", "year": "2007", "author": {"Wei-Tek Tsai": "87/3960", "Zhi Jin": "22/3510", "Puwei Wang": "27/3001", "Budan Wu": "80/6229"}, "abstract": " Abstract:Service-oriented computing has received significant attentions recently, and many applications are being developed using this approach. Thus there is a need to analyze system requirements. This paper examines issues related to service-oriented requirement engineering (SORE). SORE focuses on modeling, specifying, and analyzing application requirements for software that will be developed in a service-oriented manner running in an SOA infrastructure. This paper also presents key features of SORE and some technical challenges."}, "conf/webist/WuJ07": {"title": "Web Service Retrieval based on Environment Ontology.", "url": "", "year": "2007", "author": {"Budan Wu": "80/6229", "Zhi Jin": "22/3510"}, "abstract": ""}, "conf/icebe/HouJW05": {"title": "FECT: A Framework for Automatic Composition ofWeb Services.", "url": "https://doi.org/10.1109/ICEBE.2005.67", "year": "2005", "author": {"Lishan Hou": "77/1769", "Zhi Jin": "22/3510", "Budan Wu": "80/6229"}, "abstract": " Abstract:In this paper, we introduce FECT, a implemented prototype framework to support the publication, selection and composition of Web services on the basis of environment ontology and behavior trace. And a case of Web sale is presented to demonstrate FECT"}, "journals/eis/LinPYWY20": {"title": "A voted based random forests algorithm for smart grid distribution network faults prediction.", "url": "https://doi.org/10.1080/17517575.2019.1600724", "year": "2020", "author": {"Rongheng Lin": "35/3624", "Zixiang Pei": "263/3228", "Zezhou Ye": "210/3894", "Budan Wu": "80/6229", "Geng Yang": "97/3523"}, "abstract": ""}, "journals/fgcs/WuLLC20": {"title": "A distributed business process fragmentation method based on community discovery.", "url": "https://doi.org/10.1016/j.future.2020.02.046", "year": "2020", "author": {"Budan Wu": "80/6229", "Ran Liu": "65/2726", "Rongheng Lin": "35/3624", "Junliang Chen": "63/6051"}, "abstract": "For deploying a traditional centralized business process to distributed systems, how to properly partition the process is a key issue. If closely related sub-process fragments are assigned into many different servers, the frequent interactions of the sub-processes will result in large server communication costs. However, most of the current works in business process fragmentation focus on optimizing load balancing to achieve high execution performance, without considering the intrinsic functional aggregation of partitioned sub-processes. This paper proposes a novel distributed business process fragmentation method based on community discovery, which aggregates functional related process partitions together to optimize server communication costs during business process execution. An advanced fuzzy models (AFM) and control-data flow model which are more suitable for community discovery are presented. And the community-based process fragmentation algorithm (CPFA) is developed to get an optimized business process distributed deployment schema, reducing communications between servers and data access communication costs. We evaluate our method with BPI dataset, and demonstrate that it significantly reduces communication costs between servers for process execution efficiency while also maintain good server resource load balancing."}, "journals/tii/JiangLYW18": {"title": "A Fused Load Curve Clustering Algorithm Based on Wavelet Transform.", "url": "https://doi.org/10.1109/TII.2017.2769450", "year": "2018", "author": {"Zigui Jiang": "185/1448", "Rongheng Lin": "35/3624", "Fangchun Yang": "06/5366", "Budan Wu": "80/6229"}, "abstract": " Abstract:The electricity load data recorded by smart meters contain plenty of knowledge that contributes to obtaining load patterns and consumer categories. Generally, the daily load curves are clustered first in order to obtain load patterns of each consumer. However, due to the volume and high dimensions of load curves, existing clustering algorithms are not appropriate in this situation. Thus, a fused load curve clustering algorithm based on wavelet transform (FCCWT) is proposed to solve this problem. The algorithm includes two main phases. First, FCCWT applies multilevel discrete wavelet transform (DWT) to convert the daily load curves for dimensionality reduction. Second, it detects clusters at two outputs of the first phase, and then fuses two groups of clusters with a sub-algorithm named cluster fusion to achieve the optimized clusters. FCCWT is implemented on datasets of both China and United States. Their clustering performances are evaluated by diverse validity indices comparing with four typical clustering methods. The experimental results show that FCCWT outperforms other comparison methods. Additionally, case analysis of two datasets are also provided to discuss the significance of load patterns."}, "journals/jss/LiGHHWHL17": {"title": "Software cybernetics in BPM: Modeling software behavior as feedback for evolution by a novel discovery method based on augmented event logs.", "url": "https://doi.org/10.1016/j.jss.2016.03.013", "year": "2017", "author": {"Chuanyi Li": "142/1532", "Jidong Ge": "128/5781", "Liguo Huang": "28/3956", "Haiyang Hu": "65/6717", "Budan Wu": "80/6229", "Hao Hu 0001": "67/6924-1", "Bin Luo 0003": "36/4256-3"}, "abstract": "Business Process Management (BPM) is a quickly developing management theory in recent years. The goal of BPM is to improve corporate performance by managing and optimizing the businesses process in and among enterprises. The goal is easier to achieve with the closed-loop feedback mechanism from business process execution to redesign in BPM life cycle, where the business process itself and the set of activities in BPM are viewed as a controlled object and a controller respectively. In this feedback control system, process mining plays an important role in generating feedback of process execution for redesign. However, the existing discovery methods cannot mine certain special structures from execution logs (e.g., implicit dependency, implicit place and short loops) correctly and their mining efficiencies cannot meet the requirements of online process mining. In this paper, we propose a novel discovery method to overcome these challenges based on a kind of augmented event log that will also bring new research directions for process discovery. A case study is presented for introducing how the mined model can be used in business process evolution. Results of experiments are described to show the improvements of the proposed algorithm compared with others."}, "journals/isci/LiGHHWYHL16": {"title": "Process mining with token carried data.", "url": "https://doi.org/10.1016/j.ins.2015.08.050", "year": "2016", "author": {"Chuanyi Li": "142/1532", "Jidong Ge": "128/5781", "Liguo Huang": "28/3956", "Haiyang Hu": "65/6717", "Budan Wu": "80/6229", "Hongji Yang": "78/4510", "Hao Hu 0001": "67/6924-1", "Bin Luo 0003": "36/4256-3"}, "abstract": "Process mining is to discover, monitor and improve real processes by extracting the knowledge from logs which are available in today's information systems. The existing process mining algorithms are based on the event logs where only the executions of tasks are recorded. In order to reduce the pre-processing efforts and strengthen the mining ability of the existing process mining algorithms, we have proposed a novel perspective to employ the data carried by tokens recorded in token log which tracks the changes of process resources for process mining in this study. The feasibility of the token logs is proved and the results of pairwise t-tests show that there is no big difference between the efforts that are taken by the same workflow system to generate the token log and the event log. Besides, a process mining algorithm () based on the new log is proposed in this paper. With algorithm , the mining efficiency as well as the mining capability is improved compared to the traditional event-log-based mining algorithms. We have also developed three plug-ins on top of the existing workflow engine, process modeling and mining platforms (YAWL, PIPE and ProM) for proving the feasibility of token log and realizing the token log generation and algorithm ."}, "journals/jwsr/QiaoWLXC14": {"title": "Event-Driven SOA Based District Heating Service System with Complex Event Processing Capability.", "url": "https://doi.org/10.4018/ijwsr.2014010101", "year": "2014", "author": {"Xiuquan Qiao": "66/4187", "Budan Wu": "80/6229", "Yunlong Liu": "32/306", "Zhao Xue": "149/3127", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/wpc/WuSCWC14": {"title": "Loss Tolerant Bandwidth Aggregation for Multihomed Video Streaming over Heterogeneous Wireless Networks.", "url": "https://doi.org/10.1007/s11277-013-1422-3", "year": "2014", "author": {"Jiyan Wu": "139/5744", "Yanlei Shang": "59/4425", "Bo Cheng 0001": "05/2700-1", "Budan Wu": "80/6229", "Junliang Chen": "63/6051"}, "abstract": "Bandwidth aggregation is a key research issue in integrating heterogeneous wireless networks, since it can substantially increase the throughput and reliability for enhancing streaming video quality. However, the burst loss in the unreliable wireless channels is a severely challenging problem which significantly degrades the effectiveness of bandwidth aggregation. Previous studies mainly address the critical problem by reactively increasing the forward error correction (FEC) redundancy. In this paper, we propose a loss tolerant bandwidth aggregation approach (LTBA), which proactively leverages the channel diversity in heterogeneous wireless networks to overcome the burst loss. First, we allocate the FEC packets according to the loss-free bandwidth of each wireless network to the multihomed client. Second, we deliberately insert intervals between the FEC packets departures while still respecting the delay constraint. The proposed LTBA is able to reduce the consecutive packet loss under burst loss assumption. We carry out analysis to prove that the proposed LTBA outperforms the existing back-to-back transmission schemes based on Gilbert loss model and continuous time Markov chain. We conduct the performance evaluation in Exata and emulation results show that LTBA outperforms the existing approaches in improving the video quality in terms of PSNR (Peak Signal-to-Noise Ratio)."}, "journals/spe/TsaiWJ0L13": {"title": "Ontology patterns for service-oriented software development.", "url": "https://doi.org/10.1002/spe.1132", "year": "2013", "author": {"Wei-Tek Tsai": "87/3960", "Budan Wu": "80/6229", "Zhi Jin": "22/3510", "Yu Huang 0008": "39/6301-8", "Wu Li": "84/3238"}, "abstract": ""}, "journals/jsw/YangWCG11": {"title": "Maximum Portfolio: A Query Condition Optimization Method.", "url": "https://doi.org/10.4304/jsw.6.12.2486-2494", "year": "2011", "author": {"Zhi Yang": "90/5587", "Budan Wu": "80/6229", "Junliang Chen": "63/6051", "Pingli Gu": "15/8405"}, "abstract": ""}, "journals/jwsr/WangJLW10": {"title": "Specifying and Composing Web Services with an Environment Ontology-Based Approach.", "url": "https://doi.org/10.4018/jwsr.2010070104", "year": "2010", "author": {"Puwei Wang": "27/3001", "Zhi Jin": "22/3510", "Lin Liu 0001": "61/2115-1", "Budan Wu": "80/6229"}, "abstract": ""}, "journals/chinaf/HouJW06": {"title": "Modeling and verifying Web services driven by requirements: An ontology-based approach.", "url": "https://doi.org/10.1007/s11432-006-2031-5", "year": "2006", "author": {"Lishan Hou": "77/1769", "Zhi Jin": "22/3510", "Budan Wu": "80/6229"}, "abstract": "Automatic discovery and composition of Web services is an important research area in Web service technology, in which the specification of Web services is a key issue. This paper presents a Web service capability description framework based on the environment ontology. This framework depicts Web services capability in two aspects: the operable environment and the environment changes resulting from behaviors of the Web service. On the basis of the framework, a requirement-driven Web service composition model has been constructed. This paper brings forward the formalization of Web service interactions with  calculus. And an automatic mechanism converting conceptual capability description to the formal process expression has been built. This kind of formal specification assists in verifying whether the composite Web service model matches the requirement."}}}