{"id": "51/4906", "name": "Changqiao Xu", "Article": {"conf/icc/MaXAKZG22": {"title": "A Proactive Defense Strategy Against SGX Side-channel Attacks via self-checking DRL in the Cloud.", "url": "https://doi.org/10.1109/ICC45855.2022.9838400", "year": "2022", "author": {"Tengchao Ma": "245/4704", "Changqiao Xu": "51/4906", "Qingzhao An": "326/7818", "Xiaohui Kuang": "18/1267", "Lujie Zhong": "124/8701", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:Intel software guard extensions (SGX) technology allows cloud vendors to provide customers with an independent and trusted execution environment (TEE). It protects critical data confidentiality and integrity from malicious software. However, more and more SGX side-channel attacks have appeared, which seriously undermine the confidence of tenants in cloud security. The related research focuses on system hardware and SGX compiler solutions for specific attacks, which also has difficulties in deployment. Differently, we propose an intelligent-driven proactive defense strategy, which is based on live migration. To the best of our knowledge, this is the first proactive defense against SGX side-channel attacks. We adopt the Markov decision process to solve the migration programming problem. The innovative deep reinforcement learning (DRL) solves problems of the unknown state transition probability and large machine load states, which is called self-checking proximal policy optimization (SPPO). It changes the reward pattern, improving the convergence speed and stability of DRL. In prototype experiments, we deploy the strategy in the OpenStack platform agilely to prove the defense performance and low virtual machine costs."}, "conf/icmcs/WangPC0XX22": {"title": "CoLive: An Edge-Assisted Online Learning Framework for Viewport Prediction in 360° Live Streaming.", "url": "https://doi.org/10.1109/ICME52920.2022.9859963", "year": "2022", "author": {"Mu Wang": "94/4375", "Shuai Peng": "115/6470", "Xingyan Chen": "211/5842", "Yu Zhao 0019": "57/2056-19", "Mingwei Xu": "18/6055", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:The ever-increasing demand for bandwidth resources when delivering premium quality 360° video challenges the current network capacity. To alleviate such bandwidth pressure, it is imperative to predict the viewport via observing the content visual feature and historical viewing behaviors, which thereby allows the system to concentrate the limited resource on viewer's region of interest in 360° content. However, enabling accurate viewport prediction for 360° live streaming is non-trivial given the time-sensitive of live content and shortage of pre-knowledge on the visual features and viewing behaviors. In this paper, we propose CoLive, an edge-assisted online viewport prediction framework. CoLive incorporates edge computing to offload the prediction model training from viewers and migrates the saliency feature detection to the server side for reducing the processing delay. Viewers can also collaboratively train a central predicting model via sharing their loss gradients. This central model, together with the saliency feature detection, further prompts accuracy prediction and learning acceleration, especially for new incoming viewers. A series of experiments on the public 360° video dataset show how our solution achieves better performance compared with state-of-the-art solutions."}, "conf/iwcmc/JiaXWFCY22": {"title": "Measuring Decentralization in Emerging Public Blockchains.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9825341", "year": "2022", "author": {"Yongpu Jia": "310/0305", "Changqiao Xu": "51/4906", "Zhonghui Wu": "279/4587", "Zichen Feng": "309/9987", "Yaxin Chen": "96/8538", "Shujie Yang": "78/10624"}, "abstract": " Abstract:Bitcoin and Ethereum have always been the two major heavyweight infrastructures in the blockchain space. However, Low throughput and high cost hinder their further development. Recently, some emerging public blockchains have become popular. They all have efficient transaction confirmation mechanism and cheap interaction costs. However, the advantages are actually a sacrifice of decentralization. As we all know, decentralization is an essential feature of blockchain. Therefore, it requires the conceiving of up-to-date metrics of decentralization measurement. However, there is little research on the degree of decentralization of these emerging public blockchains in the past. This paper studies nine popular public chains such as Binance Smart Chain, Cardano, and Avalanche. Since these public chains mostly use the consensus mechanism of POS variants, the distribution of governance token balances on the chain can reflect the decentralization of the blockchain. Hence, We evaluate the distribution of the token balance of those public blockchains to indicate their decentralization degree. Two kinds of indicators are adopted and redesigned: information entropy and Gini coefficients. Among the nine public blockchains we selected, Cardano, Tron and Polkadot have a higher degree of decentralization, while Elrond and Binance Smart Chain have a lower degree of decentralization. We think our work will be helpful for future research on the degree of blockchain decentralization."}, "conf/iwcmc/JiYZZLX22": {"title": "Multi-Domain Multicast Routing Mutation Scheme for Resisting DDoS attacks.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9824529", "year": "2022", "author": {"Weixiao Ji": "141/4730", "Shujie Yang": "78/10624", "Bingchi Zhang": "271/5375", "Tao Zhang": "15/4777", "Yibo Lian": "325/0332", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Network performance of multicast transmissions such as bandwidth, utilization and delay is very important to improve the quality of user experience and the above constraints have to be considered. Most of the current multicast protocol infrastructures use static routes, however, static routing policies provide potential convenience for attackers who can perform network sniffing or initiate DoS attacks. We propose a multi-constraint multicast routing mutation mechanism to enable dynamic changes in multicast routing while satisfying certain quality of service to achieve proactive multicast routing defense, which increases the attacker's attack cost and reduces the defender's defense overhead. In addition, for the high time complexity of the multicast tree generation algorithm, we propose a multi-controller multicast routing algorithm with multi-domains. We perform simulations and show that the defense performance of multicast routing is significantly improved after adopting this mechanism."}, "conf/iwcmc/WangWZYX22": {"title": "CMT-MQ: Multi-QoS Aware Adaptive Concurrent Multipath Transfer With Reinforcement Learning.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9824120", "year": "2022", "author": {"Deguang Wang": "59/10364", "Mingze Wang": "296/7556", "Tao Zhang": "15/4777", "Shujie Yang": "78/10624", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Concurrent multipath transfer(CMT) can make better use of network resources to increase the data transmission rate. However, there are heterogeneous paths in the real network, the existing scheduling strategy is fixed and does not have self-adaptation, there are still some problems with delay and throughput performance, which reduces the reliability of transmission. Therefore, we propose a novel CMT scheduling strategy based on multi-QoS (CMT-MQ). Combined with reinforcement learning (RL), scheduling strategies are generated according to service QoS requirements and path characteristics. At the same time, in order to reduce the action space of RL and eliminate poor paths, clustering algorithm is introduced to filter the set of paths before training. Finally, the simulation comparison experiment on OmNET++ shows that CMT-MQ has higher throughput and lower message delay."}, "conf/globecom/0001XWMY21": {"title": "Augmented Dual-Shuffle-based Moving Target Defense to Ensure CIA-triad in Federated Learning.", "url": "https://doi.org/10.1109/GLOBECOM46510.2021.9685154", "year": "2021", "author": {"Zan Zhou 0001": "203/3329", "Changqiao Xu": "51/4906", "Ming-Ze Wang": "251/4117", "Tengchao Ma": "245/4704", "Shui Yu": "90/3575"}, "abstract": " Abstract:In today's “Internet of Everything (IoE)” era, the collaboration from massive participants significantly boosts the performance and efficiency of model training. This trend also un-avoidably stirs up considerable concerns about multi-dimensional security problems. Under the circumstances, federated learning (FL) is enthusiastically adopted, as it protects privacy to a certain extent by only processing personal data locally. Nevertheless, FL's characteristics of concealment also pave the way for sev-eral emerging attacks during the training process, i.e., model inversion, poisoning, and backdoor. Currently, although partially mitigating attack effects, existing countermeasures against those threats are studied separately and orthogonal. This separation makes those defense methods mutually exclusive and restrictive in real-world application scenarios, far from satisfying. In this paper, we extensively model different attack paradigms into three types based on CIA-triad, the well-known information security primitive, and propose a novel dual-shuffle method to thwart aforementioned threats jointly. Concretely speaking, our primary model shuffling mechanism provides the confidentiality guarantee based on the information-theoretic notion of identifiability; then, an augmented client shuffling mechanism purges the user group of adversaries proactively without any compromise of anonymous constraints. By conducting a series of experiments on bench-mark datasets, we demonstrate that our method could achieve significant security and convergence performance against three state-of-the-art attacks."}, "conf/globecom/XiaoXMYZM21": {"title": "Edge Computing-Assisted Multimedia Service Energy Optimization based on Deep Reinforcement Learning.", "url": "https://doi.org/10.1109/GLOBECOM46510.2021.9685687", "year": "2021", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Yunxiao Ma": "46/1709", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:With the development of communication technology, emerging multimedia (e.g. virtual reality) can provide users with more immersive service experience. However, due to the ultra-high rendering and splicing requirements of multimedia content, the higher demand for computing resources is put forward for the playback device. The anomalies of energy consumption and latency caused by such computationally intensive tasks hinder the practical application of emerging multimedia technology in mobile networks. In this regard, this paper proposes an edge computing assisted multimedia service optimization scheme (ECMSO) to broaden the computing capacity of the viewer(i.e. requester), so as to ensure that content can be served in time and reduce the energy cost of computation from the perspective of executor and requester, respectively. First, a computational offloading scheme based on deep reinforcement learning is designed. It optimizes intelligently the energy consumption while meeting the latency requirements of the requester. Secondly, a heuristic algorithm to allocate power, bandwidth, and computing resources for candidate executors is proposed. Finally, a series of simulation experiments are conducted to demonstrate the effectiveness of our proposed scheme."}, "conf/globecom/ZhangXM21": {"title": "A Novel Distributed Data Backup and Recovery Method for Software Defined-WAN Controllers.", "url": "https://doi.org/10.1109/GLOBECOM46510.2021.9685291", "year": "2021", "author": {"Yi Zhang": "64/6544", "Changqiao Xu": "51/4906", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Software-defined wide area network (SD-WAN) is a new type of network architecture that has developed rapidly in recent years. SD-WAN inherits the centralized control ar-chitecture of Software-defined networking (SDN), but supports more diverse access methods and equipment types and covers a wider area. It is also associated with greater uncertainty in the network environment. These characteristics make the fault management of the SD-WAN controller more challenging, so that the existing SDN-based data backup methods cannot adapt to SD-WAN scenarios. This paper proposes an SD-WAN-oriented Distributed Data Backup and Recovery method (DDBR) based on an improved secret sharing algorithm. To deploy this method, we design an online-offline dual backup framework based on the data freshness requirements of the controller. Under this framework, dynamic data of the controller is divided into different shares, and then stored into the storage of switches. When the controller fails, data recovery can be performed on the backup controller quickly, which greatly improves the network availability. The outstanding feature of the proposed DDBR method is that it ensures the integrity and confidentiality of the backup data in an unreliable network environment, even when some of the storage nodes fail. Evaluation results on file backup example show that the proposed solution has significant advantages over existing methods in terms of backup data storage size and backup success rate."}, "conf/icc/MaXCXZM21": {"title": "Fairness-Guaranteed Transcoding Task Assignment for Viewer-Assisted Crowdsourced Livecast Services.", "url": "https://doi.org/10.1109/ICC42927.2021.9500257", "year": "2021", "author": {"Yunxiao Ma": "46/1709", "Changqiao Xu": "51/4906", "Xingyan Chen": "211/5842", "Han Xiao": "98/627", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Recent years have witnessed an outstanding increase in popularity of Crowdsourced Livecast Services (CLS), which is the latest trend in social media. In CLS, transcoding enormous video contents from massive broadcasters and providing high-quality CLS for global viewers with heterogeneous devices are computation-intensive as well as time-consuming. There are some schemes that design viewer-assisted transcoding scheme, but it is challenging to achieve an efficient and fair task assignment due to the dynamic of computing and communication resources. This paper introduces a viewer-assisted CLS framework and focuses on proposing an innovative fairness-guaranteed task assignment scheme, which is a key challenge in this context. Considering the dynamic nature of viewers’ computing and communication resources and stability, a dynamic programming problem with fairness and QoS constraints is formulated. To solve the problem, we devise a Fair Bandit (FB) algorithm based on the Combinatorial Multi-Armed Bandit (CMAB). Finally, the effectiveness of proposed scheme is demonstrated by trace-driven simulations."}, "conf/infocom/ChenXWWYZM21": {"title": "A Universal Transcoding and Transmission Method for Livecast with Networked Multi-Agent Reinforcement Learning.", "url": "https://doi.org/10.1109/INFOCOM42981.2021.9488868", "year": "2021", "author": {"Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Zhonghui Wu": "279/4587", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Intensive video transcoding and data transmission are the most crucial tasks for large-scale Crowd-sourced Livecast Services (CLS). However, there exists no versatile model for joint optimization of computing resources (e.g., CPU) and transmission resources (e.g., bandwidth) in CLS systems, making maintaining the balance between saving resources and improving user viewing experience very challenging. In this paper, we first propose a novel universal model, called Augmented Graph Model (AGM), which converts the above joint optimization into a multi-hop routing problem. This model provides a new perspective for the analysis of resource allocation in CLS, as well as opens new avenues for problem-solving. Further, we design a decentralized Networked Multi-Agent Reinforcement Learning (MARL) approach and propose an actor-critic algorithm, allowing network nodes (agents) to distributively solve the multi-hop routing problem using AGM in a fully cooperative manner. By leveraging the computing resource of massive nodes efficiently, this approach has good scalability and can be employed in large-scale CLS. To the best of our knowledge, this work is the first attempt to apply networked MARL on CLS. Finally, we use the centralized (single-agent) RL algorithm as a benchmark to evaluate the numerical performance of our solution in a large-scale simulation. Additionally, experimental results based on a prototype system show that our solution is superior in saving resources and service performance to two alternative state-of-the-art solutions."}, "conf/iwcmc/ShenZZJKX21": {"title": "PPO-RM: Proximal Policy Optimization Based Route Mutation for Multimedia Services.", "url": "https://doi.org/10.1109/IWCMC51323.2021.9498706", "year": "2021", "author": {"Jiahao Shen": "249/6524", "Tao Zhang 0063": "15/4777-63", "Bingchi Zhang": "271/5375", "Weixiao Ji": "141/4730", "Xiaohui Kuang": "18/1267", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:The growing multimedia services have brought unprecedented challenges to the traditional static network architecture. Moving Target Defense (MTD) has been proposed to solve the inherent disadvantages of existing defense techniques. As an important area of MTD research, Route Mutation (RM) can dynamically change the forwarding routes in the network. In our previous work, we applied Reinforcement Learning (RL) to RM. However, there are still two problems that need to be addressed. 1) We consider too few constraints to reflect the actual network situation. 2) Due to the slow rate of convergence, it becomes difficult for efficient deployment. In this paper, we propose a Proximal Policy Optimization Based Route Mutation (PPO-RM) scheme to solve these problems. Firstly, we utilize the Satisfiability Module Theory (SMT) to formalize the space of all possible mutated routes. Then, we design an RM algorithm based on Proximal Policy Optimization (PPO) and implement it in the SDN controller. Finally, we simulate on Mininet to validate our method. The experiment results show that PPO-RM achieves the improvement in terms of convergence rate, defense performance, and network performance."}, "conf/nana/FengXXJDL21": {"title": "Dynamic Overhead Queue-based Efficient Service Delivery at Edge for Adaptive Live Streaming.", "url": "https://doi.org/10.1109/NaNA53684.2021.00036", "year": "2021", "author": {"Zichen Feng": "309/9987", "Changqiao Xu": "51/4906", "Han Xiao": "98/627", "Yongpu Jia": "310/0305", "Zhongyi Ding": "309/9697", "Zhaoyang Liu": "120/5899"}, "abstract": " Abstract:The live broadcast business has developed rapidly in recent years, but low latency, smoothness, and high user quality of experience (QoE) are still the problems that we need to solve. At the same time, the arise of edge computing has made up for the lack of traditional cloud computing in live broadcast services and brought low-latency effects, but also brought a heavy burden to the edge network, making edge load balancing an important issue to be solved urgently. Meanwhile, the real-time and low-latency characteristics of live broadcast put forward higher requirements on the network, which increases the difficulty of load balancing optimization. Therefore, to cope with the development trend of adaptive live streaming and improve the QoE, this article first proposes an adaptive live streaming transmission framework under the edge network, which integrates edge service clusters, multicast, and client adaptive bitrate(ABR) algorithms. Then, we proposed a load optimization scheme for edge service clusters, focusing on the dynamics of load and transmission costs. According to the two factors directly affected by the ABR algorithm, i.e. edge server CPU load and bandwidth overhead, The dynamic overhead queue load-balancing algorithm is proposed. Compared with the other three load optimization algorithms, the simulation results show the superiority of our scheme in term of load balancing and overhead."}, "conf/adhoc-now/LiMZX20": {"title": "XSS Attack Detection Model Based on Semi-supervised Learning Algorithm with Weighted Neighbor Purity.", "url": "https://doi.org/10.1007/978-3-030-61746-2_15", "year": "2020", "author": {"Xinran Li": "57/10368", "Wenxing Ma": "141/7622", "Zan Zhou 0001": "203/3329", "Changqiao Xu": "51/4906"}, "abstract": "With the popularity of web applications, cyber security is becoming more and more important. The most common web attack is cross-site scripting (XSS), which can be easily constructed in malicious URLs. However, the existing methods of detecting XSS attacks are suffering from the lack of labeled data, and some semi-supervised methods still have the problem of mislabeling. In this paper, we propose a novel XSS attack detection model based on semi-supervised learning algorithm with weighted neighbor purity. Semi-supervised learning can make best use of little labeled data, and a simple mechanism of neighbor purity using weighted-kNN is applied to rectify mislabeled samples, improving classification accuracy. To verify the feasibility of our solution in real-world scenario, we collected real HTTP requests in the China Education and Research Network (CERNET) as training data. The comparison experiment shows that proposed method performs better than a well-known semi-supervised algorithm and a recently published ensemble learning method in different initially labeled rates.KeywordsXSS attackMachine learningSemi-supervised learningBinary classification"}, "conf/globecom/MaXZKZG20": {"title": "Intelligent-driven Adapting Defense Against the Client-side DNS Cache Poisoning in the Cloud.", "url": "https://doi.org/10.1109/GLOBECOM42002.2020.9322430", "year": "2020", "author": {"Tengchao Ma": "245/4704", "Changqiao Xu": "51/4906", "Zan Zhou 0001": "203/3329", "Xiaohui Kuang": "18/1267", "Lujie Zhong": "124/8701", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:A new Domain Name System (DNS) cache poisoning attack aiming at clients has emerged recently. It induced cloud users to visit fake web sites and thus reveal information such as account passwords. However, the design of current DNS defense architecture does not formally consider the protection of clients. Although the DNS traffic encryption technology can alleviate this new attack, its deployment is as slow as the new DNS architecture. Thus we propose a lightweight adaptive intelligent defense strategy, which only needs to be deployed on the client without any configuration support of DNS. Firstly, we model the attack and defense process as a static stochastic game with incomplete information under bounded rationality conditions. Secondly, to solve the problem caused by uncertain attack strategies and large quantities of game states, we adopt a deep reinforcement learning (DRL) with guaranteed monotonic improvement. Finally, through the prototype system experiment in Alibaba Cloud, the effectiveness of our method is proved against multiple attack modes with a success rate of 97.5% approximately."}, "conf/icc/ZhouXMK20": {"title": "Multi-vNIC Intelligent Mutation: A Moving Target Defense to thwart Client-side DNS Cache Attack.", "url": "https://doi.org/10.1109/ICC40277.2020.9148655", "year": "2020", "author": {"Zan Zhou 0001": "203/3329", "Changqiao Xu": "51/4906", "Tengchao Ma": "245/4704", "Xiaohui Kuang": "18/1267"}, "abstract": " Abstract:As massive research efforts are poured into server-side DNS security enhancement in online cloud service platforms, sophisticated APTs tend to develop client-side DNS attacks, where defenders only have limited resources and abilities. The collaborative DNS attack is a representative newest client-side paradigm to stealthily undermine user cache by falsifying DNS responses. Different from existing static methods, in this paper, we propose a moving target defense solution named multi-vNIC intelligent mutation to free defenders from arduous work and thwart elusive client-side DNS attack in the meantime. Multiple virtual network interface cards are created and switched in a mutating manner. Thus attackers have to blindly guess the actual NIC with a high risk of exposure. Firstly, we construct a dynamic game-theoretic model to capture the main characteristics of both attacker and defender. Secondly, a reinforcement learning mechanism is developed to generate adaptive optimal defense strategy. Experiment results also highlight the security performance of our defense method compared to several state-of-the-art technologies."}, "conf/iwcmc/ZhangXZKWYM20": {"title": "DQ-RM: Deep Reinforcement Learning-based Route Mutation Scheme for Multimedia Services.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148371", "year": "2020", "author": {"Tao Zhang 0063": "15/4777-63", "Changqiao Xu": "51/4906", "Bingchi Zhang": "271/5375", "Xiaohui Kuang": "18/1267", "Yue Wang": "33/4822", "Shujie Yang": "78/10624", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Increasingly growing various multimedia services (e.g., interactive live video and so on) have brought tremendous pressure on existing static defense techniques. To cope with inherent drawback of static defense techniques, Network Moving Target Defense (NMTD) such as route mutation (RM) was proposed. What's more, applying reinforcement learning (RL) into RM has been proved feasible in our previous work. But two main problems still need to be considered in this combination of RL with RM: 1) It lacks the consideration of multiple flows situation. 2) With the state-action space grow larger, current solution can't handle efficiently. In this paper, we propose a deep Q-learning method for RM (DQ-RM) to solve above two problems. Firstly, benefited from the satisfiability module theory, we formalize RM space considering single flow and multiple flows concurrently. Then we further propose a deep reinforcement learning-based RM scheme based on our previous work, which is suitable for large-scale state-action space. Finally, extensive experimental results highlight the improvement of DQ-RM in defense performance and convergence speed compared to the representative solution."}, "conf/iwcmc/WangXZYS20": {"title": "A Survey of Blockchain-based Cybersecurity for Vehicular Networks.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148566", "year": "2020", "author": {"Xifeng Wang": "80/10587", "Changqiao Xu": "51/4906", "Zan Zhou 0001": "203/3329", "Shujie Yang": "78/10624", "Limin Sun": "37/4705"}, "abstract": " Abstract:The development of vehicular networks has greatly improved the efficiency and safety of intelligent traffic systems. However, it also introduces additional security threats into the system. The special characteristics of vehicular networks, such as dynamic topology, huge network scale and so on, make it difficult to adopt the traditional security solutions directly into this scenario. In addition, the single point failure problem of the centralized security mechanisms is also a big challenge. Recently, blockchain technology, which is a distributed database, is a potential approach to address these security issues. In this paper, a comprehensive review of the existing blockchain-based cybersecurity mechanisms is presented with the corresponding performance analysis. The purpose of this work is to provide a guideline for the further study in the application of blockchain in the vehicular network security area."}, "conf/mm/HaoXZM20": {"title": "A Multi-update Deep Reinforcement Learning Algorithm for Edge Computing Service Offloading.", "url": "https://doi.org/10.1145/3394171.3413702", "year": "2020", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "\n\t\tBy pushing computing functionalities to network edges, backhaul network bandwidth is saved and various latency requirements are met, providing support for diverse computation-intensive and delay-sensitive multimedia services. Due to the limited capabilities of edge nodes, it is very important to decide which services should be provided locally. This paper investigates the cloud-edge service offloading problem. Different from prior works which only give the proportion of computation offloading with constraint of computing capacity, we also take the storage space into account and determine the computing status of each service. We formulate the problem as a Markov decision process whose goal is to maximize the long-term average reduction of delay. The problem is hard to be solved with traditional methods because of the extremely large action space and lack of information about transition probability. Instead, this paper proposes an innovative deep reinforcement learning method to solve it. The proposed multi-update reinforcement learning algorithm introduces a novel exploration strategy and update method, which reduce dramatically the size of the action space. Extensive simulation-based testing shows that the proposed algorithm has fast convergence and improves the system performance more than other three alternative solutions do.\n\t"}, "conf/nana/WuCXY20": {"title": "Nesterov Accelerated Gradient-based Algorithm for the Allocation Problem of NFV Service.", "url": "https://doi.org/10.1109/NaNA51271.2020.00044", "year": "2020", "author": {"Zhonghui Wu": "279/4587", "Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624"}, "abstract": " Abstract:Network Functions Virtualization, as well as Software Defined Networking, is a crucial technology to distributed cloud network, providing support for network services allocations with elastic Virtual Network Functions instantiated in a flexible way at distributed cloud locations. In this paper, an O (E) approximation optimal solution with time complexity O([1/(E)]) to NFV Service Allocation Problem is proposed. Enlightened by the Nesterov Accelerated Gradient-based method, we use the cloud augmented graph model and redefine the service chain model to deal with the flow requirement, processes and transmission of cloud network. We formulate the VNFs services place problem as a non-smooth concave problem with integer programming form. Then, we translate the integer form into the linear program by linear relaxation of the problem. We further propose a Distributed Nesterov Accelerated Gradient-based algorithm which enables network nodes to obtain the optimal scheme by only requiring weight information from one-hop neighbors. Besides, we give three main theoretical results of our algorithm, which are queue-length reduction performance, utility optimal and convergence rate. Finally, multiple simulations are conducted to show the dominance of the proposed algorithm against the state-of-art solution."}, "conf/dsc/SongXYZG19": {"title": "A Black-Box Approach to Generate Adversarial Examples Against Deep Neural Networks for High Dimensional Input.", "url": "https://doi.org/10.1109/DSC.2019.00078", "year": "2019", "author": {"Chengru Song": "144/1365", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Zan Zhou 0001": "203/3329", "Changhui Gong": "247/9178"}, "abstract": " Abstract:Generating adversarial samples is gathering much attention as an intuitive approach to evaluate the robustness of learning models. Extensive recent works have demonstrated that numerous advanced image classifiers are defenseless to adversarial perturbations in the white-box setting. However, the white-box setting assumes attackers to have prior knowledge of model parameters, which are generally inaccessible in real world cases. In this paper, we concentrate on the hard-label black-box setting where attackers can only pose queries to probe the model parameters responsible for classifying different images. Therefore, the issue is converted into minimizing non-continuous function. A black-box approach is proposed to address both massive queries and the non-continuous step function problem by applying a combination of a linear fine-grained search, Fibonacci search, and a zeroth order optimization algorithm. However, the input dimension of a image is so high that the estimation of gradient is noisy. Hence, we adopt a zeroth-order optimization method in high dimensions. The approach converts calculation of gradient into a linear regression model and extracts dimensions that are more significant. Experimental results illustrate that our approach can relatively reduce the amount of queries and effectively accelerate convergence of the optimization method."}, "conf/globecom/CaoXJXZG19": {"title": "Stochastic Optimization for Pricing-Aware Multimedia Services in 5G Vehicular Networks.", "url": "https://doi.org/10.1109/GLOBECOM38437.2019.9013905", "year": "2019", "author": {"Tengfei Cao": "224/0908", "Changqiao Xu": "51/4906", "Zhongbai Jiang": "166/6020", "Han Xiao": "98/627", "Lujie Zhong": "124/8701", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:The many fold capacity magnification promised by 5G vehicular networks will likely provide massive multimedia services, including infotainment, augmented reality, location services, etc. However, the large-scale and stochastic characteristic of these burgeoning multimedia applications will lead to an exponential increase of traffic in vehicular networks. Meanwhile, the diversified requirements introduced by the coexistence with traditional services will also bring new challenges to the efficient usage of resources. To cope with the above challenges, we propose a novel Stochastic Optimization framework for Pricing-aware Multimedia Services (SOPMS) in this paper, which targets the maximization of utility with the constraints of system stability and traffic pricing policy. Specifically, we leverage the Lyapunov function to address this optimization objective, which is decomposed into three tractable subproblems. For each problem, a distinct algorithm is conceived, i.e. Quality of Experience (QoE) based utility maximization, cooperative resource allocation and pricing-based transmission control. Finally, validated by the simulations, our proposed SOPMS preserves the optimality and significantly improves the queue stability and service utility, in comparison with other state-of-the-art solutions."}, "conf/globecom/XiaoXCZM19": {"title": "GTTC: A Low-Expenditure IoT Multi-Task Coordinated Distributed Computing Framework with Fog Computing.", "url": "https://doi.org/10.1109/GLOBECOM38437.2019.9013357", "year": "2019", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Tengfei Cao": "224/0908", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:As an important scenario under the 5G, the Internet of things (IoT) is undertaking countless computing tasks, which are obtained from real life. However, for IoT devices, due to the limited computing resource and battery capacity, it is difficult to cope with the diversified incoming computing tasks. To this end, this paper studies the IoT task computing expenditure problem with the assistance of fog computing and cloud center. We firstly propose a game theoretic task computing framework (GTTC) to ease the competition of multi-nodes by taking into account the expected benefit of each computing node. Then, we put forward the concept of tendency-oriented priority (TOP) to coordinate the scheduling order between multi-tasks of fog computing node for further reducing the expenditure. Finally, the effectiveness of the proposed mechanism is verified by sufficient experimental simulations in terms of a wide set of performance metrics."}, "conf/globecom/ZhangKZGX19": {"title": "An Intelligent Route Mutation Mechanism against Mixed Attack Based on Security Awareness.", "url": "https://doi.org/10.1109/GLOBECOM38437.2019.9014119", "year": "2019", "author": {"Tao Zhang 0063": "15/4777-63", "Xiaohui Kuang": "18/1267", "Zan Zhou 0001": "203/3329", "Hongquan Gao": "259/3918", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Static network defense technologies are always in a passive defense state because of their disadvantages in cost, time and information. So Network Moving Target Defense (NMTD) is proposed as a kind of proactive defense technology. As an important research direction of NMTD, route mutation techniques still have limitations that they can not learn attack strategies and be adaptive in dynamical security situation. In this paper, we propose a novel route mutation mechanism based on reinforcement learning. We firstly investigate four different attack strategies and introduce a mixed attack strategy with entropy constraints. Then we formulate the network requirements using Satisfiability Module Theory (SMT) logic to acquire the route mutation space. We further propose a security-awareness Q- learning algorithm to select routes from the mutation space iteratively and conduct security awareness to adjust learning rate adaptively. Meanwhile, the optimal convergence of our algorithm is proved theoretically. Finally, experimental results highlight the effectiveness as defense performance, network overhead and convergence speed of our method compared to the representative solution."}, "conf/hpsr/GongXZZY19": {"title": "A Reputation Management Scheme for Identifying Malicious Nodes in VANET.", "url": "https://doi.org/10.1109/HPSR.2019.8808102", "year": "2019", "author": {"Changhui Gong": "247/9178", "Changqiao Xu": "51/4906", "Zan Zhou 0001": "203/3329", "Tao Zhang 0063": "15/4777-63", "Shujie Yang": "78/10624"}, "abstract": " Abstract:In vehicular ad-hoc network (VANET), vehicles exchange information on road conditions which guarantees safety. However, there exists malicious nodes which interfere the communication between vehicles. Thus, it is vital to identify malicious vehicles in VANET. Reputation-based schemes are one of the most promising schemes to identify malicious nodes in time. However, existing methods can only identify malicious nodes of a specific attack. Additionally, the efficiency and effectiveness of existing work in solving advanced attacks are unsatisfactory. In this paper, we propose a scheme to identify malicious nodes in VANET based on collaborative filtration. Distinguished from the existing solutions, we consider a variety of attacks in VANET, instead of a specific attack. In addition, our scheme updates the reputation of nodes in time according to the result of each communication, which brings better efficiency and effectiveness. The superiority of our proposed scheme has been demonstrated through simulation experiments."}, "conf/icc/GaoXQZM19": {"title": "A Stochastic Optimal Scheduler for Multipath TCP in Software Defined Wireless Network.", "url": "https://doi.org/10.1109/ICC.2019.8761974", "year": "2019", "author": {"Kai Gao": "12/4000", "Changqiao Xu": "51/4906", "Jiuren Qin": "203/3456", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Multipath TCP (MPTCP) can take advantage of multiple paths to transmit data and has been deeply optimized by many researchers. However, most researchers only devote themselves to improve the transmission performance, neglecting the price cost which is another factor that users are concerned about. This paper proposes a novel stochastic optimal scheduler for MPTCP (SOS-MPTCP) that utilizes Lyapunov optimization technique in software defined wireless network (SDWN). SOS-MPTCP analyzes and solves the trade-off problem between the performance and price cost from users' perspective. Besides, with the help of centralized optimization in SDWN architecture, the controller can feed status information of each path back to mobile terminals for SOS-MPTCP to make decisions. SOS-MPTCP includes three control decisions: 1) packets admission control; 2) packets distribution control; 3) data traffic purchasing control. SOS-MPTCP aims to maximize the throughput and minimize the price cost for users. Experiment results have proved the efficiency of trade-off optimization and the transmission system can achieve the expected stability."}, "conf/icc/HaoXWZW19": {"title": "Stochastic Cooperative Multicast Scheduling for Cache-Enabled and Green 5G Networks.", "url": "https://doi.org/10.1109/ICC.2019.8761402", "year": "2019", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Lujie Zhong": "124/8701", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:Caching has advantages in mitigating the backhaul data traffic and multicast is able to satisfy multiple identical requests by a multicast stream, which are the two most promising technologies to realize tremendous data transmission in 5G networks. However, many studies focus on cooperative caching but ignore the problem that what contents to multicast for a given caching status by cooperation between base stations (BSs). In this paper, we consider the cooperative multicast scheduling problem in cache-enabled 5G networks to satisfy user demands while minimizing the energy consumption. We propose a novel pending request queue model and transform the cooperative multicast scheduling problem into a Lyapunov stochastic optimization problem that can be calculated on-line. By analyzing properties of the problem, we proposed an on-line centralized algorithm to obtain the optimal strategy. Motivated by practical deployment, we further propose a distributed algorithm which has similar performance and lower complexity. Extensive simulations have been conducted to verify that our algorithms have better performance than several state-of-art algorithms, including both energy consumption and delay."}, "conf/icc/ZhouXKZS19": {"title": "An Efficient and Agile Spatio-Temporal Route Mutation Moving Target Defense Mechanism.", "url": "https://doi.org/10.1109/ICC.2019.8761927", "year": "2019", "author": {"Zan Zhou 0001": "203/3329", "Changqiao Xu": "51/4906", "Xiaohui Kuang": "18/1267", "Tao Zhang 0063": "15/4777-63", "Limin Sun": "37/4705"}, "abstract": " Abstract:For the reasons that defect remedy is an endless arduous work for static network defense technologies and cyberspace security remains unguaranteed, moving target defense (MTD) is proposed to stem the tide. Whereas, as an important branch of MTD, route mutation technologies still have limitations against some sophisticated adversaries like Advanced Persistent Threat (APT), multiple-step complex or combined attacks. In this paper, we propose a new spatio-temporal route mutation method based on MTD. We first take the maximization of resistibility towards not only multiple forms of attacks but also attackers' long-term background knowledge into consideration. We also formulate the problem into a stochastic optimization model and make it possible to agilely generate the satisfying mutation route meets the demands of various parties jointly by only solving one uniform problem. Thus, network Security is guaranteed from both flows(users) and nodes(infrastructure) perspectives. Experimental results highlight the security advantages as traffic dispersion, potential victim number and attack failure rates of our method compared to existing solutions."}, "conf/icmcs/Balasubramanian19": {"title": "Edge-Boost: Enhancing Multimedia Delivery with Mobile Edge Caching in 5G-D2D Networks.", "url": "https://doi.org/10.1109/ICME.2019.00290", "year": "2019", "author": {"Venkatraman Balasubramanian 0002": "31/6194-2", "Mu Wang": "94/4375", "Martin Reisslein": "54/3577", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:By moving computation and caching to the network edge, Mobile Edge Computing (MEC) offloads core networks and shortens data access latencies, which is important for large scale mobile multimedia services. Increasing the density of edge data centers to service these multimedia requests is uneconomical. Recent research has proven the benefits of involving devices in the delivery of multimedia services. This is done by exploiting the idle computation and storage resources via device-to-device (D2D) communication, i.e., by forming a so-called Mobile Device Cloud (MDC). Despite the flexibility and cost efficiency of this MDC paradigm, the timely allocation of caching resources to satisfy the dynamic user demands is challenging. This is mainly due to the uncertainty in resource availability of mobile devices. To this end, we propose Edge-Boost, a novel MDC caching architecture for lowlatency multimedia streaming services. We develop a novel fluid-based model to capture the dynamically changing network status. Additionally, we propose a dynamic caching allocation to jointly minimize caching cost and service latency. Edge-Boost achieves over 20% higher average cache utilization and 15% shorter average access latency than the state-of-the-art MDC approach."}, "conf/infocom/CaoXXZ19": {"title": "Credible and Economic Multimedia Service Optimization in Cloud Network.", "url": "https://doi.org/10.1109/INFCOMW.2019.8845045", "year": "2019", "author": {"Tengfei Cao": "224/0908", "Changqiao Xu": "51/4906", "Han Xiao": "98/627", "Lujie Zhong": "124/8701"}, "abstract": " Abstract:The cloud network has the advantages in efficiently offloading the large-scale Internet traffic, which is considered as a promising architecture to provide the satisfactory multimedia services for mobile users. However, most current studies lack the joint consideration of economic and security of services in cloud network. In this paper, a novel multimedia service optimization mechanism is proposed hereby to meet the user's requirements mentioned above while guaranteeing the reliability of service. Firstly, a credible scheme is designed to help the mobile users distinguish the reliable cloud providers; Moreover, a noncooperative Stackelberg game model is presented to maximize the profit of each party; Furthermore, the equilibrium of this game is achieved by the methods of backward induction and gradient descent; Finally, extensive simulations demonstrate that our solution has efficient performance in terms of secure service ratio, utility, pricing and service requirement."}, "conf/iwcmc/MaXZKZ19": {"title": "SE-PSO: Resource Scheduling Strategy for Multimedia Cloud Platform Based on Security Enhanced Virtual Migration.", "url": "https://doi.org/10.1109/IWCMC.2019.8766781", "year": "2019", "author": {"Tengchao Ma": "245/4704", "Changqiao Xu": "51/4906", "Zan Zhou 0001": "203/3329", "Xiaohui Kuang": "18/1267", "Lujie Zhong": "124/8701"}, "abstract": " Abstract:In the multimedia cloud platform, the resource scheduling performance directly affects the energy consumption, resource utilization of the active physical machine (PM) and virtual machine (VM) security. Besides, service level agreement (SLA) violation rate also fluctuates with the strategy. Many optimization methods have been launched to cope with this scheduling task, while none of them accommodate all the above aspects in a uniform manner to our best knowledge. In this paper, aiming at optimizing the four sides performance, we propose a new resource scheduling strategy called Security Enhanced Particle Swarm Optimization (SE-PSO) based on VM migration which uses Particle Swarm Optimization (PSO) as a kernel part. Firstly, the inertia factor and the learning factor are dynamically adapted to improve the search performance of SE-PSO. Then, by periodically predicting physical hotspots with the exponential smoothing model, we reduce unnecessary migrations and thus minimize the VM migration security risk. Finally, roulette wheel idea is applied to achieve long-term optimization of the platform resources. The experiments conducted in CloudSim with real-world dataset also show that SE-PSO has a good overall performance in energy consumption, resource utilization, SLA violation rate and migration security compared with the mainstream PSO algorithm."}, "conf/iwcmc/XiaoXCYZM19": {"title": "Energy Efficient for Scalable Video Caching Service over Device-to-Device Communication.", "url": "https://doi.org/10.1109/IWCMC.2019.8766708", "year": "2019", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Tengfei Cao": "224/0908", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Due to its advantages in service flexibility, scalable video coding (SVC) has been widely used in Device-to-Device (D2D) network communication, which is an effective network technology in the fifth generation (5G) communication network. However, duo to the limited capacity of mobile device, the uninterrupted transmission communication is difficult to be maintained, which needs to be solved urgently. Therefore, in this paper, we introduce the maximum offloading traffic and energy cost ratio to estimate service performance and propose a heuristic algorithm based on the greedy strategy to maximize the offloading traffic because of the NP-hardness of the cache placement problem for SVC. Then, we improve the energy efficiency over D2D link by optimizing the transmission power. Finally, a series of detailed simulation experiments are conducted to analyze the relationship between offloading traffic and energy cost, which demonstrates that a tradeoff exists between the significant amount of traffic and approving energy efficiency."}, "conf/nana/PiHYLX19": {"title": "RBDR: A Distributed Routing Algorithm in High Mobility UAV Network.", "url": "https://doi.org/10.1109/NaNA.2019.00017", "year": "2019", "author": {"Wenchao Pi": "260/7683", "Hao Hao": "96/10637", "Shujie Yang": "78/10624", "Yong Liao": "69/2622", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:High Mobility Unmanned Aerial Vehicle(UAV) network is a wireless mobile network with strong mobility of nodes, limited space and energy of nodes and real-time changed of network topology. At present, UAV networks are widely used in military, disaster reconstruction, agricultural and other scenarios. The routing problem as a focus in the research of UAV network has also aroused researcher's extensive attention. The routing algotithm in UAV network mainly include proactive routing algorithm, reactive routing algorithm, auxiliary routing algorithm, etc. However, most of these routing algorithms are centralized, deployment difculties, low stability and poor scalability. And they also require each node to maintain a global routing information table in order to obtain global node information in real time to network flooding, which undoubtedly wastes a lot of storage space for uav nodes with limited space. This paper, a novel and effective distributed routing algorithm is proposed which named reputation-based distributed routing algorithm(RBDR), and deploy it to the high mobility UAV network. In RBDR, we introduce a realtime quota-controlled strategy (which can control the number of message replicates in real time) and defne the concept of reputation for each node, this can avoid network congestion and improve the success rate of messages transmission. Since each node only needs to maintain its own friend list without obtaining the global network status, so the distributed RBDR algorithm can avoid the problem of difcult deployment and difcult information exchange of centralized routing algorithm in the high mobility UAV network. The experimental results show that the RBDR algorithm have higher success rate of message transmission and lower network resource overhead in high mobility UAV network."}, "conf/nana/XiaoCYZLX19": {"title": "Service Stochastic Optimization with Energy Constraint Over UAV-Assisted Network.", "url": "https://doi.org/10.1109/NaNA.2019.00022", "year": "2019", "author": {"Han Xiao": "98/627", "Tengfei Cao": "224/0908", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Yong Liao": "69/2622", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:The arriving next generation network (5G) will provide people with more diverse services. However, the increasing amount of traffic has put a great deal of pressure on the network, which easily gives rise to massive network congestion. Under the context mentioned above, this paper proposes a service stochastic optimization method under the energy constraint based on the advanced unmanned aerial vehicle (UAV) technology. First, we model the service infrastructure and energy overhead as backlog queues and virtual queues, respectively. In this way, the network congestion control is transformed into a queue stability problem. Further, we consider improving the quality of experience (QoE) by optimizing the transmission rate. And the Drift-Plus-Penalty based on Lyapunov is constructed to ensure that the transmission rate of users is increased while avoiding the congestion. Finally, we carry out a succession of simulation and verify the efficiency of our proposed algorithm by fine tuning the experimental environment."}, "conf/wcnc/GaoXQYZM19": {"title": "QoS-driven Path Selection for MPTCP: A Scalable SDN-assisted Approach.", "url": "https://doi.org/10.1109/WCNC.2019.8885585", "year": "2019", "author": {"Kai Gao": "12/4000", "Changqiao Xu": "51/4906", "Jiuren Qin": "203/3456", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Multipath TCP (MPTCP), as a promising transmission protocol, can aggregate the bandwidth of multiple paths in order to improve the transmission rate. However, due to the lack of perceiving the network status from lower layers, MPTCP cannot adaptively adjust the number of subflows, which will lead to network congestion or underutilization of network resources. Besides, plenty of packets will be out-of-order severely due to the diversity among the paths so that transmission performance degrades significantly. To address the problems mentioned above, we propose a novel QoS-driven and SDN-assisted MPTCP path selection scheme (QSMPS) for high-quality transmission service. QSMPS utilizes a scalable SDN-assisted approach to monitor and analyze network status information. Through matching service demand and the provided capacity of current network, the scheme calculates the optimal number of subflows, then distributes them to the least differential delay paths determinately. Simulation results show QSMPS outperforms the existing solutions by evaluating performance in Mininet emulator and Ryu controller."}, "conf/dsc/YangLKX18": {"title": "A Vulnerability Test Method for Speech Recognition Systems Based on Frequency Signal Processing.", "url": "https://doi.org/10.1109/DSC.2018.00150", "year": "2018", "author": {"Honghao Yang": "81/2986", "Dong Liang": "23/110", "Xiaohui Kuang": "18/1267", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:With the development of information technology and the popularity of smart devices, voice recognition system, which is installed in many devices such as smartphones and automatic control equipment, is playing an increasingly important role in people's lives. Its appearance has greatly facilitated people's lives. However, their potential safety issues should also receive sufficient attention. Human perception of speech signals is affected by prior knowledge and context. It is natural for a people to unconsciously make up the obscure part of a voice signals he heard. But it doesn't work this way for a voice recognition software. In this condition, wrong results which are far from normal people's recognition will be returned from the software. That case rose above shows that voice recognition systems have potential vulnerability, which makes it possible that designed dangerous commands may be executed without operator's conscious. This paper firstly proposes a method to process voice signal and produce a lot of processed signals which are similar in human auditory but different in actual. Then, we propose a strategy to select processed voice signals aiming at a target speech recognition system. Finally, a way to test the vulnerability of voice recognition system is proposed in passing. Experimental results revealed that the above strategies effectively changed the output texts from speech recognition systems while the input voices were auditory changed little. This result confirmed the vulnerability of voice recognition system."}, "conf/globecom/ChenXWCZM18": {"title": "Optimal Coded Caching in 5G Information-Centric Device-to-Device Communications.", "url": "https://doi.org/10.1109/GLOCOM.2018.8647705", "year": "2018", "author": {"Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Tengfei Cao": "224/0908", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:As one of the key technologies for future 5G, Device- to-Device communications (D2D) offloads traffic to local by enabling mobile equipment directly communicating with each other, which perfectly supporting distributed applications and IoT scenarios. Integrating Information-centric networking (ICN) with D2D is becoming an attractive trend because of the superior advantages of inherent support of caching and name-based routing. Nevertheless, efficient caching in ICN D2D still remain problematic due to the low utilization of caching space and multicast feature of wireless scenarios. In this paper, we propose a novel optimal coded content caching mechanism for ICN-based 5G D2D. We first building a fluid-based model to describe how the roles of mobile nodes evolve with the user behaviors and caching strategy. We then accordingly formulate the coded caching problem as an optimization problem, which mainly considers the tradeoff between delivery latency and energy consumption. The existence of optimal solutions is proved theoretically. We further propose a Learn Tree- based Code Content (LTCC) mechanism to cluster the contents for content coding selection and an Optimal Coded Content Caching (O3C) algorithm to solve coded content caching problem. Finally, we conduct massive simulation tests to validate the performance of the proposed algorithm against the state-of-art solutions."}, "conf/icc/CaoXWCZM18": {"title": "Family-Aware Pricing Strategy for Accelerating Video Dissemination over Information-Centric Vehicular Networks.", "url": "https://doi.org/10.1109/ICC.2018.8422411", "year": "2018", "author": {"Tengfei Cao": "224/0908", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Xingyan Chen": "211/5842", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The recent fast development of wireless communications and smart devices has opened the avenue to supporting high quality video streaming services in vehicular networks. This growing trend towards enhanced video services and the inefficient content distribution of conventional IP networks have motivated the researchers to propose new Internet architectures that are more efficient for content distribution in general and in vehicular networks in particular. Information-centric networking (ICN) shifts the network paradigm from host centric to content centric, providing effective content distribution by named-based routing and in-network caching, which becomes a promising solution for sharing video streaming among vehicles. In this paper, we present a novel Family-Aware Pricing Strategy (FAPS) to accelerate video streaming dissemination over Information-Centric Vehicular Networks (ICVNs). We first classify the mobile users into multiple families by investigating user similar behaviors. Based on the family, an efficient video sharing scheme is proposed to support near end video fetching. In addition, a pricing-based video caching policy is also proposed to accurately optimize caching distributions. Simulation results show how our proposed strategy achieves better performance than other state-of-art solutions in terms of caching hit ratio, searching delay, freeze times and control overhead."}, "conf/infocom/HaoXW0LW18": {"title": "Knowledge-centric proactive edge caching over mobile content distribution network.", "url": "https://doi.org/10.1109/INFCOMW.2018.8406950", "year": "2018", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Haiyong Xie 0001": "30/6562", "Yifeng Liu": "44/4345", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:By enabling caching content at base stations, accessing points or other mobile nodes which are close to users, wireless edge caching is able to shorten the content delivery latency and offloading data traffic from backhaul to local, which has become a promising solution video service in future mobile content distribution network. How to maximize the caching utilization while averagely reduce the overall video delivery latency is a critical issue in wireless edge caching. However, the high dynamic and complex of user playback behavior of mobile video streaming makes it difficult to decide which content should be cached by popularity investigation or conditional probability-based requests prediction. In this paper, we propose a knowledge-centric edge caching optimization for multimedia service in 5G that online optimizes the caching configuration based on semantic information of user playback behavior. We first capture the semantic information of user by employing a deep belief networks. Then, by determining the future requested video based on playback pattern, we mathematically formulate the caching optimization problem which is NP-complete but submodular and monotone, namely a near optimal solution can be found in polynomial time. To solve this optimization problem, we propose a greed-based online caching configuration algorithm in order to minimize the overall delivery cost for video streaming in real-time. Simulation results show how our proposed method outperform the state-of-the-art solutions."}, "conf/ipccc/LiuZGXW18": {"title": "When Group Buying Meets Wi-Fi Advertising.", "url": "https://doi.org/10.1109/PCCC.2018.8711007", "year": "2018", "author": {"Yang Liu 0038": "51/3710-38", "Ying Zhang": "13/6769", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Yu Wang 0003": "w/YuWang3"}, "abstract": " Abstract:The recent proliferation of public hotspots has given rise to Wi-Fi advertising where venue owners promote their business by pushing advertisers' advertisements on their hotspots. However, a small business usually has insufficient budget to make a purchase for a whole webpage. Therefore, in this paper, we propose GAWA, a Group-buying based Auction mechanism for Wi-Fi Advertising among a venue owner, group leaders and advertisers, which is composed of three phases. More specifically, in the first phase, we propose an algorithm to decide a group bid for each group leader and winning advertisers for each group. In the second phase, the venue owner assigns venues to group leaders by a novel winning group leader determination algorithm. In the third phase, the mechanism determines how much each winning group leader should charge each advertiser in the winning group. We prove that GAWA is computationally efficient, and possesses excellent economic properties such as individual rationality, budget balance, and truthfulness. We evaluate the proposed algorithms using large-scale simulations, and demonstrate the effectiveness and efficiency of our design when comparing with the state-of-the-art approaches."}, "conf/iwcmc/QinXHZM18": {"title": "MO-PR: Message-Oriented Partial-Reliability MPTCP for Real-time Multimedia Transmission in Wireless Networks.", "url": "https://doi.org/10.1109/IWCMC.2018.8450509", "year": "2018", "author": {"Jiuren Qin": "203/3456", "Changqiao Xu": "51/4906", "Hui Huang": "33/5763", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:As an extension of Transmission Control Protocol (TCP), Multi-Path Transport Control Protocol (MPTCP) provides a reliable and streaming-oriented transmission service to the upper applications. However, when turning to the real-time multimedia transmission, the repeatedly retransmission of expired segments is unnecessary and inefficient. Thus, we propose a Message-Oriented Partial-Reliability (MO-PR) improvement for MPTCP in this paper. The MO-PR firstly extend the Partially-Reliability transmission scheme to MPTCP which allows the sender to abandon the invalid segment by notifying the receiver. Then, the Message-Oriented retransmission mechanism is designed to improve the discarding efficiency. Finally, the comparison-based simulation results show that MO-PR can effectively improve the transmission performance of multimedia in dynamic wireless networks."}, "conf/nana/ZhangCX18": {"title": "Intelligent Routing Algorithm Based on Deep Belief Network for Multimedia Service in Knowledge Centric VANETs.", "url": "https://doi.org/10.1109/NANA.2018.8648766", "year": "2018", "author": {"Tao Zhang 0063": "15/4777-63", "Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Currently, vehicular ad hoc networks (VANETs) are experiencing an explosive network traffic growth due to the rapid development of video streaming service, which causes large transmission delay and waste of bandwidth. However, the existing routing and caching strategies in VANETs are not efficient enough to cope with the time-varying network conditions, such as dynamic network topology. On the other hand, Knowledge Centric Network (KCN) is a new network architecture to solve above problems, which uses deep learning to manage network in a more intelligent and autonomous way. In this paper, we propose an Intelligent Routing Algorithm (IRA) based on deep belief network to provide high-quality multimedia service in VANETs, which considers a concept called user class. Deep belief network is used to extract feature vectors from users request sequence to divide user classes, which can improve quality of experience. We first divide mobile users into different user classes and users can discover requested video content from other users who belong to the same user class. Simulation results show that IRA achieves better network performance that other state-of-art routing algorithms in terms of delay in finding data and cache hit ratio."}, "conf/nana/YangXGZ18": {"title": "Event-based Diffusion Kalman Filter Strategy for Clock Synchronization in WSNs.", "url": "https://doi.org/10.1109/NANA.2018.8648770", "year": "2018", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Tao Zhang 0063": "15/4777-63"}, "abstract": " Abstract:As a distributed system, most applications in wireless sensor networks (WSNs) require clock synchronization as support. However, clock crystal oscillators in WSNs are highly susceptible to the environment. The problem of clock synchronization among sensors in WSNs is urgently to be solved. Therefore, in this paper, a state-space model considering the distributed characteristics of WSNs is set up to solve clock synchronization problems. Based on this model, a diffusion Kalman filter is put forward to implement compensation of clock offset and clock skew. Furthermore, an event-based diffusion Kalman filter algorithm is proposed, in which, the eb-DKF will be executed only when some event happens. Through this proposed solution, it can achieve close performances with DKF implement but reduce computational cost significantly, which is particularly adaptive to the low power and low cost properties of WSNs. At last, experiments is shown to support these theoretical algorithm well."}, "conf/icc/JiangXGZY17": {"title": "Loss-aware adaptive scalable transmission in wireless high-speed railway networks.", "url": "https://doi.org/10.1109/ICC.2017.7997402", "year": "2017", "author": {"Zhongbai Jiang": "166/6020", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Shui Yu": "90/3575"}, "abstract": " Abstract:Widespread deployment of High-Speed Railway (HSR) in recent years brings strong demand for high-quality onboard Internet services. However, the wireless link between the train and Base Station (BS) suffers from numerous problems, including frequent handover, severe Doppler shift, and great penetration loss, etc. It is still a challenge to provide HSR passengers with high-quality Internet services. In this paper, the Packet Loss Rate (PLR) of HSR networks is measured along Beijing-Shanghai railway line. Measurement results indicate that PLR remains at a high level for a long period and changes frequently in a large interval. To address this problem, we focus on frame loss problem of train-to-BS wireless link and propose a novel Loss-Aware Adaptive Scalable Transmission mechanism (LAAST) to fit for HSR networks. In LAAST, variable number of frame copies are transmitted according to Frame Loss Probability (FLP) to improve the scalability and efficiency of transmission over train-to-BS link. The optimal relationship between frame duplication number and FLP is derived through nonlinear programming model. Simulations demonstrate the effectiveness and fitness of LAAST for HSR networks."}, "conf/icc/WangXJGG17": {"title": "Preference-aware Fast Interest Forwarding for video streaming in information-centric VANETs.", "url": "https://doi.org/10.1109/ICC.2017.7996742", "year": "2017", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Shijie Jia": "51/10138", "Jianfeng Guan": "47/6455", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:Information-Centric Networking (ICN) focuses on data dissemination instead of host communication, and it is a promising solution for video streaming in Vehicular Ad-hoc Networks (VANETs). In Information-Based VANETs, content copies can be cached by arbitrary mobile nodes in the networks. Thus, it is required to optimize the routing of content requests (referred to as Interest packets) in order to quickly locate potential content providers as soon as possible. This article proposes a Preference-aware Fast Interest Forwarding for video streaming in ICN-based VANETs (PaFF). In PaFF, each mobile user creates a Highly Preferred Content Table (HPCT) to maintain the content caching status of nodes who have similar mobility patterns and video playback behavior. Based on HPCT, a preference-aware forwarder selection mechanism is proposed to select the next hop of Interest packets in order to minimize latencies and maximize reliability. Simulation results show that PaFF achieves a considerable improvement in terms of start-up delay and cache hit ratio while incurring almost the same overhead with respect to state-of-art solutions."}, "conf/icig/ChenWJX17": {"title": "Energy-Aware Fast Interest Forwarding for Multimedia Streaming over ICN 5G-D2D.", "url": "https://doi.org/10.1007/978-3-319-71589-6_31", "year": "2017", "author": {"Xingyan Chen": "211/5842", "Mu Wang": "94/4375", "Shijie Jia": "51/10138", "Changqiao Xu": "51/4906"}, "abstract": "By providing extremely low delivery latency, very high data rate and significant improvement on network capacity, 5G wireless communications have paved the way for introducing high quality multimedia services such ultra HD videos into mobile Internet. The new emerging multimedia applications further spurs the ever growing mobile data traffic and diverse quality of service requirements, which has motivated the need to explore new data delivery paradigms and network architectures. Recently, the combined use of device-to-device (D2D) and information-centric networking (ICN) has been shown to be a promising approach for wide range of multimedia applications in 5G. However, a critical issue is how to select appropriate Interest forwarders in order to fast discover nearby content provider while remains low energy consumption. In this paper, we propose an energy-aware fast Interest forwarding scheme (EAFF) for multimedia streaming over ICN 5G-D2D. We firstly formulate the Interest forwarding problem to jointly optimize the energy consumption and forwarding coverage, and prove it to be NP-hard but submodular and monotonous. Then we propose a greed-based distributed forwarder selection algorithm which enables each node individually determines the next-hop forwarders during the Interest forwarding process. We also conduct a series of simulation tests to show that our proposed method achieves dramatically performance improvement with the respect to state-of-art solutions."}, "conf/infocom/JiangGLLX17": {"title": "SPCN: Providing smart support for proactive caching in mobile scenario.", "url": "https://doi.org/10.1109/INFCOMW.2017.8116398", "year": "2017", "author": {"Zhongbai Jiang": "166/6020", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Xinshu Li": "209/8778", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:In recent years, the ever-growing number of mobile users and demands for mobile services exert great pressure on wireless content transmission. It is still a challenge to provide high-quality service in mobile scenario. To improve the quality of mobile service, proactive caching is proposed to push popular and requested service content to the nearest base stations or access points from mobile users through mobility prediction and content prefteching and caching. Despite a lot of proactive caching algorithms have been proposed, there is few research has been done to design and establish a network architecture which is capable of providing smart and native support for proactive caching. Therefore, in this paper, a Smart Proactive Caching Network (SPCN) is proposed to fill the gap. The architecture and working procedure of SPCN is presented and network model is established. The performance is also evaluated."}, "conf/infocom/ZhuXGLZ17": {"title": "A preference-aware trajectory privacy-preserving scheme in location-based social networks.", "url": "https://doi.org/10.1109/INFCOMW.2017.8116482", "year": "2017", "author": {"Liang Zhu": "85/20", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Trajectory privacy-preserving for Location-based Social Networks (LBSNs) has been received much attention to protect the sensitive location information of subscribers from leaking. Existing trajectory privacy-preserving schemes in literature are confronted with three problems: 1) it is limited for privacy-preserving by only considering the location anonymization in practical environment, and the sensitive locations are always revealed by this way; 2) they fail to consider the user preference and background information in trajectory anonymization, which is important to keep personalized location-based service; 3) they can not be adapted to different kinds of privacy risk levels, resulting in low the service precision. To tackle the above problems, we propose PTPP, a preference-aware trajectory privacy-preserving scheme. First, we model the user preference by considering movement pattern, user familiarity and location popularity. Then, we classify the privacy risk levels according to user familiarity and location popularity. Finally, we propose a preference-aware trajectory anonymization algorithm by considering privacy risk levels. The experimental results show that our method outperforms the existing method in terms of data utility and efficiency."}, "conf/iwcmc/ZhuXQZG17": {"title": "Mobility-aware multimedia data transfer using Multipath TCP in Vehicular Network.", "url": "https://doi.org/10.1109/IWCMC.2017.7986429", "year": "2017", "author": {"Danyang Zhu": "203/3368", "Changqiao Xu": "51/4906", "Jiuren Qin": "203/3456", "Zan Zhou 0001": "203/3329", "Jianfeng Guan": "47/6455"}, "abstract": " Abstract:This paper proposed a mobility-aware multimedia data transfer mechanism using Multipath TCP in Vehicular Network. Since high transmission rate and low latency are the two key factors for multimedia data transmission that could provide stable video streaming services, therefore, we first adopted Multipath Transport Control Protocol which can transfer data concurrently for improving transmission rate and designed Quality-aware Data Distribution to dynamically allocate the data to different subflows. Moreover, in Vehicular Network, the mobile terminal, which means the vehicle, can communicate with remote server through roadside unit (RSU). However, the communication link between terminals and remote server will disrupt while the vehicle exceeding the communication range of roadside unit; and there also exists the situation that the vehicle is in the communication range of several RSU. Accordingly, we exploited a mobility-aware distance measurement for checking whether the vehicle has moved out of the communication range of any RSU or it is in multi-RSU's communication range. Afterwards, we designed a handover mechanism which transfer data to connected path (4G) for stable transmission using MPTCP when the vehicle exceeded the communication range of RSU; while one mobile can communicate with more than one RSU, we exploited a mechanism which can trigger new path for multipath data transmission and non-corporation Nash Equilibria was employed for solving the problem of fairness in the same kind of network technology multipath transmission. Simulation results show how mobility-aware multimedia data transfer mechanism improve the performance of transmission comparison with state-of-art solution."}, "conf/iwcmc/ZhangGX17": {"title": "Multi-state prediction: A VOM based user behavior pattern in cognitive internet.", "url": "https://doi.org/10.1109/IWCMC.2017.7986433", "year": "2017", "author": {"Neng Zhang": "128/4245", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Cognitive radio networks enable the unlicensed users to share the spectrum with licensed users, while it makes dynamic environment. The use of the channel by unlicensed users should be sensible of the licensed users in advance whether acceptable interference occurs. Mostly the routing protocol considered the previous state prediction. However, the routing probe and react strategy by unlicensed users sometimes is not only determined by the last one node state. In this paper we introduce a predictive node mobility model which is monitoring a licensed user's mobility, capable of reducing the delay."}, "conf/nana/HaoXYGLZ17": {"title": "BF-PDT: A New Name Lookup Mechanism in Content-Centric Networking.", "url": "https://doi.org/10.1109/NaNA.2017.11", "year": "2017", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Lujie Zhong": "124/8701"}, "abstract": " Abstract:Content-Centric Networking (CCN) as a promising architecture of Information-Centric Networking (ICN) relies upon variable-length hierarchical names instead of fixed-length host addresses. The problem of name lookup mechanism in CCN is a research hotspot. However, the existing mechanism with the longest prefix matching (LMP) method cannot meet the requirements of CCN because of the variable length and the large size of CCN names. To solve this problem, in this paper, we propose a novel name lookup mechanism (named by BF-PDT), which combines with Bloom Filter, the Popularity table and the Degraded Tire. In BF-PDT, bloom filter can help us determine whether the element is in set. Meanwhile, the popularity table is according to the access features of the CCN network and the degraded tire is proposed to improve tire. Finally, we experiment with BF-PDT and the results show that the BF-PDT can obtain high lookup speed at the cost of small memory."}, "conf/nana/GaoXGL17": {"title": "A Survey of Multipath Transport Mechanism in Software Defined Network.", "url": "https://doi.org/10.1109/NaNA.2017.8", "year": "2017", "author": {"Kai Gao": "12/4000", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38"}, "abstract": " Abstract:The idea of decoupling the control and forwarding and programmable network has been concerned by the researchers due to the emergence of software defined network which acts as the future network. Also, terminals equipped with multiple interfaces are increasing which can use multiple paths simultaneously. Multipath transport mechanism can improve throughput via multiple paths. We present a survey about multipath transport mechanisms in software defined network. First of all, the research on single TCP in SDN is analyzed. Then, SDN-based data center, the path management and the SDN testbed of multipath transport mechanism are summarized respectively. Finally, the developments and challenges of multipath transport mechanism in software defined network are put forward."}, "conf/wcnc/YangXG17": {"title": "Diffusion Kalman Filter Algorithm for Adaptive Network with Quantized Information Exchange.", "url": "https://doi.org/10.1109/WCNC.2017.7925563", "year": "2017", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455"}, "abstract": " Abstract:We study the distributed Kalman filter in sensor networks where multiple sensors collaborate to achieve a common objective. Diffusion Kalman filtering algorithms have been a popular topic in linear dynamic system estimation problems, In there algorithms, nodes cooperate with their direct neighbors and diffuse the information across the entire network through a sequence of Kalman iterations and data-aggregation. In this article, we propose the diffusion Kalman filtering with quantized global (DKFQFI)algorithm because of the limited sources in the wireless environment, where nodes exchange their quantized states with neighbors to reduce the consumption of resources. To prove the convergence of the DKFQFI algorithm, we derive the theoretical expressions of the mean and mean-square performance. From the expressions, we show that the mean performance and mean-square performance of the proposed algorithm are unbiased and stable. Therefore, the feasibility of the algorithm is verified. Moreover, the proposed algorithm achieves an outperform by simulation."}, "conf/icc/ZhuXGY16": {"title": "Finding top-k similar users based on Trajectory-Pattern model for personalized service recommendation.", "url": "https://doi.org/10.1109/ICCW.2016.7503845", "year": "2016", "author": {"Liang Zhu": "85/20", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Shujie Yang": "78/10624"}, "abstract": " Abstract:Service recommendation for Location-based Social Networks (LBSNs) has been received much attention mainly in the field of large-scale Wireless Communication Networks. It is a promising solution to guarantee service reliability and improve quality of experience (QoE) of users. Many schemes have been proposed to provide the reliable and personalized services for users, such as collaborative filtering (CF), content-based recommendation(CBR), and context-aware recommendation, etc. However, the activity sequence and type popularity is lacked in above researches, which leads to the recommendation accuracy and service experience decline. In this paper, we propose TopSim-TP, a novel trajectory-pattern-based similar users discovery method aiming to effectively mine the life cycle and preference of users. First, we describe the mobile behavior of users by mapping location information into type information. Then, we model the trajectory-pattern for each user. Finally, we present a Common Trajectory-Pattern (CTP) extraction algorithm and compute the similarity of sequences to find the top-k similar users for current user. The experimental results show that our method outperforms the existing method."}, "conf/nana/WeiXWG16": {"title": "Cache Management for Adaptive Scalable Video Streaming in Vehicular Content-Centric Network.", "url": "https://doi.org/10.1109/NaNA.2016.60", "year": "2016", "author": {"Yiran Wei": "161/4646", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Jianfeng Guan": "47/6455"}, "abstract": " Abstract:Vehicular Content-Centric Network (VCCN) is a promising solution for real-time applications in Vehicular Ad-hoc Networks (VANETs). Meanwhile, adaptive scalable video streaming over VCCN has better performance than video streaming service with fixed bit rate, due to it enables consumers access multiple bit rate content based on the link quality and allows progressive transmission of scalable video coded video content. Our objective is to improve the quality of experience (QoE) for adaptive scalable video streaming services through an effective cache management. At its core, we first analyze the caching potential for caching a content with a specific bit rate. Then a novel caching strategy, namely layered cooperative cache management (LCC-VCCN), is proposed to select neighbor nodes within broadcast range to cache one or several SVC layer content based on the layer level caching potential value. In this way, the most needed layer chunk content can cooperatively be pushed to the consumers to reduce content retrieval time and prevent stalls of the video playback. Simulation results show that our proposal outperforms the state-of-art caching strategies for video streaming services over VCCN."}, "conf/pimrc/WeiXWG16": {"title": "A novel dynamic adaptive video streaming solution in content-centric mobile network.", "url": "https://doi.org/10.1109/PIMRC.2016.7794977", "year": "2016", "author": {"Yiran Wei": "161/4646", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Jianfeng Guan": "47/6455"}, "abstract": " Abstract:The newly rising of dynamic adaptive streaming over HTTP (DASH) enables consumers access diverse bit rate encoded video content according to the link situation, which improves the quality of experience (QoE) of consumers in mobile environment. While Content-Centric Mobile Networks (CCMNs) bring content centric design to mobile environment and has already become a promising solution for the content-based applications. The major challenges of DASH in CCMNs are how to determine proper video quality in a mobile environment and to reduce broadcasting storm. To address these problems, we design a novel adaptive video streaming solution in CCMNs (DAS-CCMN). We first analyze the load degree of content carrier, and define an interest satisfied potential (ISP) concept to reflect the ability that a content carrier can satisfy the interest request from a consumer. In DAS-CCMN, each mobile node shares its ISP information with neighbors. All nodes store this information in their interest satisfied potential table (ISPT). Based on information recorded in ISPT, a self-learning based rate determination strategy is presented to choose video content with proper bit rate. Moreover, an interest flooding control is presented to solve the broadcast storming problem for adaptive video streaming in CCMNs. Simulation results show our solution improves the performance of current DASH service in CCMNs."}, "conf/qshine/GuanYYXZ16": {"title": "The Cache Location Selection Based on Group Betweenness Centrality Maximization.", "url": "https://doi.org/10.1007/978-3-319-60717-7_27", "year": "2016", "author": {"Jianfeng Guan": "47/6455", "Zhiwei Yan": "41/6859", "Su Yao": "198/8323", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": "Content-Centric Networking (CCN) as a content-oriented network architecture can provide efficient content delivery via its in-network caching. However, it is not optimal way to cache contents at all intermediate routers for that the current technology is not yet ready to support an Internet scale deployment. Therefore, in this paper we study the cache location selection problem with an objective to maximize cache delivery performance while minimize the cache nodes. The existing work select cache location based on the important of single node rather than that of entire group, which may result in inefficient problem caused by reduplicative impertinences. Therefore in this paper, we adopt group centrality especially Group Betweenness Centrality (GBC) to select cache locations. To evaluate its performance, we simulate CCN caching under different topologies, and the final results show that GBC-based scheme can provide better performance than others in term of average hop of content delivery.KeywordsCCNCacheGroup betweenness centrality"}, "conf/icc/ZhaoXGZ15": {"title": "A fluid model of multipath TCP algorithm: Fairness design with congestion balancing.", "url": "https://doi.org/10.1109/ICC.2015.7249436", "year": "2015", "author": {"Jia Zhao": "34/3125", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Multipath TCP (MP-TCP) algorithms are supposed to be fair to single-path TCP and utilize multiple paths to support high quality end-to-end services. Existing MP-TCP algorithms in literature are confronted with the problems: 1) MP-TCP can be excessively aggressive towards single-path TCP in their coexisting environments; 2) they sometimes fail to balance congestion on multiple paths; 3)their performance is prone to degradation under the circumstances of path heterogeneity, wireless network environments and bandwidth-intensive applications. In this paper, we propose a fluid-based MP-TCP algorithm to address the above problems. Our algorithm has a unique stable equilibrium and serves the design goals of fairness and congestion-balancing. Simulation results show that our algorithm achieves improvement of TCP-friendliness and window fluctuation performance in different scenarios."}, "conf/itnac/HanGQX15": {"title": "LB-VoIP: Enhancing access control of VoIP for secure networks.", "url": "https://doi.org/10.1109/ATNAC.2015.7366824", "year": "2015", "author": {"Bingjie Han": "148/9891", "Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Voice over IP (VoIP) has attracted the attention of secure networks for its convenient deployment, easy management and multi-service carrying capability. However, security is a big problem that must be considered if VoIP is introduced into secure networks. Traditional methods to deal with security problems in VoIP are usually adopting encryption algorithms, enhancing authentication mechanisms, introducing intrusion detection systems or firewalls and so on. But for secure networks, due to its different security requirements to the public networks, such as high controllability, aforementioned methods are inappropriate and not full-qualified. In this paper, we propose a label-based VoIP (LB-VoIP) to solve this problem by enhancing access control to voice service, terminals and voice data. Several experiments are also presented to prove the practicability of LB-VoIP."}, "conf/wcnc/ZhaoXGZ15": {"title": "AIMD-PQ: A path quality based TCP-friendly AIMD algorithm for multipath congestion control in heterogeneous wireless networks.", "url": "https://doi.org/10.1109/WCNC.2015.7127720", "year": "2015", "author": {"Jia Zhao": "34/3125", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Multipath congestion control algorithms are supposed to be friendly to traditional single-path TCP (SP-TCP). Existing multipath Additive Increase Multiplicative Decrease algorithms (MP-AIMD) for multipath TCP (MP-TCP) are confronted with the problems: 1) they are unfair to SP-TCP when the multiple available paths have heterogeneity, e.g. different RTT; 2) they all use packet losses as congestion signals and induce spurious backoffs on a wireless link with high error rate; 3) congestion window fluctuation reduces their potential to support smooth high-quality service such as multimedia applications. This paper proposes a path quality based multipath AIMD (AIMD-PQ) to tackle the above problems. We utilize the round trip time (RTT) on each sub-path to formulate the path quality estimation. AIMD-PQ balances the loads among its sub-paths, moves traffic off the most congested sub-path, and triggers Multiplicative Decrease by both packet loss and path quality signals. Simulation results show that AIMD-PQ improves both the TCP-friendliness and window fluctuation performance of MP-TCP in a heterogeneous wireless network environment."}, "conf/bmsb/ZhuXGZ14": {"title": "Spectrum auctions for multimedia streaming over mobile cognitive radio networks.", "url": "https://doi.org/10.1109/BMSB.2014.6873529", "year": "2014", "author": {"Junlong Zhu": "127/6367", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Cognitive radio technologies have been proposed as a promising communication paradigm to efficiently utilize the spectrum by dynamically accessing the temporally licensed spectrum in an opportunistic way. In secondary spectrum market, the primary user resell the idle spectrum to secondary users who are willing to pay some payment to primary user. Therefore, auction is a nature mechanism for allocating spectrum. Existing spectrum auction designs, fail to consider both the characteristics of multimedia data and the potential mobility of secondary users. In this paper, we investigate the problem of multimedia streaming communication over mobile cognitive radio networks. We consider both the characteristics of multimedia and the mobility of secondary users in cognitive radio networks. We consider a spectrum auction that enable exclusive channel bidding, while exclusive channel access is critical for the support of mobile wireless secondary users in mobile cognitive radio networks. Therefore, we propose a two dimensional auction by nature, allocation a channel either exclusively or non-exclusively. Simultaneously, we also give analysis of the proposed spectrum auction, and prove that the proposed algorithm can efficiently allocate the spectrum and achieve maximal social welfare."}, "conf/ccis/ZhangGQXZ14": {"title": "HFA: Novel naming and routing design for future Internet architecture.", "url": "https://doi.org/10.1109/CCIS.2014.7175730", "year": "2014", "author": {"Meng Zhang": "04/6901", "Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:The design of naming and routing scheme is an important research area for scalable future Internet infrastructure. Currently, existing naming and routing schemes such as hierarchical or flat structure have some individual drawbacks, which limit the development of future Internet greatly. In this paper, we make an in-depth study of existing naming and routing schemes for future Internet, and propose a naming scheme named HFA, which is built by a hybrid Hierarchical-Flat-Attributes structure. Based on this design, an efficient routing scheme using Trie and Hash Table is further proposed as the corresponding routing method. Experimental results show that the HFA has a good flexibility and superior performance with respective to purely hierarchical-based and flat-based naming scheme using our routing method in terms of routing aggregation, lookup time and memory consumption."}, "conf/ccis/GuanQXZ14": {"title": "The comparison and performance analysis of CCN under mobile environments.", "url": "https://doi.org/10.1109/CCIS.2014.7175745", "year": "2014", "author": {"Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:The booming of various Internet services and mobile smart terminals make the Internet paradigm shift from the traditional resource sharing to the content retrial and delivery, from host-centric to content-centric. The traditional Internet cannot satisfy the future requirements in terms of video retrieval and distribution, which spurs the researches of new network architectures such Content-Centric Networking (CCN). However, the mobility support especially the mobile provider is still an open issue with the increase of the mobile users. In this paper, we investigate the related work of mobility support of CCN in detail, and evaluate its performance under different mobile scenarios. The comparison results show that the mobile of CCN is similar to the mobile multicast, and it has good performance under the scenarios with the high content popularity and enough amounts of nodes, but needs to enhance the mobility support in the design for the high mobile scenarios."}, "conf/ccnc/ZhongX14": {"title": "DLCA: Distributed load balancing and VCR-aware two-tier P2P VoD system.", "url": "https://doi.org/10.1109/CCNC.2014.6866571", "year": "2014", "author": {"Lujie Zhong": "124/8701", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Dynamic characteristics of user interactivity make supporting VCR-like operations in peer-to-peer (P2P) Video on Demand (VoD) streaming systems very challenging. Recently, the prediction-based prefetching of hot segments scheme has emerged as a promising approach to improve user Quality of Experience. However, this prediction model uses a centralized server to collect and analyze the large volumes of user viewing logs for predicting user VCR behavior. This log server can easily become bottleneck in terms of data exchange and processing. In this paper, we propose a novel distributed load balancing and VCR-aware two-tier P2P VoD System (DLCA). DLCA relies on a two-tier architecture. In the low tier, the common nodes form a classic gossip-based unstructured network for normal data distribution. On the top layer, a portion of strong nodes establish a structured DHT network for VCR-related information analysis and publish. By employing a pattern mining algorithm, each strong mode maintains a prefetching routing table, which can effectively assist common nodes prefetching segments for VCR-like interactivity during playback. Simulation results show how DLCA outperforms a state of the art centralised method in terms of performance."}, "conf/ccnc/CaoXGZ14": {"title": "SCTP-C", "url": "https://doi.org/10.1109/CCNC.2014.6866576", "year": "2014", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Stream Control Transport Protocol (SCTP)-based multimedia streaming has gained variety of attentions and resulted in many peer-reviewed publications. However, there is no MAC-SCTP cross-layer path switching strategy appropriate for wireless networking, where wireless error tends to occur frequently due to the intrinsic wireless link characteristics. As a remedy, we in this paper propose a novel Cross-layer Cognitive SCTP (SCTP-C\n2\n) for efficient multimedia data delivery by jointly considering the characteristics of MAC layer and transport layer. A Cross-layer Path Switching Trigger (CPST) is designed in SCTP-C\n2\n to improve the efficiency of the path switching mechanism and further provide an optimal congestion window (cwnd) fast recovery scheme after path switching. A Congestion-aware Multimedia Data Distributor (CMDD) is introduced in SCTP-C\n2\n to overcome a \"hot-potato\" congestion problem and enable an optimal transmission behavior by identifying network congestion. The results gained by a close realistic simulation topology show that how SCTP-C\n2\n outperforms existing SCTP protocol in terms of consumers' experience of quality for multimedia streaming service."}, "conf/icc/LiuLWX14": {"title": "Large traffic flows classification method.", "url": "https://doi.org/10.1109/ICCW.2014.6881259", "year": "2014", "author": {"Qiong Liu": "20/718", "Zhen Liu 0017": "77/35-17", "Ruoyu Wang 0002": "127/9829-2", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:To Ensure QoE (quality of experience) to the users when they access so many Internet applications every day, ISPs are faced with challenge and opportunity in bandwidth management. They need some ways to identify each application's flows generated by user hosts, especially the application classes with large flows because of the higher bandwidth occupation comparing with the other classes with small flows. A novel method is presented to modularize flow size using information gain ratio. The origin dataset is properly partitioned into large flow and small flow subsets by a threshold that is achieved when the data complexity of large flow subset is minimized. The searching algorithm of the partitioned threshold is independent of classification performance. The specific classifiers can be trained to identify large flows and small flows properly on each subset in generalization. Experimental results on real world traffic datasets show that byte accuracy increased 30% averagely when our method is compared with original."}, "conf/icmcs/CaoXGZ14": {"title": "Receiver-driven SCTP-based multimedia streaming services in heterogeneous wireless networks.", "url": "https://doi.org/10.1109/ICME.2014.6890329", "year": "2014", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:The packet loss and handover tend to occur often in burst in heterogeneous wireless network. The Sender-based transport control mechanisms make current SCTP cannot provide an expected adaptive transmission rate adjustment and recovery strategy to ensure the users' quality of experience for multimedia streaming service due to the abrupt and frequent transmission rate fluctuation. Moreover, current SCTP solutions seldom consider balancing the overhead and sharing the load between the sender and receiver. In this paper, we propose a novel receiver-driven SCTP-based multimedia delivery solution which runs some important functions at receiver including: 1) appropriate sending rate estimation and advertisement, supported by a designed receiver-based sending rate estimator; and 2) primary path selection and fast recovery, enabled by a developed receiver-assisted path switch trigger. The simulation results show that how the proposed solution outperforms existing SCTP protocol in terms of multimedia delivery performance."}, "conf/iwcmc/ZhangXGWZZ14": {"title": "A smart hybrid routing protocol supporting multimedia delivery over mobile ad hoc networks.", "url": "https://doi.org/10.1109/IWCMC.2014.6906418", "year": "2014", "author": {"Mingchuan Zhang": "87/550", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Qingtao Wu": "71/4515", "Ruijuan Zheng": "28/6042", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Routing in mobile ad hoc networks (MANETs) is an extremely challenging issue due to the features of MANETs. In this paper, we present a novel bio-inspired hybrid routing protocol (B-iHRP) supporting multimedia delivery based on zone routing framework, ant colony optimization (ACO) and physarum autonomic optimization (PAO). B-iHRP divides network topology into a series of zones subjectively. Within a zone, the route table of central node is proactively maintained by perceptive ants which can sense link status metrics through cross-layer perception to assess the discovered routes. Among zones, perceptive ants are sent to reactively find routes to destinations as well as assess the discovered routes with the metrics by source nodes. Afterwards, B-iHRP uses PAO to select the optimal one from the found routes and optimize autonomically the local routes during the course of multi-zone communication sessions. Simulation results show how B-iHRP can achieve the effective performance compared to existing state-of-the-art algorithms."}, "conf/iwcmc/ZhangGXZ14": {"title": "A dynamic social content caching under user mobility pattern.", "url": "https://doi.org/10.1109/IWCMC.2014.6906514", "year": "2014", "author": {"Neng Zhang": "128/4245", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Online content propagation gives rise to tremendous data explosion and requires efficient management for a large amount of network resources, after next generation network service predomination. Especially in the age of social network, the way of content propagation and consumption has significantly changed from requesting to sharing. Since massive users are tending to influenced by the trends in social community and mainstream media, content caching becomes an effective method for providing better quality of service for such social relationships. A key challenge is traditional caching strategies cannot meet the dynamic variation in geo-social environments. In this paper, we propose a dynamic social content caching scheme with social user mobility. We employ a combination of cooperative filtering recommendation and cache update algorithm to effectively predict and manage cache updates. Simulation results show that our caching method over performs than classical caching methods that rely on the historical popularity prediction."}, "conf/networking/QuanXVGZG14": {"title": "TB2F: Tree-bitmap and bloom-filter for a scalable and efficient name lookup in Content-Centric Networking.", "url": "https://doi.org/10.1109/IFIPNetworking.2014.6857122", "year": "2014", "author": {"Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Athanasios V. Vasilakos": "40/4747", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:Content-Centric Networking (CCN) is an entirely novel networking paradigm, in which packet forwarding relies upon lookup operations on content names directly instead of fixed-length host addresses. The unique features of CCN names, i.e., variable length, huge cardinality, and hierarchical structure, introduce new challenges that could hinder the deployment of such a new architecture at the Internet scale. In this paper, we make an in-depth study of characteristics of large-scale CCN names, and propose a simple yet efficient CCN-customized name lookup engine (named by TB\n2\nF), which capitalizes the strengths of Tree-Bitmap (TB) and Bloom-Filter (BF) mechanisms, while counteracts their main limitations. To this end, TB2F splits CCN prefix into a constant size T-segment and a variable length B-segment with a relative short length, which are treated using TB and BF, respectively. Furthermore, an optimal length of the T-segment is found to improve the lookup efficiency. Experimental comparisons with respect to the reference Name Prefix-Trie and Bloom-Hash have been also carried out. The results show that TB\n2\n F properly configured has good scalability and efficiency by (i) speeding up lookup operations and reducing the false positive rate with respect to Bloom-Hash; (ii) requiring less memory than Name Prefix-Trie; (iii) achieving a low overhead in updating operations in the large scale case."}, "conf/trustcom/CaoGXQZ14": {"title": "Cognitive Adaptive Access-Control System for a Secure Locator/Identifier Separation Context.", "url": "https://doi.org/10.1109/TrustCom.2014.30", "year": "2014", "author": {"Yuanlong Cao": "121/0052", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Wei Quan 0001": "67/5376-1", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:As a promising solution to the scalability issue of the current routing infrastructure, locator/identifier separation has gained variety of attentions and resulted in thousands of peer-reviewed publications. However, there is still significant ongoing work addressing many challenges of the secure Locator/Identifier Separation Context (LISC). In this paper, we propose a novel Cognitive Adaptive Access-Control solution (CAAC) for a secure LISC with three modules, which are Tag-aware Access-Control module (TAC) that devotes to generate user tag (UTag) and service tag (STag) by cognizing their natural and dynamic attributes, Adaptive Policy Generation paradigm (APG) that serves to select proper policy instance for adaptive and intelligent access control, and Cooperative Decision Making module (CDM) that contributes to provide efficient decision-making by multi-peer parallel cooperation. We implement the designed CAAC in our identifier-based network platform to verify its advantages."}, "conf/wcnc/ZhangXGWZZ14": {"title": "B-iTRF: A novel bio-inspired trusted routing framework for wireless sensor networks.", "url": "https://doi.org/10.1109/WCNC.2014.6952678", "year": "2014", "author": {"Mingchuan Zhang": "87/550", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Qingtao Wu": "71/4515", "Ruijuan Zheng": "28/6042", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:In this paper, we present a novel bio-inspired trusted routing framework (B-iTRF) which composed of trust mechanism and routing strategy. For trust mechanism, B-iTRF monitors neighbors' behavior in real time and then assesses neighbors' trust value based on the priori knowledge. For routing strategy, each node finds routes to the Sink based on ant colony optimization. In the process of path finding, B-iTRF senses and calculates the metrics of the found routes to support the route selection. Moreover, B-iTRF also assesses the availability of route based on Physarum autonomic optimization to maintain the route table. Simulation results show that B-iTRF can achieve the effective performance compared to existing state-of-the-art algorithms."}, "conf/wcnc/LiXGZM14": {"title": "Efficient concurrent multipath transfer using network coding in wireless networks.", "url": "https://doi.org/10.1109/WCNC.2014.6952900", "year": "2014", "author": {"Zhuofeng Li": "154/3555", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Concurrent Multipath Transfer (CMT), enabled by Stream Control Transmission Protocol (SCTP), is considered as one preferred data-transport mode due to increased available bandwidth. However, CMT performance degrades seriously in terms of data reordering due to path dissimilarity and frequent packet loss from wireless unreliability. Most relevant solutions follow the packet sequence numbers and thereby focus on strict in-order reception and packet-specific retransmission. Passively adapting to the network conditions, those approaches are not general and well enough responding to the dynamicity of wireless environment. By applying Network Coding (NC) to CMT, this paper proposes a progressive end-to-end solution (CMT-NC) to those problems in heterogeneous wireless networks. CMT-NC is capable of avoiding reordering and compensating lost packets. Further, an innovative group-based transmission management mechanism enhances the robustness and reliability of data transfer. Simulation results show how by using CMT-NC significant improvements in comparison to another state-of-the-art solution are obtained."}, "conf/wcnc/CaoXGZ14": {"title": "TCP-friendly CMT-based multimedia distribution over multi-homed wireless networks.", "url": "https://doi.org/10.1109/WCNC.2014.6952966", "year": "2014", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:In this paper, we propose TCP-friendly CMT, a novel TCP-friendly Stream Control Transmission Protocol (SCTP)-based Concurrent Multipath Transfer (CMT) solution necessitating the following aims: (i) fairness to TCP flows, (ii) load sharing, and (iii) improve multimedia delivery performance. To satisfy the first requirement, a Weighted Moving congestion window (WM-cwnd) based Additive Increase and Multiplicative Decrease (AIMD)-enhanced congestion control mechanism is designed to make TCP-friendly CMT preserve fairness to TCP flows. A newly WM-cwnd-based data distribution algorithm is further introduced in TCP-friendly CMT to make proper load sharing and improve multimedia delivery performance. Finally, a proposal for saving energy is introduced. The simulation results show how the proposed TCP-friendly CMT solution improves the data delivery performance, as well as users' quality of experience for multimedia streaming service while still remaining fair to the competing TCP flows."}, "conf/wowmom/QuanXGZG14": {"title": "Social cooperation for information-centric multimedia streaming in highway VANETs.", "url": "https://doi.org/10.1109/WoWMoM.2014.6918992", "year": "2014", "author": {"Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:High-quality multimedia streaming services in Vehicular Ad-hoc Networks (VANETs) are severely hindered by intermittent host connectivity issues. The Information Centric Networking (ICN) paradigm could help solving this issue thanks to its new networking primitives driven by content names rather than host addresses. This unique feature, in fact, enables native support to mobility, in-network caching, nomadic networking, multicast, and efficient content dissemination. In this paper, we focus on exploring the potential social cooperation among vehicles in highways. An ICN-based COoperative Caching solution, namely ICoC, is proposed to improve the quality of experience (QoE) of multimedia streaming services. In particular, ICoC leverages two novel social cooperation schemes, namely partner-assisted and courier-assisted, to enhance information-centric caching. To validate its effectiveness, extensive ns-3 simulations have been executed, showing that ICoC achieves a considerable improvement in terms of start-up delay and playback freezing with respect to a state-of-the-art solution based on probabilistic caching."}, "conf/icct/ZhangQDGXZ13": {"title": "The fairness research of VANETs in Universal Network.", "url": "https://doi.org/10.1109/ICCT.2013.6820397", "year": "2013", "author": {"Chaogui Zhang": "131/2909", "Wei Quan 0001": "67/5376-1", "Yu Dai": "45/6861", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Vehicular Ad Hoc Networks (VANETs) offer great prospects for the future intelligent transportation system (ITS), which are receiving much attention thanks to the wide variety of services they can provide a lot of work and research around the globe is being conducted to define the standards for VANETs, which depend on the vehicles themselves to provide network functionality rather than the traditional fixed infrastructure. However, the reliability of VANETs is very challenging due to the high mobility of vehicles and intermittent connectivity among them. Universal Network is a new Internet architecture which can provide the better mobility support by splitting the identifier and location of traditional IP address. This paper makes a research of fairness of integrating VANETs in Un iversal Network, and proposes a novel merger mechanism which can provide flexible and safe services for consumers. What's more, extensive simulations show that the proposed scheme has a fair performance which verifies its reasonability and practicality."}, "conf/imis/GuanQXZ13": {"title": "The Stochastic Properties of Cognitive Networks under RD Mobility Model.", "url": "https://doi.org/10.1109/IMIS.2013.20", "year": "2013", "author": {"Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:The cognitive networks can increase the spectrum utilization efficiency by allowing the Secondary User (SU) to occupy the licensed frequency of primary user (PU). The movement of PU may leads to an intermittent end to end path for SU during the communications, which may affect the routing performance. So it is important to analyze SU's stochastic properties to optimize the routing design. The previous work in term of PU mobility mainly focuses on its impact on the spectrum sensing. While in this paper, we aim to study the PU mobility in term of routing design, and study the stochastic properties including the hitting time, meeting time, contact time and inter-contact time under the random direction mobility model by combining with the new features of the cognitive networks technologies. We derive the closed-form expressions for these properties and observe that the mobility will increase the spectrum occupancy time to improve the throughput of SU because mobile nodes are hard to encounter others, and we get that the routing design of cognitive networks should carefully choose the transmission range of SU to reduce the contact time and enlarge the hitting time and meeting time to improve the routing stability."}, "conf/imis/ZhangGXZ13": {"title": "TSS: A Primary User Mobility Model in Cognitive Internet.", "url": "https://doi.org/10.1109/IMIS.2013.99", "year": "2013", "author": {"Neng Zhang": "128/4245", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Realistic mobility models are important to understand the performance of routing protocols in Cognitive Internet (CI), especially when behaviors and activities of Primary User (PU) are taken into consideration. Currently, PU mobility models are commonly simplistic spectrum handoff or traditional mobility models that do not reflect realistic space-time characteristics in CI. Hence, the effect involved in PUs mobility should tightly integrated with spectrum available time and PUs appearance behavior. In this paper we propose a novel PU mobility model named TSS, combined with spectrum usage and spatio-temporal characteristics. In this model, we describe the PUs appearance behaviors that are visited often by the nodes to capture location visiting preferences, and spectrum available time with different mobility parameters to create periodical spectrum reuse of nodes at the same location. Lastly, we present numerical and simulation results that illustrate the performance evaluation of PU."}, "conf/vtc/CaoXGQZZ13": {"title": "Ant Colony Optimization Based Cross-Layer Bandwidth Aggregation Scheme for Efficient Data Delivery in Multi-Homed Wireless Networks.", "url": "https://doi.org/10.1109/VTCFall.2013.6692108", "year": "2013", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Jia Zhao": "34/3125", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Extension for the multi-homing feature of Stream Control Transport Protocol (SCTP), Concurrent Multipath Transfer (CMT) can achieve bandwidth aggregation by making use of parallel transmisson over selected paths. However, if CMT-based path selection depended solely upon the information provided by transport layer, it cannot really make the desired bandwidth aggregation. Motivated by the urgent needs of cross-layer bandwidth aggregation and the advances of Ant Colony Optimization (ACO) in network selection, this paper proposes a novel ACO based cross-layer bandwidth aggregation scheme for efficient Concurrent Multipath data Transfer (CMT-ACO) in wireless transmission. CMT-ACO provides an efficient data delivery with two modules, which are ACO-based Efficiency Aware model (ACO-EA) that devotes to sense paths' transmission efficiency(supported by a cross-layer factor) and reduce ``ping-pongquot; path switching (enabled by a stabilization factor), and ACO-based Bandwidth Aggregation scheme (ACO-BA) that contributes to provide a cross-layer optimal bandwidth aggregation scheme. The results gained by a close realistic simulation topology show that how CMT-ACO outperforms existing CMT protocol in terms of performance and quality of service in multi-homed SCTP-based wireless networks."}, "conf/vtc/ZhangXGZWZ13": {"title": "P-iRP: Physarum-Inspired Routing Protocol for Wireless Sensor Networks.", "url": "https://doi.org/10.1109/VTCFall.2013.6692365", "year": "2013", "author": {"Mingchuan Zhang": "87/550", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Ruijuan Zheng": "28/6042", "Qingtao Wu": "71/4515", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:There is a trade-off between routing efficiency and energy equilibrium for sensor nodes in wireless sensor networks (WSNs). Inspired by the large and single-celled amoeboid organism-slime mold physarum polycephalum, this paper presents a novel physarum-inspired routing protocol (P-iRP) for WSNs to address the above issue. In P-iRP, a sensor node selects its proper next hop by using a proposed physarum-inspired selecting next hop model (PSN), which considers comprehensively the distance, energy residue and location of the next hop. We introduce the PSN's routing selecting strategy and detail PiRP's algorithms. Simulation results show how P-iRP can achieve the effective trade-off between routing efficiency and energy equilibrium compared to existing classical algorithms."}, "conf/wcnc/QuanGXJZZ13": {"title": "Content retrieval model for information-center MANETs: 2-dimensional case.", "url": "https://doi.org/10.1109/WCNC.2013.6555290", "year": "2013", "author": {"Wei Quan 0001": "67/5376-1", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Shijie Jia": "51/10138", "Junlong Zhu": "127/6367", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Information-Centric Networking (ICN) is a clean-slate networking architecture that puts information is focus instead of addressed hosts. Construction of content retrieval model to estimate the delivery performance is challenging in this ICN-based Mobile Ad hoc Networks (MANETs). In this paper, we propose a novel content retrieval model (PRCRM) for Information-Centric MANETs (ICMs) in 2-dimensional case. By investigating the distribution of content popularity, receiver-driven mechanism, content caching and replacement mechanism and generalized mobility model in 2-dimensional space, PRCRM constructs a novel content retrieval model based on the content hit/miss probability to estimate the content retrieval-related performance. We evaluate PRCRM by comparing its performance with another state of the art solution in terms of RTT and throughput. Simulation results demonstrate PRCRM's rationality and validity and it is shown that PRCRM is available to analyze content retrieval in ICMs."}, "conf/wcnc/CaoXGZZ13": {"title": "Cross-layer cognitive CMT for efficient multimedia distribution over multi-homed wireless networks.", "url": "https://doi.org/10.1109/WCNC.2013.6555307", "year": "2013", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Jia Zhao": "34/3125", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:With feature of flows across multiple interfaces based on the multi-homing feature of Stream Control Transport Protocol (SCTP), Concurrent Multipath Transfer (CMT) has been regarded as a promising protocol for content-rich multimedia data delivery under stringent bandwidth, delay, and loss wireless environment. However, current CMT researches mostly pay attention to improve CMT protocol itself depended solely upon the information provided by transport layer. In this paper, we propose a novel MAC-SCTP based Cross-layer Cognitive CMT (CMT-CC) for efficient multimedia distribution in varying wireless transmission. A Cross-layer Quality Sense Model (CQSM) is designed in the CMT-CC to cognize the paths' quality and select candidate paths for multimedia content delivery. By condition-aware cognitive ability to distinguish the causes of transmission condition change, a further proposed Intelligent Multimedia Content Distributor (IMCD) makes adaptive multimedia delivery behaviors in compliance with real-time wireless condition. Results obtained by a close realistic simulation topology show how the CMT-CC outperforms existing CMT approach in terms of users' of quality of experience for multimedia streaming services."}, "conf/ccis/DaiGQXZ12": {"title": "PCA-based dimensionality reduction method for user information in Universal Network.", "url": "https://doi.org/10.1109/CCIS.2012.6664370", "year": "2012", "author": {"Yu Dai": "45/6861", "Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Universal Network (UN) is one kind of future Internet architecture. The collection and analysis of user information is a core in the management system of UN. However, users' high-dimensional data affects the performance greatly because it brings in a long response delay when matching user information with strategy rules. An efficient dimensionality reduction method is important to improve the matching efficiency on high-dimensional data. This paper introduces a statistic computational method based on Principal Component Analysis (PCA) for the reduction of user information. The method converts multiple indicators into fewer overall indicators by taking the advantage of the relations among attributes. Then, we apply this algorithm in the user information management system of UN and make several experiments to evaluate and analyze its performance. Experimental results show that the time of querying and matching is reduced by the proposed method on the condition of not losing much information of original attributes. It proves that this method reduces the dimension effectively and can be applied in the high-dimensionality user information management system."}, "conf/ccis/GuanQXZ12": {"title": "The location selection for CCN router based on the network centrality.", "url": "https://doi.org/10.1109/CCIS.2012.6664240", "year": "2012", "author": {"Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Content-Centric Network (CCN) as one of the well-known Information Center Network (ICN) solutions has been getting more and more research recently. Different to the traditional Internet which is designed to connect the different terminals, CCN mainly focuses on the content delivery by enhancing the cache function of routers. However, in case of the interworking between the CCN and traditional Internet, we should carefully select the locations of CCN routers so that all the end users can get the better performance. So in this paper, we propose an evaluation metric called average content acquirement time based on the complex network centralities including the degree centrality, closeness centrality, betweenness centrality and eigenvector centrality to selection the location to acquire the tradeoff between deployment cost and service performance. We evaluate the average content acquirement time under different network centralities, and the results shows that the betweenness centrality has the better performance than others, and it can be used as a metric to select the location of CCR routers."}, "conf/ccis/ZhaoJGXZ12": {"title": "A Service Identifier parsing mechanism for Universal Network based on BHO.", "url": "https://doi.org/10.1109/CCIS.2012.6664271", "year": "2012", "author": {"Futao Zhao": "131/0665", "Shijie Jia": "51/10138", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:In Universal Network, SID (Service Identifier) is the unique description for service or resource without any locator messages, which is different from URL (Universal Resource Locator) on the Internet. The SID parsing mechanism plays the most important role in Universal Network. In this paper, we propose a SID Parsing mechanism (SIDP) by making use of BHO plug-in to parse SIDs into corresponding CID (Connection Identifier). By collecting the SIDs required from the Internet Explorer browser in Windows OS, SIDP parses the SIDs into corresponding CIDs so as to access service or obtain resource for users. Experimental results show that SIDP system can easily and accurately parse SID into CID and will efficiently reduce the load of server especially to some popular services and resources."}, "conf/ccis/GuanXQZ12": {"title": "The hitting times analysis of cognitive user in Cognitive Internet under random direction mobility model.", "url": "https://doi.org/10.1109/CCIS.2012.6664274", "year": "2012", "author": {"Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Wei Quan 0001": "67/5376-1", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:The Cognitive Internet as a new Internet architecture with cognition capability was proposed based on the cognitive radio technology and new network architecture. Cognitive Internet has two kinds of users called Cognitive Users (CUs) and Primary Users (PUs). The CUs can occupy the frequency of PUs when they are absent. As a result, the activities of CUs may have an important impact on the PUs. So in this paper, we model the movement behavior of CU under the random direction mobility model, and analyze its expected hitting time between CU and PU to evaluate its potential impact. Besides, we simulate the mobility of CU to acquire the expected hitting times, and compare it with the analytical results. The final results show that the analytical results can fit with the simulation results."}, "conf/ccis/JiaXGZ12": {"title": "A MP2P-based VoD solution for supporting VCR-like operations in MANETs.", "url": "https://doi.org/10.1109/CCIS.2012.6664278", "year": "2012", "author": {"Shijie Jia": "51/10138", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Mobile Peer-to-Peer (MP2P) network is a promising avenue for large-scale deployment of Video-on-Demand (VoD) applications over mobile ad-hoc networks (MANETs). In P2P VoD systems, fast search for resources is key determinants for improving the Quality of Service (QoS) due to the low delay of seeking resources caused by streaming interactivity. In this paper, we propose a MP2P-based VoD (MPV) solution for efficient video resource sharing in MANETs. By estimating the popularity of video chunks and association level between chunks, MPV divides the chunks into two types: “overlay router” chunk and ordinary chunk and builds the “virtual connection” between them. MPV chooses a node for each “overlay router” chunk as “overlay router” to provide the service of seeking resource for overlay nodes. Thorough simulation results also show how MPV achieves lower average end-to-end delay, lower packet loss ratio and higher network throughput in comparison with another state of the art solution."}, "conf/ccis/QuanGCXZ12": {"title": "M-Label: A naming scheme for services in future networks.", "url": "https://doi.org/10.1109/CCIS.2012.6664284", "year": "2012", "author": {"Wei Quan 0001": "67/5376-1", "Jianfeng Guan": "47/6455", "Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Future networks will care more about the services and contents, and will support revolutionary services. Thus, naming scheme for services becomes a core technology for realizing future networks. This paper proposes a naming scheme for services in future networks, named by M-Label. M-Label has three features: it adopts user-friendly name; it describes the attribute information of content in the name from different dimensions; and it is unstructured, has a good scalability. Based on this naming scheme, we implement our content aware services management system and check the usability in the platform of Universal Network. The result shows that M-Label has a high scalability and can be used for a huge number of services or contents in future networks."}, "conf/globecom/GuanQXZZ12": {"title": "The multicast service model for Next Generation Internet based on Identifier/Locator Separation.", "url": "https://doi.org/10.1109/GLOCOMW.2012.6477712", "year": "2012", "author": {"Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Huachun Zhou": "95/796", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:The traditional multicast service is based on the host group model, which transmits the packets to a set of receivers with a single destination address. In this model, anyone can send or receive the multicast packets once it joins the multicast group. As a result, the multicast service is difficult to deploy due to the lack of effective authentication and accounting mechanisms. The recent development of the new Internet architecture based on the Identifier/Locator Separation mechanisms brings a promising opportunity to improve the multicast service model. In this paper, we propose a Multicast service model based on Identifier/Locator Separation (MILS) mechanism. This model introduces Multicast Service Identifier (MSI) and Multicast Group Identifier (MGI) to identify the multicast membership and the multicast delivery. Besides, it utilizes Multicast Controller (MC) to maintain the mapping between MSI and MGI to provide the authentication and accounting functions, so as to satisfy the different requirements of multicast services. We evaluate its performance by simulations, and analyze its scalability in terms of the group number and session density. The results show that the MILS can reduce the multicast states and improve the performance of multicast services."}, "conf/globecom/QuanGJZXZ12": {"title": "A content retrieval model for Information Centric MANETs: 1-dimensional case.", "url": "https://doi.org/10.1109/GLOCOMW.2012.6477715", "year": "2012", "author": {"Wei Quan 0001": "67/5376-1", "Jianfeng Guan": "47/6455", "Shijie Jia": "51/10138", "Junlong Zhu": "127/6367", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Information-Centric Networking (ICN) focuses on content retrieval by replacing host-based addressing with content-based addressing. However, in MANETs, content retrieval is faced with significant challenges for nodes' high mobility. Information-Centric MANETs (ICMs) are expected to provide benefits, and there are great significance and challenges for realistically modeling content retrieval in ICMs. In this paper, we design an analytical model of content retrieval for ICMs in 1-dimensional case, which considers the nodes mobility, natures of wireless environment and caching in-networking features in ICN. Our model extracts many considerations in a pervasive methodology composed of three basic objects: locations, nodes, and contents. And closed-form expressions for throughput and delay are derived based on the hit/miss probabilities at the mobile nodes. Several simulation experiments are conducted to check the reliability of proposed model. Overall, the results show that this model can be chosen to guide further research and evaluation of optimized ICMs in the future."}, "conf/globecom/ZhangGXZ12": {"title": "The Stable Routing Protocol for the Cognitive Network.", "url": "https://doi.org/10.1109/GLOCOMW.2012.6477730", "year": "2012", "author": {"Yidan Zhang": "11/8540", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Cognitive Network is one of the most prevailing development directions in the future network, prominent in enhancing the utilization of the network resource. Although the research on routing mechanism in Cognitive Network arises more attention in the recent years, the current mechanism provides limited methods for ameliorating the instability performance caused by the mobility of the Cognitive Radio Users. In this paper, we propose the Stable Routing Protocol (SRP), with Link Availability Prediction mechanism at the same time concerning the link quality and the traffic load for the nodes. SRP enables the Available Prediction mechanism for predicting the link available time and SRP prefers the link with longer available time. The longer link available time, the more stable the link is. In SRP, the senders broadcast the data packets in the medium, but the forwarders with longer available time, better link quality and light load possess the priority to relay the packets. Each sender in SRP tries to push the packet closer to the destination. The evaluation indicates that SRP performs better in terms of throughput and the end-to-end delay."}, "conf/imis/GuanXWZZ12": {"title": "ILSRO: Identifier/Location Split-Based Route Optimization for PMIPv6.", "url": "https://doi.org/10.1109/IMIS.2012.65", "year": "2012", "author": {"Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Kai Wang 0014": "78/2022-14", "Huachun Zhou": "95/796", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:As a network-based mobility management solution, Proxy Mobile IPv6 (PMIPv6) has been adopted by IETF, 3GPP and WiMAX to complement the host-based approach. In PMIPv6, the Local Mobility Anchor (LMA) is introduced to perform the mobility management and data forwarding, thus achieving the transparent mobility support. However, it results in the sub optimal routing path and single node failure. To realize the optimal routing and separate the forwarding function from the LMA, several routing optimization solutions have been proposed, but most of them are based on the MIPv6 built-in route optimization mechanism or MAGs tunnel, which incurs the additional overhead. In this paper, we propose a PMIPv6 route optimization solution based on the Identify/Location Split mechanism. Especially, in the proposed solution, a Location Identifier (LID) is assigned to each mobile node and mapped to its Home Network Prefix (HNP) to accomplish the optimal routing and reduce the additional tunnel overhead. The analytical results show that the proposed scheme is better than other schemes in terms of signaling cost, delivery cost and LMA service blocking probability."}, "conf/imis/GuanYXZZ12": {"title": "Survey on Route Optimization Schemes for Proxy Mobile IPv6.", "url": "https://doi.org/10.1109/IMIS.2012.64", "year": "2012", "author": {"Jianfeng Guan": "47/6455", "Ilsun You": "75/3854", "Changqiao Xu": "51/4906", "Huachun Zhou": "95/796", "Hongke Zhang": "09/5441"}, "abstract": " Abstract:Proxy Mobile IPv6 (PMIPv6) is being considered as a promising mobility support protocol in the next-generation mobile network, thanks to its simplicity. However, since the basic specification of PMIPv6 was developed, several extensions to PMIPv6 are still being developed in the IETF. In this paper, we present a survey on route optimization (RO) schemes proposed to improve the performance of packet transmission during the PMIPv6 RO development at the IETF. Qualitative analysis of the RO schemes are provided. Then, we also describe remaining chanllenges and issues."}, "conf/wcnc/LiX09": {"title": "Joint channel assignment and routing in real time wireless mesh network.", "url": "https://doi.org/10.1109/WCNC.2009.4917767", "year": "2009", "author": {"Xiaoguang Li": "46/1349", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:The aggregate capacity of wireless mesh networks can be increased by the use of multiple channels. In this paper, we present the joint channel assignment implementation for multi- interface and multi-channel wireless network. To reap the full performance potential of this architecture, we propose and evaluate a combination of centralized and dynamic peer oriented distribution channel assignment, and enhanced AODV routing algorithms for real time multi-channel wireless mesh networks. Simulation results show that with joint channel assignment, equipping every wireless mesh network node with different interfaces operating on different channels can improve the total network performance and make the most of traffics by finding more routes with enhanced AODV."}, "conf/wcnc/XuFQMLH09": {"title": "Performance evaluation of distributing real-time video over concurrent multipath.", "url": "https://doi.org/10.1109/WCNC.2009.4917895", "year": "2009", "author": {"Changqiao Xu": "51/4906", "Enda Fallon": "80/5549", "Yuansong Qiao": "07/1610", "Gabriel-Miro Muntean": "81/2584", "Xiaoguang Li": "46/1349", "Austin Hanley": "63/1143"}, "abstract": " Abstract:Recent research on concurrent multipath transfer (CMT) and CMT with a potentially-failed destination state (CMT-PF) uses the transport layer multi-homing protocol stream control transmission protocol (SCTP) to increase application throughput by distributing transmitted data across multiple end-to-end paths. This paper investigates and evaluates the performance of CMT with partial reliability (CMT-PR) and CMT-PF with partial reliability (CMT-PF-PR), novel extensions of SCTP for real-time video distribution. The Evalvid-CMT platform was implemented in the University of Delaware's SCTP/CMT ns-2 module to perform emulation experiments in order to compare CMT and CMT-PR, CMT-PF and CMT-PF- PR, respectively. The results presented in the paper show how the CMT-PR and CMT-PF-PR outperform CMT and CMT-PF respectively. Consequently the former are suggested as strategies for real-time video concurrent multipath transmissions."}, "conf/icc/XuMFH08": {"title": "A Balanced Tree-Based Strategy for Unstructured Media Distribution in P2P Networks.", "url": "https://doi.org/10.1109/ICC.2008.345", "year": "2008", "author": {"Changqiao Xu": "51/4906", "Gabriel-Miro Muntean": "81/2584", "Enda Fallon": "80/5549", "Austin Hanley": "63/1143"}, "abstract": " Abstract:Most research on P2P multimedia streaming assumes that users access video content sequentially and passively. Unlike P2P live streaming in which the peers start playback from the current point of streaming when they join the streaming session, in P2P video-on-demand streaming VCR-like operations such as forward, backward, and random-seek have to be supported. Providing this level of interactive streaming service in a P2P environment is a significant challenge. This paper proposes a balanced binary tree-based strategy for unstructured video-on- demand distribution in P2P networks (BBTU). BBTU assumes videos can be divided into several segments which can be fetched from different peers. BBTU involves two steps: 1) balance binary tree construction based on a prefetching algorithm in order to support interactivity; 2) unstructured video dissemination over network based on gossip protocol, which is the overlay for video distribution. Analysis and simulation show how BBTU is an efficient interactive streaming solution in P2P environment."}, "conf/icmcs/LiXZW08": {"title": "Optimal Prefix Caching and Data Sharing strategy.", "url": "https://doi.org/10.1109/ICME.2008.4607472", "year": "2008", "author": {"Kaihui Li": "59/6390", "Changqiao Xu": "51/4906", "Yuanhai Zhang": "84/2149", "Zhimei Wu": "89/3439"}, "abstract": " Abstract:It requires an enormous amount of media server and network resources for on-demand delivery of video objects to a large number of clients with high start-up latency and packet loss ratio. An effective solution is to deploy a streaming proxy server close to client to cache media streaming data. In this paper, we propose an integral and scalable data sharing scheme, Optimal Prefix Caching and Data Sharing (OPC-DS), which combines prefix caching and interval caching in the proxy cache. In OPC-DS, the sizes of the appropriate prefix cache and interval cache are calculated according to the current request distribution. It can reduce the average start-up delay experienced by users as well as assure that the major of requests can share the data in the proxy buffer. So, utility of the proxy resources can be improved, and the resources consumption can be reduced significantly for the media server and back-bone network bandwidth by using it. Experimentally comparing with several existing methods, OPC-DS achieves significant performance improvement."}, "conf/icmcs/XuMFL08": {"title": "DONet-VoD: A hybrid overlay solution for efficient peer-to-peer video on demand services.", "url": "https://doi.org/10.1109/ICME.2008.4607516", "year": "2008", "author": {"Changqiao Xu": "51/4906", "Gabriel-Miro Muntean": "81/2584", "Enda Fallon": "80/5549", "Xiaoguang Li": "46/1349"}, "abstract": " Abstract:The existing DONet-based approach uses successfully a random gossip algorithm for scalable live video streaming. This pure mesh overlay network-based solution may lead to unacceptable latency or even failure of VCR operations in video-on-demand (VoD) services where nodes usually have different playing offsets, across a wide range. This paper proposes DONet-VoD which enhances DONet in order to address issues related to VoD delivery and VCR operations. In DONet-VoD, DONet principle is employed for the video distribution over the overlay network and a novel algorithm which uses a multi-way tree structure and extra prefetching buffers at the nodes is proposed to support efficient VoD operations. Video segments are prefetched and stored in a distributed manner in the nodespsila prefetching buffer along the tree. The cooperation between DONet-based video delivery and the tree-located multimedia components enable multimedia streaming interactive commands to be performed efficiently. This paper presents and discusses the prefetching scheme, details the cooperation procedure, and then analyses the performance of the proposed DONet-VoD."}, "conf/icmcs/LiZXW08": {"title": "Buffer sharing and smoothing scheme of VBR streams.", "url": "https://doi.org/10.1109/ICME.2008.4607704", "year": "2008", "author": {"Kaihui Li": "59/6390", "Yuanhai Zhang": "84/2149", "Changqiao Xu": "51/4906", "Zhimei Wu": "89/3439"}, "abstract": " Abstract:It requires an enormous amount of server and network bandwidth resources for providing real-time video streams to a large number of clients. And when using variable-bit-rate (VBR) encoded streams, frequent traffic bursts of bit rate have high variability for resource requirements. In this paper, we propose a smoothing of prefix caching and data sharing (S-PCDS) scheme based on the proxy caching, which can assist in smoothing operation for VBR encoded streams and reduce the start-up delay of users, through caching video prefix in the proxy. It can share the data in the buffer of proxy through interval caching which size is determined dynamically according to the current request distribution. With S-PCDS, the peak requirements of the resources can be reduced for VBR stream, the major of requests can share the data in the buffer, utility of the resource can be improved for the proxy, and the resource consumption can be minimized for the media server and back-bone network bandwidth. These are proved by comparing with several existing methods experimentally."}, "conf/globecom/ZhangXHLX07": {"title": "Joint Sender/Receiver Rate Control Algorithm for Scalable Video Streaming.", "url": "https://doi.org/10.1109/GLOCOM.2007.392", "year": "2007", "author": {"Yuanhai Zhang": "84/2149", "Jin Xu": "97/3265", "Wei Huangfu": "49/3036", "Kaihui Li": "59/6390", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:In this paper we firstly improve a virtual network buffer model (VB), based on which we propose a joint sender/receiver rate control algorithm for scalable video streaming. A transmission rate is determined by a rate control algorithm at the sender which employs the program clock reference (PCR) embedded in the video streams to work in a refined way. An over-boundary playback rate adjustment mechanism based on proportional-integral (PI) controller is performed at the receiver to maximize the visual quality of the displayed video according to the receiver buffer occupancy. Simulation results show that our proposed algorithm can reduce the overflow and underflow of the sender and receiver buffer, and achieve better video quality and quality smoothness than traditional rate control algorithms."}, "conf/icmcs/LiZXX07": {"title": "Dynamic Memory Allocation and Data Sharing Schedule in Media Server.", "url": "https://doi.org/10.1109/ICME.2007.4284589", "year": "2007", "author": {"Kaihui Li": "59/6390", "Yuanhai Zhang": "84/2149", "Jin Xu": "97/3265", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Most of the existing buffer allocation and sharing schemes can not make full use of the system resources while being implemented independently. Here, based on analysis of the existing schemes, we propose a new algorithm, Balanced Buffer Sharing of Limited Resource (BBSLR), which allocates resources for each request according to the available cache and disk bandwidth, and adjusts buffer size according to the current request distribution and available resources dynamically. It does a good job of managing resources to maximize the number of simultaneous clients and enhance start-up delay. With BBSLR, the resources consumption will be balanced by rational allocation of the available resources, the average start-up delay will be reduced by caching the data at start and more clients will be served consequently. These conclusions are proved by comparing with several existing methods experimentally."}, "conf/icmcs/LiXXZ07": {"title": "An Efficient and Scalable Smoothing Algorithm of VBR Streams.", "url": "https://doi.org/10.1109/ICME.2007.4284632", "year": "2007", "author": {"Kaihui Li": "59/6390", "Changqiao Xu": "51/4906", "Jin Xu": "97/3265", "Yuanhai Zhang": "84/2149"}, "abstract": " Abstract:In order to obtain better video quality, media files are required to use variable-bit-rate (VBR) encoding. However, it produces traffic burst and unbalanced resource utilizations to translate VBR-encoded video. In this paper, we propose a novel bandwidth smoothing algorithm, buffer sharing and bandwidth smoothing of VBR streams (BSBS-VBR), which combines with prefetching and interval caching, allows video server to transmit a VBR-encoded stream at a fixed rate and makes users to share a disk stream. BSBS-VBR can also allocate and adjust buffer size dynamically according to the current request distribution and available resources. It can reduce the peak requirements of disk bandwidth and network bandwidth, improve utility of the resources, and serve more users by using this algorithm. These conclusions are proved by comparing with several existing methods experimentally."}, "conf/icmcs/ZhangHXLX07": {"title": "Integrated Rate Control and Buffer Management for Scalable Video Streaming.", "url": "https://doi.org/10.1109/ICME.2007.4284633", "year": "2007", "author": {"Yuanhai Zhang": "84/2149", "Wei Huangfu": "49/3036", "Jin Xu": "97/3265", "Kaihui Li": "59/6390", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:In this paper we present a video communication scheme that integrates rate control and buffer management at the source. A transmission rate is obtained via a rate control algorithm, which employs the Program Clock References (PCR) embedded in the video streams to regulate the transmission rate in a refined way and thus reduce the client buffer requirement. The server side also maintains multiple buffers to trade off random loss for controlled loss of visually less important data. We test our system with Standard Definition Television (SDTV) and High Definition Television (HDTV) traces, and find that the proposed scheme serves best for the transmission by slowing down the transmission rate without higher buffer requirement in both cases."}, "conf/mm/ZhangHLX07": {"title": "A refined rate allocation scheme with adaptive playback adjustment for robust hd video stream transmission.", "url": "https://doi.org/10.1145/1291233.1291365", "year": "2007", "author": {"Yuanhai Zhang": "84/2149", "Wei Huangfu": "49/3036", "Kaihui Li": "59/6390", "Changqiao Xu": "51/4906"}, "abstract": "\n\t\tIn this paper, we present a practical end-to-end video transmission system with refined rate allocation at the server and adaptive playback adjustment at the client that enables High Definition (HD) video streaming via bandwidth-constraint IP network. A transmission rate is determined by a rate control algorithm which employs the Program Clock References (PCR) embedded in the video streams to regulate the transmission rate in a refined way and thus reduce the client buffer requirement. An over-boundary playback adjustment mechanism based on Proportional-Integra (PI) controller is performed at the receiver to maximize the visual quality of the displayed video according to the receiver buffer occupancy. We test our system with Standard Definition Television (SDTV) and High Definition Television (HDTV) traces, and find that our proposed algorithm can reduce overflow and underflow of sender and receiver buffer, and achieve better video quality and quality smoothness than traditional rate control algorithms.\n\t"}, "journals/ett/Xu22": {"title": "Designing and planning of energy efficient sustainable cities and societies: A smart energy.", "url": "https://doi.org/10.1002/ett.4460", "year": "2022", "author": {"Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ett/Xu22a": {"title": "Enabling technologies for future mobile and edge networks.", "url": "https://doi.org/10.1002/ett.4481", "year": "2022", "author": {"Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ett/Xu22b": {"title": "Enabling AI technologies for Internet of Energy.", "url": "https://doi.org/10.1002/ett.4488", "year": "2022", "author": {"Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ett/Xu22c": {"title": "Designing and planning of energy efficient sustainable cities and societies: A smart energy.", "url": "https://doi.org/10.1002/ett.4538", "year": "2022", "author": {"Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ett/CaoZXSYX22": {"title": "Credible and economic multimedia service optimization based on game theoretic in hybrid cloud networks.", "url": "https://doi.org/10.1002/ett.3779", "year": "2022", "author": {"Tengfei Cao": "224/0908", "Lujie Zhong": "124/8701", "Han Xiao": "98/627", "Chengru Song": "144/1365", "Shujie Yang": "78/10624", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ett/Xu22d": {"title": "Context aware mobility in Internet of Things enabling technologies, applications, and challenges.", "url": "https://doi.org/10.1002/ett.4624", "year": "2022", "author": {"Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ett/Xu22e": {"title": "Intelligent resource management in cloud computing and networking.", "url": "https://doi.org/10.1002/ett.4625", "year": "2022", "author": {"Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ijis/MaXYHKTG22": {"title": "An intelligent proactive defense against the client-side DNS cache poisoning attack via self-checking deep reinforcement learning.", "url": "https://doi.org/10.1002/int.22934", "year": "2022", "author": {"Tengchao Ma": "245/4704", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Yiting Huang": "319/7758", "Xiaohui Kuang": "18/1267", "Hong Tang": "00/2111", "Luigi Alfredo Grieco": "23/4819"}, "abstract": ""}, "journals/jsac/XiaoXFDYZLM22": {"title": "A Transcoding-Enabled 360° VR Video Caching and Delivery Framework for Edge-Enhanced Next-Generation Wireless Networks.", "url": "https://doi.org/10.1109/JSAC.2022.3145813", "year": "2022", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Zichen Feng": "309/9987", "Renjie Ding": "91/1057", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Jie Liang": "51/239", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Virtual reality (VR) content, including 360° panoramic video, provides users with an immersive multimedia experience and therefore attracts increasing research and development attention. However, the requirement of high bandwidth and low latency of virtual reality service demand puts forward greater challenges to the current infrastructure, especially mobile networks. Inspired by the sharable nature of virtual reality content tiles, we further considered the potential opportunities for computing, caching, and multicast to address the challenges of transmission of panoramic content. This paper proposes a novel transcoding-enabled VR video caching and delivery framework for edge-enhanced next-generation wireless networks. Firstly, an edge cooperative caching scheme based on multi-agent reinforcement learning is introduced to improve the utilization efficiency of computing and storage resources, and then reduce service delay. Second, a two-tier NOMA-based base station-multicast group matching mechanism is designed to solve the collaboration challenge during the edge delivery process. A series of experiments have demonstrated the advantages of the proposed scheme in terms of cache hit rate, latency and other aspects in comparison with alternative approaches."}, "journals/twc/XiaoXMYZM22": {"title": "Edge Intelligence: A Computational Task Offloading Scheme for Dependent IoT Application.", "url": "https://doi.org/10.1109/TWC.2022.3156905", "year": "2022", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Yunxiao Ma": "46/1709", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Computational offloading, as an effective way to extend the capability of resource-limited edge devices in Internet of Things (IoT), is considered as a promising emerging paradigm for coping with delay-sensitive services. However, on one hand, applications commonly include several subtasks with dependent relations and on the other hand, the dynamic changes in network environments make offloading decision-making become a coupling and complex NP-hard problem, difficult to address. This paper proposes an intelligent Computational Offloading scheme for Dependent IoT Application (\nCODIA\n), which decouples the performance enhancement problem into two processes: scheduling and offloading. First, a prioritized scheduling strategy is designed and its complexity is analyzed. Then, an offloading algorithm with offline training and online deployment is introduced. Due to the temporal continuity between subtasks, the dependency relation is transformed into a transition of device state, and the overhead for the whole application is considered to be the long-term benefit. \nCODIA\n leverages an Actor-Critic-based solution, where the IoT devices are able to deploy intelligent models and dynamically adjust the offloading strategy to achieve low latency, while controlling energy consumption. Finally, a series of experiments are conducted to verify the robustness and efficiency of the proposed solution in terms of convergence, latency, and energy consumption."}, "journals/iotj/XuZKZY21": {"title": "Context-Aware Adaptive Route Mutation Scheme: A Reinforcement Learning Approach.", "url": "https://doi.org/10.1109/JIOT.2021.3065680", "year": "2021", "author": {"Changqiao Xu": "51/4906", "Tao Zhang 0063": "15/4777-63", "Xiaohui Kuang": "18/1267", "Zan Zhou 0001": "203/3329", "Shui Yu": "90/3575"}, "abstract": " Abstract:Moving target defense (MTD) is an emerging proactive defense technology, which can reduce the risk of vulnerabilities exploited by attacker. As a crucial component of MTD, route mutation (RM) faces a few fundamental problems defending against sophisticated Distributed-Denial of Service (DDoS) attacks: 1) it is unable to make optimal mutation selection due to insufficient learning in attack behaviors and 2) because network situation is time varying, RM also lacks self-adaptation in mutation parameters. In this article, we propose a context-aware Q-learning algorithm for RM (CQ-RM) that can learn attack strategies to optimize the selection of mutated routes. We first integrate four representative attack strategies into a unified mathematical model and formalize multiple network constraints. Then, taking above network constraints into considerations, we model RM process as a Markov decision process (MDP). To look for the optimal policy of MDP, we develop a context estimation mechanism and further propose the CQ-RM scheme, which can adjust learning rate and mutation period adaptively. Correspondingly, the optimal convergence of CQ-RM is proved theoretically. Finally, extensive experimental results highlight the effectiveness of our method compared to representative solutions."}, "journals/jnca/HaoXYZM21": {"title": "Multicast-aware optimization for resource allocation with edge computing and caching.", "url": "https://doi.org/10.1016/j.jnca.2021.103195", "year": "2021", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "Mobile edge computing (MEC) is rising as a key technology for computation-intensive and delay-sensitive applications. Many works have focused on MEC, but most of them only consider unicast scenarios, and ignore multicast issues. The reason is that MEC aiming at personalized computing of users conflicts with multicast which demands the same data stream. This makes MEC and multicast seem inconsistent. However, in fact, there will be lots of services, whose computation process is different but the result may be same (e.g. media push), which can greatly benefit from multicast over MEC and make the combination of multicast and MEC meaningful. In this paper, we first consider challenges and propose multicast-aware resource allocation for MEC, which jointly optimizes computing and caching in multicast scenarios. We formulate the problem by considering user request, network communication, service caching and service computing. But this model is knotty because it is an optimization problem with mixed discrete and continuous variables. Besides its optimization objective is the average value over a long time. Considering the complexity, we first transform the problem into an online optimization, which jointly minimizes the average time delay and energy consumption, by stochastic optimization. Then we separate the discrete variables and continuous variable, and decompose the problem into two subproblems. By solving subproblems, an efficient online algorithm called MA-ECC is proposed. Finally, we compare it with other three baseline methods, and result shows that MA-ECC can effectively reduce service latency while still keeping energy consumption low."}, "journals/tbc/ZhongXCYYM21": {"title": "Joint Optimal Multicast Scheduling and Caching for Improved Performance and Energy Saving in Wireless Heterogeneous Networks.", "url": "https://doi.org/10.1109/TBC.2020.3028354", "year": "2021", "author": {"Lujie Zhong": "124/8701", "Changqiao Xu": "51/4906", "Jiewei Chen": "261/2815", "Weiqi Yan": "287/2866", "Shujie Yang": "78/10624", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Base station caching and multicast are two promising methods to support mass content delivery in future wireless network environments. However, existing scheduling designs do not take full advantage of the two methods. This article focuses on employing multicast scheduling and caching in a network architecture which involves both macro cell base stations (MBS) and small cell base stations (SBS) in order to achieve joint optimization of average delay and power consumption. We describe this co-optimization problem as the Multicast-Aware Caching Scheduling Problem (MACSP). This article proposes a novel pending request queue model, which aims to solve the problem of long waiting time for non-popular content, and transform this collaborative multicast-cache scheduling problem into a Markov Decision Process that can be solved using reinforcement learning methods. For actual deployment, the paper further introduces a Distributed Policy Gradient algorithm (DPG) with similar performance and lower complexity. The simulation-based testing results demonstrate that our model and algorithm have better performance and lower energy consumption than existing state-of-the-art approaches."}, "journals/tcsv/ChenXWWZG21": {"title": "Augmented Queue-Based Transmission and Transcoding Optimization for Livecast Services Based on Cloud-Edge-Crowd Integration.", "url": "https://doi.org/10.1109/TCSVT.2020.3047859", "year": "2021", "author": {"Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Zhonghui Wu": "279/4587", "Lujie Zhong": "124/8701", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:Nowadays, amateur broadcasters can massively generate video contents and stream them across the Internet. For this reason, crowdsourced livecast services (CLS) are attracting millions of users around the world. To provide a smooth and high-quality playback experience to viewers with diversified device configurations in dynamic network conditions, CLS providers have to find a way to deploy cost-effective transcoding operations by distributing the computation-intensive workload among Cloud, Edge, and Crowd. In addition, it is necessary to control transcoded streams from million broadcasters to worldwide viewers. To address these challenges, we propose a novel stochastic approach that jointly optimizes the usage of transmission resources (\ne.g.\n, bandwidth), and transcoding resources (\ne.g.\n, CPU) in CLS systems that leverage the cooperation of Cloud, Edge, and Crowd technologies. In particular, we first design an augmented queue structure that can jointly capture the dynamic features of data transmission and online transcoding, based on the virtual queue technology. Then, we formulate a joint resource allocation problem, using stochastic optimization arguments, and devise an Accelerated Gradient Optimization (AGO) algorithm to solve the optimization problem in a scalable way. Moreover, we provide four main theoretical results that characterize the algorithm’s steady-state queue-length, optimality, and fast-convergence. By conducting both numerical simulations and system-level evaluations based on our prototype, we demonstrate that our solution provides lower system costs and higher QoE performance against state-of-the-art solutions."}, "journals/tetci/XuZW21": {"title": "Decentralized Online Learning Methods Based on Weight-Balancing Over Time-Varying Digraphs.", "url": "https://doi.org/10.1109/TETCI.2018.2880771", "year": "2021", "author": {"Changqiao Xu": "51/4906", "Junlong Zhu": "127/6367", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:This paper considers decentralized online optimization problems over a graph, where the allocated objective function of each agent is revealed over time and is only known for the corresponding agent in hindsight. Moreover, the graph is directed and time varying. In order to solve the problem, a decentralized stochastic subgradient online learning method is proposed over time-varying digraphs. However, the directed graph could generate an asymmetric weight matrix, which is not doubly stochastic matrix. To overcome this difficulty, we employ a weight-balancing technique. By choosing appropriate learning rates, we show that our proposed method can achieve logarithmic regret under strong convexity. Moreover, under convexity, the square-root regret can also be achieved. In addition, numerical simulations in sensor networks for solving the online distributed estimation problem illustrate the theoretical results."}, "journals/tii/WangXCZWW21": {"title": "BC-Mobile Device Cloud: A Blockchain-Based Decentralized Truthful Framework for Mobile Device Cloud.", "url": "https://doi.org/10.1109/TII.2020.2983209", "year": "2021", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Xingyan Chen": "211/5842", "Lujie Zhong": "124/8701", "Zhonghui Wu": "279/4587", "Dapeng Oliver Wu": "88/1600"}, "abstract": ""}, "journals/tsc/XuZLGY21": {"title": "DP-LTOD: Differential Privacy Latent Trajectory Community Discovering Services over Location-Based Social Networks.", "url": "https://doi.org/10.1109/TSC.2018.2855740", "year": "2021", "author": {"Changqiao Xu": "51/4906", "Liang Zhu": "85/20", "Yang Liu 0038": "51/3710-38", "Jianfeng Guan": "47/6455", "Shui Yu": "90/3575"}, "abstract": " Abstract:Community detection for Location-based Social Networks (LBSNs) has been received great attention mainly in the field of large-scale Wireless Communication Networks. In this paper, we present a Differential Privacy Latent Trajectory cOmmunity Discovering (DP-LTOD) scheme, which obfuscates original trajectory sequences into differential privacy-guaranteed trajectory sequences for trajectory privacy-preserving, and discovers latent trajectory communities through clustering the uploaded trajectory sequences. Different with traditional trajectory privacy-preserving methods, we first partition original trajectory sequence into different segments. Then, the suitable locations and segments are selected to constitute obfuscated trajectory sequence. Specifically, we formulate the trajectory obfuscation problem to select an optimal trajectory sequence which has the smallest difference with original trajectory sequence. In order to prevent privacy leakage, we add Laplace noise and exponential noise to the outputs during the stages of location obfuscation matrix generation and trajectory sequence function generation, respectively. Through formal privacy analysis, we prove that DP-LTOD scheme can guarantee ϵ-differential private. Moreover, we develop a trajectory clustering algorithm to classify the trajectories into different kinds of clusters according to semantic distance and geographical distance. Extensive experiments on two real-world datasets illustrate that our DP-LTOD scheme can not only discover latent trajectory communities, but also protect user privacy from leaking."}, "journals/tvt/YuanFZNLWX21": {"title": "Spatio-Temporal Power Optimization for MIMO Joint Communication and Radio Sensing Systems With Training Overhead.", "url": "https://doi.org/10.1109/TVT.2020.3046438", "year": "2021", "author": {"Xin Yuan 0004": "78/713-4", "Zhiyong Feng 0001": "48/195-1", "J. Andrew Zhang": "07/314-a", "Wei Ni 0001": "31/2597-1", "Ren Ping Liu": "70/4241", "Zhiqing Wei": "25/11052", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:In this paper, we study optimal spatio-temporal power mask design to maximize mutual information (MI) for a joint communication and (radio) sensing (JCAS, a.k.a., radar-communication) multi-input multi-output (MIMO) downlink system. We consider a typical packet-based signal structure which includes training and data symbols. We first derive the conditional MI for both sensing and communication under correlated channels by considering the training overhead and channel estimation error (CEE). Then, we derive a lower bound for the CEE and optimize the energy arrangement between the training and data signals to minimize the CEE. Based on the optimal energy arrangement, we provide optimal spatio-temporal power mask design for three scenarios, including maximizing MI for communication only and for sensing only, and maximizing a weighted sum MI for both communication and sensing. Extensive simulations validate the effectiveness of the proposed designs."}, "journals/access/ZhangJMX20": {"title": "Social-Aware D2D Video Delivery Method Based on Mobility Similarity Measurement in 5G Ultra-Dense Network.", "url": "https://doi.org/10.1109/ACCESS.2020.2980865", "year": "2020", "author": {"Ruiling Zhang": "64/675", "Shijie Jia 0002": "51/10138-2", "Youzhong Ma": "121/4132", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:The huge amounts of network traffic generated by the ultra-high-definition video playback of super-large-scale video users results in tremendous pressure for front-haul and back-haul in the 5G network, which brings severely negative influence for the large-scale deployment and scalability of video systems and video delivery performance (e.g. transmission delay and packet loss) related to user quality of experience. The direct D2D communications between mobile devices with adjacent position in geographical area can offloading huge video traffic into the underlying networks, which reduces load of cellular base station in the edge networks and relieves traffic pressure in the core networks. In this paper, we propose a novel Social-Aware D2D Video Delivery Method based on Rapid Sample-Efficient Measurement of Mobility Similarity in 5G Ultra-Dense Network (DMSEM). By investigation for one-hop D2D pair relationship, DMSEM builds a social state transition model of user movement, which makes use of encounter duration and shared video length between encountered users to define the state transition condition. A cluster algorithm of encounter events is proposed, which achieves initial clusters of encounter events by calculating similarity between encounter events from the two aspects of both variation rate of geographical distance between mobile users and encounter duration time. DMSEM makes use of the Fuzzy C-Means to refine the initial clusters and extracts encounter patterns of mobile users. DMSEM designs a sample-efficiency rapid recognition algorithm of encounter pattern, which can use small number of encounter distance samples to achieve fast heuristic recognition of encounter pattern. Extensive tests show how DMSEM achieves better results in comparison with other state-of-the-art solutions in terms of packet loss rate, average freeze time, cache utilization, average bitrate, buffer level and control overhead."}, "journals/cm/ZhouKSZX20": {"title": "Endogenous Security Defense against Deductive Attack: When Artificial Intelligence Meets Active Defense for Online Service.", "url": "https://doi.org/10.1109/MCOM.001.1900367", "year": "2020", "author": {"Zan Zhou 0001": "203/3329", "Xiaohui Kuang": "18/1267", "Limin Sun": "37/4705", "Lujie Zhong": "124/8701", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Existing static defenses for online service systems can be fragile and costly due to the continuity of ubiquitous cyber attacks. LAD has become a promising technology to tackle this problem. However, the security of the defense mechanism itself is often neglected as LAD mainly focuses on fortifying the protected target. This would allow a new deductive attack to encroach on LADs by inferring and undermining defense strategy, and then the whole defense mechanism can be completely invalidated once for all. Such a problem leads to the urgent need to develop new defense technologies with self-protection capability. In this article, we propose a new endogenous security defense mechanism named LSSM. To the best of our knowledge, this is the first work to provide a systematic defense structure with endogenous security to resist deductive attacks. We first review the existing learning-enhanced active defense mechanisms and compare their pros and cons. Then the methodology of LSSM is illustrated targeting two major threats posed by deductive attacks. Experimental results highlight the performance of our method. Finally, we conclude this article with a discussion of several future directions for LADs."}, "journals/jnca/WangXCZM20": {"title": "Decentralized asynchronous optimization for dynamic adaptive multimedia streaming over information centric networking.", "url": "https://doi.org/10.1016/j.jnca.2020.102574", "year": "2020", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Xingyan Chen": "211/5842", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "By the envision of combing smooth viewing experience with high-efficiency content distribution, dynamic adaptive streaming (DAS) over information-centric networking (ICN) is becoming a promising trend for the future video services. However, optimizations of DAS flow transmission control and rate adaptation need to be revisited for better adopting the ICN with multicast, multi-rate forwarding and decentralized framework. In this paper, we propose a decentralized asynchronous method for ICN-DAS. We first formulate the problem as a two-stage optimization, wherein the first stage's objective is to optimize the transmission rate within network capacity constraints, and the second is adapting the video bitrate for the long-term viewing utility. A distributed asynchronous optimization algorithm (DAOA) is then proposed for solving the two-stage problem iteratively by a novel distributed switching mirror descent and virtual queue-based iterations. Analytic results including convergence, computation complexity and time-varying adaptation are provided to validate theoretically the DAOA's performance. Simulation-based testing has also been conducted for evaluating DAOA's performance and assess its viewing experience, in comparison with state-of-the-art solutions."}, "journals/tbc/YangXZSM20": {"title": "A QoE-Driven Multicast Strategy With Segment Routing - A Novel Multimedia Traffic Engineering Paradigm.", "url": "https://doi.org/10.1109/TBC.2019.2932338", "year": "2020", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Lujie Zhong": "124/8701", "Jiahao Shen": "249/6524", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Quality of Experience (QoE) reflects end users' overall experience and feeling with network services, but needs support in terms of end-to-end Quality of Service (QoS). Segment routing (SR) as a new routing paradigm can provide good end-to-end QoS guarantee, making traditional multimedia traffic routing more efficient and scalable. In this paper, we address two problems related to the new SR mechanism: enabling fine-grained end-to-end QoS routing under a complex network environment and constructing the multicast routing tree with branch node load balancing. To solve these problems, an Inaccurate information-based QoE-driven Routing algorithm (IQdR) and a Branch-aware Multicast Tree (BaMT) algorithm were proposed. Simulation test results that have compared the performance of our proposed solution against that of other algorithms show that the previous works were outperformed. Additionally, the results also show that our multicast architecture improves the scalability of the network in terms of the number of flows."}, "journals/tgcn/HaoXZW20": {"title": "Stochastic Cooperative Optimization for Multicast Scheduling in Heterogeneous and Green 5G Networks.", "url": "https://doi.org/10.1109/TGCN.2020.2981459", "year": "2020", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Lujie Zhong": "124/8701", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:Multicast is able to satisfy multiple identical requests by a multicast stream, which can effectively reduce network energy consumption and service delay. Combined with edge caching, multicast can fully exploit its advantages and is becoming one of the most promising technologies to realize tremendous data transmission in 5G networks. As an important theme of multicast technology, multicast scheduling has attracted extensive attention. However, most of them only consider the scheduling in a single base station and ignore the different delay requirement of services. In this paper, we consider cooperative multicast scheduling between multiple base stations in cache-enabled 5G networks, aiming to satisfy user demands while minimizing energy consumption. We propose a novel pending request queue model related to delay requirement, based on which we formulate the cooperative multicast scheduling problem. Then we transform the problem into Lyapunov stochastic optimization and propose an on-line centralized algorithm to obtain the optimal strategy. Considering some scenarios where global information is unavailable, we further propose a distributed algorithm which has close performance but much lower complexity. Extensive simulations have been conducted to verify that our algorithms have better performance than several state-of-art algorithms, including both energy consumption and service delay."}, "journals/tnsm/CaoXDLXGZN20": {"title": "Reliable and Efficient Multimedia Service Optimization for Edge Computing-Based 5G Networks: Game Theoretic Approaches.", "url": "https://doi.org/10.1109/TNSM.2020.2993886", "year": "2020", "author": {"Tengfei Cao": "224/0908", "Changqiao Xu": "51/4906", "Junping Du": "13/1151", "Yawen Li": "30/4774", "Han Xiao": "98/627", "Changhui Gong": "247/9178", "Lujie Zhong": "124/8701", "Dusit Niyato": "76/440"}, "abstract": " Abstract:The edge computing-based 5G networks have the advantages in efficiently offloading the large-scale Internet traffic, which is considered to be a promising architecture to alleviate the conflict between transmission performance and quality of experience (QoE). However, due to the unreliability of service providers and the mutual interference between wireless channels in 5G networks, it is still difficult for existing solutions to provide satisfactory multimedia services for mobile users. In response to these crucial challenges, this paper proposes a reliable and efficient multimedia service optimization framework named “REMSO” hereby, including a two-stage joint optimization procedure. Specifically, a reliable video service mechanism is first constructed to help the mobile users distinguish the credible and economic service BSs. Afterwards, an efficient wireless resource allocation strategy is established to achieve low latency and energy efficient video service optimization. In particular, the Stackelberg and potential game models are leveraged to achieve these optimization objectives. Finally, extensive simulations corroborate that our REMSO framework can deliver prominent performance advantages in terms of the reliability and efficiency when comparing with the state-of-the-art solutions."}, "journals/ton/ZhaoLWXGX20": {"title": "Measurement, Analysis, and Enhancement of Multipath TCP Energy Efficiency for Datacenters.", "url": "https://doi.org/10.1109/TNET.2019.2950908", "year": "2020", "author": {"Jia Zhao": "34/3125", "Jiangchuan Liu": "l/JiangchuanLiu", "Haiyang Wang": "22/3326", "Chi Xu": "34/117", "Wei Gong 0001": "11/3249-1", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Multipath TCP (MPTCP) has recently been suggested as a promising transport protocol to boost the utilization of underlaying datacenter networks, yet it also increases the host CPU power consumption. It remains unclear whether datacenters can indeed benefit from using MPTCP from the perspective of energy efficiency. Through realworld measurement of MPTCP, we show that the energy efficiency of MPTCP is largely related to the flow completion time and the existence of link-sharing subflows. In particular, we find that the link-sharing subflows in MPTCP will significantly elevate the CPUs' power consumption on hosts. To make the matter worse, it will also reduce the transmission efficiency for both throughput-sensitive long flows and latency-sensitive short flows. To address such a problem, we present MPTCP-D, an energy-efficient enhancement of MPTCP in datacenter networks. MPTCP-D incorporates a novel congestion control algorithm that improves energy efficiency by minimizing the flow completion time. It also has a build-in subflow elimination mechanism that precludes link-sharing subflows from increasing the host CPU power consumption. We implement MPTCP-D in the Linux kernel, analyze the parameter selection in the algorithm and study its performance through packet-level simulation and on Amazon EC2. Our results show that, without degrading the performance of the long flow throughput and the short flow completion time, MPTCP-D reduces the long flow energy consumption by up to 72% compared to DCTCP for data transfers, and reduces the short flow power consumption by up to 46% compared to MPTCP with link-sharing subflows."}, "journals/tvt/YuanFNWLX20": {"title": "Connectivity of UAV Swarms in 3D Spherical Spaces Under (Un)Intentional Ground Interference.", "url": "https://doi.org/10.1109/TVT.2020.2994944", "year": "2020", "author": {"Xin Yuan 0004": "78/713-4", "Zhiyong Feng 0001": "48/195-1", "Wei Ni 0001": "31/2597-1", "Zhiqing Wei": "25/11052", "Ren Ping Liu": "70/4241", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:This paper analyzes the wireless connectivity of an Unmanned Aerial Vehicle (UAV) swarm in the presence of (un)intentional external interference from the ground. Different from existing studies, the swarm UAVs fly independently around a given three-dimensional (3D) location and are all within a 3D spherical space. Closed-form bounds are delivered for the average outage probability of a UAV from its nearest neighbor in the swarm, and the density of the swarm, which allows the swarm to operate uninterruptedly in the presence of the interference. Our analysis involves closed-form approximations of the instantaneous outage probability of a UAV from its nearest neighbor by using the first-order Marcum Q-function and the zero-th order modified Bessel function of the first kind. The analysis also involves applying Jensen's inequality to the instantaneous outage probability to bound the average outage probability and the density of the swarm. Corroborated by simulations, our analysis is accurate, and useful to evaluate the impact of external interference on the connectivity of UAV swarms. Interesting insights are shed on the connectivity and coverage of the UAV swarm."}, "journals/tvt/GaoXZQZM20": {"title": "GCH-MV: Game-Enhanced Compensation Handover Scheme for Multipath TCP in 6G Software Defined Vehicular Networks.", "url": "https://doi.org/10.1109/TVT.2020.3042987", "year": "2020", "author": {"Kai Gao": "12/4000", "Changqiao Xu": "51/4906", "Ping Zhang 0003": "77/2428-3", "Jiuren Qin": "203/3456", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The latest developments in terms of self-driving technologies have increased the demand for high quality data transmission in vehicular networks. However, frequent handovers among the Road Side Units (RSUs) cause degradation of data transmission performance, especially in the context of high-speed mobility. In order to address this problem, a novel game-enhanced compensation handover scheme (GCH-MV) for multipath TCP in 6G software defined vehicular networks is proposed. An innovative system architecture which integrates 6G communication solutions, SDN and multipath techniques is presented. GCH-MV redesigns the fluid model of Multipath TCP (MPTCP) to compensate for the declining throughput by using multiple paths. GCH-MV transfers traffic quickly between different paths, adapting the transmission to path quality and maintain high throughput. In addition, an innovative game-based optimal candidate RSU selection algorithm, employed by GCH-MV during the handover process, is also introduced. GCH-MV uses these solutions to achieve its goal to mitigate the negative impact of handover as much as possible and make the handover process smooth and transparent. Experimental results show how GCH-MV outperforms the existing solutions in terms of several quality of service (QoS) metrics, addressing efficiently the data transfer quality problem during handover in highly mobile vehicular networks."}, "journals/iotj/YangXQW19": {"title": "Diffusion Kalman Filter With Quantized Information Exchange in Distributed Mobile Crowdsensing.", "url": "https://doi.org/10.1109/JIOT.2018.2881542", "year": "2019", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Xuesong Qiu 0001": "13/342", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:With the explosion of smart devices and the gradual maturation of mobile systems, mobile crowdsensing (MCS) is playing more and more important roles in our daily life. In traditional MCS with a centralized framework, participants directly send perceived information to the task provider alone. This framework greatly increases the burden of cloud-based servers and cannot make full use of the increasing computation and storage capabilities of Internet of Things devices. To offload the computing and storage burden from traditional MCS architecture, a distributed MCS architecture was proposed in this paper, in which participants exchange sensing information with each other rather than forward it to central servers to complete a task together. Then, a diffusion Kalman filtering algorithm with quantized information exchange (QDKF) was proposed to solve the dynamic real-time estimate problem and limited communication resources in distributed MCS, where nodes exchange their quantized observations with neighbors to reduce the consumption of computing and storage resources. To prove the convergence and stability of the QDKF algorithm, an in-depth analysis of the algorithm uncertainty was reported to completely characterize the proposed solution. Moreover, the proposed algorithm achieves a superior performance by simulation."}, "journals/iotj/WangXCHZW19": {"title": "Design of Multipath Transmission Control for Information-Centric Internet of Things: A Distributed Stochastic Optimization Framework.", "url": "https://doi.org/10.1109/JIOT.2019.2929263", "year": "2019", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Xingyan Chen": "211/5842", "Hao Hao": "96/10637", "Lujie Zhong": "124/8701", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:Information-centric networking (ICN) is of high interest to the Internet of Things (IoT) community, since the dissemination of massive data continuously produced by IoT devices can be easily handled by ICN's data naming scheme and inherent multipath delivery. Providing optimal multipath-oriented transmission control is crucial for ICN-IoT data delivery, but yet remains challenging because of the randomness of request arrival, dynamic link condition, and on-path caching. More prominently, the resource limitation and scalability issues in IoT require the control scheme to be lightweight and distributed. In this paper, we propose a distributed stochastic optimization framework for multipath transmission control in ICN-IoT. The transmission control, including request scheduling and data rate regulation, is formulated as a stochastic concave optimization problem, which aims to accommodate the randomness, unpredictability, and multipath delivery of ICN-IoT and maximize the overall throughput. This problem is linearly separated into two subproblems: 1) a request scheduling problem and 2) a data rate control problem, which can be individually solved per time slot. A distributed alternating descent method (DADM) is designed to optimally control the transmission by solving the aforementioned problems at client sides. DADM enables each client to sequentially update the request schedule and rate regulation via communicating the links and providers they use, which asymptotically converges to optimality while allowing low-complexity and decentralized implementation. Validated by simulations, our DADM significantly improves throughput, delay reduction, and energy efficiency, in comparison with other state-of-the-art solutions."}, "journals/tmm/WangXCHZY19": {"title": "Differential Privacy Oriented Distributed Online Learning for Mobile Social Video Prefetching.", "url": "https://doi.org/10.1109/TMM.2019.2892561", "year": "2019", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Xingyan Chen": "211/5842", "Hao Hao": "96/10637", "Lujie Zhong": "124/8701", "Shui Yu": "90/3575"}, "abstract": " Abstract:The ever fast growing mobile social video traffic has motivated the urgent requirement of alleviating backbone pressures while ensuring the user-quality experience. Mobile video prefetching previously caches the future accessed videos at the edge, which has become a promising solution for traffic offloading and delay reduction. However, providing high performance prefetching still remains problematic in the presence of high dynamic mobile users' viewing behaviors and consecutive generated video content. Besides, given the fact that making prefetching decision requires viewing history that is sensitive, the increasing privacy issues should also be considered. In this paper, we propose a differential privacy oriented distributed online learning method for mobile social video prefetching (DPDL-SVP). Through a large-scale data analysis based on one of the most popular online social network sites, WeiBo.cn, we reveal that users' viewing behaviors have strong a relation with video preference, content popularity, and social interactions. We then formulate the prefetching problem as an online convex optimization based on these three factors. Furthermore, the problem is divided into two subproblems, and we implement a distributed algorithm separately to solve them with differential privacy. The performance bound of the proposed online algorithms is also theoretically proved. We conduct a series simulation based on real viewing traces to evaluate the performance of DPDL-SVP. Evaluation results show how our proposed algorithms achieve superior performance in terms of the prediction accuracy, delay reduction, and scalability."}, "journals/tmm/JiangXGLM19": {"title": "Stochastic Analysis of DASH-Based Video Service in High-Speed Railway Networks.", "url": "https://doi.org/10.1109/TMM.2018.2881095", "year": "2019", "author": {"Zhongbai Jiang": "166/6020", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The latest increasing popularity of high-speed railways (HSR) has stimulated growing demands for wireless Internet services in HSR networks, especially for video streaming. However, due to the high variability and unpredictability of wireless communications in HSR networks, it is still difficult for the existing solutions to provide high-quality video streaming services to HSR passengers. This paper addresses this crucial problem first by reporting on field experiments performed to investigate the characteristics of HSR networks. Then the paper formulates an intractable optimization problem for dynamic adaptive streaming over HTTP (DASH)-enabling service in HSR networks considering various factors, including packet loss, energy consumption, video service quality, etc. By leveraging Lyapunov optimization approaches, the formulated optimization problem is transformed into a queue stability problem which is of high scalability and generality. Moreover, in order to overcome the intractability of the initial optimization problem, the queue stability problem is further decomposed into three subproblems which can be easily solved individually. Finally, a novel joint stochastic DASH optimization (JSDO) mechanism consisting of three algorithms for the derived subproblems is proposed. Rigorous theoretical analyses and realistic dataset-based simulations demonstrate the effectiveness of the proposed JSDO mechanism."}, "journals/tomccap/CaoXWJCZG19": {"title": "Stochastic Optimization for Green Multimedia Services in Dense 5G Networks.", "url": "https://doi.org/10.1145/3328996", "year": "2019", "author": {"Tengfei Cao": "224/0908", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Zhongbai Jiang": "166/6020", "Xingyan Chen": "211/5842", "Lujie Zhong": "124/8701", "Luigi Alfredo Grieco": "23/4819"}, "abstract": "The manyfold capacity magnification promised by dense 5G networks will make possible the provisioning of broadband multimedia services, including virtual reality, augmented reality, and mobile immersive video, to name a few. These new applications will coexist with classic ones and contribute to the exponential growth of multimedia services in mobile networks. At the same time, the different requirements of past and old services pose new challenges to the effective usage of 5G resources. In response to these challenges, a novel Stochastic Optimization framework for Green Multimedia Services named SOGMS is proposed herein that targets the maximization of system throughput and the minimization of energy consumption in data delivery. In particular, Lyapunov optimization is leveraged to face this optimization objective, which is formulated and decomposed into three tractable subproblems. For each subproblem, a distinct algorithm is conceived, namely quality of experience--based admission control, cooperative resource allocation, and multimedia services scheduling. Finally, extensive simulations are carried out to evaluate the proposed method against state-of-art solutions in dense 5G networks."}, "journals/tvt/JiangXGN19": {"title": "Stochastic Profit Maximization of Service Provider in Millimeter-Wave High-Speed Railway Networks.", "url": "https://doi.org/10.1109/TVT.2019.2904292", "year": "2019", "author": {"Zhongbai Jiang": "166/6020", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Dusit Niyato": "76/440"}, "abstract": " Abstract:We study the problem of profit maximization for service providers using a newly emerged business model in millimeter-wave (mmWave) high-speed railway (HSR) networks. In such business model, a service provider purchases data transmission resource from a network operator with a low price. Then, mobile users only need to pay for requested services provided by the service provider. To optimize the profit of service provider, the profit analysis and optimization framework tailored toward the new business model and mmWave HSR networks is developed. This framework consists of three main components including admission control, transmission control, and resource purchasing control. To obtain optimal policies for these components, a stochastic profit optimization problem is formulated while taking into account differentiated service quality requirements, wireless transmission capacity, and network system stability. Then, the formulated problem is solved by using stochastic network optimization theory and stochastic profit maximization mechanism (SPMM) is established. An extensive performance evaluation of SPMM is conducted in order to demonstrate its superiority."}, "journals/ett/YangQXGLX18": {"title": "GDSoC: Green dynamic self-optimizing content caching in ICN-based 5G network.", "url": "https://doi.org/10.1002/ett.3221", "year": "2018", "author": {"Shujie Yang": "78/10624", "Xuesong Qiu 0001": "13/342", "Haiyong Xie 0001": "30/6562", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/fcsc/WangXJM18": {"title": "Video streaming distribution over mobile Internet: a survey.", "url": "https://doi.org/10.1007/s11704-018-7153-6", "year": "2018", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Shijie Jia 0002": "51/10138-2", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "In recent times, mobile Internet has witnessed the explosive growth of video applications, embracing user-generated content, Internet Protocol television (IPTV), live streaming, video-on-demand, video conferencing, and FaceTime-like video communications. The exponential rise of video traffic and dynamic user behaviors have proved to be a major challenge to video resource sharing and delivery in the mobile environment. In this article, we present a survey of state-of-the-art video distribution solutions over the Internet. We first discuss the challenges of mobile peer-to-peer (MP2P)-based solutions and categorize them into two groups. We discuss the design idea, characteristics, and drawbacks of solutions in each group. We also give a review for solutions of video transmission in wireless heterogeneous networks. Furthermore, we summarize the information-centric networking (ICN)-based video solutions in terms of in-network caching and name-based routing. Finally, we outline the open issues for mobile video systems that require further studies."}, "journals/itl/ZhouQZGLX18": {"title": "Differential privacy-guaranteed trajectory community identification over vehicle ad-hoc networks.", "url": "https://doi.org/10.1002/itl2.9", "year": "2018", "author": {"Zan Zhou 0001": "203/3329", "Yuansong Qiao": "07/1610", "Liang Zhu": "85/20", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/sj/ChaoZXL18": {"title": "Guest Editorial Special Issue on Visual Signal Applications Over Networks.", "url": "https://doi.org/10.1109/JSYST.2017.2783462", "year": "2018", "author": {"Han-Chieh Chao": "c/HanChiehChao", "Liang Zhou 0002": "81/4761-2", "Changqiao Xu": "51/4906", "Pascal Lorenz": "l/PascalLorenz"}, "abstract": " Abstract:Recent development of visual computing technology and wireless communications brought into focus a new paradigm of image/video signal processing via wireless channels. The information explosion of daily release for new image/video from network requires intelligent computing scheme to handle such massive data. At the same time, with the emergence of smart phones and continued growth of laptops and tablets, there is a huge increase in a number of mobile devices able to support new visual signal applications. However, conveying visual information to mobile devices over cellular or mobile broadband networks confronts many challenges, such as limited channel bandwidth; constrained computational and energy resources; high required quality and reliability; tight latency requirements; or insecure, time varying, and unplanned operating environments. This Special Issue is aiming at providing a platform to bring the new developments and original work, as well as possible emerging techniques with a potential to further improve the performance, or to lead to new solutions, algorithms or applications. This Special Issue has received a large number of submissions from an open Calls for Papers that covered all topics of visual applications system. Only 13 papers have finally been selected after a careful and highly competitive review process. These papers are briefly summarized."}, "journals/tcsv/XuQZG18": {"title": "GrIMS: Green Information-Centric Multimedia Streaming Framework in Vehicular Ad Hoc Networks.", "url": "https://doi.org/10.1109/TCSVT.2016.2607764", "year": "2018", "author": {"Changqiao Xu": "51/4906", "Wei Quan 0001": "67/5376-1", "Hongke Zhang": "09/5441", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:Information-centric networking (ICN), as a novel network paradigm, is expected to natively support mobility, multicast, and multihoming in vehicular ad hoc networks (VANETs). In this paper, the adoption of ICN principles for multimedia streaming in multihomed VANETs is investigated, with a major emphasis on the tradeoff between the quality of experience and energy efficiency (EnE). To formalize this problem, a cost optimization model is first proposed, based on queueing theory arguments. Then, a novel green information-centric multimedia streaming (GrIMS) framework is designed to drive the system toward optimal working points in practical settings. GrIMS consists of three enhanced mechanisms for on-demand cloud-based processing, adaptive multipath transmission, and cooperative in-network caching. Finally, a massive simulation campaign has been carried out, demonstrating that, thanks to its core components, the GrIMS enables flexible multimedia service provisioning and achieves an improved performance in terms of start-up delay, playbacks continuity, and EnE with respect to state-of-the-art solutions."}, "journals/tmc/XuWCZG18": {"title": "Optimal Information Centric Caching in 5G Device-to-Device Communications.", "url": "https://doi.org/10.1109/TMC.2018.2794970", "year": "2018", "author": {"Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Xingyan Chen": "211/5842", "Lujie Zhong": "124/8701", "Luigi Alfredo Grieco": "23/4819"}, "abstract": " Abstract:Device-to-Device (D2D) communications are a prominent feature of 5G systems, introduced to provide a native support to distributed services in mobile environments. D2D technologies enable straight interactions between mobile terminals without a compulsory involvement of base stations. In this manuscript, we study and propose an optimized caching strategy to content distribution on top of D2D technology, based on Information Centric Networking (ICN) principles. The rationale is that ICN architectures can provide seamless support to mobile services and decouple contents from node identifiers, thus providing a promising match with D2D requirements. To this end, a novel fluid-based model in proposed hereby that catches the interplay between ICN functionalities, D2D requirements, and 5G specifications. Then, based on this model, an optimal content replication problem is formulated, encompassing caching overhead and system load. Additionally, this problem is thoroughly analyzed to prove that it has an optimal solution with time threshold form. A practical algorithm ς*-OCP is further proposed in order to implement the optimal caching control in realistic environments. Finally, a massive simulation campaign is carried out to test the proposed algorithm in comparison to state-of-the-art solutions."}, "journals/tsipn/ZhuXGW18": {"title": "Differentially Private Distributed Online Algorithms Over Time-Varying Directed Networks.", "url": "https://doi.org/10.1109/TSIPN.2018.2797806", "year": "2018", "author": {"Junlong Zhu": "127/6367", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:We consider a private distributed online optimization problem where a set of agents aim to minimize the sum of locally convex cost functions while each desires that the local cost function of individual agent is kept differentially private. To solve such problem, we propose differentially private distributed stochastic subgradient online optimization algorithm over time-varying directed networks. We use differential privacy to preserve the privacy of participating agents. We show that our algorithm preserves differential privacy and achieves logarithmic expected regret under locally strong convexity. Moreover, we also show that square-root expected regret is obtained under local convexity. Furthermore, we reveal the tradeoff between the privacy level and the performance of our algorithm."}, "journals/cn/LiuXZLGZ17": {"title": "Incentive mechanism for computation offloading using edge computing: A Stackelberg game approach.", "url": "https://doi.org/10.1016/j.comnet.2017.03.015", "year": "2017", "author": {"Yang Liu 0038": "51/3710-38", "Changqiao Xu": "51/4906", "Yufeng Zhan": "173/1777", "Zhixin Liu 0001": "06/5185-1", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": "IoT-based services benefit from cloud which offers a virtually unlimited capabilities, such as storage, processing, and communication. However, the challenges are still open for mobile users to receive computation from the cloud with satisfied quality-of-service (QoS) provisioning. In this paper, we study computation offloading by using edge computing, which is a new paradigm to deliver computation to the edge of pervasive networks nearby mobile users. Without strong incentive in place, however, local edge servers may be reluctant to help offload computation. To stimulate cloud service operator and local edge server owners to participate in computation offloading, we formulate the interactions among cloud service operator and edge server owners as a Stackelberg game to maximize the utilities of cloud service operator and edge server owners by obtaining the optimal payment and computation offloading strategies. Through theoretical analysis, we show that the game is guaranteed to reach a unique Nash equilibrium. We then design two computation offloading algorithms that can quantify their efficiencies in terms of low delay and reduced complexity. Additionally, we extend our work by considering that edge server owners dynamically join or leave computation offloading. Numerical results show that our proposed algorithms perform well in computation offloading and efficiently stimulate edge server owners to make contribution to computation offloading."}, "journals/comcom/XuQVZM17": {"title": "Information-centric cost-efficient optimization for multimedia content delivery in mobile vehicular networks.", "url": "https://doi.org/10.1016/j.comcom.2016.07.014", "year": "2017", "author": {"Changqiao Xu": "51/4906", "Wei Quan 0001": "67/5376-1", "Athanasios V. Vasilakos": "40/4747", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "Providing high-quality multimedia services is a challenging and high-cost task in mobile vehicular networks due to intermittent connectivity, highly dynamic capacity, mostly associated to heterogeneous hosts distribution and their high mobility. Information-centric networking (ICN), which adopts novel content-based dissemination instead of the traditional host-based one, has great potential to accomplish cost-efficient quality-oriented multimedia delivery. This paper proposes a novel cost-Efficient Multimedia content Delivery approach (EcoMD) in vehicular networks leveraging the ICN features. In EcoMD, two essential factors are first analyzed and modeled: content mobility and supply-demand balance, and then, a mixed integer programming (MIP) optimization is formulated to minimize the economic cost associated to guaranteed the quality level of multimedia services. To resolve this NP-hard problem, heuristic mechanisms are proposed covering three aspects: priority-based path selection, least-required source maintaining and on-demand caching enhancement. By comparison with existing state-of-the-art solutions, simulation results demonstrate how EcoMD provides an improved performance in terms of start-up delay, jitter, playback continuity, and Quality of Experience (QoE) while particularly reduces the economic cost."}, "journals/jnca/ZhuXGZ17": {"title": "SEM-PPA: A semantical pattern and preference-aware service mining method for personalized point of interest recommendation.", "url": "https://doi.org/10.1016/j.jnca.2016.12.033", "year": "2017", "author": {"Liang Zhu": "85/20", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": "Point-of-Interest (POI) recommendation has received increasing attention in Location-based Social Networks (LBSNs). It involves user behavior analysis, movement pattern model and trajectory sequence prediction, in order to recommend personalized services to target user. Existing POI recommendation methods are confronted with three problems: (1) they only consider the location information of users' check-ins, which causes data sparsity; (2) they fail to consider the order of users' visited locations, which is valuable to reflect the interest or preference of users; (3) users cannot be recommended the suitable services when they move into the new place. To address the above issues, we propose a semantical pattern and preference-aware service mining method called SEM-PPA to make full use of the semantic information of locations for personalized POI recommendation. In SEM-PPA, we firstly propose a novel algorithm to classify the locations into different types for location identification; then we construct the user model for each user from four aspects, which are location trajectory, semantic trajectory, location popularity and user familiarity; in addition, a potential friends discovery algorithm based on movement pattern is proposed. Finally, we conduct extensive experiments to evaluate the recommendation accuracy and recommendation effectiveness on two real-life datasets from GeoLife and Beijing POI. Experimental results show that SEM-PPA can achieve better recommendation performance in particular for sparse data and recommendation accuracy in comparison with other methods."}, "journals/jnca/GuanYYXZ17": {"title": "GBC-based caching function group selection algorithm for SINET.", "url": "https://doi.org/10.1016/j.jnca.2016.12.004", "year": "2017", "author": {"Jianfeng Guan": "47/6455", "Zhiwei Yan": "41/6859", "Su Yao": "198/8323", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": "The emerging future network designs such as Smart Identifier Network (SINET) and Information-Centric Networking (ICN) can provide efficient content delivery via its in-path caching. However, it is not an optimal way to cache contents at all intermediate routers for that current technology is not yet ready to support an Internet scale deployment. Most of the existing works select cache location based on the important of single node rather than that of entire cache group, which may result in inefficient problem caused by reduplicative impertinences. In this work, we study the intelligent cache location selection algorithm with an objective to maximize cache delivery performance while minimize the number of caching nodes. We first investigate the recent work in term of content location selection schemes, and formulate this problem as finding the prominent group with the highest Group Betweenness Centrality (GBC). We then propose a GBC-based in-path caching function group selection algorithm to select the caching nodes in SINET. We evaluate the performance of proposed algorithm through simulations and compare it with others. The final results show that GBC-based algorithm can provide better performance in term of average hop of content delivery. Using our finding, the network operators could deploy cache easily."}, "journals/mis/JiangMGX17": {"title": "Challenges and Opportunities of Network Virtualization over Wireless Mobile Networks.", "url": "https://doi.org/10.1155/2017/9053678", "year": "2017", "author": {"Xiaohong Jiang 0001": "67/5160-1", "Gabriel-Miro Muntean": "81/2584", "George Ghinea": "g/GeorgeGhinea", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/tbc/XuWXWM17": {"title": "Pipeline Network Coding-Based Multipath Data Transfer in Heterogeneous Wireless Networks.", "url": "https://doi.org/10.1109/TBC.2016.2590819", "year": "2017", "author": {"Changqiao Xu": "51/4906", "Peng Wang 0071": "95/4442-71", "Chunshan Xiong": "201/3660", "Xinpeng Wei": "147/7735", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Multipath transmission control protocol (MPTCP) has attracted significant attention from standardization bodies, industrial communities, and academic communities. However, an important performance-related aspect is that MPTCP is negatively affected by packet reordering, especially in heterogeneous wireless environments. Although to improve the protocol, the proposed updated scheduling policies and congestion control methods do not solve the problem fundamentally. In this context, by breaking the strong binding between data packets and their sequence numbers, network coding has been demonstrated to be a promising solution for end-to-end multipath transmissions. However, current network coding solutions are based on batch coding without exception, and encoding and decoding operations cannot proceed unless all packets of a group have arrived. In addition, frequent generation and transmission of coding coefficients increase the delay and waste the already limited bandwidth. This paper proposes a novel pipeline network coding-based MPTCP (MPTCP-PNC) which reduces encoding and decoding delay and saves bandwidth by using innovative economic coding coefficient rules. Based on these, a quality-based distribution scheme and a corresponding transmission management policy are introduced to further improve the performance of MPTCP-PNC. Simulation tests involving video delivery over a multi-path distribution network show how MPTCP-PNC outperforms other state-of-art network coding solutions."}, "journals/wc/XuZJWM17": {"title": "Video Streaming in Content-Centric Mobile Networks: Challenges and Solutions.", "url": "https://doi.org/10.1109/MWC.2017.1600219WC", "year": "2017", "author": {"Changqiao Xu": "51/4906", "Ping Zhang 0003": "77/2428-3", "Shijie Jia 0002": "51/10138-2", "Mu Wang": "94/4375", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The massive amounts of mobile traffic generated by the unprecedented demand for high-quality video content are fast approaching the communication capacity of current network infrastructures. Novel solutions are required, including using content- centric mobile networks (CCMNs), which make use of storage, computation, and bandwidth resources of the entire network to support traffic offloading and large-scale content sharing in wireless mobile networks. The unicast-based interest routing in CCMNs is known for fast content delivery with low resource consumption, but video information management and mobility of mobile nodes significantly influence the performance of video delivery. This article first reviews recent studies and discusses the research challenges for content distribution and delivery in CCMNs. The article then presents an innovative video streaming solution in CCMNs (VSCC), which proactively leverages a content-centric multi-region video content management method and a mobility-adaptive content-centric video delivery mechanism to improve the performance of video delivery. Simulation results demonstrate that VSCC achieves high video sharing efficiency and increased QoS levels in comparison with two state of the art approaches."}, "journals/comsur/XuZM16": {"title": "Congestion Control Design for Multipath Transport Protocols: A Survey.", "url": "https://doi.org/10.1109/COMST.2016.2558818", "year": "2016", "author": {"Changqiao Xu": "51/4906", "Jia Zhao": "34/3125", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:High-quality services over wired and wireless networks require high bitrate network content delivery. Multipath transport protocols utilize multiple paths to support increased throughput for network applications. Ubiquitous mobile devices with multiple interfaces such as WiFi and 4G/5G cellular, and data centers supporting big data analysis and cloud-computing, motivate adoption of multipath transmission in current and future network architectures. Congestion control mechanisms play a fundamental role in these multipath transport protocols. Diverse approaches have been proposed in the literature, differing in terms of their goals, principles, performance, and mostly in how various issues are addressed in their design. This paper presents a survey of congestion control solutions for multipath transport protocols and discusses the multipath congestion control design in order to address the need for some desirable properties including TCP-friendliness, load balancing, stability, and Pareto optimality. Existing window-based and rate-based multipath congestion control algorithms are investigated and categorized based on their theoretical algorithm design. Next, this paper discusses the congestion control mechanisms used in diverse multipath transport protocols in the context of different network scenarios. Finally, the trends in the future multipath congestion control design are presented."}, "journals/ijdsn/ZhuZXGZ16": {"title": "The Performance Analysis of Diffusion LMS Algorithm in Sensor Networks Based on Quantized Data and Random Topology.", "url": "https://doi.org/10.1177/155014779685385", "year": "2016", "author": {"Junlong Zhu": "127/6367", "Mingchuan Zhang": "87/550", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/mis/GuanYXZ16": {"title": "The PMIPv6-Based Group Binding Update for IoT Devices.", "url": "https://doi.org/10.1155/2016/7853219", "year": "2016", "author": {"Jianfeng Guan": "47/6455", "Ilsun You": "75/3854", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/mis/JiangCMGX16": {"title": "Green Communication for Mobile and Wireless Networks.", "url": "https://doi.org/10.1155/2016/8719763", "year": "2016", "author": {"Xiaohong Jiang 0001": "67/5160-1", "Han-Chieh Chao": "c/HanChiehChao", "Gabriel-Miro Muntean": "81/2584", "George Ghinea": "g/GeorgeGhinea", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/tvt/XuLZZM16": {"title": "CMT-NC: Improving the Concurrent Multipath Transfer Performance Using Network Coding in Wireless Networks.", "url": "https://doi.org/10.1109/TVT.2015.2409556", "year": "2016", "author": {"Changqiao Xu": "51/4906", "Zhuofeng Li": "154/3555", "Lujie Zhong": "124/8701", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The growing popularity of multihoming mobile terminals has encouraged the use of concurrent multipath transfer (CMT) to provide network diversity and accelerated content distribution in ubiquitous and heterogeneous wireless network environments. However, CMT severely degrades its performance, which is mostly due to both data reordering required as a result of great path dissimilarity and frequent packet loss due to wireless channel unreliability. Most delivery approaches follow the packet sequence numbers and thereby result in strict in-order and packet-specific reception. Passively adapting to the network variations, those approaches are not general enough to address CMT problems. This paper proposes to apply network coding (NC) principles to CMT, to break the strong binding between data packets and their sequence numbers, and then improve its performance. The proposed CMT-NC solution avoids data reordering to mitigate buffer blocking and compensates for the lost packets to reduce the number of retransmissions. Its specific encoding approach reduces the encoding complexity and fully ensures decoding feasibility. Furthermore, the group-based transmission management enhances the robustness and reliability of the data transfer. Simulation results show how CMT-NC is a highly efficient data transport solution outperforming existing state-of-the-art solutions."}, "journals/cm/XuJZM15": {"title": "Socially aware mobile peer-to-peer communications for community multimedia streaming services.", "url": "https://doi.org/10.1109/MCOM.2015.7295477", "year": "2015", "author": {"Changqiao Xu": "51/4906", "Shijie Jia 0002": "51/10138-2", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Mobile multimedia streaming services have become the main reason behind the latest increase in mobile data traffic worldwide. The enormous user base, frequency of data exchange, and demand for high-quality multimedia content open up new challenges to offer good QoS levels in mobile multimedia streaming systems. This article presents an innovative SMMC that integrates performance factors with aspects such as demand, socialization, mobility, and delivery. Simulation results demonstrate that SMMC achieves high content sharing efficiency and increased QoS levels."}, "journals/eetws/WangXWG15": {"title": "Propagation-based Content Dissemination for Social Mobile Interactive Multimedia Services.", "url": "https://doi.org/10.4108/icst.mobimedia.2015.259057", "year": "2015", "author": {"Mu Wang": "94/4375", "Changqiao Xu": "51/4906", "Yiran Wei": "161/4646", "Jianfeng Guan": "47/6455"}, "abstract": ""}, "journals/ijdsn/JiaMZZX15": {"title": "A Novel Energy-Efficiency Social-Inspired Video Sharing Solution in Wireless Networks.", "url": "https://doi.org/10.1155/2015/518289", "year": "2015", "author": {"Shijie Jia": "51/10138", "Youzhong Ma": "121/4132", "Yongxin Zhang": "92/3858", "Lujie Zhong": "124/8701", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ijdsn/XuMZJ15": {"title": "Green and Friendly Communication for Sensor Networks.", "url": "https://doi.org/10.1155/2015/968167", "year": "2015", "author": {"Changqiao Xu": "51/4906", "Gabriel-Miro Muntean": "81/2584", "Liang Zhou 0002": "81/4761-2", "Xiaohong Jiang 0001": "67/5160-1"}, "abstract": ""}, "journals/tcsv/XuLLZM15": {"title": "Cross-Layer Fairness-Driven Concurrent Multipath Video Delivery Over Heterogeneous Wireless Networks.", "url": "https://doi.org/10.1109/TCSVT.2014.2376138", "year": "2015", "author": {"Changqiao Xu": "51/4906", "Zhuofeng Li": "154/3555", "Jinglin Li": "45/10335", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The growing availability of various wireless access technologies promotes increasing demand for mobile video applications. Stream control transmission protocol (SCTP)-based concurrent multipath transfer (CMT) improves the wireless video delivery performance with its parallel transmission and bandwidth (BW) aggregation features. However, the existing CMT solutions deployed at the transport layer only are not accurate enough due to lower layer uncertainties, such as variations of the wireless channel. In addition, CMT-based video transmission may use excessive BW in comparison with the popular Transmission Control Protocol (TCP)-based flows, which results in unfair sharing of network resources. This paper proposes a novel cross-layer fairness-driven (CL/FD) SCTP-based CMT solution (CMT-CL/FD) to improve video delivery performance, while remaining fair to the competing TCP flows. CMT-CL/FD utilizes a cross-layer approach to monitor and analyze path quality, which includes wireless channel measurements at the data-link layer and rate/BW estimations at the transport layer. Furthermore, an innovative window-based mechanism is applied for flow control to balance delivery fairness and efficiency. Finally, CMT-CL/FD intelligently distributes video data over different paths depending on their estimated quality to mitigate packet reordering and loss, under the constraint of TCP-friendly flow control. Simulation results show how CMT-CL/FD outperforms existing solutions in terms of both video delivery performance and TCP-friendliness."}, "journals/tvt/XuJWZZM15": {"title": "Performance-Aware Mobile Community-Based VoD Streaming Over Vehicular Ad Hoc Networks.", "url": "https://doi.org/10.1109/TVT.2014.2329696", "year": "2015", "author": {"Changqiao Xu": "51/4906", "Shijie Jia 0002": "51/10138-2", "Mu Wang": "94/4375", "Lujie Zhong": "124/8701", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Leveraging the development of mobile communication technologies and increased capabilities of mobile devices, mobile multimedia services have set new trends. To support high-quality Video-on-Demand (VoD) in mobile wireless networks, using virtual community-based approaches to balance the efficiency of content sharing and maintenance cost of performance-aware solutions has attracted increasing research interest. In this paper, we propose a novel Performance-aware Mobile Community-based VoD streaming solution over vehicular ad hoc networks (PMCV). PMCV relies on a newly designed mobile community detection scheme and an innovative community member management mechanism. The former employs a novel fuzzy ant-inspired clustering algorithm and an innovative mobility similarity estimation model to group together the mobile users with similar behavior in terms of playback and movement into mobile communities. The latter introduces the role and task of members, member join and leave, collaborative store and search for resources, and replacement of a broker member. Simulation-based testing shows how PMCV outperforms another state-of-the-art solution in terms of performance."}, "journals/wpc/CaoXGZ15": {"title": "CMT-CC: Cross-Layer Cognitive CMT for Efficient Multimedia Distribution over Multi-homed Wireless Networks.", "url": "https://doi.org/10.1007/s11277-015-2304-7", "year": "2015", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": "This paper proposes CMT-CC, a novel cross-layer cognitive concurrent multipath transfer (CMT) solution necessitating the following aims: (i) cross-layer design, (ii) fairness to TCP-like flows, and (iii) improve users’ quality of experience for multimedia streaming service. To satisfy above requirements, a newly cross-layer network condition sensor is designed in CMT-CC in order to cognize network condition and distinguishes the causes of network condition change. An intelligent multimedia content distributor is further introduced in CMT-CC for enabling adaptive multimedia distribution behavior appropriate for the varying wireless network condition. To make CMT-CC preserve fairness to TCP flows on congested links, a weighted moving congestion window based TCP-friendly congestion control mechanism is developed in CMT-CC. The results gained by a close realistic simulation topology show how the proposed CMT-CC solution significantly improves throughput, as well as multimedia delivery performance while still remaining fair to TCP-like flows."}, "journals/chinaf/CaoXGZ14": {"title": "Qos-driven SCTP-based multimedia delivery over heterogeneous wireless networks.", "url": "https://doi.org/10.1007/s11432-014-5171-z", "year": "2014", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": "Stream Control Transport Protocol (SCTP)-based handover is supposedly the best suit for current mobile Internet users. However, prevalent SCTP-based handover solutions mostly evaluate candidate networks by a function of multiple attributes such as available bandwidth, delay, etc., which tend to vary often in burst and might cause the instability of handover decisions. Moreover, the SCTP congestion control strategy leads to sudden degradation of users’ quality of experience for multimedia streaming service because of abrupt and frequent strong fluctuations in the transmission rate. In this paper, we propose a novel QoS-driven SCTPbased handover solution (SCTP-QD) appropriate for heterogeneous wireless multimedia transmission. A new network service and transport layer QoS-aware model is designed to help SCTP-QD accurately analyze the service stability and data transmission capacity for each path. A proper QoS-driven handover decision model is introduced in SCTP-QD in order to improve the SCTP handover efficiency while reducing unnecessary handoffs and fail-over probability. A proposal is finally addressed to help SCTP-QD avoid the slow start phase whenever handover occurs. The simulation results show that SCTP-QD outperforms existing solutions in terms of data delivery performance."}, "journals/csse/GuanQWXTZ14": {"title": "Modeling and analysis of mobility stochastic properties in cognitive radio networks.", "url": "", "year": "2014", "author": {"Jianfeng Guan": "47/6455", "Wei Quan 0001": "67/5376-1", "Lili Wang": "23/5672", "Changqiao Xu": "51/4906", "Feilong Tang": "59/2249", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/icl/QuanXGZG14": {"title": "Scalable Name Lookup with Adaptive Prefix Bloom Filter for Named Data Networking.", "url": "https://doi.org/10.1109/LCOMM.2013.112413.132231", "year": "2014", "author": {"Wei Quan 0001": "67/5376-1", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Luigi Alfredo Grieco": "23/4819"}, "abstract": ""}, "journals/ijdsn/ZhaoGXS14": {"title": "Game Theoretic Request Scheduling with Queue Priority in Video Sensor Networks.", "url": "https://doi.org/10.1155/2014/572524", "year": "2014", "author": {"Jia Zhao": "34/3125", "Jianfeng Guan": "47/6455", "Changqiao Xu": "51/4906", "Wei Su": "50/4091"}, "abstract": ""}, "journals/itiis/ZhangXGZWZ14": {"title": "A Novel Bio-inspired Trusted Routing Protocol for Mobile Wireless Sensor Networks.", "url": "https://doi.org/10.3837/tiis.2014.01.005", "year": "2014", "author": {"Mingchuan Zhang": "87/550", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Ruijuan Zheng": "28/6042", "Qingtao Wu": "71/4515", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/tbc/XuJZZM14": {"title": "Ant-Inspired Mini-Community-Based Solution for Video-On-Demand Services in Wireless Mobile Networks.", "url": "https://doi.org/10.1109/TBC.2014.2314791", "year": "2014", "author": {"Changqiao Xu": "51/4906", "Shijie Jia 0002": "51/10138-2", "Lujie Zhong": "124/8701", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Highly efficient distribution and management of media resources and fast content discovery are key determinants for mobile peer-to-peer video-on-demand solutions, especially in wireless mobile networks. Virtual communities making use of users' common characteristics such as interest and interaction to describe the boundary of sharing content and objects are a promising avenue for high-efficiency resource sharing. In this paper, we propose a novel ant-inspired mini-community-based video sharing solution for on-demand streaming services in wireless mobile networks (AMCV). AMCV relies on a newly designed two layer architecture and on an algorithm inspired from the indirect communication between ants via pheromone trails which enables them to discover and use shortest paths. The architecture is composed of a mini-community network layer and a community member layer. The ant-inspired algorithm enables finding the common interest of users in video content within large amounts of pseudo disorderly interactive behavior data. AMCV proposes an ant colony optimization-based community communication strategy that dynamically bridges communities to support fast search for resources. AMCV achieves high scalability by making use of a designed community maintenance mechanism to uniformly distribute the maintenance cost of members and resources in the community, according to various member roles. Simulation-based testing shows how AMCV outperforms another state-of- the-art solution in terms of a wide set of performance metrics."}, "journals/tbc/JiaXGZM14": {"title": "A Novel Cooperative Content Fetching-Based Strategy to Increase the Quality of Video Delivery to Mobile Users in Wireless Networks.", "url": "https://doi.org/10.1109/TBC.2014.2322772", "year": "2014", "author": {"Shijie Jia 0002": "51/10138-2", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Cooperatively fetching video content with the help of other mobile nodes can release some of the pressure on storage and bandwidth of the constrained mobile devices in wireless networks and speeds up the localization process of video resources so as to support better quality of viewing experience. In this context, the discovery of the appropriate mobile cooperative node becomes a key factor and is also a challenge for the deployment of such a fetching scheme. In this paper, we introduce a novel cooperative content fetching-based strategy to increase the quality of video delivery to mobile users in wireless networks (CCF). By intelligently monitoring the real-time variation in the state of the one-hop neighbors (immediate-neighbors) of the video resource downloader, CCF employs an innovative estimation model to measure the stability of these immediate-neighbors. In order to enhance the cooperative fetching efficiency, CCF designs a communication quality forecast model to measure link reliability and forecast the available bandwidth. By making use of a newly proposed cooperative fetching algorithm, CCF can speed up fetching and disseminating of video resources with the help of cooperative neighbors selected in terms of stability and communication quality. Simulation results show how CCF obtains higher selection accuracy of cooperative neighbors, lower average end-to-end delay, lower average packet loss ratio, higher average throughput, higher video quality, and lower maintenance overhead in comparison with state-of-the-art solutions."}, "journals/winet/JiaXVGZM14": {"title": "Reliability-oriented ant colony optimization-based mobile peer-to-peer VoD solution in MANETs.", "url": "https://doi.org/10.1007/s11276-013-0667-9", "year": "2014", "author": {"Shijie Jia 0002": "51/10138-2", "Changqiao Xu": "51/4906", "Athanasios V. Vasilakos": "40/4747", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "Mobile peer-to-peer (MP2P) has\n emerged as a state-of-the-art technology for video resource sharing in mobile ad-hoc networks (MANETs), building on the advantages of P2P data exchange and providing a feasible solution for large-scale deployment of media streaming services. Fast search for video resources and low maintenance overhead of overlay networks to support the mobility of nodes are key factors in MP2P video on demand solutions. In this paper, we propose a novel reliability-oriented ant colony optimization (ACO)-based MP2P solution to support interactivity for video streaming in MANETs (RACOM). RACOM makes use of highly innovative algorithms such as the peer status-aware mechanism and peer-centric overlay maintenance mechanism to support high-efficiency video resource sharing. The peer status-aware mechanism includes the user reliability measure model which is used to identify the peers having reliable playback status in order to find stable potential resource suppliers and a new ACO-based prediction model of playback behavior which provides the accurate prediction of playback content in the future to ensure the smooth experience and optimize the distribution of resources. In order to balance the fast supplier discovery and low maintenance overhead, RACOM makes use of peer-centric overlay maintenance mechanism composed of the time window-based detection strategy and encounter-based synchronization strategy to reduce the maintenance overhead of reliable peers, obtain quasi real-time status of peers and support the mobility of mobile nodes. Simulation results show how RACOM achieves higher hit ratio, lower seek delay, lower server stress, lower peer load and less overlay maintenance overhead in comparison with another state of the art solution."}, "journals/ijdsn/XuXGZM13": {"title": "Disorder Analytic Model-Based CMT Algorithms in Vehicular Sensor Networks.", "url": "https://doi.org/10.1155/2013/460164", "year": "2013", "author": {"Changqiao Xu": "51/4906", "Xiangzhou Xia": "129/7116", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": ""}, "journals/ijdsn/ZhangXGZWZ13": {"title": "A Novel ", "url": "https://doi.org/10.1155/2013/483581", "year": "2013", "author": {"Mingchuan Zhang": "87/550", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Ruijuan Zheng": "28/6042", "Qingtao Wu": "71/4515", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/tmc/XuLGZM13": {"title": "CMT-QA: Quality-Aware Adaptive Concurrent Multipath Data Transfer in Heterogeneous Wireless Networks.", "url": "https://doi.org/10.1109/TMC.2012.189", "year": "2013", "author": {"Changqiao Xu": "51/4906", "Tianjiao Liu": "126/7997", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Mobile devices equipped with multiple network interfaces can increase their throughput by making use of parallel transmissions over multiple paths and bandwidth aggregation, enabled by the stream control transport protocol (SCTP). However, the different bandwidth and delay of the multiple paths will determine data to be received out of order and in the absence of related mechanisms to correct this, serious application-level performance degradations will occur. This paper proposes a novel quality-aware adaptive concurrent multipath transfer solution (CMT-QA) that utilizes SCTP for FTP-like data transmission and real-time video delivery in wireless heterogeneous networks. CMT-QA monitors and analyses regularly each path's data handling capability and makes data delivery adaptation decisions to select the qualified paths for concurrent data transfer. CMT-QA includes a series of mechanisms to distribute data chunks over multiple paths intelligently and control the data traffic rate of each path independently. CMT-QA's goal is to mitigate the out-of-order data reception by reducing the reordering delay and unnecessary fast retransmissions. CMT-QA can effectively differentiate between different types of packet loss to avoid unreasonable congestion window adjustments for retransmissions. Simulations show how CMT-QA outperforms existing solutions in terms of performance and quality of service."}, "journals/tvt/XuZGZM13": {"title": "QoE-Driven User-Centric VoD Services in Urban Multihomed P2P-Based Vehicular Networks.", "url": "https://doi.org/10.1109/TVT.2012.2228682", "year": "2013", "author": {"Changqiao Xu": "51/4906", "Futao Zhao": "131/0665", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Recently, many cities around the world have witnessed large-scale deployment of terrestrial broadcasting mobile television (TV) to vehicles. This service is similar to the cable or satellite TV already in the home, and user-centric interactive mobile Video-on-Demand (VoD) over urban vehicular networks is in fact expected. However, providing this new service with focus on user Quality of Experience (QoE) constitutes a significant challenge. This paper introduces a QoE-driven User-centric solution for VoD services in urban vehicular network environments (QUVoD). QUVoD relies on a multihomed hierarchical peer-to-peer (P2P) and vehicular ad-hoc network (VANET) architecture. Vehicles construct a low-layer VANET via Wireless Access in the Vehicular Environment interfaces; they also form an upper layer P2P Chord overlay on top of a cellular network via Fourth-Generation (4G) interfaces. A novel grouping-based storage strategy that uniformly distributes the video segments along the Chord overlay is proposed, reducing segment seeking traffic while also enabling load balancing. A novel segment seeking and multipath delivery scheme that achieves high lookup success rate and very good video data delivery efficiency is also introduced, which achieves high lookup success rate and very good video data delivery efficiency. Furthermore, a new speculation-based prefetching strategy is proposed, which analyses users' interactive viewing behavior and, by estimating video segment playback order, employs prefetching of the expected segments, smoothening the video playback. Simulation results show how QUVoD is a highly efficient user-centric mobile VoD solution in urban vehicular networks in comparison with existing state-of-the-art solutions."}, "journals/ijdmbc/CaoXGZ12": {"title": "Background Traffic-Based Retransmission Algorithm for Multimedia Streaming Transfer over Concurrent Multipaths.", "url": "https://doi.org/10.1155/2012/789579", "year": "2012", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/ijdsn/CaoXGSZ12": {"title": "Environment-Aware CMT for Efficient Video Delivery in Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.1155/2012/381726", "year": "2012", "author": {"Yuanlong Cao": "121/0052", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Fei Song 0001": "37/5972-1", "Hongke Zhang": "09/5441"}, "abstract": ""}, "journals/tbc/HuangXDMM12": {"title": "Novel End-to-End Quality of Service Provisioning Algorithms for Multimedia Services in Virtualization-Based Future Internet.", "url": "https://doi.org/10.1109/TBC.2012.2198970", "year": "2012", "author": {"Jun Huang 0002": "51/5022-2", "Changqiao Xu": "51/4906", "Qiang Duan": "67/6644", "Yan Ma": "31/1970", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Network virtualization has been proposed as a key contribution to the future internetworking paradigm and is expected to play a crucial role in the next generation Internet. Although interesting progress has been made towards network virtualization, end-to-end Quality of Service (QoS) provisioning for multimedia services in network virtualization environments is still an important open topic. In this paper, we tackle this challenging issue by modeling multimedia service delivery in network virtualization and proposing efficient path selection algorithms for virtual networks. The main contributions of this paper are a model for the end-to-end multimedia service delivery in network virtualization environments, proposal of efficient algorithms for selecting paths traversing the network infrastructure for QoS provisioning in virtual networks, and analysis of the effectiveness and efficiency of the proposed algorithms. Both theoretical analysis and experimental results show that the modeling technique and the algorithms proposed in this paper are general and flexible, and therefore applicable to the delivery of multimedia content in various heterogeneous networking systems in the next generation Internet."}, "journals/tbc/XuFQZM11": {"title": "Performance Evaluation of Multimedia Content Distribution Over Multi-Homed Wireless Networks.", "url": "https://doi.org/10.1109/TBC.2011.2119050", "year": "2011", "author": {"Changqiao Xu": "51/4906", "Enda Fallon": "80/5549", "Yuansong Qiao": "07/1610", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:The growing availability of IP based heterogeneous wireless access technologies coupled with the increasing capabilities of mobile devices is creating opportunities for multimedia distribution. Through its multi-homing feature, the ability to support multiple network connections in a single end to end association, the transport layer Stream Control Transmission Protocol (SCTP) can enable seamless and transparent communication sessions over multiple heterogeneous networks. This paper analyzes the performance of multimedia distribution when making use of two multi-homing SCTP-based approaches: Single Path Transfer and Concurrent Multi-path Transfer, in which a single or all paths within an association are used simultaneously for data transmission. In this investigation various retransmission policies and different parameter sets are used in turn and recommendations are made for achieving best results during video delivery. In order to perform this study a novel realistic evaluation tool-set was proposed and is described, which can simulate video delivery over SCTP. Our simulation results and analysis show how to optimize the transmission of multimedia content over SCTP associations in both single and multipath scenarios."}, "journals/wpc/GuanZXZL11": {"title": "The Performance Analysis of the Multicast Extension Support for Proxy MIPv6.", "url": "https://doi.org/10.1007/s11277-011-0425-1", "year": "2011", "author": {"Jianfeng Guan": "47/6455", "Huachun Zhou": "95/796", "Changqiao Xu": "51/4906", "Hongke Zhang": "09/5441", "Hongbin Luo": "98/3129"}, "abstract": "Mobile multicast is based on the traditional multicast protocols and the mobility support protocols to provide the multicast services for the mobile subscribers. Several mobile multicast methods were proposed in the past few years, but most of them are based on Mobile IPv6 and its variants which require the mobile node to support the mobility function. Recently, Proxy Mobile IPv6 (PMIPv6) was proposed to provide the mobility support for the mobile node with or without mobility function, and the previous studies have shown that PMIPv6 can improve the performance in term of the handover performance and protocol cost. However, PMIPv6 mainly concerns on the mobility support for unicast routing and little considers the multicast routing. In this paper, we propose two multicast methods called the MAG (Mobile Access Gateway)-based method and LMA (Local Mobility Anchor)-based method based on the different multicast delivery transmission path to extend PMIPv6, and analyze their performance under the different scenarios. The analytical results show that the LMA-based method is suitable for the higher speed, bigger domain size, and larger network topology scenarios, whereas the MAG-based method is suitable for the lower speed, smaller domain size and smaller network topology scenarios."}, "journals/tbc/XuMFH09": {"title": "Distributed Storage-Assisted Data-Driven Overlay Network for P2P VoD Services.", "url": "https://doi.org/10.1109/TBC.2008.2006252", "year": "2009", "author": {"Changqiao Xu": "51/4906", "Gabriel-Miro Muntean": "81/2584", "Enda Fallon": "80/5549", "Austin Hanley": "63/1143"}, "abstract": " Abstract:Providing VCR-like operations in peer-to-peer (P2P) environments is a significant challenge. This paper proposes a distributed storage-assisted data-driven overlay network (SDNet) to support P2P video-on-demand (VoD) services. It integrates two networks: a data-driven overlay network (DONet) and a multi-way tree. DONet is enhanced and used for the routine video distribution based on the buffer overlapping mechanism and gossip protocol. A novel algorithm which uses a multi-way tree structure and extra pre-fetching buffers at the nodes is proposed to support efficient VoD operations. Videos are divided into uniform segments, pre-fetched and stored in a distributed manner along the tree topology. The cooperation between DONet-based video delivery and the tree-located multimedia components enable multimedia streaming interactive commands to be performed efficiently. This paper presents and discusses the structure of SDNet and the distributed storage scheme and details the cooperation procedure. Simulation-based testing results show how the proposed SDNet is an efficient interactive streaming solution in a P2P environment."}}}