{"id": "272/6179", "name": "Chong-gao Chen", "Article": {"conf/icmtel/RenC20": {"title": "Application of Big Data's Association Rules in the Analysis of Sports Competition Tactics.", "url": "https://doi.org/10.1007/978-3-030-51100-5_21", "year": "2020", "author": {"Jia Ren": "50/912", "Chong-gao Chen": "272/6179"}, "abstract": "The problem of low accuracy and poor ability of tactical analysis of current tournament analysis strategy, to improve the statistical intelligent analysis ability of the tactical analysis of sports games, it is necessary to carry out the tactical analysis and statistics of the sports games, and put forward a game strategy analysis and statistical model based on a large data association rule mining. firstly, a data acquisition and diagnosis analysis model of a sports game strategy analysis is constructed, and a sports game tactical analysis data information flow model is constructed, and the statistic characteristic quantity in the sports game tactical analysis is extracted, the method of fuzzy correlation fusion is used to analyze the interference of the statistical data in the tactical analysis of the sports game, and a plurality of known interference frequency components are removed. in that method, a large-data association rule mining algorithm is adopted to carry out statistical data identification and characteristic analysis in a sports game and tactical analysis, an optimization characteristic solution of the game and tactical statistical information analysis is established, and a self-adaptive optimization of the game and tactical statistical information analysis is carried out by adopting a simplified gradient algorithm, the feature analysis and data optimization recognition of the game tactics analysis are realized by combining the self-correlation feature matching method. The simulation results show that the method is used to carry out the tactical analysis of sports games and the accuracy of the statistics, so as to improve the ability of the tactical analysis of the sports games, so as to improve the effect of the competition.KeywordsBig dataAssociation rulesSports gamesTactical analysisStatistical analysis"}, "conf/icmtel/ChenR20": {"title": "Identification and Analysis of Limb Swing Image in Short Run Training Based on Visual Signal Processing.", "url": "https://doi.org/10.1007/978-3-030-51100-5_22", "year": "2020", "author": {"Chong-gao Chen": "272/6179", "Jia Ren": "50/912"}, "abstract": "In order to improve the ability of the accurate detection and recognition of the swing of the training limb of the sprinter, a method of image recognition based on the visual signal processing for the motion of the limb is proposed. The method comprises the following steps of: analyzing the motion characteristic quantity of the swing of a sprinting training limb, carrying out a sprinting training limb swinging image acquisition by adopting an infrared characteristic scanning technology, carrying out edge contour detection on the collected sprinting training limb swinging image. Carrying out contour segmentation and characteristic identification of the swinging of the limb of the sprinting training limb in combination with the image segmentation technology, constructing a gray histogram distribution structure model of a sprinting training limb swing image, and carrying out effective extraction of the motion characteristics of the limb swing and the motion characteristic of the sprinting training limb by adopting a regional block matching method, The method of multi-dimensional space reconstruction is adopted to simulate the motion of the limb, and the visual signal processing and the key feature point calibration method are adopted to calibrate and detect the characteristic points of the limb swing of the sprinting training, so as to realize the optimal recognition of the swing of the training limb of the sprinter. The simulation results show that the method of the invention has the advantages of high accuracy, good characteristic identification ability and the capability of improving the swing image recognition ability of the sprinter training limb.KeywordsVisual signal processingSprintingTrainingLimb swingImage recognition"}, "journals/monet/ChenP22": {"title": "Design of action correction assistant system in physical education teaching and training based on .NET platform.", "url": "https://doi.org/10.1007/s11036-022-01941-7", "year": "2022", "author": {"Chong-gao Chen": "272/6179", "Dawid Polap": "151/7138"}, "abstract": "In order to improve the training accuracy of sports teaching and training, and promote the scientific and standardized sports teaching and training, a correcting assistant system based on. NET platform is designed. Based on the Microsoft. NET platform, a three-tier architecture is constructed. Among them, the data access layer uses the functions of ADO. NET and. NET XML to realize the exchange of database information, provides services for the business logic layer, designs the motion correction module of the business logic layer, uses Kinect to extract the skeleton angle data characteristics of the trainer's training actions in the motion collection module, adopts the dynamic time planning algorithm to match the corresponding frames, calculates the training scores, realizes the reappearance of motion correction through the 3D reconstruction module, and finally displays the motion correction through the user interface layer. Experimental results show that the system can collect training action and mark the key points, the average score is 8 points, the corresponding frame is matched accurately, and the training action with very satisfactory (A) level reaches more than 90%."}}}