{"id": "27/3906", "name": "Dongliang Xie", "Article": {"conf/aaai/LiuYXWSHB20": {"title": "Adaptive Activation Network and Functional Regularization for Efficient and Flexible Deep Multi-Task Learning.", "url": "https://ojs.aaai.org/index.php/AAAI/article/view/5930", "year": "2020", "author": {"Yingru Liu": "160/6116", "Xuewen Yang": "189/3032", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Li Shen": "91/3680", "Haozhi Huang 0001": "170/1729", "Niranjan Balasubramanian": "40/1931"}, "abstract": "Multi-task learning (MTL) is a common paradigm that seeks to improve the generalization performance of task learning by training related tasks simultaneously. However, it is still a challenging problem to search the flexible and accurate architecture that can be shared among multiple tasks. In this paper, we propose a novel deep learning model called Task Adaptive Activation Network (TAAN) that can automatically learn the optimal network architecture for MTL. The main principle of TAAN is to derive flexible activation functions for different tasks from the data with other parameters of the network fully shared. We further propose two functional regularization methods that improve the MTL performance of TAAN. The improved performance of both TAAN and the regularization methods is demonstrated by comprehensive experiments.\n\t\t\t\t"}, "conf/eccv/YangZJLWTXWW20": {"title": "Fashion Captioning: Towards Generating Accurate Descriptions with Semantic Rewards.", "url": "https://doi.org/10.1007/978-3-030-58601-0_1", "year": "2020", "author": {"Xuewen Yang": "189/3032", "Heming Zhang": "04/4972", "Di Jin": "67/1861", "Yingru Liu": "160/6116", "Chi-Hao Wu": "50/5051", "Jianchao Tan": "165/9938", "Dongliang Xie": "27/3906", "Jue Wang 0001": "69/393-1", "Xin Wang 0001": "10/5630-1"}, "abstract": "\nGenerating accurate descriptions for online fashion items is important not only for enhancing customers’ shopping experiences, but also for the increase of online sales. Besides the need of correctly presenting the attributes of items, the expressions in an enchanting style could better attract customer interests. The goal of this work is to develop a novel learning framework for accurate and expressive fashion captioning. Different from popular work on image captioning, it is hard to identify and describe the rich attributes of fashion items. We seed the description of an item by first identifying its attributes, and introduce attribute-level semantic (ALS) reward and sentence-level semantic (SLS) reward as metrics to improve the quality of text descriptions. We further integrate the training of our model with maximum likelihood estimation (MLE), attribute embedding, and Reinforcement Learning (RL). To facilitate the learning, we build a new FAshion CAptioning Dataset (FACAD), which contains 993K images and 130K corresponding enchanting and diverse descriptions. Experiments on FACAD demonstrate the effectiveness of our model (Code and data: https://github.com/xuewyang/Fashion_Captioning).KeywordsFashionCaptioningReinforcement LearningSemantics"}, "conf/fpga/ZhangHTLJLATSFX20": {"title": "LPAC: A Low-Precision Accelerator for CNN on FPGAs.", "url": "https://doi.org/10.1145/3373087.3375343", "year": "2020", "author": {"Tianyu Zhang": "17/3842", "Tiantian Han": "259/3846", "Lu Tian": "48/913", "Yi Li": "59/871", "Xijie Jia": "186/8733", "Guangdong Liu": "53/2009", "Pingbo An": "259/3589", "Yingran Tan": "259/3622", "Lingzhi Sui": "157/9925", "Shaoxia Fang": "93/10799", "Dongliang Xie": "27/3906", "Michaela Blott": "40/6407", "Yi Shan": "74/7863"}, "abstract": "\n\t\tLow bit quantization of neural network is required on edge devices to achieve lower power consumption and higher performance. 8bit or binary network either consumes a lot of resources or has accuracy degradation. Thus, a full-process hardware-friendly quantization solution of 4A4W (activations 4bit and weights 4bit) is proposed to achieve better accuracy/resource trade-off. It doesn't contain any additional floating operations and achieve accuracy comparable to full-precision. We also implement a low-precision accelerator for CNN (LPAC) on the Xilinx FPGA, which takes full advantage of its DSP by efficiently mapping convolutional computations. Through on-chip reassign management and resource-saving analysis, high performance can be achieved on small chips. Our 4A4W solution achieves 1.8x higher performance than 8A8W and 2.42x increase in power efficiency under the same resource. On ImageNet classification, the accuracy has a gap less than 1% to full-precision in Top-5. On the human pose estimation, we achieve 261 frames per second on ZU2EG, which is 1.78x speed up compared to 8A8W and the accuracy has only 1.62% gap to full-precision. This proves that our solution has better universality.\n\t"}, "conf/icct/YangXJJZ20": {"title": "High Altitude Platform Station Communication as an Enabler for Massive Internet of Things.", "url": "https://doi.org/10.1109/ICCT50939.2020.9295655", "year": "2020", "author": {"Wei Yang 0014": "03/1094-14", "Dongliang Xie": "27/3906", "Xiaojun Jing": "98/3588", "Qiaojie Jiang": "284/2341", "Jing Zeng": "44/3331"}, "abstract": " Abstract:Driven by the Internet of Things (IoT) enabled massively data-intensive applications, there is a need for technological advancements and evolutions for wireless communications beyond the fifth-generation (5G) networks. Here, 6G is expected to extend the 5G capabilities to very high levels where millions of connected devices and applications could operate seamlessly with high data rates and low latency. High Altitude Platform Station (HAPS) communication is an emerging technology for addressing the wide range coverage in mobile networks to support rapidly growing massive IoT services as well as applications, and would thus play a major role in supporting massive interconnectivity in IoT with highly diverse service requirements. To address the complex and dynamic access issues, we propose an efficient Markov chain based channel model. Simulation results demonstrate the effectiveness of proposed Markov chain based channel model on meet the exceptional demands of ubiquitous connectivity in future 6G enabled IoT."}, "conf/infocom/0001LWXDXWZ20": {"title": "Neural Tensor Completion for Accurate Network Monitoring.", "url": "https://doi.org/10.1109/INFOCOM41043.2020.9155366", "year": "2020", "author": {"Kun Xie 0001": "98/476-1", "Huali Lu": "197/6869", "Xin Wang 0001": "10/5630-1", "Gaogang Xie": "01/2888", "Yong Ding": "45/4509", "Dongliang Xie": "27/3906", "Jigang Wen": "92/1480", "Dafang Zhang": "16/2420"}, "abstract": " Abstract:Monitoring the performance of a large network is very costly. Instead, a subset of paths or time intervals of the network can be measured while inferring the remaining network data by leveraging their spatiotemporal correlations. The quality of missing data recovery highly relies on the inference algorithms. Tensor completion has attracted some recent attentions with its capability of exploiting the multi-dimensional data structure for more accurate missing data inference. However, current tensor completion algorithms only model the three-order interaction of data features through the inner product, which is insufficient to capture the high-order, nonlinear correlations across different feature dimensions. In this paper, we propose a novel Neural Tensor Completion (NTC) scheme to effectively model three-order interaction among data features with the outer product and build a 3D interaction map. Based on which, we apply 3D convolution to learn features of high-order interaction from the local range to the global range. We demonstrate this will lead to good learning ability. We conduct extensive experiments on two real-world network monitoring datasets, Abilene and WS-DREAM, to demonstrate that NTC can significantly reduce the error in missing data recovery. When the sampling ratio is low at 1%, the recovery error ratios on the testing data are around 0.05 (Abilene) and 0.13 (WS-DREAM) when using NTC, but are 0.99 (Abilene) and 0.99 (WS-DREAM) using the best current tensor completion algorithms, which are 21 times and 8 times larger."}, "conf/mm/YangXWYDY20": {"title": "Learning Tuple Compatibility for Conditional Outfit Recommendation.", "url": "https://doi.org/10.1145/3394171.3413936", "year": "2020", "author": {"Xuewen Yang": "189/3032", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Jiangbo Yuan": "119/1492", "Wanying Ding": "139/6912", "Pengyun Yan": "272/8772"}, "abstract": "\n\t\tOutfit recommendation requires the answers of some challenging outfit compatibility questions such as 'Which pair of boots and school bag go well with my jeans and sweater?'. It is more complicated than conventional similarity search, and needs to consider not only visual aesthetics but also the intrinsic fine-grained and multi-category nature of fashion items. Some existing approaches solve the problem through sequential models or learning pair-wise distances between items. However, most of them only consider coarse category information in defining fashion compatibility while neglecting the fine-grained category information often desired in practical applications. To better define the fashion compatibility and more flexibly meet different needs, we propose a novel problem of learning compatibility among multiple tuples (each consisting of an item and category pair), and recommending fashion items following the category choices from customers. Our contributions include: 1) Designing a Mixed Category Attention Net (MCAN) which integrates both fine-grained and coarse category information into recommendation and learns the compatibility among fashion tuples. MCAN can explicitly and effectively generate diverse and controllable recommendations based on need. 2) Contributing a new dataset IQON, which follows eastern culture and can be used to test the generalization of recommendation systems. Our extensive experiments on a reference dataset Polyvore and our dataset IQON demonstrate that our method significantly outperforms state-of-the-art recommendation methods.\n\t"}, "conf/aicas/PengTJGXXLS019": {"title": "Multi-task ADAS system on FPGA.", "url": "https://doi.org/10.1109/AICAS.2019.8771615", "year": "2019", "author": {"Jinzhang Peng": "54/6166", "Lu Tian": "48/913", "Xijie Jia": "186/8733", "Haotian Guo": "245/8320", "Yongsheng Xu": "80/1986", "Dongliang Xie": "27/3906", "Hong Luo": "67/876", "Yi Shan": "74/7863", "Yu Wang 0002": "w/YuWang2"}, "abstract": " Abstract:Advanced Driver-Assistance Systems (ADAS) can help drivers in the driving process and increase the driving safety by automatically detecting objects, doing basic classification, implementing safeguards, etc. ADAS integrate multiple subsystems including object detection, scene segmentation, lane detection, and so on. Most algorithms are now designed for one specific task, while such separate approaches will be inefficient in ADAS which consists of many modules. In this paper, we establish a multi-task learning framework for lane detection, semantic segmentation, 2D object detection, and orientation prediction on FPGA. The performance on FPGA is optimized by software and hardware co-design. The system deployed on Xilinx zu9 board achieves 55 FPS, which meets real-time processing requirement."}, "conf/aistats/LiuXW19": {"title": "Generalized Boltzmann Machine with Deep Neural Structure.", "url": "http://proceedings.mlr.press/v89/liu19b.html", "year": "2019", "author": {"Yingru Liu": "160/6116", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1"}, "abstract": ""}, "conf/emnlp/YangLXWB19": {"title": "Latent Part-of-Speech Sequences for Neural Machine Translation.", "url": "https://doi.org/10.18653/v1/D19-1072", "year": "2019", "author": {"Xuewen Yang": "189/3032", "Yingru Liu": "160/6116", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Niranjan Balasubramanian": "40/1931"}, "abstract": ""}, "conf/fpga/ZengLLKXSHWY19": {"title": "A Fine-Grained Sparse Accelerator for Multi-Precision DNN.", "url": "https://doi.org/10.1145/3289602.3293964", "year": "2019", "author": {"Shulin Zeng": "211/7708", "Yujun Lin 0001": "121/1067-1", "Shuang Liang": "20/1080", "Junlong Kang": "192/1306", "Dongliang Xie": "27/3906", "Yi Shan": "74/7863", "Song Han 0003": "80/806-3", "Yu Wang 0002": "w/YuWang2", "Huazhong Yang": "94/1128"}, "abstract": "\n\t\tNeural Networks (NNs) have made a significant breakthrough in many fields, while they also pose a great challenge to hardware platforms since the state-of-the-art neural networks are both communicational- and computational-intensive. Researchers proposed model compression algorithms using sparsification and quantization, along with specific hardware architecture designs, to accelerate various applications. However, the irregularity of memory access caused by the sparsity severely damages the regularity of intensive computation loops. Therefore, the architecture design for sparse neural networks is crucial to better software and hardware co-design for neural network applications. To face these challenges, this paper first analyzes the computation patterns of different NN structures and unify them into the form of sparse matrix-vector multiplication, sparse matrix-matrix multiplication, and element-wise multiplication. On the basis of the EIE which supports only the fully-connected network and recurrent neural network (RNN), we expand it to support the convolution neural network (CNN) using the input vector transform unit. This paper designs a multi-precision multiplier with supporting datapath, which makes the proposed architecture have a better acceleration effect in the low-bit quantization with the same hardware architecture. The proposed accelerator architecture can achieve the equivalent performance and energy efficiency up to 574.2 GOPS, 42.8 GOPS/W for CNN and 110.4 GOPS, 8.24 GOPS/W for RNN under 4-bit quantization on Xilinx XCKU115 FPGA running at 200MHz. And it is the state-of-the-art accelerator supporting CNN-RNN-based models like the long-term recurrent convolutional network with 571.1 GOPS performance and 42.6 GOPS/W energy efficiency under 4-bit data format.\n\t"}, "conf/fpl/0013ZJTLSXS19": {"title": "A High-Performance CNN Processor Based on FPGA for MobileNets.", "url": "https://doi.org/10.1109/FPL.2019.00030", "year": "2019", "author": {"Di Wu 0013": "52/328-13", "Yu Zhang": "50/671", "Xijie Jia": "186/8733", "Lu Tian": "48/913", "Tianping Li": "126/7814", "Lingzhi Sui": "157/9925", "Dongliang Xie": "27/3906", "Yi Shan": "74/7863"}, "abstract": " Abstract:Convolution neural networks (CNNs) have been widely applied in the fields of computer vision tasks. However, it is hard to deploy those standard neural networks into embedded devices because of their large amount of operations and parameters. MobileNet, the state-of-the-art CNN which adopts depthwise separable convolution to replace the standard convolution has significantly reduced operations and parameters with only limited loss in accuracy. A high-performance CNN processor based on FPGA is proposed in this paper. To improve the efficiency, two dedicated computing engines named Conv Engine and Dwcv Engine were designed for pointwise convolution and depthwise convolution respectively. The schedule for Conv Engine and Dwcv Engine has significantly improved the efficiency of our accelerator. Furthermore, we designed a special architecture called Channel Augmentation to improve the efficiency in the first layer of MobileNets. The accelerator can be flexibly deployed to various devices with different configurations to balance hardware resources and computational performance. We implemented our accelerator on ZU2 and ZU9 MPSoC FPGAs. The classification on ImageNet achieved 205.3 frames per second(fps) on ZU2 and 809.8 fps on ZU9, which is 15.4x speedup on ZU2 and 60.7x speedup on ZU9 compared to CPU. We also deployed MobileNet + SSD network on our accelerator for object detection, and achieved 31.0 fps on ZU2 and 124.3 fps on ZU9."}, "conf/icmcs/LiuXW19": {"title": "Energy-Based Recurrent Model for Stochastic Modeling of Music.", "url": "https://doi.org/10.1109/ICME.2019.00049", "year": "2019", "author": {"Yingru Liu": "160/6116", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1"}, "abstract": " Abstract:The aim of this work is to more accurately model the stochastic process of music-related data, which is essential for many AI applications in musicology. When music is naturally represented as a sequence of vectorized frames, existing models generally cannot well capture the correlation of the elements inside each frame. We propose an energy-based model called Chain Graphical Recurrent Neural Network (CGRNN) to explore the correlation of elements for more accurate modeling of the dynamics of music. In CGRNN, a probabilistic substructure named Conditional spike and slab Restricted Boltzmann Machine (C-ssRBM) is defined to better model the conditional covariance and joint distribution of elements in a frame. Besides, CGRNN is capable of tracking the evolution of music and extracting sparse features with an efficient design of temporal transition. With the estimated stochastic process of music, we further implement CGRNN to generate melodious music automatically. Extensive empirical evaluations of multiple unsupervised learning tasks are conducted on symbolic MIDI and audio sounds to demonstrate the performance of our model."}, "conf/infocom/XieLWXXLWD19": {"title": "Quick and Accurate False Data Detection in Mobile Crowd Sensing.", "url": "https://doi.org/10.1109/INFOCOM.2019.8737644", "year": "2019", "author": {"Kun Xie 0001": "98/476-1", "Xiaocan Li": "211/7466", "Xin Wang 0001": "10/5630-1", "Gaogang Xie": "01/2888", "Dongliang Xie": "27/3906", "Zhenyu Li 0001": "58/5750-1", "Jigang Wen": "92/1480", "Zulong Diao": "237/2076"}, "abstract": " Abstract:With the proliferation of smartphones, a novel sensing paradigm called Mobile Crowd Sensing (MCS) has emerged very recently. However, the attacks and faults in MCS cause a serious false data problem. Observing the intrinsic low dimensionality of general monitoring data and the sparsity of false data, false data detection can be performed based on the separation of normal data and anomalies. Although the existing separation algorithm based on Direct Robust Matrix Factorization (DRMF) is proven to be effective, requiring iteratively performing Singular Value Decomposition (SVD) for low-rank matrix approximation would result in a prohibitively high accumulated computation cost when the data matrix is large. In this work, we observe the quick false data location feature from our empirical study of DRMF, based on which we propose an intelligent Light weight Low Rank and False Matrix Separation algorithm (LightLRFMS) that can reuse the previous result of the matrix decomposition to deduce the one for the current iteration step. Our algorithm can largely speed up the whole iteration process. From a theoretical perspective, we validate that LightLRFMS only requires one round of SVD computation and thus has very low computation cost. We have done extensive experiments using a PM 2.5 air condition trace and a road traffic trace. Our results demonstrate that LightLRFMS can achieve very good false data detection performance with the same highest detection accuracy as DRMF but with up to 10 times faster speed thanks to its lower computation cost."}, "conf/fpt/FangTWLXCSYSSW18": {"title": "Real-Time Object Detection and Semantic Segmentation Hardware System with Deep Learning Networks.", "url": "https://doi.org/10.1109/FPT.2018.00081", "year": "2018", "author": {"Shaoxia Fang": "93/10799", "Lu Tian": "48/913", "Junbin Wang": "158/8189", "Shuang Liang": "20/1080", "Dongliang Xie": "27/3906", "Zhongmin Chen": "60/10980", "Lingzhi Sui": "157/9925", "Qian Yu": "16/3790", "Xiaoming Sun": "87/285", "Yi Shan": "74/7863", "Yu Wang 0002": "w/YuWang2"}, "abstract": " Abstract:Advanced Driver Assistance Systems (ADAS) help the driver in the driving process by detecting objects, doing basic classification, implementing safety guards and so on. Convolution Neural Networks (CNN) has been proved to be an essential to support ADAS. We designed an architecture named Aristotle to execute neural networks for both object detection and semantic segmentation on FPGA. DNNDK (Deep Learning Development Toolkit), a full-stack software tool, with tens of compilation optimization techniques is proposed to improve the energy efficiency and make it easy to develop. The Aristotle architecture is implemented on Xilinx ZU9 FPGA, and two networks are deployed on it to execute object detection and semantic segmentation, respectively."}, "conf/icdsp/ZengGFKXSWY18": {"title": "An Efficient Reconfigurable Framework for General Purpose CNN-RNN Models on FPGAs.", "url": "https://doi.org/10.1109/ICDSP.2018.8631880", "year": "2018", "author": {"Shulin Zeng": "211/7708", "Kaiyuan Guo": "161/4716", "Shaoxia Fang": "93/10799", "Junlong Kang": "192/1306", "Dongliang Xie": "27/3906", "Yi Shan": "74/7863", "Yu Wang 0002": "w/YuWang2", "Huazhong Yang": "94/1128"}, "abstract": " Abstract:Convolutional Neural Network (CNN) and Recurrent Neural Network (RNN) have made great progress in machine learning community. Combining CNN and RNN can accomplish more general and complex tasks. Many specially designed hardware accelerators on FPGA or ASIC have been proposed for CNN or RNN, yet few of them focus on CNN-RNN-based models for general purpose applications. In this paper, we propose a complete design framework for deploying general-purpose CNNRNN-based models on FPGAs. We use Deephi Aristotle and Descartes IPs to build an efficient and reconfigurable hardware system with the support of Deephi's toolchains and Xilinx SDSoC environment. We also design a CNN-RNN-based co-optimization method which can find the IP configuration to achieve the maximum throughput under the given FPGA resources and neural network models. Our implementation on the Xilinx ZU5EG FPGA achieves the throughput of 690.76GOPS and the energy efficiency of 86.34GOPS/W on LRCN network."}, "conf/infocom/Cordova-GarciaX18": {"title": "Restricting Involuntary Extension of Failures in Smart Grids using Social Network Metrics.", "url": "https://doi.org/10.1109/INFOCOM.2018.8485823", "year": "2018", "author": {"Jose Cordova-Garcia": "159/1222", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1"}, "abstract": " Abstract:Modern communication technologies are expected to be available in the future Smart Grids to enable the control of equipments over the whole power grid. In this paper, we consider such networked control approach to address failures that may occur at any location of the grid, due to attacks or unit malfunction, and provide a wide-scale solution that prevent the failure impacts from spreading over a large area. Different from literature work that focuses on modifying power equations under the standard constraints of the power system, we estimate the impact of controlling different nodes on topological areas of the grid based on social metrics, which are derived from the graph capturing both the topological and electrical properties of the power grid. We propose a failure control algorithm for topological containment of failures in smart grid. Our algorithm also takes careful consideration of the impact the planned control has on the grid to avoid the possibly involuntary failure extension. We show that social metrics can efficiently trade off between the topological and electrical characteristics revealed by the power grid graph representation. We evaluate the performance against networked control strategies that only use power models to determine the actions to be performed at power nodes. Our results show that the proposed control scheme can effectively contain failures within their original location range."}, "conf/mm/YangXW18": {"title": "Crossing-Domain Generative Adversarial Networks for Unsupervised Multi-Domain Image-to-Image Translation.", "url": "https://doi.org/10.1145/3240508.3240716", "year": "2018", "author": {"Xuewen Yang": "189/3032", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1"}, "abstract": "\n\t\tState-of-the-art techniques in Generative Adversarial Networks (GANs) have shown remarkable success in image-to-image translation from peer domain X to domain Y using paired image data. However, obtaining abundant paired data is a non-trivial and expensive process in the majority of applications. When there is a need to translate images across n domains, if the training is performed between every two domains, the complexity of the training will increase quadratically. Moreover, training with data from two domains only at a time cannot benefit from data of other domains, which prevents the extraction of more useful features and hinders the progress of this research area. In this work, we propose a general framework for unsupervised image-to-image translation across multiple domains, which can translate images from domain X to any a domain without requiring direct training between the two domains involved in image translation. A byproduct of the framework is the reduction of computing time and computing resources since it needs less time than training the domains in pairs as is done in state-of-the-art works. Our proposed framework consists of a pair of encoders along with a pair of GANs which learns high-level features across different domains to generate diverse and realistic samples from. Our framework shows competing results on many image-to-image tasks compared with state-of-the-art techniques.\n\t"}, "conf/pricai/WangXW18": {"title": "Robust and Real-Time Face Swapping Based on Face Segmentation and CANDIDE-3.", "url": "https://doi.org/10.1007/978-3-319-97310-4_38", "year": "2018", "author": {"Haosen Wang": "195/1701", "Dongliang Xie": "27/3906", "Lu Wei": "12/2554"}, "abstract": "Despite some successes have been made in face swapping research, face swapping is still not robust and real-time enough. In this paper, a robust and real-time method for face swapping based on face segmentation and CANDIDE-3 is proposed. We implement our method through four steps: face detection, face alignment, modelling and swapping. We test our method on three publicly available datasets and some videos, and results show that our method can effectively improve the robust and real-time performance of face swapping.KeywordsFace swappingFace segmentationCANDIDE-3 model"}, "conf/fpga/HanKMHLLXLYWYD17": {"title": "ESE: Efficient Speech Recognition Engine with Sparse LSTM on FPGA.", "url": "http://dl.acm.org/citation.cfm?id=3021745", "year": "2017", "author": {"Song Han 0003": "80/806-3", "Junlong Kang": "192/1306", "Huizi Mao": "169/9863", "Yiming Hu": "68/5169", "Xin Li": "09/1365", "Yubin Li": "62/8111", "Dongliang Xie": "27/3906", "Hong Luo": "67/876", "Song Yao": "85/7898", "Yu Wang 0002": "w/YuWang2", "Huazhong Yang": "94/1128", "William (Bill) J. Dally": "d/WJDally"}, "abstract": "\n\t\tLong Short-Term Memory (LSTM) is widely used in speech recognition. In order to achieve higher prediction accuracy, machine learning scientists have built increasingly larger models. Such large model is both computation intensive and memory intensive. Deploying such bulky model results in high power consumption and leads to a high total cost of ownership (TCO) of a data center. To speedup the prediction and make it energy efficient, we first propose a load-balance-aware pruning method that can compress the LSTM model size by 20x (10x from pruning and 2x from quantization) with negligible loss of the prediction accuracy. The pruned model is friendly for parallel processing. Next, we propose a scheduler that encodes and partitions the compressed model to multiple PEs for parallelism and schedule the complicated LSTM data flow. Finally, we design the hardware architecture, named Efficient Speech Recognition Engine (ESE) that works directly on the sparse LSTM model. Implemented on Xilinx KU060 FPGA running at 200MHz, ESE has a performance of 282 GOPS working directly on the sparse LSTM network, corresponding to 2.52 TOPS on the dense one, and processes a full LSTM for speech recognition with a power dissipation of 41 Watts. Evaluated on the LSTM for speech recognition benchmark, ESE is 43x and 3x faster than Core i7 5930k CPU and Pascal Titan X GPU implementations. It achieves 40x and 11.5x higher energy efficiency compared with the CPU and GPU respectively.\n\t"}, "conf/icdcs/XieLWXCWX16": {"title": "Decentralized Context Sharing in Vehicular Delay Tolerant Networks with Compressive Sensing.", "url": "https://doi.org/10.1109/ICDCS.2016.83", "year": "2016", "author": {"Kun Xie 0001": "98/476-1", "Wang Luo": "20/4374", "Xin Wang 0001": "10/5630-1", "Dongliang Xie": "27/3906", "Jiannong Cao 0001": "c/JiannongCao", "Jigang Wen": "92/1480", "Gaogang Xie": "01/2888"}, "abstract": " Abstract:Vehicles equipped with various types of sensors can act as mobile sensors to monitor the road conditions. To speed up the information collection process, the monitoring data can be shared among vehicles upon their encounters to facilitate drivers to find a good route. The vehicular network experiences intermittent connectivity as a result of the mobility, which makes the inter-vehicle contact duration a scarce resource for data transmissions and the support of monitoring applications over vehicular networks a challenge. We propose a novel compressive sensing (CS)-based scheme to enable efficient decentralized context sharing in vehicular delay tolerant networks, called CS-Sharing. To greatly reduce the data transmission overhead and speed up the monitoring processing, CS-sharing exploits two techniques: sending an aggregate message in each vehicle encounter, and quick collection of information taking advantage of data sharing and the sparsity of events in vehicle networks to significantly reduce the number of measurements needed for global information recovery. We propose a novel data structure, and an aggregation method that can take advantage of the random and opportunistic vehicle encounters to form the measurement matrix. We prove that the measurement matrix satisfies the Restricted Isometry Property (RIP) property required by the CS technique. Our results from extensive simulations demonstrate that CS-Sharing allows vehicles in a large network to quickly obtain the full context data with the successful recovery ratio larger than 90%."}, "conf/iwqos/Xie0LM16": {"title": "Exploiting time-varying graphs for data forwarding in mobile social Delay-Tolerant Networks.", "url": "https://doi.org/10.1109/IWQoS.2016.7590436", "year": "2016", "author": {"Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Lanchao Liu": "16/8970", "Linhui Ma": "187/7010"}, "abstract": " Abstract:With the rapid shift from end-to-end communications to content-based data sharing, there are increasing interests in exploiting mobile social Delay-Tolerant Networks (social DTNs) to deliver data, where the forwarding decision is usually made by comparing the social metrics of encountered nodes. Existing studies mostly derive long-term statistical social metrics without considering the temporal impact from node mobility. We exploit the time-varying contact graphs to analyze the dynamics of social DTNs based on two groups of datasets. Based on the analysis, we derive the time-varying characteristics of node contacts, durative and periodicity, and apply them to more accurately predict the corresponding time-varying social metrics (TSMs). We further propose a two-stage opportunistic forwarding strategy to select relays based on TSMs. Our simulation results verify the importance of the two properties we observe and the effectiveness of our algorithm in tracking time-varying social metrics. We also show the potential of our algorithm in finding general time varying metrics to improve the data dissemination performance of other opportunistic forwarding schemes."}, "conf/iwqos/Xie0M16": {"title": "Lexicographical order Max-Min fair source quota allocation in mobile Delay-Tolerant Networks.", "url": "https://doi.org/10.1109/IWQoS.2016.7590424", "year": "2016", "author": {"Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Linhui Ma": "187/7010"}, "abstract": " Abstract:There is a big potential to enable more efficient data dissemination in mobile Delay-Tolerant Networks (DTNs) with the concurrent use of multi-copy forwarding and social metrics. However, this also leads to the possibility of severely overloading the relay nodes with high social metrics, and consequent performance degradation. We propose a fair source quota allocation algorithm to effectively alleviate the load while ensuring their dissemination fairness, i.e, Lexicographical order Max-Min Fairness(LMMF). In this paper, A fair source quota allocation algorithm along with an implementation scheme was presented to take advantage of the features of social networks and social forwarding for higher delivery performance. Extensive simulations based on trace data demonstrate that our mechanism greatly reduces the delivery-ratio degradation caused by uneven load while ensuring fairness among the network users."}, "conf/iwqos/Xie0W16": {"title": "Network Codes-based Multi-Source Transmission Control Protocol for Content-centric Networks.", "url": "https://doi.org/10.1109/IWQoS.2016.7590427", "year": "2016", "author": {"Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Qingtao Wang": "186/0816"}, "abstract": " Abstract:With the rapid shift from end-to-end communications to content-based data retrieval, there are increasing interests in exploiting Content-centric Networks (CCN) to deliver data. As the special characteristics of CCN, in-network caching and naming-based routing make traditional TCP-like transmission control protocol unsuitable. Although there are some existing efforts on improving the congestion control in CCN, the big issue of redundant transmissions caused by multiple sources has received little attention. To eliminate the redundancy and speed up the transmission, we propose a complete Network Codes-based Multi-Source Transmission Control Protocol (MSTCP), which provides an efficient and controllable multi-source content retrieval service over CCN. MSTCP takes advantage of random network coding to make full use of the coded data responded by different sources to speed up decoding and data receiving at the request side. Moreover, we design a scheduling algorithm based on a simple Expected Reception Deadline (ERD) to efficiently control the number of coded packets to send at each source. This not only effectively eliminates the redundant transmissions in CCN, but also helps to significantly speed up the information retrieval. Extensive simulations show that our mechanism greatly reduces the redundancy while speeding up the content retrievals by the network users."}, "conf/iccve/WangXJ15": {"title": "Network codes-based content-centric transmission control in VANET.", "url": "https://doi.org/10.1109/ICCVE.2015.26", "year": "2015", "author": {"Qingtao Wang": "186/0816", "Dongliang Xie": "27/3906", "Xiangyang Ji": "53/15"}, "abstract": " Abstract:The boost of wireless technology brings dramatic growth for Vehicular ad-hoc networks(VANETs). The effective routing and forwarding protocol is critical for the performance of VANETs thus influence the automatic driving and information distribution. The dynamic characteristic of vehicle to vehicle(V2V) communications makes it hard to maintain a reliable path between vehicles. In order to improve transmission performance in VANETs, we make full use of the Content-centric information dissemination, and there are some existing efforts on proving feasibility of content-centric network(CCN). In this paper, we propose a novel Source Selection Dynamically Network Coding-based Information Centric Network protocol (SSDNC), which introduces CCN architecture in VANET. SSDNC exploit the features of CCN to make multiple sources exist. With the application of Analytic Hierarchy Process(AHP), requested symbols can be distributed adaptively to different interfaces according to their weight. Then the forwarding decisions will be made to obtain the information that makes transmission more effective. Moreover, we take advantage of network coding (NC) to eliminate the network redundancy for the purpose of achieving higher performance. We evaluate the performance of the SSDNC using ndnSIM over NS-3 network simulator, which focused on the size of chunk, throughput and average transmission delay and compared with ICTP [1]. The result shows that the performance of our protocol is better than ICTP."}, "conf/iccve/LiuXWZ15": {"title": "CCN-based cooperative caching in VANET.", "url": "https://doi.org/10.1109/ICCVE.2015.24", "year": "2015", "author": {"Lanchao Liu": "16/8970", "Dongliang Xie": "27/3906", "Siyu Wang": "168/9309", "Zhen Zhang": "19/5112"}, "abstract": " Abstract:Vihicular Ad hoc Network(VANET) has developed rapidly in recent years, which requires information sharing, especially in secure and efficient driving. Content-centric Network (CCN) performs better in content retrieving with its in-network caching and naming-based routing. Whether to select a node as a caching point is very important for communications in VANET beacause of the shiftting from end-to-end communication to content-oriented communication. In order to get better content retrieval performance, we adapt the behaviour of CCN nodes for VANET. To decide which node being the caching point, we propose a node selection algorithm based on the minimum vertex cover set theory in static networks. Furthermore, we propose Collaborative Caching Based on Socialized Relations (CCBSR) to determine the caching point to solve the disconnecty caused by the mobility of vehicles. Extensive simulations in highway show that our mechanism speeds up the content retrieval and makes the video more fluent."}, "conf/iccve/BaiXWZ15": {"title": "Multi-path transmission protocol in VANET.", "url": "https://doi.org/10.1109/ICCVE.2015.25", "year": "2015", "author": {"Yuhong Bai": "186/0693", "Dongliang Xie": "27/3906", "Siyu Wang": "168/9309", "Ming Zhong": "92/2292"}, "abstract": " Abstract:The VANET requires fast and reliable data transmission, the multi-path transmission makes the transmission more efficient. Although there are some existing multi-path transmission control protocols, the transmission performance is still a big issue caused by the link-heterogeneity in VANET. To solve the bottleneck problem and improve the transmission efficiency, we propose a novel Network Codes-based Multi-Path transmission control protocol(NCMPTCP), which provides an efficient and reliable transmission in VANET. NCMPTCP takes advantage of network coding to eliminate the difference of data packets. Moreover, we design a redundancy control algorithm and a scheduling algorithm based on the estimated delivery time. These not only effectively reduce the transmission delay, but also make a big improvement of the throughput. Extensive simulations successfully validate our proposed protocol."}, "conf/infocom/XieW0XZXW15": {"title": "Sequential and adaptive sampling for matrix completion in network monitoring systems.", "url": "https://doi.org/10.1109/INFOCOM.2015.7218633", "year": "2015", "author": {"Kun Xie 0001": "98/476-1", "Lele Wang 0003": "11/7909-3", "Xin Wang 0001": "10/5630-1", "Gaogang Xie": "01/2888", "Guangxing Zhang": "87/4248", "Dongliang Xie": "27/3906", "Jigang Wen": "92/1480"}, "abstract": " Abstract:End-to-end network monitoring is essential to ensure transmission quality for Internet applications. However, in large-scale networks, full-mesh measurement of network performance between all transmission pairs is infeasible. As a newly emerging sparsity representation technique, matrix completion allows the recovery of a low-rank matrix using only a small number of random samples. Existing schemes often fix the number of samples assuming the rank of the matrix is known, while the data features thus the matrix rank vary over time. In this paper, we propose to exploit the matrix completion techniques to derive the end-to-end network performance among all node pairs by only measuring a small subset of end-to-end paths. To address the challenge of rank change in the practical system, we propose a sequential and information-based adaptive sampling scheme, along with a novel sampling stopping condition. Our scheme is based only on the data observed without relying on the reconstruction method or the knowledge on the sparsity of unknown data. We have performed extensive simulations based on real-world trace data, and the results demonstrate that our scheme can significantly reduce the measurement cost while ensuring high accuracy in obtaining the whole network performance data."}, "conf/mass/YanWYX15": {"title": "Connecting Robots with Concurrent Exploration of Control and Communications.", "url": "https://doi.org/10.1109/MASS.2015.32", "year": "2015", "author": {"Zhe Yan": "92/7993", "Xin Wang 0001": "10/5630-1", "Daegeun Yoon": "174/2155", "Dongliang Xie": "27/3906"}, "abstract": " Abstract:Multi-robot systems (MRS) have many applications and the efficient operation of MRS relies on coordination of robots. However, it is difficult to build network connections among randomly distributed robots in the presence of robot movements and weak wireless channels. In this work, we propose to jointly exploit communications and motion control to efficiently establish robot connections. To achieve this goal, we concurrently use MUSIC and particle filter to more accurately and efficiently estimate robot signal directions, built on which signal strength-based potential field is formed to control robot motion to establish and maintain communication links. Our studies based on test bed and simulations demonstrate the effectiveness of our algorithm in networking robots, with much higher number of robots connected compared to peer algorithms."}, "conf/mass/CordovaWXZ14": {"title": "Self-Motivated Relay Selection for a Generalized Power Line Monitoring Network.", "url": "https://doi.org/10.1109/MASS.2014.109", "year": "2014", "author": {"Jose Cordova": "159/1222", "Xin Wang 0001": "10/5630-1", "Dongliang Xie": "27/3906", "Lei Zuo": "35/1274"}, "abstract": " Abstract:Efficient power line monitoring is essential for reliable operation of the Smart Grid. A Power Line Monitoring Network (PLMN) based on wireless sensor nodes can provide the necessary infrastructure to deliver data from the extension of the power grid to one or several control centers. However, the restricted physical topology of the power lines constrains the data paths, and has a great impact on the reporting performance. We discuss the features of power-lines and their impact on the performance of monitoring and transmissions. We present a comprehensive design to guide efficient and flexible relay selection in PLMNs to ensure reliable and energy efficient transmissions while taking into account the restricted topology of power-lines. Specifically, our design applies probabilistic power control along with flexible transmission scheduling to combat the poor channel conditions around power line while maintaining the energy level of transmission nodes. We evaluate the impact of different channel conditions, non-uniform topologies for a power line corridor and the effect of reporting events. Our performance results demonstrate that our data forwarding scheme can well control the energy consumption and delay while ensuring reliability and extended lifetime."}, "conf/nas/YueXZZ13": {"title": "E-HiLow: Extended Hierarchical Routing Protocol in 6LoWPAN Wireless Sensor Network.", "url": "https://doi.org/10.1109/NAS.2013.8", "year": "2013", "author": {"Li Yue 0005": "86/2025-5", "Dongliang Xie": "27/3906", "Jiatong Zhao": "140/0820", "Jie Zhang": "84/6889"}, "abstract": " Abstract:Deploying the IPv6 protocol in Wireless Sensor Network (WSN) is the key issue of ubiquitous intelligence and mobile computing in the future. IETF 6LoWPAN enables the IPv6 protocol over IEEE 802.15.4 Low-power Wireless Personal Area Networks (Low PAN). The paper proposes an extended hierarchical routing protocol (E-HiLow), which reduces the memory requirement and the number of control packages and improve the path recovery and address allocation in HiLow. The simulation results and the analysis validates that the E-HiLow achieves better E2E packet delay and energy consumption performance."}, "conf/wowmom/ChengDFCMX11": {"title": "Streaming data delivery in multi-hop cluster-based wireless sensor networks with mobile sinks.", "url": "https://doi.org/10.1109/WoWMoM.2011.5986379", "year": "2011", "author": {"Long Cheng 0005": "49/225-5", "Sajal K. Das 0001": "d/SajalKDas", "Mario Di Francesco": "48/1923", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1", "Dongliang Xie": "27/3906"}, "abstract": " Abstract:It has been shown that sink mobility provides an energy-efficient approach to data delivery in wireless sensor networks (WSNs). Most of the approaches targeted to WSNs with mobile sinks (MSs) addressed the problem of data delivery where only a few messages are reported during a long time frame. However, transmitting streaming data is becoming relevant in WSNs, as more and more multimedia sensor nodes - equipped with image, audio, and video capabilities - are being used to characterize the sensing environment. In this scenario, a sequence of messages propagates into the network, hence the problem of finding an effective routing path for delivering data to MSs becomes even more challenging, since the communication overhead for reaching the MS might also be significant. In this paper, we present an energy-efficient streaming data delivery (SDD) protocol for cluster-based WSNs with MSs. Different from existing works, we focus on the mobility support for the delivery of streaming data in hierarchical WSNs. By introducing a cross-cluster handover mechanism and a path redirection scheme, SDD maintains the end-to-end connectivity between the source and the MS, while avoiding the constant transmission of the MS location as it moves across multiple clusters. We evaluate the performance of the proposed SDD protocol, and compare it with a hierarchical cluster-based data dissemination protocol. Simulation results demonstrate its effectiveness, in terms of both end-to-end delivery delay and energy-efficiency."}, "conf/vtc/LiCXHS09": {"title": "A Multi-hop Routing Mechanism Based on Fuzzy Estimation for Heterogeneous Wireless Networks.", "url": "https://doi.org/10.1109/VETECF.2009.5378873", "year": "2009", "author": {"Mingxin Li": "66/5692", "Shanzhi Chen": "35/1712", "Dongliang Xie": "27/3906", "Bo Hu 0003": "04/2380-3", "Yan Shi 0002": "67/2601-2"}, "abstract": " Abstract:The integration cellular networks, wireless local area networks (WLANs), and the new paradigm of mobile ad hoc networks (MANETs) is the trend for next generation mobile networks. And the multi-hop routing mechanism is an open and challenge issue in this area. In this paper, a multi-hop routing mechanism with fuzzy estimation of links for heterogeneous wireless networks (HWNs) is proposed. The mechanism comprises neighbor discover, gateway discover and route discovery, which supports the mobile hosts (MHs) outside of the service area to access BS/AP by multi-hop route. The quality of links is addressed and evaluated by comprehensive fuzzy estimation approach based on analytic hierarchy process (AHP). Furthermore, the route maintenance overhead is also analyzed and discussed. Simulations reveal that the proposed routing mechanism can effectively provide valid route and improve the quality of service and performance in HWNs."}, "conf/icc/WangXCMC08": {"title": "Deploying Multiple Mobile Sinks in Event-Driven WSNs.", "url": "https://doi.org/10.1109/ICC.2008.437", "year": "2008", "author": {"Bin Wang": "13/1898", "Dongliang Xie": "27/3906", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Deploying multiple mobile sinks is an attractive approach to enhance the performance of wireless sensor networks. In this paper, we address the scenario of two mobile sinks. The two sinks can travel in the same region or in the divided regions separately. The problems are formulated by a lattice-based network model. We deduce the network lifetime and delay of data delivery in different mobility patterns. The relation between network performance and number of mobile sinks is also discussed. Simulation results are provided to validate our theoretic analysis followed by performance comparison of different mobility patterns."}, "conf/vtc/WangXCMC08": {"title": "Employing Mobile Sink in Event-Driven Wireless Sensor Networks.", "url": "https://doi.org/10.1109/VETECS.2008.51", "year": "2008", "author": {"Bin Wang": "13/1898", "Dongliang Xie": "27/3906", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Prolonging the network lifetime and reducing the delay of event delivery are both important in event-driven multi- hop wireless sensor networks. In this paper, an optimum predefined mobility trajectory of the sink was explored to balance the two performance metrics. We focus on a lattice-based analytical model for understanding performance as system and mobility parameters are scaled. Based on the model, the theoretical analysis and the simulation results validate our statements. The case of multiple mobile sinks are also discussed and simulated."}, "conf/wicon/XieCCM08": {"title": "A patrol grid protocol for mobile wireless sensor network.", "url": "https://doi.org/10.4108/ICST.WICON2008.4861", "year": "2008", "author": {"Dongliang Xie": "27/3906", "Mingxing Chen": "00/7077", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1"}, "abstract": ""}, "conf/aina/MunirRJWXM07": {"title": "Mobile Wireless Sensor Network: Architecture and Enabling Technologies for Ubiquitous Computing.", "url": "https://doi.org/10.1109/AINAW.2007.257", "year": "2007", "author": {"Saad Ahmed Munir": "77/555", "Biao Ren": "63/6823", "Weiwei Jiao": "83/6973", "Bin Wang": "13/1898", "Dongliang Xie": "27/3906", "Jian Ma 0001": "26/4870-1"}, "abstract": " Abstract:A mobile wireless sensor network owes its name to the presence of mobile sink or sensor nodes within the network. The advantages of mobile WSN over static WSN are better energy efficiency, improved coverage, enhanced target tracking and superior channel capacity. In this paper we present and discuss hierarchical multi-tiered architecture for mobile wireless sensor network. This architecture is proposed for the future pervasive computing age. We also elaborate on the impact of mobility on different performance metrics in mobile WSN. A study of some of the possible application scenarios for pervasive computing involving mobile WSN is also presented. These application scenarios will be discussed in their implementation context. While discussing the possible applications, we also study related technologies that appear promising to be integrated with mobile WSN in the ubiquitous computing. With an enormous growth in number of cellular subscribers, we therefore place the mobile phone as the key element in future ubiquitous wireless networks. With the powerful computing, communicating and storage capacities of these mobile devices, the network performance can benefit from the architecture in terms of scalability, energy efficiency and packet delay, etc."}, "conf/msn/LiXMC07": {"title": "A MAC-Layer Retransmission Algorithm Designed for Zigbee Protocol.", "url": "https://doi.org/10.1007/978-3-540-77024-4_30", "year": "2007", "author": {"Yi Li": "59/871", "Dongliang Xie": "27/3906", "Jian Ma 0001": "26/4870-1", "Canfeng Chen": "13/2491"}, "abstract": "A typical scenarios was considered , in which an event, such as a mobile sink arriving to collect data via the wireless sensor network, initiates the collection of one packet of data from each node in the surrounding cluster. The node requesting the beacon synchronizes its time clock and purpose to the cluster and assumes the role of clusterhead. All nodes covers an area with a radius of several hundred meters, to within a few microseconds. We exploit this ability to extend the Contension Windows to improve retransmission algorithms in Zigbee MAC protocols. The result is a retransmission algorithm that uses a Extended Shared Contention Window (ESCW) that is easy to implement and results in fewer collisions than retransmission algorithms that use Binary-Exponential-Backoff (BEB). We show via numerical and simulation results that an ESCW-based Zigbee protocol performs significantly better – in terms of energy usage, throughput, and the time to complete the data collection task – than standard Zigbee (IEEE802.15.4)."}, "conf/mswim/LiCX07": {"title": "A multi-step vertical handoff mechanism for cellular multi-hop networks.", "url": "https://doi.org/10.1145/1298275.1298301", "year": "2007", "author": {"Mingxin Li": "66/5692", "Shanzhi Chen": "35/1712", "Dongliang Xie": "27/3906"}, "abstract": "\n\t\tWith the rapid development of wireless network, the integration of cellular and multi-hop networks is the trend for next generation mobile networks (NGMN). And vertical handoff is really an open and challenge issue in this area. Consequently, in this paper, a multi-step vertical handoff mechanism (MVHOM) is proposed for a cellular multi-hop network (CMN). The mechanism comprises three steps, getting location information based on arrival time in conjunction with radio signal strength (RSS), then dealing with access network selection by weight of QoS factors calculated by an integrated analytic hierarchy process (AHP) and grey relational analysis (GRA) algorithm, and finally triggering a forced vertical handoff to sustain service continuity. Simulations reveal that the proposed MVHOM can effectively improve the quality of service and performance in CMN.\n\t"}, "conf/apweb/TianXZC06": {"title": "Quasi-Bottleneck Nodes: A Potential Threat to the Lifetime of Wireless Sensor Networks.", "url": "https://doi.org/10.1007/11610496_31", "year": "2006", "author": {"Le Tian": "19/5319", "Dongliang Xie": "27/3906", "Lei Zhang": "97/8704", "Shiduan Cheng": "35/3871"}, "abstract": "Enlightened by the congestion linkage in the traditional Internet, the novel concept of bottleneck node is proposed in this paper, which is crucial to the lifetime of the wireless sensor network deployed randomly. Due to the computation complexity and the operational deployment, the quasi-bottleneck node is presented to replace the theoretical bottleneck node in the practical scenario. Theoretical analysis shows the probability of the presence of quasi-bottleneck nodes stands at high level and an algorithm to find out this kind of nodes is presented. Simulation proves the correctness of the algorithm and shows the effect of these nodes on the network behavior, such as energy consumption and packet lost rate. At last, two effective solutions to decrease the energy consumption of the quasi-bottleneck nodes are presented.KeywordsSensor NodeWireless Sensor NetworkSource NodeForwarding NodeAggregation RatioThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/icwmc/HanXTRC06": {"title": "An Adaptive Location Service for Wireless Sensor Networks with Mobile Sinks.", "url": "https://doi.org/10.1109/ICWMC.2006.19", "year": "2006", "author": {"Bing Han": "74/2721", "Dongliang Xie": "27/3906", "Le Tian": "19/5319", "Biao Ren": "63/6823", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:How to provide the sensor nodes with the locations of mobile sinks with minimum energy consumption is a key issue to the performance of the geographic location based routing protocols. In this paper, we investigate three location update methods: Neighbour update (NUPD), Flooding update (FUPD) and Unicast update (UUPD). We get the analytical expression of energy consumption of each method. Based on the comparison results of the performance of these methods under various network conditions, we propose an adaptive location service for mobile sinks in WSN, which enables the mobile sinks to send their current location to the sensor nodes efficiently according to various data traffic characteristics, network size and node density. We evaluate the performance of our location service by comprehensive simulations and compared it with the TTDD protocol. The results show that while keeping the packet delay below an upper bound, our location update algorithm can effectively decrease the energy consumption thus prolong the network lifetime."}, "journals/access/YangZZZJX21": {"title": "MVTLR-HCFS: Density Peak Algorithm Based on Multi-View and Tensor Low Rank Expression.", "url": "https://doi.org/10.1109/ACCESS.2021.3052248", "year": "2021", "author": {"Wei Yang 0014": "03/1094-14", "Linlin Zhuo": "243/4152", "Jing Zeng": "44/3331", "Yijun Zhao": "147/2217", "Qiaojie Jiang": "284/2341", "Dongliang Xie": "27/3906"}, "abstract": " Abstract:With the rapid development of hardware and software technology, modern industry has produced a large amount of high-dimensional unlabeled data, such as pictures and videos. As clusters of these data sets may exist in some subspaces, traditional algorithms are no longer applicable. The related algorithms based on sparse subspace can find clusters in the subspace, which solves the problem of high data dimension. However, their clustering process based on only one single feature, which results in their performance being particularly sensitive to this single view. Affected by the integrated algorithm, a large number of multi-view methods began to emerge. These methods improve the clustering performance by integrating the subspace expressions of multiple views, but the problem is that the complementary information of multiple views cannot be fully considered. In addition, the problem of non-uniform distribution in clusters also exists in high-dimensional data sets. In this paper, based on the multi-view subspace clustering method, a clustering algorithm based on tensor low rank expression is proposed to solve the clustering problem of high-dimensional datasets. On the one hand, this paper solves the problem of noise and data corruption by combining the method of ℓ\n2,1\n norms, which transform the optimization problem of solving multi-view subspace expression into a low-rank expression problem of tensor to fully consider the complementarities between views. On the other hand, the proposed scheme solves the problem of nonuniform distribution in clusters in high-dimensional data by combining with the density peak algorithm based on hierarchical strategy. Experiment results show the effectiveness of the algorithm."}, "journals/access/ZhangSSJX21": {"title": "Federated Transfer Learning for IIoT Devices With Low Computing Power Based on Blockchain and Edge Computing.", "url": "https://doi.org/10.1109/ACCESS.2021.3095078", "year": "2021", "author": {"Peiying Zhang": "24/9047", "Hao Sun": "82/2248", "Jingyi Situ": "297/3596", "Chunxiao Jiang": "00/8334", "Dongliang Xie": "27/3906"}, "abstract": " Abstract:With the development of artificial intelligence and Internet of Things (IoT), the era of industry 4.0 has come. According to the prediction of IBM, with the continuous popularization of 5G technology, the IoT technology will be more widely used in factories. In recent years, federated learning has become a hot topic for Industrial Internet of Things (IIoT) researchers. However, many devices in the IIoT currently have a problem of low computing power, so these devices cannot perform well facing the tasks of training and updating models in federated learning. In order to solve the above problems, we introduce edge computing into the IIot, so that the device can complete the federated learning operation. In order to ensure the security of data transmission, blockchain is introduced as the main algorithm of equipment authentication in the system. What's more, in order to increase the efficiency and versatility of training model in IIoT, we introduce transfer learning to improve the system performance. The experimental results show that our algorithm can achieve high security and high training accuracy."}, "journals/access/SunHKKKZX21": {"title": "Security Enhanced Sentence Similarity Computing Model Based on Convolutional Neural Network.", "url": "https://doi.org/10.1109/ACCESS.2021.3099489", "year": "2021", "author": {"Qifeng Sun": "175/8823", "Xingzhe Huang": "255/8215", "Godfrey Kibalya": "157/7579", "Neeraj Kumar 0001": "04/8395", "S. V. N. Santhosh Kumar": "217/1282", "Peiying Zhang": "24/9047", "Dongliang Xie": "27/3906"}, "abstract": " Abstract:Deep learning model shows great advantages in various fields. However, researchers pay attention to how to improve the accuracy of the model, while ignoring the security considerations. The problem of controlling the judgment result of deep learning model by attack examples and then affecting the system decision-making is gradually exposed. In order to improve the security of sentence similarity analysis model, we propose a convolution neural network model based on attention mechanism. First of all, the mutual information between sentences is correlated by attention weighting. Then, it is input into improved convolutional neural network. In addition, we add attack examples to the input, which is generated by the firefly algorithm. In the attack example, we replace the words in the sentence to some extent, which results in the adversarial data with great semantic change but slight sentence structure change. To a certain extent, the addition of attack example increases the ability of model to identify adversarial data and improves the robustness of the model. Experimental results show that the accuracy, recall rate and F1 value of the model are due to other baseline models."}, "journals/wicomm/MuTXZJ21": {"title": "CNN and DCGAN for Spectrum Sensors over Rayleigh Fading Channel.", "url": "https://doi.org/10.1155/2021/9970600", "year": "2021", "author": {"Junsheng Mu": "185/3832", "Youheng Tan": "297/3522", "Dongliang Xie": "27/3906", "Fangpei Zhang": "299/4304", "Xiaojun Jing": "98/3588"}, "abstract": ""}, "journals/iet-com/MuXHJ20": {"title": "Computation-constrained spectrum sensing in IoT-based scenarios.", "url": "https://doi.org/10.1049/iet-com.2019.1367", "year": "2020", "author": {"Junsheng Mu": "185/3832", "Dongliang Xie": "27/3906", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": ""}, "journals/tnsm/LuGX20": {"title": "A Dynamic and Collaborative Multi-Layer Virtual Network Embedding Algorithm in SDN Based on Reinforcement Learning.", "url": "https://doi.org/10.1109/TNSM.2020.3012588", "year": "2020", "author": {"Meilian Lu": "150/2496", "Yun Gu": "54/10782", "Dongliang Xie": "27/3906"}, "abstract": " Abstract:Most of existing virtual network embedding (VNE) algorithms only consider how to construct virtual networks more efficiently on a physical infrastructure, without considering the possibility that the constructed virtual networks may be further virtualized to multiple smaller ones. We define the former scenario as single-layer VNE and the later as multi-layer VNE. As the increasing popularity of deploying large datacenter networks and wide area networks with Software Defined Network (SDN) architectures, it becomes a new requirement and possibility to provide multi-layer encapsulated network services for large tenants who have hierarchical organizational structures or need fine-grained service isolation. However, existing VNE algorithm are not specifically designed for the above requirement and not flexible enough to deal with mapping virtual network requirements (VNRs) to a physical network and smaller VNRs to a mapped virtual network. In this paper, we aim to propose a unified and flexible multi-layer VNE algorithm combining with reinforcement learning to solve the embedding of multi-layer VNRs, which can better distinguish the differences between VNRs and physical networks. Simulation results show that our algorithm achieves good performance both in single-layer and multi-layer VNE scenarios."}, "journals/ton/LiXWXXLWDW20": {"title": "Quick and Accurate False Data Detection in Mobile Crowd Sensing.", "url": "https://doi.org/10.1109/TNET.2020.2982685", "year": "2020", "author": {"Xiaocan Li": "211/7466", "Kun Xie 0001": "98/476-1", "Xin Wang 0001": "10/5630-1", "Gaogang Xie": "01/2888", "Dongliang Xie": "27/3906", "Zhenyu Li 0001": "58/5750-1", "Jigang Wen": "92/1480", "Zulong Diao": "237/2076", "Tian Wang 0001": "25/3246-1"}, "abstract": " Abstract:The attacks, faults, and severe communication/system conditions in Mobile Crowd Sensing (MCS) make false data detection a critical problem. Observing the intrinsic low dimensionality of general monitoring data and the sparsity of false data, false data detection can be performed based on the separation of normal data and anomalies. Although the existing separation algorithm based on Direct Robust Matrix Factorization (DRMF) is proven to be effective, requiring iteratively performing Singular Value Decomposition (SVD) for low-rank matrix approximation would result in a prohibitively high accumulated computation cost when the data matrix is large. In this work, we observe the quick false data location feature from our empirical study of DRMF, based on which we propose an intelligent Light weight Low Rank and False Matrix Separation algorithm (LightLRFMS) that can reuse the previous result of the matrix decomposition to deduce the one for the current iteration step. Depending on the type of data corruption, random or successive/mass, we design two versions of LightLRFMS. From a theoretical perspective, we validate that LightLRFMS only requires one round of SVD computation and thus has very low computation cost. We have done extensive experiments using a PM 2.5 air condition trace and a road traffic trace. Our results demonstrate that LightLRFMS can achieve very good false data detection performance with the same highest detection accuracy as DRMF but with up to 20 times faster speed thanks to its lower computation cost."}, "journals/corr/abs-2008-02693": {"title": "Fashion Captioning: Towards Generating Accurate Descriptions with Semantic Rewards.", "url": "https://arxiv.org/abs/2008.02693", "year": "2020", "author": {"Xuewen Yang": "189/3032", "Heming Zhang": "04/4972", "Di Jin": "67/1861", "Yingru Liu": "160/6116", "Chi-Hao Wu": "50/5051", "Jianchao Tan": "165/9938", "Dongliang Xie": "27/3906", "Jue Wang 0001": "69/393-1", "Xin Wang 0001": "10/5630-1"}, "abstract": "\n      Abstract:  Generating accurate descriptions for online fashion items is important not\nonly for enhancing customers' shopping experiences, but also for the increase\nof online sales. Besides the need of correctly presenting the attributes of\nitems, the expressions in an enchanting style could better attract customer\ninterests. The goal of this work is to develop a novel learning framework for\naccurate and expressive fashion captioning. Different from popular work on\nimage captioning, it is hard to identify and describe the rich attributes of\nfashion items. We seed the description of an item by first identifying its\nattributes, and introduce attribute-level semantic (ALS) reward and\nsentence-level semantic (SLS) reward as metrics to improve the quality of text\ndescriptions. We further integrate the training of our model with maximum\nlikelihood estimation (MLE), attribute embedding, and Reinforcement Learning\n(RL). To facilitate the learning, we build a new FAshion CAptioning Dataset\n(FACAD), which contains 993K images and 130K corresponding enchanting and\ndiverse descriptions. Experiments on FACAD demonstrate the effectiveness of our\nmodel.\n\n    "}, "journals/corr/abs-2008-08189": {"title": "Learning Tuple Compatibility for Conditional OutfitRecommendation.", "url": "https://arxiv.org/abs/2008.08189", "year": "2020", "author": {"Xuewen Yang": "189/3032", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Jiangbo Yuan": "119/1492", "Wanying Ding": "139/6912", "Pengyun Yan": "272/8772"}, "abstract": "\n      Abstract:  Outfit recommendation requires the answers of some challenging outfit\ncompatibility questions such as 'Which pair of boots and school bag go well\nwith my jeans and sweater?'. It is more complicated than conventional\nsimilarity search, and needs to consider not only visual aesthetics but also\nthe intrinsic fine-grained and multi-category nature of fashion items. Some\nexisting approaches solve the problem through sequential models or learning\npair-wise distances between items. However, most of them only consider coarse\ncategory information in defining fashion compatibility while neglecting the\nfine-grained category information often desired in practical applications. To\nbetter define the fashion compatibility and more flexibly meet different needs,\nwe propose a novel problem of learning compatibility among multiple tuples\n(each consisting of an item and category pair), and recommending fashion items\nfollowing the category choices from customers. Our contributions include: 1)\nDesigning a Mixed Category Attention Net (MCAN) which integrates both\nfine-grained and coarse category information into recommendation and learns the\ncompatibility among fashion tuples. MCAN can explicitly and effectively\ngenerate diverse and controllable recommendations based on need. 2)\nContributing a new dataset IQON, which follows eastern culture and can be used\nto test the generalization of recommendation systems. Our extensive experiments\non a reference dataset Polyvore and our dataset IQON demonstrate that our\nmethod significantly outperforms state-of-the-art recommendation methods.\n\n    "}, "journals/corr/abs-2008-11882": {"title": "Crossing-Domain Generative Adversarial Networks for Unsupervised Multi-Domain Image-to-Image Translation.", "url": "https://arxiv.org/abs/2008.11882", "year": "2020", "author": {"Xuewen Yang": "189/3032", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1"}, "abstract": "\n      Abstract:  State-of-the-art techniques in Generative Adversarial Networks (GANs) have\nshown remarkable success in image-to-image translation from peer domain X to\ndomain Y using paired image data. However, obtaining abundant paired data is a\nnon-trivial and expensive process in the majority of applications. When there\nis a need to translate images across n domains, if the training is performed\nbetween every two domains, the complexity of the training will increase\nquadratically. Moreover, training with data from two domains only at a time\ncannot benefit from data of other domains, which prevents the extraction of\nmore useful features and hinders the progress of this research area. In this\nwork, we propose a general framework for unsupervised image-to-image\ntranslation across multiple domains, which can translate images from domain X\nto any a domain without requiring direct training between the two domains\ninvolved in image translation. A byproduct of the framework is the reduction of\ncomputing time and computing resources, since it needs less time than training\nthe domains in pairs as is done in state-of-the-art works. Our proposed\nframework consists of a pair of encoders along with a pair of GANs which learns\nhigh-level features across different domains to generate diverse and realistic\nsamples from. Our framework shows competing results on many image-to-image\ntasks compared with state-of-the-art techniques.\n\n    "}, "journals/jsac/ZhaoXWM19": {"title": "Towards Efficient Medium Access for Millimeter-Wave Networks.", "url": "https://doi.org/10.1109/JSAC.2019.2947924", "year": "2019", "author": {"Jie Zhao 0004": "23/3168-4", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Arjuna Madanayake": "68/4217"}, "abstract": " Abstract:The need of highly directional communications at mmWave frequencies introduces high overhead for beam training and alignment, which makes the medium access control (MAC) a grand challenge. To harvest the gain for high performance transmissions in mmWave networks, we propose an efficient and integrated MAC design with the concurrent support of three closely interactive components: 1) an accurate and low-cost beam training methodology with a) multiuser, multi-level, bi-directional coarse training for fast user association and beam alignment and b) adaptive fine beam training with compressed channel measurement and multi-resolution block-sparse channel estimation in response to the channel condition and the learning from past measurements; 2) an elastic virtual resource scheduling scheme that jointly considers beam training, beam tracking and data transmissions while enabling burst data transmissions with the concurrent allocation of transmission rate and duration; and 3) a flexible and efficient beam tracking strategy to enable stable beam alignment with beamwidth adaptation and mobility estimation. Compared with literature studies, our performance results demonstrate that our design can effectively reduce the training overhead and thus significantly improve the throughput. Compared to 802.11ad, the training overhead can be reduced more than 60%, and the throughput can be more than 75% higher. In low SNR case, the throughput gain can be more than 90%. Our scheme can also achieve about 50% higher throughput in the presence of user mobility."}, "journals/tsc/XieWXXCJW19": {"title": "Distributed Multi-Dimensional Pricing for Efficient Application Offloading in Mobile Cloud Computing.", "url": "https://doi.org/10.1109/TSC.2016.2642182", "year": "2019", "author": {"Kun Xie 0001": "98/476-1", "Xin Wang 0001": "10/5630-1", "Gaogang Xie": "01/2888", "Dongliang Xie": "27/3906", "Jiannong Cao 0001": "c/JiannongCao", "Yuqin Ji": "255/2875", "Jigang Wen": "92/1480"}, "abstract": " Abstract:Offloading computation intensive applications to mobile cloud is promising for overcoming the problems of limited computational resources and energy of mobile devices. However, without considering the competition relationship of mobile users and cloudlets in the mobile cloud computing system, existing studies lack an incentive mechanism for the system to achieve efficient application offloading and cloud resource provisioning. In this paper, we design MPTMG, a Multi-dimensional Pricing mechanism based on Two-sided Market Game. We propose three types of prices: a multi-dimensional price corresponding to multi-dimensional resource allocation, a penalty price to encourage fair and high quality cloud services, and a benefit discount factor to motivate more even provisioning of resources on different dimensions in the cloud. Based on these prices, we propose a distributed price-adjustment algorithm for efficient resource allocation and QoS-aware offloading scheduling. We prove that the algorithm can converge in a finite number of iterations to the equilibrium core allocation at which the mobile cloud system achieves the Pareto efficiency by maximizing the total system benefit. To the best of our knowledge, this is the first paper that applies economic theories and pricing mechanisms to manage application offloading in mobile cloud systems. The simulation results demonstrate that our proposed pricing mechanism can significantly improve the system performance."}, "journals/tsg/Cordova-GarciaW19": {"title": "Control of Communications-Dependent Cascading Failures in Power Grids.", "url": "https://doi.org/10.1109/TSG.2018.2873217", "year": "2019", "author": {"Jose Cordova-Garcia": "159/1222", "Xin Wang 0001": "10/5630-1", "Dongliang Xie": "27/3906", "Yue Zhao 0007": "48/76-7", "Lei Zuo": "35/1274"}, "abstract": " Abstract:The most severe failures in power grids are often characterized as cascading failures where an initial event triggers consequent failures all along the grid often leading to blackouts. Upon identifying a failure and its cascade potential, timely control actions should be performed by the grid operators to mitigate the effect of the cascade. These actions have to be delivered to one or more control devices, creating a dependency between the power grid and its control network. This paper examines the dependency of the operation of the power grid on the control network. Different from literature studies on failure control, our dependency model captures the impact of networking parameters. We formulate an algorithmic model that describes the impact of this dependency on cascade control. Based on this model, we propose an efficient cascade control algorithm using load shedding with consideration of delays in the communication network for power grids. Finally, we evaluate the impact of the power-communication network dependency with uncontrolled grids, ideal/simple control grids and our proposed control scheme. The results demonstrate that the proposed algorithm can significantly reduce the failure of power lines while sustaining larger power demand for users."}, "journals/corr/abs-1908-11782": {"title": "Latent Part-of-Speech Sequences for Neural Machine Translation.", "url": "http://arxiv.org/abs/1908.11782", "year": "2019", "author": {"Xuewen Yang": "189/3032", "Yingru Liu": "160/6116", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Niranjan Balasubramanian": "40/1931"}, "abstract": "\n      Abstract:  Learning target side syntactic structure has been shown to improve Neural\nMachine Translation (NMT). However, incorporating syntax through latent\nvariables introduces additional complexity in inference, as the models need to\nmarginalize over the latent syntactic structures. To avoid this, models often\nresort to greedy search which only allows them to explore a limited portion of\nthe latent space. In this work, we introduce a new latent variable model,\nLaSyn, that captures the co-dependence between syntax and semantics, while\nallowing for effective and efficient inference over the latent space. LaSyn\ndecouples direct dependence between successive latent variables, which allows\nits decoder to exhaustively search through the latent syntactic choices, while\nkeeping decoding speed proportional to the size of the latent variable\nvocabulary. We implement LaSyn by modifying a transformer-based NMT system and\ndesign a neural expectation maximization algorithm that we regularize with\npart-of-speech information as the latent sequences. Evaluations on four\ndifferent MT tasks show that incorporating target side syntax with LaSyn\nimproves both translation quality, and also provides an opportunity to improve\ndiversity.\n\n    "}, "journals/corr/abs-1911-08065": {"title": "Adaptive Activation Network and Functional Regularization for Efficient and Flexible Deep Multi-Task Learning.", "url": "http://arxiv.org/abs/1911.08065", "year": "2019", "author": {"Yingru Liu": "160/6116", "Xuewen Yang": "189/3032", "Dongliang Xie": "27/3906", "Xin Wang 0001": "10/5630-1", "Li Shen": "91/3680", "Haozhi Huang 0001": "170/1729", "Niranjan Balasubramanian": "40/1931"}, "abstract": "\n      Abstract:  Multi-task learning (MTL) is a common paradigm that seeks to improve the\ngeneralization performance of task learning by training related tasks\nsimultaneously. However, it is still a challenging problem to search the\nflexible and accurate architecture that can be shared among multiple tasks. In\nthis paper, we propose a novel deep learning model called Task Adaptive\nActivation Network (TAAN) that can automatically learn the optimal network\narchitecture for MTL. The main principle of TAAN is to derive flexible\nactivation functions for different tasks from the data with other parameters of\nthe network fully shared. We further propose two functional regularization\nmethods that improve the MTL performance of TAAN. The improved performance of\nboth TAAN and the regularization methods is demonstrated by comprehensive\nexperiments.\n\n    "}, "journals/tmc/XieN0XCXW17": {"title": "Recover Corrupted Data in Sensor Networks: A Matrix Completion Solution.", "url": "https://doi.org/10.1109/TMC.2016.2595569", "year": "2017", "author": {"Kun Xie 0001": "98/476-1", "Xueping Ning": "43/10217", "Xin Wang 0001": "10/5630-1", "Dongliang Xie": "27/3906", "Jiannong Cao 0001": "c/JiannongCao", "Gaogang Xie": "01/2888", "Jigang Wen": "92/1480"}, "abstract": " Abstract:Affected by hardware and wireless conditions in WSNs, raw sensory data usually have notable data loss and corruption. Existing studies mainly consider the interpolation of random missing data in the absence of the data corruption. There is also no strategy to handle the successive missing data. To address these problems, this paper proposes a novel approach based on matrix completion (MC) to recover the successive missing and corrupted data. By analyzing a large set of weather data collected from 196 sensors in Zhu Zhou, China, we verify that weather data have the features of low-rank, temporal stability, and spatial correlation. Moreover, from simulations on the real weather data, we also discover that successive data corruption not only seriously affects the accuracy of missing and corrupted data recovery but even pollutes the normal data when applying the matrix completion in a traditional way. Motivated by these observations, we propose a novel Principal Component Analysis (PCA)-based scheme to efficiently identify the existence of data corruption. We further propose a two-phase MC-based data recovery scheme, named MC-Two-Phase, which applies the matrix completion technique to fully exploit the inherent features of environmental data to recover the data matrix due to either data missing or corruption. Finally, the extensive simulations with real-world sensory data demonstrate that the proposed MC-Two-Phase approach can achieve very high recovery accuracy in the presence of successively missing and corrupted data."}, "journals/corr/HanKMHLLXLYWYD16": {"title": "ESE: Efficient Speech Recognition Engine with Compressed LSTM on FPGA.", "url": "http://arxiv.org/abs/1612.00694", "year": "2016", "author": {"Song Han 0003": "80/806-3", "Junlong Kang": "192/1306", "Huizi Mao": "169/9863", "Yiming Hu": "68/5169", "Xin Li": "09/1365", "Yubin Li": "62/8111", "Dongliang Xie": "27/3906", "Hong Luo": "67/876", "Song Yao": "85/7898", "Yu Wang 0002": "w/YuWang2", "Huazhong Yang": "94/1128", "William J. Dally": "d/WJDally"}, "abstract": "\n      Abstract:  Long Short-Term Memory (LSTM) is widely used in speech recognition. In order\nto achieve higher prediction accuracy, machine learning scientists have built\nlarger and larger models. Such large model is both computation intensive and\nmemory intensive. Deploying such bulky model results in high power consumption\nand leads to high total cost of ownership (TCO) of a data center. In order to\nspeedup the prediction and make it energy efficient, we first propose a\nload-balance-aware pruning method that can compress the LSTM model size by 20x\n(10x from pruning and 2x from quantization) with negligible loss of the\nprediction accuracy. The pruned model is friendly for parallel processing.\nNext, we propose scheduler that encodes and partitions the compressed model to\neach PE for parallelism, and schedule the complicated LSTM data flow. Finally,\nwe design the hardware architecture, named Efficient Speech Recognition Engine\n(ESE) that works directly on the compressed model. Implemented on Xilinx\nXCKU060 FPGA running at 200MHz, ESE has a performance of 282 GOPS working\ndirectly on the compressed LSTM network, corresponding to 2.52 TOPS on the\nuncompressed one, and processes a full LSTM for speech recognition with a power\ndissipation of 41 Watts. Evaluated on the LSTM for speech recognition\nbenchmark, ESE is 43x and 3x faster than Core i7 5930k CPU and Pascal Titan X\nGPU implementations. It achieves 40x and 11.5x higher energy efficiency\ncompared with the CPU and GPU respectively.\n\n    "}, "journals/ijcomsys/WangXWZS15": {"title": "Paths selection-based resequencing queue length in concurrent multipath transfer.", "url": "https://doi.org/10.1002/dac.2792", "year": "2015", "author": {"Fenghua Wang": "23/5743", "Dongliang Xie": "27/3906", "Jingyu Wang 0001": "37/2749-1", "Peng Zhang": "21/1048", "Yan Shi 0002": "67/2601-2"}, "abstract": ""}, "journals/amc/LiXC14": {"title": "Complex dynamics of a predator-prey model with impulsive state feedback control.", "url": "https://doi.org/10.1016/j.amc.2013.12.107", "year": "2014", "author": {"Yongfeng Li": "14/3072", "Dongliang Xie": "27/3906", "Jingan Cui": "85/6273"}, "abstract": "In the paper, we consider a prey-dependent model with integrated pest management strategies, that is, when the pest population reaches the economic injury level, we use a combination tactics such as biological, cultural, and chemical control tactics such that pests reduce to a tolerable level. The sufficient conditions for the existence and stability of semi-trivial and positive periodic solutions are obtained by using the Poincaré map and the analogue of the Poincaré criterion. The qualitative analysis shows that the positive periodic solution bifurcates from the semi-trivial solution through a fold bifurcation. Finally, we give an example and numerical simulations to explain the mathematical conclusions."}, "journals/ijdsn/XieSCLP14": {"title": "A Carrier Class IoT Service Architecture Integrating IMS with SWE.", "url": "https://doi.org/10.1155/2014/930472", "year": "2014", "author": {"Dongliang Xie": "27/3906", "Chao Shang": "147/0494", "Jinchao Chen": "147/0451", "Yongfang Lai": "147/0465", "Chuanxiao Pang": "147/0501"}, "abstract": ""}, "journals/jam/LiXC14": {"title": "The Effect of Continuous and Pulse Input Nutrient on a Lake Model.", "url": "https://doi.org/10.1155/2014/462946", "year": "2014", "author": {"Yongfeng Li": "14/3072", "Dongliang Xie": "27/3906", "Jingan Cui": "85/6273"}, "abstract": ""}, "journals/cm/0001XCC00L05": {"title": "Recent advances on TD-SCDMA in China.", "url": "https://doi.org/10.1109/MCOM.2005.1381872", "year": "2005", "author": {"Bo Li 0001": "50/3402-1", "Dongliang Xie": "27/3906", "Shiduan Cheng": "35/3871", "Junliang Chen": "63/6051", "Ping Zhang 0003": "77/2428-3", "Wenwu Zhu 0001": "97/6308-1", "Bin Li 0036": "89/6764-36"}, "abstract": " Abstract:China has fully embraced the remarkable growth and unprecedented penetration of mobile services, and has become the world's largest mobile cellular market. TD-SCDMA was proposed by the China Wireless Technology Standard (CWTS) Group in 1998, approved as one of the 3G standards by ITU in May 2000, and joined 3GPP in March 2001. This has been a major effort by China to advance its mobile communication systems and facilitate its own technological development in this critical area. TD-SCDMA, a combination of TDD and synchronous CDMA, offers several unique advantages over its alternatives, WCDMA and cdma2000, such as flexible spectrum allocation, low-cost implementation, and easier migration from GSM systems. This article reviews the development, key technical features, and deployment of TD-SCDMA in China."}}}