{"id": "83/5810", "name": "Fang-Chung Yang", "Article": {"conf/smc/KuoHY05": {"title": "Development of active IR-based surgical marker tracking and positioning systems.", "url": "https://doi.org/10.1109/ICSMC.2005.1571515", "year": "2005", "author": {"Chung-Hsien Kuo": "07/5888", "Fang-Chun Huang": "20/1201", "Fang-Chung Yang": "83/5810"}, "abstract": " Abstract:This paper presents an active vision based space-positioning robot (AVBSPR) for surgical navigation applications. The development of the proposed navigation robot consists of a five-axis SCROBOT-ER VII Robot, a stereoscopic based eye-in-hand image capture module and a set of infrared (IR) based surgical marker emitters. To increase the navigation space and to determine the best image capture orientation, a fuzzy inference engine is constructed to dynamically track the moving surgical markers. On the other hand, the stereoscopic image coordinates are used to calculate the 3D space coordinates of the surgical markers for surgical navigation applications. Finally, a prototype system had been implemented, and several experimental tests had been done. The experimental results showed that the robot tracks the surgical markers well, and the positioning error is around 5 mm within 2000 mm distance operating ranges."}, "conf/smc/YangKWY04": {"title": "Reconstructing the 3D solder paste surface model using image processing and artificial neural network.", "url": "https://doi.org/10.1109/ICSMC.2004.1400799", "year": "2004", "author": {"Fang-Chung Yang": "83/5810", "Chung-Hsien Kuo": "07/5888", "Jein-Jong Wing": "56/4680", "Ching-Kun Yang": "38/5238"}, "abstract": " Abstract:In general, the laser inspection can measure accurate 3D solder paste surface model, however, it is not practical due to the high cost and low inspection speed. This paper presents the three-dimensional (3D) solder paste surface model reconstruction using the image processing and artificial neural network (ANN), and the proposed approach forms the virtual laser 3D automatic optical inspection (AOI) model. The input nodes of the ANN model consist of the image features that are captured from images of using different light sources. The output nodes are the heights of the corresponding image pixel areas. The training patterns of the proposed ANN model use the laser 3D inspection results. Meanwhile, the in-lab design and the commercial coaxial light sources with the pad and sub-area based learning architecture models are constructed and validated, and the estimated 3D surface model achieves 90% accuracy in average."}}}