{"id": "72/4898-3", "name": "Fang Zhao 0003", "Article": {"conf/sigir/QinFL0022": {"title": "Next Point-of-Interest Recommendation with Auto-Correlation Enhanced Multi-Modal Transformer Network.", "url": "https://doi.org/10.1145/3477495.3531905", "year": "2022", "author": {"Yanjun Qin": "210/3849", "Yuchen Fang": "189/3599", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Chenxing Wang 0001": "144/6318-1"}, "abstract": "\n\t\tNext Point-of-Interest (POI) recommendation is a pivotal issue for researchers in the field of location-based social networks. While many recent efforts show the effectiveness of recurrent neural network-based next POI recommendation algorithms, several important challenges have not been well addressed yet: (i) The majority of previous models only consider the dependence of consecutive visits, while ignoring the intricate dependencies of POIs in traces; (ii) The nature of hierarchical and the matching of sub-sequence in POI sequences are hardly model in prior methods; (iii) Most of the existing solutions neglect the interactions between two modals of POI and the density category. To tackle the above challenges, we propose an auto-correlation enhanced multi-modal Transformer network (AutoMTN) for the next POI recommendation. Particularly, AutoMTN uses the Transformer network to explicitly exploits connections of all the POIs along the trace. Besides, to discover the dependencies at the sub-sequence level and attend to cross-modal interactions between POI and category sequences, we replace self-attention in Transformer with the auto-correlation mechanism and design a multi-modal network. Experiments results on two real-world datasets demonstrate the ascendancy of AutoMTN contra state-of-the-art methods in the next POI recommendation.\n\t"}, "conf/huc/ZhuLG021": {"title": "Data Mining for Transportation Mode Recognition from Radio-data.", "url": "https://doi.org/10.1145/3460418.3479374", "year": "2021", "author": {"Yida Zhu": "237/4985", "Haiyong Luo": "00/1531", "Song Guo": "01/267", "Fang Zhao 0003": "72/4898-3"}, "abstract": "\n\t\t The rapid development of urban information techniques, mobile sensors, and artificial intelligence can help to generate solutions for transportation mode recognition (TMR). The Sussex-Huawei Locomotion-Transportation (SHL) recognition challenge organized at the UbiComp 2021 presents a large and realistic dataset with different activities. Different from the previous three years that aimed at transportation mode recognition from the motion sensors, the goal of this year is to recognize 8 modes of locomotion and transportation (activities) in a user-independent manner based on radio-data, including GPS reception, GPS location, WiFi reception, and GSM cell tower scans. In this paper, our team (We can fly) summarizes our submission to the competition. We first preprocess the data, divide the sample time window and deal with missing values, and then extract 303 features from the given sensor, and finally feed these features into the LightGBM classifier. In the experiment, we utilized the training datasets to train our model and achieved macro-F1 score of 0.665 on the valid datasets.\n\t"}, "conf/iros/JiaL0JLYJW21": {"title": "Lvio-Fusion: A Self-adaptive Multi-sensor Fusion SLAM Framework Using Actor-critic Method.", "url": "https://doi.org/10.1109/IROS51168.2021.9635905", "year": "2021", "author": {"Yupeng Jia": "90/1847", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Guanlin Jiang": "294/8330", "Yuhang Li": "72/2508", "Jiaquan Yan": "219/0936", "Zhuqing Jiang": "72/10176", "Zitian Wang": "46/7299"}, "abstract": " Abstract:State estimation with sensors is essential for mobile robots. Due to different performance of sensors in different environments, how to fuse measurements of various sensors is a problem. In this paper, we propose a tightly coupled multi-sensor fusion framework, Lvio-Fusion, which fuses stereo camera, Lidar, IMU, and GPS based on the graph optimization. Especially for urban traffic scenes, we introduce a segmented global pose graph optimization with GPS and loop-closure, which can eliminate accumulated drifts. Additionally, we creatively use a actor-critic method in reinforcement learning to adaptively adjust sensors’ weight. After training, actor-critic agent can provide the system better and dynamic sensors’ weight. We evaluate the performance of our system on public datasets and compare it with other state-of-the-art methods, which shows that the proposed method achieves high estimation accuracy and robustness to various environments. And our implementations are open source and highly scalable."}, "conf/huc/ZhuLC0S20": {"title": "DenseNetX and GRU for the sussex-huawei locomotion-transportation recognition challenge.", "url": "https://doi.org/10.1145/3410530.3414349", "year": "2020", "author": {"Yida Zhu": "237/4985", "Haiyong Luo": "00/1531", "Runze Chen": "234/6034", "Fang Zhao 0003": "72/4898-3", "Lin Su": "72/8559"}, "abstract": "\n\t\tThe Sussex-Huawei Locomotion-Transportation (SHL) recognition challenge organized at the HASCA Workshop of UbiComp 2020 presents a large and realistic dataset with different activities and transportation. The goal of this human activity recognition challenge is to recognize eight modes of locomotion and transportation from 5-second frames of sensor data of a smartphone carried in the unknown position. In this paper, our team (We can fly) summarize our submission to the competition. We proposed a one-dimensional (1D) DenseNetX model, a deep learning method for transportation mode classification. We first convert sensor readings from the phone coordinate system to the navigation coordinate system. Then, we normalized each sensor using different maximums and minimums and construct multi-channel sensor input. Finally, 1D DenseNetX with the Gated Recurrent Unit (GRU) model output the predictions. In the experiment, we utilized four internal datasets for training our model and achieved averaged F1 score of 0.7848 on four valid datasets.\n\t"}, "conf/huc/Zhu0C19": {"title": "Applying 1D sensor DenseNet to Sussex-Huawei locomotion-transportation recognition challenge.", "url": "https://doi.org/10.1145/3341162.3345571", "year": "2019", "author": {"Yida Zhu": "237/4985", "Fang Zhao 0003": "72/4898-3", "Runze Chen": "234/6034"}, "abstract": "\n\t\tThe Sussex-Huawei Transportation-Locomotion (SHL) Recognition Challenge organized at the HASCA Workshop of UbiComp 2019 presents a large and realistic dataset with different activities and transportation. The goal of this machine learning/data science challenge is to recognize eight modes of locomotion and transportation from the inertial sensor data of a smartphone in a mobile-phone placement independent manner. In this paper, our team (We can fly) summarize our submission to the competition. We proposed a 1D DenseNet model, a deep learning method for transportation classification. We first convert sensor readings from phone coordinate system to navigation coordinate system. Then, we normalized each sensor using different maximums and minimums and construct multichannel sensor input. Finally, 1D DenseNet model output the predictions. In the experiment, we utilized three internal datasets to train our model and achieved averaged F1 score 0.78 on four internal datasets.\n\t"}, "conf/ipin/YanL0SLC19": {"title": "Wi-Fi RTT based indoor positioning with dynamic weighted multidimensional scaling.", "url": "https://doi.org/10.1109/IPIN.2019.8911783", "year": "2019", "author": {"Shuo Yan": "09/8350", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Wenhua Shao": "134/5920", "Zhaohui Li": "46/4444", "Antonino Crivello": "151/6013"}, "abstract": " Abstract:Indoor positioning methods have appeared to fulfill indoor location-based systems requirements, it is still a great challenge to obtain high precision results of indoor positioning. For example, fingerprint-based methods reach high performances but have a high cost for to survey the environment in order to collect sample and to maintain location fingerprints. Systems based on log-distance path loss model suffer from the multi-path problem and the adjustment of Wi-Fi station powers, and achieve low accuracy in complex environments. The appearance of fine time measurement protocol supported Wi-Fi access points provide a novel way to develop accurate indoor positioning algorithms. Considering the influence of the indoor multi-path effect to the fine time measurement ranging accuracy, we propose a multi-dimensional scaling based positioning algorithm to reduce the impact of ranging errors. We leverage the multidimensional scaling algorithm to estimate the rough position of positioning clients. Successively, adjusting the weight of fine time measurement ranging, we optimize the positioning results with the application of a SMACOF strategy. Through experiments conducted in a complex real-world scenario, we demonstrate that the system proposed reach an accuracy below the 2.5 meters at 80% of the cases."}, "conf/ipin/Lu0LWS19": {"title": "A destination prediction algorithm using spatial temporal bidirectional LSTM networks.", "url": "http://ceur-ws.org/Vol-2498/short57.pdf", "year": "2019", "author": {"Zhaoxu Lu": "256/4364", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Qu Wang": "190/3175", "Wenhua Shao": "134/5920"}, "abstract": ""}, "conf/icc/ShaoL00CT18": {"title": "DePedo: Anti Periodic Negative-Step Movement Pedometer with Deep Convolutional Neural Networks.", "url": "https://doi.org/10.1109/ICC.2018.8422308", "year": "2018", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Cong Wang 0003": "18/2771-3", "Antonino Crivello": "151/6013", "Muhammad Zahid Tunio": "195/4303"}, "abstract": " Abstract:Pedometer is an enabling technique for smartphone- based pedestrian positioning systems. Because the sensor drifts, these algorithms can only estimate moving distances from step counts. In order to detect step events, researchers have tried to leverage the peak detection and the periodicity attribute of step acceleration signals. However, many human behaviors are having acceleration peaks and periodic, causing traditional detectors error- prone when the phone is shaken periodically leading state-of-the-art system to high false positive ratio and consequently to big mistake of distance estimations. Based on the acceleration feature analysis of step events, we present a deep convolution neural network based step detection scheme to improve the pedometer robustness. Finally, the proposed step detection algorithm is tested in a realistic situation, showing a high anti periodic negative-step movement capability."}, "conf/uic/WangL0QZC18": {"title": "Detecting Transportation Modes with Low-Power-Consumption Sensors Using Recurrent Neural Network.", "url": "https://doi.org/10.1109/SmartWorld.2018.00191", "year": "2018", "author": {"Hao Wang": "181/2812", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Yanjun Qin": "210/3849", "Zhongliang Zhao": "123/3334", "Yiqu Chen": "231/8580"}, "abstract": " Abstract:With the quick development of mobile Internet and the popularity of smartphones, smartphone-based transportation mode detection has become a hot topic, which is able to provide effective data support for urban planning and traffic management. Though the popular GPS based transportation mode detection method has achieved reasonable accuracy, this method consumes large power, thus limiting it to be used in smartphones. Here, we propose a novel transportation mode detection algorithm using recurrent neural network. In order to identify transportation modes with low power consumption, this algorithm only uses four low-power-consumption sensors (namely accelerator, gyroscope, magnetometer and barometer) which are embedded in the commodity smartphones. Furthermore, we exploited the good representative ability of Long Short-Term Memory (LSTM) and applied it to recognizing the transportation modes to achieve higher accuracy. To filter noises, a preprocessing is applied. After calculating features, we adopt the LSTM learning algorithm to train a model of transportation mode recognition and employ this model to predict transportation modes. Extensive experimental results indicate that our proposed approach outperforms the compared state-of-the-art transportation recognition methods with 96.9% accuracy to detect four transportation modes, namely buses, cars, subways, and trains."}, "conf/upinlbs/JiangZLY18": {"title": "A Crowdsourcing based Indoor Topology Construction Algorithm using the Forward and Backward Track Fusion of User Closed Trajectory.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559717", "year": "2018", "author": {"Mengling Jiang": "210/1382", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Langlang Ye": "237/5548"}, "abstract": " Abstract:At present, indoor location-based service has become a hot topic. The traditional approaches that rely on professional equipment and expertise to collect indoor maps has limited the rapid development of indoor location-based services. Adopting low-cost crowdsourcing methods to construct and maintain indoor maps with various sensors integrated in smart phones by common users is a development trend of constructing indoor map. The existing crowdsourcing-based indoor topology construction methods mostly use the pedometer based PDR (Pedestrian Dead Reckoning) to infer user trajectories, which suffers from the problem of accumulated estimation errors. To reduce the error of pedestrian dead reckoning and improve the accuracy of the indoor topology construction, we propose a novel indoor topology construction algorithm based on the user closed trajectory fusion. The algorithm requires the user to start and end a trajectory loop at the same location when collecting data. Based on this trajectory loop, we can perform the forward and backward dead reckoning starting from the starting and the ending point of the path, respectively. For instance, after completing the forward path inference, we can swap the starting point with the ending point, and then perform the reverse path inference. Last, we aggregate the coordinates obtained from the forward and reverse path inferences with the different weight. The weight is defined to be proportional to the confidence of the PDR, i.e., inversely proportional to the walking time from the starting location of path inference. Compared to the traditional unidirectional trajectory inference method, our proposed algorithm can greatly reduce the accumulated error of dead reckoning by aggregating the bidirectional trajectory inference. To improve the accuracy of heading estimation of each step, we Ieverage a radial Gaussian function to filter the compass noise, and adopt the multi-strategy fusion mechanism based on the difference of direction es..."}, "conf/upinlbs/LiuCWZL18": {"title": "A hybrid localization algorithm using Inertial Sensor, Satellite and Wi-Fi for Smartphone.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559727", "year": "2018", "author": {"Chun Liu": "67/1749", "Yiqu Chen": "231/8580", "Qu Wang": "190/3175", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:The complex environment based on Intelligent mobile phone navigation technology has become a research hotspot. The traditional combination navigation technology based on satellite and inertial navigation system can effectively compensate for the effect of short satellite signal loss, but the sensors used in strapdown inertial navigation system generally need high precision and sensitivity, and the existing smart phone built-in MEMS sensor has relatively low precision and sensitivity. One the other hand, the smart phone's WiFi signal can be considered for improving the positioning performance of inertial navigation system in the absence of satellite, but the fingerprint matching Iocalization results are scattered and there is noise because of its non-Gaussian noise and multipath interference in the outdoor scene. In order to improve the positioning and navigation accuracy and robustness of the smart phone in complex environment, a WiFi-aided fusion positioning algorithm for satellite and inertial navigation system is proposed, which includes two stages, namely, navigational solution and optimization fusion. In order to improve the positioning accuracy, in the navigation solution phase, in the absence of satellite, the system outputs the location result of the outdoor WiFi location algorithm and the combined navigation location result to the optimized fusion device. In order to improve the robustness of the positioning, in the optimization fusion stage, the paper makes a second fusion of two positioning results through an improved fusion weighted average mechanism. The experimental results show that the positioning accuracy of the satellite can be improved obviously in the time of the effective time and the failure moment after WiFi calibration."}, "conf/upinlbs/ShaoLZWCT18": {"title": "DePos: Accurate orientation-Free Indoor Positioning with Deep Convolutional Neural Networks.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559764", "year": "2018", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Cong Wang 0003": "18/2771-3", "Antonino Crivello": "151/6013", "Muhammad Zahid Tunio": "195/4303"}, "abstract": " Abstract:The smartphone-based indoor positioning has attracted considerable attention in recent years. In order to implement accurate and infrastructure-free positioning systems, researchers have tried to fuse magnetic field, Wi-Fi, and dead reckoning information applying particle filter technique. In fact, magnetic signals have high-resolution and Wi-Fi signals are able to provide coarse-grained global results. However, in order to move particles, the particle filter requires the phone's orientation aligned with the user moving directions, thus limiting its applications and impairing user experiences. In order to implement an orientation-free and infrastructure-free system, we propose a deep learning based positioning scheme. The proposed system constructs a new kind of rich-information positioning image, then leverages convolution neural network to automatically map positioning images to position predictions. We also present a novel extracting and labeling method to generate enough positioning images for training the neural network. Finally, experiments convincingly reveal that the proposed positioning system is orientation-free, infrastructure-free, and achieves good precisions."}, "conf/upinlbs/WangWYMZLH18": {"title": "A Multimode Fusion Visible Light Localization Algorithm using Ambient Lights.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559842", "year": "2018", "author": {"Qu Wang": "190/3175", "Xiaojian Wang": "132/7862", "Langlang Ye": "237/5548", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Yan Huang 0035": "75/6434-35"}, "abstract": " Abstract:With the booming development of green lighting technologies, ubiquitous lighting infrastructures make visible light positioning (VLP) become a promising technology for indoor localization and navigation. However, most existing VLP systems use modulated LEDs as anchors for target localization. LEDs with its customized hardware and modulated information greatly prevent VLP systems from large-scale deployment and limit their widespread applications. Moreover, some VLP systems have the disadvantage of imposing strong restrictions on smartphone such as fixed phone orientation, which is not practical for real-life use. In this paper, we propose a ubiquitous visible light localization (LiLoc) algorithm using ambient lights based on augmented particle filter algorithm. LiLoc directly uses the light intensity fingerprint of ambient light sources (e.g., fluorescent, incandescent, and LEDs) to estimate target location without obtaining modulation information of light sources in buildings. To improve localization accuracy, we introduce a light-intensity trajectory fingerprint matching scheme to calibrate target position. We also develop a beacon identification algorithm based on the inherent visual features of light sources, which are determined by specific manufacturing variations. We combine beacon identification algorithm with PDR to estimate target position in terrible illumination environment (e.g., sunlight interference, beacons sparse deployment, individual beacon damaged/closed, or training fingerprint missing).To reduce power consumption, we design adaptive scheduling mechanism to invoke corresponding algorithms based on the detection result of sunlight interference. The experimental results demonstrate that LiLoc can achieve medium localization errors of 2.2 m in a complex lighting environment with various light sources and sunlight interference."}, "conf/upinlbs/WeiZZLY18": {"title": "Zero-cost and map-free shop-level localization algorithm based on crowdsourcing fingerprints.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559708", "year": "2018", "author": {"Jie Wei": "35/3800", "Xiaoyun Zhou": "181/4009", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Langlang Ye": "237/5548"}, "abstract": " Abstract:In recent years, with the rapid development of mobile Internet, intelligent location-based services attract widespread attention. Using the situated shop location of users, the accuracy of the message and advertisement delivery can be effectively promoted. Though the Wi-Fi based positioning has become the mainstream of indoor positioning technology, the large deployment and maintenance cost limits its widespread use. In this paper, we proposed a novel zero-cost and map-free shop-level localization algorithm. The algorithm collected Wi-Fi fingerprinting data and opportunistic GPS data when customers paid the bill through mobile payment app. This algorithm takes each shop identification as a location index and localizes user without the need of the map. The Wi-Fi fingerprints and GPS data are collected in the background when crowdsourcing users employ the mobile payment APP, so our proposed localization algorithm can work without any site survey. To improve the positioning accuracy and speed up localization calculation, we introduce a hierarchical classification method based on ensemble learning model. The upper classifier dynamically selects several local candidate shops with an online Wi-Fi fingerprinting, with the virtue of reducing the computational complexity. After completing the upper classification, we further perform a confidence-weighted ensemble classification combing using GBDT, random forest and KNN to estimate the user location. By aggregating the location estimations of individual classifiers with their corresponding positioning accuracy, the confidence-weighted ensemble classification model can obtain more accurate location estimation. The paper also introduces some features, i.e., historical shop scanning Wi-Fi ratio, Wi-Fi signal statistics, store type and transaction time distribution, to improve the accuracy of the bottom shop classifier. Extensive experimental results show that our proposed method outperforms the maximum likelihood estimation and ..."}, "conf/upinlbs/ZhangLCZJ18": {"title": "A Complex User Activity Recognition Algorithm based on Convolutional Neural Networks.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559850", "year": "2018", "author": {"Jiaxian Zhang": "263/2763", "Haiyong Luo": "00/1531", "Shaomeng Chen": "210/3918", "Fang Zhao 0003": "72/4898-3", "Mengling Jiang": "210/1382"}, "abstract": " Abstract:Using sensors to accurately identify the user's activity is helpful to select suitable indoor localization algorithm, thus improving the positioning accuracy. Traditional user activity recognition technology generally needs to artificially analyze and extract the data features, and sometimes it is difficult to accurately excavate the characteristics of complex user's activity. By making use of the ability of automatically extracting feature of raw data with deep learning algorithm, this paper proposes a novel algorithm for complex user activity recognition based on CNN. As a representative neural network of the deep learning, CNN provides an end-to-end learning model with high recognition accuracy. The algorithm utilizes the original data collected by sensors embedded in a smartphone, such as acceleration sensor, gyroscope sensor and magnetic sensor, as input of neural network after 2D image-like conversion. By training and optimizing the various super parameters of the convolution neural network, such as the layer number of the convolution layer and the number of filters, the features of different activities are automatically learned by CNN. At the same time, we select ReLU as activation function to improve the training speed, and finally build a multiple user complex activity recognition model based on convolution neural network. As a comparison, we implements an activity recognition algorithm based on AdaBoost by using the handcrafted features. Extensive experimental results show that our proposed algorithm can accurately identify six kinds of complex behavior modes, such as walking normallywalking sideways, walking backward, crawling on the floor, pushing a pushcart, going up and down the elevator, and the accuracy is up to 99.8%, which is superior to the AdaBoost based activity recognition algorithm"}, "conf/upinlbs/ZhouWZLY18": {"title": "A shop-level location algorithm based on CNN for crowdsourcing fingerprint.", "url": "https://doi.org/10.1109/UPINLBS.2018.8559873", "year": "2018", "author": {"Xiaoyun Zhou": "181/4009", "Jie Wei": "35/3800", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Langlang Ye": "237/5548"}, "abstract": " Abstract:Recent years, the use of widely covered Wi-Fi signal to achieve accurate indoor positioning has become a research hotspot. The Wi-Fi Positioning Algorithm based on the existing RF Fingerprint can obtain high positioning accuracy, but there is a big shortage of large deployment and maintenance cost. In order to reduce the cost of Wi-Fi fingerprints collection, this paper utilizes the RSS collected by the consumers using the mobile phone for electronic payment, constructs the low cost crowdsourcing Wi-Fi RF Fingerprint, and realizes the shop-level accurate positioning with CNN. Based on the feature of CNN extraction from local to global, this paper constructs a characteristic group which includes signal intensity, user transaction time and shop information. The statistics of each feature in the statistical interval are obtained by using the interval of 1 to 23 days before the current time. The Min-Max normalization of the statistical value is to avoid inconsistencies in the data distribution caused by the loss of data. In this way, the feature map of window length and statistic feature is constructed, the different feature groups of Wi-Fi and Shop are used as input matrices of multiple CNN, then the other manual features are combined to train a CNN positioning classifier to realize the position estimation of shop-level. A large number of experimental data tests show that the proposed algorithm can obtain higher positioning accuracy by 91% compared with the positioning algorithm based on LR(Logistic Regression), AdaBoost and XGBoost."}, "conf/wcnc/ShaoL00CZ18": {"title": "Mass-centered weight update scheme for particle filter based indoor pedestrian positioning.", "url": "https://doi.org/10.1109/WCNC.2018.8377274", "year": "2018", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Cong Wang 0003": "18/2771-3", "Antonino Crivello": "151/6013", "Tunio Muhammad Zahid": "195/4303"}, "abstract": " Abstract:Smartphone based indoor positioning has become a hot topic in pervasive computing, because of the need to improve indoor location-based services. In order to strengthen positioning accuracy, researchers have tried to leverage high-resolution magnetic fingerprint with particle filter and dynamic time warping (DTW). These approaches are computation-hungry, which increases hardware cost for positioning companies. By analyzing magnetic features for pedestrian users, we present a mass-centered weight update scheme to decrease calculation overheads. Finally, the proposed positioning algorithm is tested in a realistic situation, showing high-quality localization capability."}, "conf/es/ChenL0YJ17": {"title": "Transportation Mode Recognition Algorithm Based on Multiple Support Vector Machine Classifiers.", "url": "https://doi.org/10.1109/ES.2017.49", "year": "2017", "author": {"Shaomeng Chen": "210/3918", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Weichao Yuan": "210/3941", "Mengling Jiang": "210/1382"}, "abstract": " Abstract:Transportation mode recognition is a special sub-field of activity recognition, it is also an important user context information in pervasive computing which can not only be used to conduct unobtrusive monitoring of human behavior, but also to provide intelligent information push service. Aiming at the situation that traditional GPS-based transportation mode recognition system suffered from high power consumption, limited usage scenario and modest accuracy of motorized transportation mode recognition, a lightweight transportation mode recognition algorithm with high accuracy which is based on multiple support vector machine classifiers is proposed. The algorithm uses a variety of sensors integrated in intelligent terminals such as acceleration sensors, gyroscope sensors, magnetic sensors, and pressure sensors. Based on the mining of behavior features of vehicular movement patterns, a number of support vector machine classifiers are designed to conduct transportation mode recognition. The experimental results show that the transportation mode recognition algorithm based on multiple support vector machine classifiers has better universality and robustness, and can obtain more than 95% recognition accuracy for motorized transportation mode recognition."}, "conf/ipin/GongZCL17": {"title": "A convolutional neural networks based transportation mode identification algorithm.", "url": "https://doi.org/10.1109/IPIN.2017.8115930", "year": "2017", "author": {"Yanyun Gong": "210/3944", "Fang Zhao 0003": "72/4898-3", "Shaomeng Chen": "210/3918", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:With the increasing sensing ability of smartphone, both recognizing and understanding a user's activity using sensor data have become a popular topic of ubiquitous computing systems. Individual transportation mode identification can provide essential data for road planning and traffic management. In this paper, we present a Convolutional Neural Networks (CNN) based method to extract expressive and discriminative features automatically for transportation mode identification. The signal preprocessing in the time and frequency domain is performed before the sensor data is fed into the deep learning framework. We optimize various important hyper-parameters such as learning rate, kernel size and number of convolutional layers to adapt the characteristics of multiple sensor signals. Extensive experimental results indicate that the proposed CNN based transportation mode identification algorithm can achieve 98% accuracy to distinguish between car, bus, train and metro, which outperforms the Support Vector Machines and Adaboost based transportation identification with better robustness and generalization."}, "conf/ipin/GuoS0WLL16": {"title": "WiMag: Multimode Fusion Localization System based on Magnetic/WiFi/PDR.", "url": "https://doi.org/10.1109/IPIN.2016.7743700", "year": "2016", "author": {"Xumeng Guo": "190/3177", "Wenhua Shao": "134/5920", "Fang Zhao 0003": "72/4898-3", "Qu Wang": "190/3175", "Dongmeng Li": "190/3195", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:With the rapid increase of location based services, various indoor positioning technologies have emerged. The existing indoor positioning technologies have different characteristics in localization accuracy, real-time performance, coverage and cost. To meet the requirements of high accuracy, low cost, and broad coverage in complex indoor scenes, we design an indoor localization system WiMag: Multimode Fusion Localization System based on Magnetic/WiFi/PDR. Based on the particle filter framework, the system optimally selects the fusion strategy to combine the location results according to the identified smartphone status. The experimental results demonstrate that the proposed WiMag outperforms all single indoor positioning technologies with higher accuracy (1.6m average localization error), wider localization coverage and better robustness."}, "conf/ipin/WangL0S16": {"title": "An indoor self-localization algorithm using the calibration of the online magnetic fingerprints and indoor landmarks.", "url": "https://doi.org/10.1109/IPIN.2016.7743595", "year": "2016", "author": {"Qu Wang": "190/3175", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Wenhua Shao": "134/5920"}, "abstract": " Abstract:Personal dead reckoning (PDR) localization technology can provide effective and critical assistance for public security, such as emergency rescue or anti-terror training in the indoor or underground environment without the need of deploying additional positioning infrastructure. However, the PDR suffers from the severe position error accumulation with time due to the inaccurate step length and moving direction estimation. To improve the self-positioning accuracy, this paper proposed a novel indoor self-localization algorithm using two kinds of automatic calibration methods, i.e., opportunistic magnetic trajectory matching and indoor landmark identification. Extensive experiments performed in two representative indoor environments, including an office building and a supermarket, demonstrate that the proposed self-localization algorithm can obtain an 80 percentile localization accuracy of 1.4m and 2m in the two representative indoor environments, respectively, which outperforms the art-of-the-state PDR algorithms."}, "conf/upinlbs/LiuZSL16": {"title": "An hidden Markov model based complex walking pattern recognition algorithm.", "url": "https://doi.org/10.1109/UPINLBS.2016.7809976", "year": "2016", "author": {"Yiyan Liu": "37/1286", "Fang Zhao 0003": "72/4898-3", "Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:The popularity of smartphone enables the capability of sensing the human activity, which can be used to provide various intelligent context-aware services. Most existing methods on human motion mode recognition assume that all sensors are mounted in a fixed position on users' body while walking. However, it is inconvenient for a user to mount his/her phone in a specific position. When a user holds his/her phone in hand, the situation becomes fairly complex. First, the motion of the hand is coupled with the general activity of the user. Second, the characteristics of the inertial sensors may vary along with diverse carrying modes. In this paper, eight different human activities are defined to characterize the phone holding modes and the motion patterns. By extracting features in time and frequency domains from the tri-axis accelerometer and tri-axis gyroscope signals, we design and implement a hierarchical classification system to detect complex walking patterns based on the decision tree, random forest and hidden Markov model (HMM). Simulation experimental results demonstrate that the recognition success of complex walking pattern using the proposed method is more than 93.8% for eight complex motion modes."}, "conf/upinlbs/ZhangZSL16": {"title": "A pervasive indoor and outdoor scenario identification algorithm based on the sensing data and human activity.", "url": "https://doi.org/10.1109/UPINLBS.2016.7809979", "year": "2016", "author": {"Yang Zhang": "06/6785", "Fang Zhao 0003": "72/4898-3", "Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:The location and context switching, especially the indoor and outdoor scenario switching, provide basic and original information for various mobile applications. Diverse smartphone placements and limited battery supply pose challenge for the accurate and robust indoor-outdoor identification. In this paper, a pervasive indoor and outdoor scenario identification algorithm is proposed, which utilizes both the sensing data collected by the commodity smartphones and recognized human activity information. The indoor and outdoor scenario identification is modelled as a binary classification problem. To better utilize the collected sensor data and inferred human activities, two time-dependent Adaboost classifiers are developed to perform stateless and instance-based scene detection. The stateless detection result is further used as the observation of a hidden Markov model (HMM) to obtain the final scene estimation. The adoption of the stateful HMM filter can effectively eliminate the occasional noises and improve detection accuracy. Furthermore, to meet the high-accuracy detection demand on the indoor-outdoor transition scenario, invoking GPGSV on demand is introduced to improve the detection confidence. Extensive experimental results confirm that the proposed pervasive indoor-outdoor identification algorithm outperforms the state-of-the-art JODetector with more than 97% detection accuracy under various weather condition and smartphone placements, especially in the cloudy daytime, at night and being put in pocket."}, "conf/cwsn/LiLZL14": {"title": "TACO: A Traceback Algorithm Based on Ant Colony Optimization for Geomagnetic Positioning.", "url": "https://doi.org/10.1007/978-3-662-46981-1_20", "year": "2014", "author": {"Hui Li": "66/3387", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Xinrong Li": "09/1234"}, "abstract": "Magnetic field fluctuations in modern buildings can derive from both natural and man-made sources, which typically include steel, reinforced concrete structures, and electric power systems, etc. Since the anomalies of the magnetic field inside the building are nearly static and have sufficient local variability, this provides a unique magnetic clue which could be utilized for global self-localization. In this research, we propose TACO, an algorithm that uses Ant Colony Optimization (ACO) and Multi-Position TraceBack Algorithm (MTA) to solve one dimensional magnetic data localization problem. TACO employs a set of novel techniques to resolve ambiguity in locations: ACO is used to generate candidate locations and MTA to make full use of both historical positions and users moving direction information. The evaluation results show that TACO could achieve high localization accuracy, when appropriate previous position information is provided.KeywordsGeomagnetic positioningAnt colony optimizationTraceback algorithmIndoor localization"}, "conf/cwsn/0003LYL14": {"title": "An Adaptive Step Detection Algorithm Based on the State Machine.", "url": "https://doi.org/10.1007/978-3-662-46981-1_62", "year": "2014", "author": {"Fang Zhao 0003": "72/4898-3", "Xinran Li": "57/10368", "Jiabao Yin": "223/2766", "Haiyong Luo": "00/1531"}, "abstract": "This paper addresses an adaptive step detection algorithm using inertial sensors commonly found on commodity mobile phone. After analyzing the acceleration data collected by the accelerometer in mobile phone, the step detection is completed by using the state machine combined with other subsidiary conditions. This step detection algorithm can also dynamically change the thresholds based on the acceleration data features to achieve the goal of detecting the steps adaptively. The experimental results show that this step detection algorithm not only has high accuracy, but also solid robustness. It can eliminate the error count caused by the shaking and flipping.KeywordsStep detectionAccelerometerState machineMobile phone"}, "conf/icinfa/0003LYL14": {"title": "A hybrid floor identification algorithm based on Bayesian classification and special AP.", "url": "https://doi.org/10.1109/ICInfA.2014.6932743", "year": "2014", "author": {"Fang Zhao 0003": "72/4898-3", "Dan Luo": "03/142", "Wu Yuan": "15/5832", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:Accurately discriminating different floors is a very important task in indoor fingerprinting localization, which can be used to reduce space search domain and improve localization accuracy. There exist some research works for floor identification at present; however, the accuracy is not high. To achieve higher accuracy, this paper proposes a hybrid floor identification algorithm using Bayesian classification and special AP. By extracting the distribution feature of APs in different floors with training data, the proposed approach can determine floor efficiently with 100% accuracy."}, "conf/ipin/ChengWTL012": {"title": "Clustering algorithms research for device-clustering localization.", "url": "https://doi.org/10.1109/IPIN.2012.6418888", "year": "2012", "author": {"Huang Cheng": "34/4391", "Feng Wang": "90/4225", "Rui Tao": "82/10553", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3"}, "abstract": " Abstract:Crowdsourcing-based localization has attracted wide research concern to the metropolitan-scale positioning. However, crowdsourcing-based fingerprints collection with assorted mobile smart devices brings fingerprint confusion, which significantly degrades the localization accuracy. To solve the device diversity problem, many solutions have been raised like the Device-Clustering algorithm. Based on macro Device-Cluster (DC) rather than natural device, DC algorithm maintains less device types and slight calibration overhead. Despite high positioning accuracy, the selection of suitable clustering algorithms in DC system becomes another puzzle. In this paper, we reshape the novel Device-Clustering algorithm to enhance the indoor positioning by comparing the application of different clustering algorithms. The experimental result indicates the reliability of DC strategy in broad clustering scheme as well as the suitable locating process corresponding to distinct environment."}, "conf/pdcat/Shao0WL12": {"title": "Design and Implementation of a Scalable LBS Middleware Based on the PUBSUB Paradigm and Load Balancing Mechanism.", "url": "https://doi.org/10.1109/PDCAT.2012.66", "year": "2012", "author": {"Wenhua Shao": "134/5920", "Fang Zhao 0003": "72/4898-3", "Guoshi Wang": "134/5996", "Haiyong Luo": "00/1531"}, "abstract": " Abstract:This paper presents a LBS middleware software, which contains application and positioning modules. The first module is designed to improve the granularity of the pushed information in current LBS systems and to conveniently add new applications. Taking the advantage of PUB/SUB system's asynchronous, loosely-coupled and multiplex communication mechanism, the middleware pushes LBS information with its granularity refined. By combining position information and the PUB/SUB paradigm, users can easily focus on his points of interest. Positioning module enables the system of handling both indoor and outdoor scenario. And the system can easily add new indoor positioning server and dispatch work load to them judging by their current work load. Experimental results showed that the middleware can offer an efficient service to users and system performance can be improved under massive requests."}, "conf/csie/ZhaoMHZ09": {"title": "Forecasting Heartbeat Delay for Failure Detection over Internet Using Nonlinear System.", "url": "https://doi.org/10.1109/CSIE.2009.14", "year": "2009", "author": {"Haijun Zhao": "12/5402", "Yan Ma": "31/1970", "Xiaohong Huang": "67/4573", "Fang Zhao 0003": "72/4898-3"}, "abstract": " Abstract:To overcome Internet dynamic characteristics and accurately predict next heartbeat message delay for failure detection service, a novel learning machine is proposed to predict next heartbeat arrival time. We use a nonlinear autoregressive network with exogenous inputs to learn nonlinear and linear characters of heartbeat messages, perform one-step-ahead prediction to estimate future heartbeat delay. The inputs are two moving window observations of past heartbeat delays and heartbeat sending time, the output is next heartbeat delay, the network is trained by standard back-propagation algorithm, its weights and basis are adjusted by approximate steepest descent rule. Simulation result shows that this adaptive algorithm can accurately capture heartbeat dynamics over Internet and make minimum prediction error under different network environments such as bottleneck link, link down and up."}, "conf/msn/ZhaoLQ09": {"title": "A Mobile Beacon-Assisted Localization Algorithm Based on Network-Density Clustering for Wireless Sensor Networks.", "url": "https://doi.org/10.1109/MSN.2009.12", "year": "2009", "author": {"Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Lin Quan": "33/6939"}, "abstract": " Abstract:Most existing mobile beacon-assisted localization algorithms do not make effective use of the node distribution information and let the mobile landmark traverse the entire network, which causes large path length and low utilization rate of beacon messages. In order to reduce the path length and use the mobile beacon more effectively, a novel mobile beacon-assisted localization algorithm based on network-density clustering (MBL(ndc)) for wireless sensor networks is presented, which combines node clustering, incremental localization and mobile beacon assisting together. Simulation results demonstrate that the proposed MBL(ndc) algorithm offers comparable localization accuracy as the mobile beacon-assisted localization algorithm with HILBERT trajectory, but with less than 50% path length of the later, which shortens the period of positioning the whole network."}, "conf/apnoms/ZhaoMHZ08": {"title": "Performance Evaluation of Heartbeat-Style Failure Detector over Proactive and Reactive Routing Protocols for Mobile Ad Hoc Network.", "url": "https://doi.org/10.1007/978-3-540-88623-5_38", "year": "2008", "author": {"Haijun Zhao": "12/5402", "Yan Ma": "31/1970", "Xiaohong Huang": "67/4573", "Fang Zhao 0003": "72/4898-3"}, "abstract": "Ad hoc wireless networks are characterized with multi-hop connectivity and frequently changing network topology. Routing protocol plays a very important role to ensure each packet reaches its destination node in Ad hoc wireless network. Many different routing protocols have been proposed in literature, but no performance comparison of heartbeat-style failure detection service over them is available. In this paper, we do the comprehensive simulations to investigate the performance of heartbeat-style failure detector over proactive and reactive routing protocols with ns-2 simulator. The performance different are analyzed using varying the number of nodes, mobility speed, transmission range. Results show that DSDV performed better in average delay and average failure detection time, AODV performed better in normalized routing overhead, delivery ratio, energy consumption ratio, false detection ratio. The observations can be used to motivate and improve future implementations of failure detection service in Ad hoc wireless networks.KeywordsAd Hoc NetworkFailure DetectionHeartbeatPerformance"}, "journals/ijis/ZhaoJLZQW22": {"title": "An abnormal driving behavior recognition algorithm based on the temporal convolutional network and soft thresholding.", "url": "https://doi.org/10.1002/int.22842", "year": "2022", "author": {"Yunyun Zhao": "34/9712", "Hongwei Jia": "12/6829", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Yanjun Qin": "210/3849", "Yueyue Wang": "142/1405"}, "abstract": ""}, "journals/ijis/QinZFLW22": {"title": "Memory attention enhanced graph convolution long short-term memory network for traffic forecasting.", "url": "https://doi.org/10.1002/int.22855", "year": "2022", "author": {"Yanjun Qin": "210/3849", "Fang Zhao 0003": "72/4898-3", "Yuchen Fang": "189/3599", "Haiyong Luo": "00/1531", "Chenxing Wang 0001": "144/6318-1"}, "abstract": ""}, "journals/remotesensing/XuLWWBZ22": {"title": "Towards Predicting the Measurement Noise Covariance with a Transformer and Residual Denoising Autoencoder for GNSS/INS Tightly-Coupled Integrated Navigation.", "url": "https://doi.org/10.3390/rs14071691", "year": "2022", "author": {"Hongfu Xu": "318/5076", "Haiyong Luo": "00/1531", "Zijian Wu": "148/7164", "Fan Wu": "07/6378", "Linfeng Bao": "94/11423", "Fang Zhao 0003": "72/4898-3"}, "abstract": ""}, "journals/tii/ShaoLZTHC22": {"title": "Floor Identification in Large-Scale Environments With Wi-Fi Autonomous Block Models.", "url": "https://doi.org/10.1109/TII.2021.3074153", "year": "2022", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Hui Tian 0003": "57/1592-3", "Jingyu Huang": "06/8376", "Antonino Crivello": "151/6013"}, "abstract": " Abstract:Traditional Wi-Fi-based floor identification methods mainly have been tested in small experimental scenarios, and generally, their accuracies drop significantly when applied in real large and multistorey environments. The main challenge emerges when the complexity of Wi-Fi signals on the same floor exceeds the complexity between the floors along the vertical direction, leading to a reduced floor distinguishability. A second challenge regards the complexity of Wi-Fi features in environments with atrium, hollow areas, mezzanines, intermediate floors, and crowded signal channels. In this article, we propose an adaptive Wi-Fi-based floor identification algorithm to achieve accurate floor identification also in these environments. Our algorithm, based on the Wi-Fi received signal strength indicator and spatial similarity, first identifies autonomous blocks parcelling the whole environment. Then, local floor identification is performed through the proposed Wi-Fi models to fully harness the Wi-Fi features. Finally, floors are estimated through the joint optimization of the autonomous blocks and the local floor models. We have conducted extensive experiments in three real large and multistorey buildings greater than 140 000 m\n2^2\n using 19 different devices. Finally, we show a comparison between our proposal and other state-of-the-art algorithms. Experimental results confirm that our proposal performs better than other methods, and it exhibits an average accuracy of 97.24%."}, "journals/tits/ZhuLCZG22": {"title": "MSCPT: Toward Cross-Place Transportation Mode Recognition Based on Multi-Sensor Neural Network Model.", "url": "https://doi.org/10.1109/TITS.2021.3115264", "year": "2022", "author": {"Yida Zhu": "237/4985", "Haiyong Luo": "00/1531", "Runze Chen": "234/6034", "Fang Zhao 0003": "72/4898-3", "Song Guo": "01/267"}, "abstract": " Abstract:With the ever-increasing intelligent perception capability of mobile terminals, the demand for fine-grained human activity recognition has become urgent. Transportation mode recognition, as a special branch of human activity recognition, plays a vital role in various mobile smart services. Some studies have been conducted on attitude-independence transportation mode recognition from various perspectives. However, it is challenging to recognize cross-place transportation mode due to the diversity of human activity and carrier deployment place. Towards this end, we propose a robust cross-place transportation mode recognition algorithm, which consists of three parts: Multi-Sensor Neural Network model, a variant bootstrap (ensemble learning) method, and data augmentation. The Multi-Sensor Neural Network model leverages multiple SF-SEDNets to extract spatial-temporal and spectral fusion features from different sensor combinations. The proposed data augmentation method addresses the unbalance data problem without introducing additional data collection costs, and the variant bootstrap method improves the robustness of our proposed algorithm. We evaluate our proposed algorithm on the Sussex-Huawei Locomotion-Transportation recognition challenge 2019 dataset. Extensive experimental results indicate that our algorithm achieves 81.45% macro-F1 score on the test dataset, which is 3.03% higher than that provided by the winning entry of this competition and is 14.85% higher than that of the official baseline."}, "journals/tits/WangZZLQF22": {"title": "Fine-Grained Trajectory-Based Travel Time Estimation for Multi-City Scenarios Based on Deep Meta-Learning.", "url": "https://doi.org/10.1109/TITS.2022.3145382", "year": "2022", "author": {"Chenxing Wang 0001": "144/6318-1", "Fang Zhao 0003": "72/4898-3", "Haichao Zhang": "57/3924", "Haiyong Luo": "00/1531", "Yanjun Qin": "210/3849", "Yuchen Fang": "189/3599"}, "abstract": " Abstract:Travel Time Estimation (TTE) is indispensable in intelligent transportation system (ITS). It is significant to achieve the fine-grained Trajectory-based Travel Time Estimation (TTTE) for multi-city scenarios, namely to accurately estimate travel time of the given trajectory for multiple city scenarios. However, it faces great challenges due to complex factors including dynamic temporal dependencies and fine-grained spatial dependencies. To tackle these challenges, we propose a meta learning based framework, MetaTTE, to continuously provide accurate travel time estimation over time by leveraging well-designed deep neural network model called DED, which consists of Data preprocessing module and Encoder-Decoder network module. By introducing meta learning techniques, the generalization ability of MetaTTE is enhanced using small amount of examples, which opens up new opportunities to increase the potential of achieving consistent performance on TTTE when traffic conditions and road networks change over time in the future. The DED model adopts an encoder-decoder network to capture fine-grained spatial and temporal representations. Extensive experiments on two real-world datasets are conducted to confirm that our MetaTTE outperforms nine state-of-art baselines, and improve 29.35% and 25.93% accuracy than the best baseline on Chengdu and Porto datasets, respectively."}, "journals/corr/abs-2201-08017": {"title": "Fine-Grained Trajectory-based Travel Time Estimation for Multi-city Scenarios Based on Deep Meta-Learning.", "url": "https://arxiv.org/abs/2201.08017", "year": "2022", "author": {"Chenxing Wang 0001": "144/6318-1", "Fang Zhao 0003": "72/4898-3", "Haichao Zhang": "57/3924", "Haiyong Luo": "00/1531", "Yanjun Qin": "210/3849", "Yuchen Fang": "189/3599"}, "abstract": "\n      Abstract:  Travel Time Estimation (TTE) is indispensable in intelligent transportation\nsystem (ITS). It is significant to achieve the fine-grained Trajectory-based\nTravel Time Estimation (TTTE) for multi-city scenarios, namely to accurately\nestimate travel time of the given trajectory for multiple city scenarios.\nHowever, it faces great challenges due to complex factors including dynamic\ntemporal dependencies and fine-grained spatial dependencies. To tackle these\nchallenges, we propose a meta learning based framework, MetaTTE, to\ncontinuously provide accurate travel time estimation over time by leveraging\nwell-designed deep neural network model called DED, which consists of Data\npreprocessing module and Encoder-Decoder network module. By introducing meta\nlearning techniques, the generalization ability of MetaTTE is enhanced using\nsmall amount of examples, which opens up new opportunities to increase the\npotential of achieving consistent performance on TTTE when traffic conditions\nand road networks change over time in the future. The DED model adopts an\nencoder-decoder network to capture fine-grained spatial and temporal\nrepresentations. Extensive experiments on two real-world datasets are conducted\nto confirm that our MetaTTE outperforms six state-of-art baselines, and improve\n29.35% and 25.93% accuracy than the best baseline on Chengdu and Porto\ndatasets, respectively.\n\n    "}, "journals/icl/ShaoZLTLC21": {"title": "Particle Filter Reinforcement via Context-Sensing for Smartphone-Based Pedestrian Dead Reckoning.", "url": "https://doi.org/10.1109/LCOMM.2021.3090300", "year": "2021", "author": {"Wenhua Shao": "134/5920", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Hui Tian 0003": "57/1592-3", "Jiaxin Li": "69/327", "Antonino Crivello": "151/6013"}, "abstract": " Abstract:Pedestrian dead reckoning based on particle filter is commonly used for enabling seamless smartphone-based indoor positioning. However, compass directions indoor are heavily distorted due to the presence of ferromagnetic materials. Conventional particle filters convert the raw compass direction to a distribution adding a constant variance noise and leveraging a particle swarm to simulate the distribution. Finally, the selection of eligible directions is performed applying external constraints mainly imposed from the indoor map. However, the choice of a constant parameter decreases the positioning performances because the variance of nearby context, including topography, ferromagnetic materials, and particle distribution, is not represented. Therefore, we propose the particle filter reinforcement able to adaptively learn and adjust the variance of the direction observing the context in real-time. Experiments in real-world scenarios show that the proposed method improves the positioning accuracy by more than 20% at the 80% probability compared with state-of-the-art methods."}, "journals/iotj/ZhuLZC21": {"title": "Indoor/Outdoor Switching Detection Using Multisensor DenseNet and LSTM.", "url": "https://doi.org/10.1109/JIOT.2020.3013853", "year": "2021", "author": {"Yida Zhu": "237/4985", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Runze Chen": "234/6034"}, "abstract": " Abstract:In recent years, with the widespread popularity of smart mobile devices, seamless location-based service (LBS) between indoor and outdoor (IO) space has become an emerging requirement. As the direct indicator of location and contextual status, accurate indoor/outdoor status guarantees stability and continuity for human localization and activity recognition. Rich-sensor smartphones have made possible various context sensing. However, it is challenging to realize fast and accurate IO switching detection in dynamic and complex environments with variable sensory signals. Toward this end, we propose a multisensor deep learning model to predict the IO state, which consists of four parts: 1) sensor vectors; 2) 1-D sensor DenseNet; 3) LSTM; and 4) MLP. Unlike the traditional feature engineering and fixed threshold strategy, we utilize 1-D sensor DenseNet to extract higher level features for different sensors, and then utilize LSTM to capture signal change pattern in time series. Finally, we leverage the MLP to classify indoor/outdoor scenes. We evaluated our proposed architecture on two data sets, one for only differentiating IO scenes and one for detecting the indoor/outdoor switching scenes. Extensive experimental results show that our proposed method outperforms the fixed threshold method, traditional machine learning-based methods, and other existing neural network-based methods in terms of switching delay and recognition accuracy."}, "journals/iotj/WangLXMZXO21": {"title": "Pedestrian Dead Reckoning Based on Walking Pattern Recognition and Online Magnetic Fingerprint Trajectory Calibration.", "url": "https://doi.org/10.1109/JIOT.2020.3016146", "year": "2021", "author": {"Qu Wang": "190/3175", "Haiyong Luo": "00/1531", "Hao Xiong": "46/5036", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Ming Xia": "54/344", "Changhai Ou": "174/7880"}, "abstract": " Abstract:With the explosive development of pervasive computing and the Internet of Things (IoT), indoor positioning and navigation have attracted immense attention over recent years. Pedestrian dead reckoning (PDR) is a potential autonomous localization technology that obtains position estimation employing built-in sensors. However, most existing PDR methods assume that the smartphone is held horizontally and points to the walking direction. To solve reckoning errors caused by inconsistency of headings between walking heading and pointing of smartphone, we design an accurate and robust PDR method based on walking patterns, which is identified by multihead convolutional neural networks. In addition to adaptively adjust the threshold of step detection and select the most suitable step length model according to the results of walking pattern recognition, a novel heading estimation approach independent of device orientation is proposed. To mitigate accumulative errors, we proposed an online trajectory calibration method based on forward and backward magnetic fingerprint trajectory matching. We conduct extensive and well-designed experiments in typical scenarios, and the experimental results indicate that the 75th percentile localization accuracy of the three scenarios is 1.06, 1.08, and 1.22 m, respectively, using the commercial smartphone embedded sensor without any dedicated infrastructures or training data. Despite the intricate pedestrian locomotion, the proposed PDR method has great potential in pedestrian positioning."}, "journals/tim/LuGLZLJ21": {"title": "Heterogeneous Multi-Task Learning for Multiple Pseudo-Measurement Estimation to Bridge GPS Outages.", "url": "https://doi.org/10.1109/TIM.2020.3028438", "year": "2021", "author": {"Shuangqiu Lu": "257/8709", "Yilin Gong": "257/8553", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Zhaohui Li": "46/4444", "Jinguang Jiang": "26/3479"}, "abstract": " Abstract:To enhance the performance of the inertial navigation system (INS)/global position system (GPS) integrated navigation system for the land vehicle during GPS outages is an extremely challenging task. Though existing researches have made reasonable progress in positioning accuracy, they largely ignore sophisticated vehicle stopping events, and the further improvement of positioning performance is urgently needed in complex urban environments. In this article, we propose a heterogeneous multi-task learning (MTL) structure with a shared de-noising process to conduct pseudo-GPS position prediction and zero-velocity detection. The raised model builds upon three vital parts: 1) a shared de-noising convolutional autoencoder (CAE), which can effectively filter the measurement noises in the original inputs and provide more clean data for subsequent calculations without the ground-truth sensor data; 2) a predictor that uses a deep temporal convolutional network (TCN) to predict pseudo-GPS position to bridge GPS gaps; and 3) a robust zero-velocity detector that utilizes a 1-D deep convolutional neural network to accurately detect the vehicle stationary pattern, allowing for timely correcting the velocity and heading. Our proposed MTL model is evaluated on extensive practical road data and achieves a root mean square error of 3.794 m for 120-s GPS outages under long-term vehicle stopping scenarios, which obviously outperforms the stand-alone long short-term memory, TCN, and TCN + CAE. Experimental results also demonstrate that our proposed MTL method yields a remarkable accuracy of over 99.0% for vehicle stationary detection."}, "journals/tim/WuLJZXG21": {"title": "Predicting the Noise Covariance With a Multitask Learning Model for Kalman Filter-Based GNSS/INS Integrated Navigation.", "url": "https://doi.org/10.1109/TIM.2020.3024357", "year": "2021", "author": {"Fan Wu": "07/6378", "Haiyong Luo": "00/1531", "Hongwei Jia": "12/6829", "Fang Zhao 0003": "72/4898-3", "Yimin Xiao": "125/1781", "Xile Gao": "237/4119"}, "abstract": " Abstract:In the recent years, the availability of accurate vehicle position becomes more urgent. The global navigation satellite systems/inertial navigation system (GNSS/INS) is the most used integrated navigation scheme for land vehicles, which utilizes the Kalman filter (KF) to optimally fuse GNSS measurement and INS prediction for accurate and robust localization. However, the uncertainty of the process noise covariance and the measurement noise covariance has a significant impact on Kalman filtering performance. Traditional KF-based integrated navigation methods configure the process noise covariance and measurement noise covariance with predefined constants, which cannot adaptively characterize the various and dynamic environments, and obtain accurate and continuous positioning results under complex environments. To obtain accurate and robust localization results under various complex and dynamic environments, in this article, we propose a novel noise covariance estimation algorithm for the GNSS/INS-integrated navigation using multitask learning model, which can simultaneously estimate the process noise covariance and measurement noise covariance for the KF. The predicted multiplication factors are used to dynamically scale process noise covariance matrix and measurement noise covariance matrix respectively according to the inputs of raw inertial measurement. Extensive experiments are conducted on our collected practical road data set under three typical complex urban scenarios, such as, avenues, viaducts, and tunnels. Experimental results demonstrate that compared with the traditional KF-based integrated navigation algorithm with predefined fixed settings, our proposed method reduces 77.13% positioning error."}, "journals/tits/0001L0Q21": {"title": "Combining Residual and LSTM Recurrent Networks for Transportation Mode Detection Using Multimodal Sensors Integrated in Smartphones.", "url": "https://doi.org/10.1109/TITS.2020.2987598", "year": "2021", "author": {"Chenxing Wang 0001": "144/6318-1", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Yanjun Qin": "210/3849"}, "abstract": " Abstract:In recent years, with the rapid development of public transportation, the ways people travel has become more diversified and complicated. Transportation mode detection, as a significant branch of human activity recognition (HAR), is of great importance in analyzing human travel patterns, traffic prediction and planning. Though many works have been devoted to transportation mode detection, there remains challenge for accurate and robust transportation pattern identification. In this paper, we propose a residual and LSTM recurrent networks-based transportation mode detection algorithm using multiple light-weight sensors integrated in commodity smartphones. Feature representation learning is adopted separately on multiple preprocessed sensor data using deep residual and LSTM network, which can enhance the identification accuracy and support one or more sensors. Residual units are introduced to accelerate the learning speed and enhance the accuracy of transportation mode detection. Furthermore, we also leverage the attention model to learn the significance of different features and different timesteps to enhance the recognition accuracy. Extensive experimental results on three datasets indicate that using our proposed model can achieve the best recognition accuracy for eight transportation modes including being stationary, walking, running, cycling, taking a car, taking a bus, taking a subway and taking a train, which outperforms other benchmark algorithms."}, "journals/tvt/QinLZWF21": {"title": "NDGCN: Network in Network, Dilate Convolution and Graph Convolutional Networks Based Transportation Mode Recognition.", "url": "https://doi.org/10.1109/TVT.2021.3060761", "year": "2021", "author": {"Yanjun Qin": "210/3849", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Chenxing Wang 0001": "144/6318-1", "Yuchen Fang": "189/3599"}, "abstract": " Abstract:Transportation mode recognition is a crucial task of Intelligent Transportation Systems (ITS) in smart city. Though many works have been investigated on transportation mode recognition in recent years, the accuracy and generality are still not able to meet the application requirements. In this paper, we propose a novel fusion framework for fine-grained transportation mode recognition, which consists of the Network in Network (NIN), Dilate Convolution and the Graph Convolutional Networks (GCN). In this framework, we first use NIN and Dilate Convolution to capture local and global features, respectively, and then introduce the graph convolutional network to learn the correlation of features. We construct a topological structure of the features based on the maximal information coefficient (MIC) criteria which is used to measure the similarity between two variables, and then obtain the adjacency matrix used for graph convolution. Extensive experimental results on the public Sussex-Huawei Locomotion-Transportation (SHL) dataset demonstrate the superiority of our proposed NDGCN to other state-of-the-art baselines with more than 22.3% higher accuracy."}, "journals/tvt/XiaoLZWGWC21": {"title": "Residual Attention Network-Based Confidence Estimation Algorithm for Non-Holonomic Constraint in GNSS/INS Integrated Navigation System.", "url": "https://doi.org/10.1109/TVT.2021.3113500", "year": "2021", "author": {"Yimin Xiao": "125/1781", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Fan Wu": "07/6378", "Xile Gao": "237/4119", "Qu Wang": "190/3175", "Lizhen Cui": "82/5713"}, "abstract": " Abstract:Nowadays, the availability of accurate vehicle position becomes more and more indispensable. The GNSS/INS (Global Navigation Satellite Systems/Inertial Navigation System) is currently the most widely-used integrated navigation scheme for land vehicles, which is capable of provide high-accuracy and continuous positioning results in the open-sky environments. However, under the GNSS-denied conditions, the existing GNSS/INS integrated system often fails to provide reliable positioning results due to various and nonlinear errors contained in the MEMS (Micro-Electro-Mechanical System) IMU (Inertial Measurement Unit) measurements. To improve the positioning accuracy during GNSS outage, deep learning has been introduced into the GNSS/INS integrated system in recent years. In this paper, we propose a residual attention network-based confidence (i.e., measurement noise covariance) estimation algorithm for non-holonomic constraint in GNSS/INS integrated navigation system, which adopts a residual attention network to dynamically estimate the noise covariance of the pseudo-observation (i.e., non-holonomic constraint) for optimal Kalman filtering (KF) fusion. To emphasize the more representative features with larger weights for accurate noise covariance estimation, we introduce an attention mechanism to automatically assign proper weights to the learned features according to their contributions. We evaluate our proposed method on three practical road datasets and compare it with other seven methods including the traditional KF, Pure INS, KF with three deep learning networks, K-means, and the Input-Delayed Neural Networks based method. Extensive experimental results demonstrate that our proposed RA-NHC bounds the errors associated with velocities and achieves reasonable accuracy improvement in position and velocity estimation."}, "journals/corr/abs-2106-06783": {"title": "Lvio-Fusion: A Self-adaptive Multi-sensor Fusion SLAM Framework Using Actor-critic Method.", "url": "https://arxiv.org/abs/2106.06783", "year": "2021", "author": {"Yupeng Jia": "90/1847", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Guanlin Jiang": "294/8330", "Yuhang Li": "72/2508", "Jiaquan Yan": "219/0936", "Zhuqing Jiang": "72/10176"}, "abstract": "\n      Abstract:  State estimation with sensors is essential for mobile robots. Due to\ndifferent performance of sensors in different environments, how to fuse\nmeasurements of various sensors is a problem. In this paper, we propose a\ntightly coupled multi-sensor fusion framework, Lvio-Fusion, which fuses stereo\ncamera, Lidar, IMU, and GPS based on the graph optimization. Especially for\nurban traffic scenes, we introduce a segmented global pose graph optimization\nwith GPS and loop-closure, which can eliminate accumulated drifts.\nAdditionally, we creatively use a actor-critic method in reinforcement learning\nto adaptively adjust sensors' weight. After training, actor-critic agent can\nprovide the system better and dynamic sensors' weight. We evaluate the\nperformance of our system on public datasets and compare it with other\nstate-of-the-art methods, which shows that the proposed method achieves high\nestimation accuracy and robustness to various environments. And our\nimplementations are open source and highly scalable.\n\n    "}, "journals/corr/abs-2107-07331": {"title": "Modeling Accurate Human Activity Recognition for Embedded Devices Using Multi-level Distillation.", "url": "https://arxiv.org/abs/2107.07331", "year": "2021", "author": {"Runze Chen": "234/6034", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Xuechun Meng": "267/0808", "Zhiqing Xie": "297/4384", "Yida Zhu": "237/4985"}, "abstract": "\n      Abstract:  Human Activity Recognition (HAR) based on IMU sensors is a crucial area in\nubiquitous computing. Because of the trend of deploying AI on IoT devices or\nsmartphones, more researchers are designing different HAR models for embedded\ndevices. Deployment of models in embedded devices can help enhance the\nefficiency of HAR. We propose a multi-level HAR modeling pipeline called\nStage-Logits-Memory Distillation (SMLDist) for constructing deep convolutional\nHAR models with embedded hardware support. SMLDist includes stage distillation,\nmemory distillation, and logits distillation. Stage distillation constrains the\nlearning direction of the intermediate features. The teacher model teaches the\nstudent models how to explain and store the inner relationship among\nhigh-dimensional features based on Hopfield networks in memory distillation.\nLogits distillation builds logits distilled by a smoothed conditional rule to\npreserve the probability distribution and enhance the softer target accuracy.\nWe compare the accuracy, F1 macro score, and energy cost on embedded platforms\nof a MobileNet V3 model built by SMLDist with various state-of-the-art HAR\nframeworks. The product model has a good balance with robustness and\nefficiency. SMLDist can also compress models with a minor performance loss at\nan equal compression ratio to other advanced knowledge distillation methods on\nseven public datasets.\n\n    "}, "journals/corr/abs-2112-02262": {"title": "STJLA: A Multi-Context Aware Spatio-Temporal Joint Linear Attention Network for Traffic Forecasting.", "url": "https://arxiv.org/abs/2112.02262", "year": "2021", "author": {"Yuchen Fang": "189/3599", "Yanjun Qin": "210/3849", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Chenxing Wang 0001": "144/6318-1"}, "abstract": "\n      Abstract:  Traffic prediction has gradually attracted the attention of researchers\nbecause of the increase in traffic big data. Therefore, how to mine the complex\nspatio-temporal correlations in traffic data to predict traffic conditions more\naccurately become a difficult problem. Previous works combined graph\nconvolution networks (GCNs) and self-attention mechanism with deep time series\nmodels (e.g. recurrent neural networks) to capture the spatio-temporal\ncorrelations separately, ignoring the relationships across time and space.\nBesides, GCNs are limited by over-smoothing issue and self-attention is limited\nby quadratic problem, result in GCNs lack global representation capabilities,\nand self-attention inefficiently capture the global spatial dependence. In this\npaper, we propose a novel deep learning model for traffic forecasting, named\nMulti-Context Aware Spatio-Temporal Joint Linear Attention (STJLA), which\napplies linear attention to the spatio-temporal joint graph to capture global\ndependence between all spatio-temporal nodes efficiently. More specifically,\nSTJLA utilizes static structural context and dynamic semantic context to\nimprove model performance. The static structure context based on node2vec and\none-hot encoding enriches the spatio-temporal position information.\nFurthermore, the multi-head diffusion convolution network based dynamic spatial\ncontext enhances the local spatial perception ability, and the GRU based\ndynamic temporal context stabilizes sequence position information of the linear\nattention, respectively. Experiments on two real-world traffic datasets,\nEngland and PEMSD7, demonstrate that our STJLA can achieve up to 9.83% and\n3.08% accuracy improvement in MAE measure over state-of-the-art baselines.\n\n    "}, "journals/corr/abs-2112-02264": {"title": "DMGCRN: Dynamic Multi-Graph Convolution Recurrent Network for Traffic Forecasting.", "url": "https://arxiv.org/abs/2112.02264", "year": "2021", "author": {"Yanjun Qin": "210/3849", "Yuchen Fang": "189/3599", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Chenxing Wang 0001": "144/6318-1"}, "abstract": "\n      Abstract:  Traffic forecasting is a problem of intelligent transportation systems (ITS)\nand crucial for individuals and public agencies. Therefore, researches pay\ngreat attention to deal with the complex spatio-temporal dependencies of\ntraffic system for accurate forecasting. However, there are two challenges: 1)\nMost traffic forecasting studies mainly focus on modeling correlations of\nneighboring sensors and ignore correlations of remote sensors, e.g., business\ndistricts with similar spatio-temporal patterns; 2) Prior methods which use\nstatic adjacency matrix in graph convolutional networks (GCNs) are not enough\nto reflect the dynamic spatial dependence in traffic system. Moreover,\nfine-grained methods which use self-attention to model dynamic correlations of\nall sensors ignore hierarchical information in road networks and have quadratic\ncomputational complexity. In this paper, we propose a novel dynamic multi-graph\nconvolution recurrent network (DMGCRN) to tackle above issues, which can model\nthe spatial correlations of distance, the spatial correlations of structure,\nand the temporal correlations simultaneously. We not only use the\ndistance-based graph to capture spatial information from nodes are close in\ndistance but also construct a novel latent graph which encoded the structure\ncorrelations among roads to capture spatial information from nodes are similar\nin structure. Furthermore, we divide the neighbors of each sensor into\ncoarse-grained regions, and dynamically assign different weights to each region\nat different times. Meanwhile, we integrate the dynamic multi-graph convolution\nnetwork into the gated recurrent unit (GRU) to capture temporal dependence.\nExtensive experiments on three real-world traffic datasets demonstrate that our\nproposed algorithm outperforms state-of-the-art baselines.\n\n    "}, "journals/corr/abs-2112-02736": {"title": "CDGNet: A Cross-Time Dynamic Graph-based Deep Learning Model for Traffic Forecasting.", "url": "https://arxiv.org/abs/2112.02736", "year": "2021", "author": {"Yuchen Fang": "189/3599", "Yanjun Qin": "210/3849", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Liang Zeng": "09/2922", "Bo Hui": "260/4200", "Chenxing Wang 0001": "144/6318-1"}, "abstract": "\n      Abstract:  Traffic forecasting is important in intelligent transportation systems of\nwebs and beneficial to traffic safety, yet is very challenging because of the\ncomplex and dynamic spatio-temporal dependencies in real-world traffic systems.\nPrior methods use the pre-defined or learnable static graph to extract spatial\ncorrelations. However, the static graph-based methods fail to mine the\nevolution of the traffic network. Researchers subsequently generate the dynamic\ngraph for each time slice to reflect the changes of spatial correlations, but\nthey follow the paradigm of independently modeling spatio-temporal\ndependencies, ignoring the cross-time spatial influence. In this paper, we\npropose a novel cross-time dynamic graph-based deep learning model, named\nCDGNet, for traffic forecasting. The model is able to effectively capture the\ncross-time spatial dependence between each time slice and its historical time\nslices by utilizing the cross-time dynamic graph. Meanwhile, we design a gating\nmechanism to sparse the cross-time dynamic graph, which conforms to the sparse\nspatial correlations in the real world. Besides, we propose a novel\nencoder-decoder architecture to incorporate the cross-time dynamic graph-based\nGCN for multi-step traffic forecasting. Experimental results on three\nreal-world public traffic datasets demonstrate that CDGNet outperforms the\nstate-of-the-art baselines. We additionally provide a qualitative study to\nanalyze the effectiveness of our architecture.\n\n    "}, "journals/corr/abs-2112-02740": {"title": "STformer: A Noise-Aware Efficient Spatio-Temporal Transformer Architecture for Traffic Forecasting.", "url": "https://arxiv.org/abs/2112.02740", "year": "2021", "author": {"Yanjun Qin": "210/3849", "Yuchen Fang": "189/3599", "Haiyong Luo": "00/1531", "Liang Zeng": "09/2922", "Fang Zhao 0003": "72/4898-3", "Chenxing Wang 0001": "144/6318-1"}, "abstract": "\n      Abstract:  Traffic forecasting is crucial for public safety and resource optimization,\nyet is very challenging due to three aspects: i) current existing works mostly\nexploit intricate temporal patterns (e.g., the short-term thunderstorm and\nlong-term daily trends) within a single method, which fail to accurately\ncapture spatio-temporal dependencies under different schemas; ii) the\nunder-exploration of the graph positional encoding limit the extraction of\nspatial information in the commonly used full graph attention network; iii) the\nquadratic complexity of the full graph attention introduces heavy computational\nneeds. To achieve the effective traffic flow forecasting, we propose an\nefficient spectral graph attention network with disentangled traffic sequences.\nSpecifically, the discrete wavelet transform is leveraged to obtain the low-\nand high-frequency components of traffic sequences, and a dual-channel encoder\nis elaborately designed to accurately capture the spatio-temporal dependencies\nunder long- and short-term schemas of the low- and high-frequency components.\nMoreover, a novel wavelet-based graph positional encoding and a query sampling\nstrategy are introduced in our spectral graph attention to effectively guide\nmessage passing and efficiently calculate the attention. Extensive experiments\non four real-world datasets show the superiority of our model, i.e., the higher\ntraffic forecasting precision with lower computational cost.\n\n    "}, "journals/iotj/WangLYMZHO20": {"title": "Personalized Stride-Length Estimation Based on Active Online Learning.", "url": "https://doi.org/10.1109/JIOT.2020.2971318", "year": "2020", "author": {"Qu Wang": "190/3175", "Haiyong Luo": "00/1531", "Langlang Ye": "237/5548", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Yan Huang 0035": "75/6434-35", "Changhai Ou": "174/7880"}, "abstract": " Abstract:The ability to accurately estimate a user's stride length plays a great important role in various applications. For a new target pedestrian or device, their heterogeneity dramatically reduces the performance of the current stride-length estimation (SLE) methods. To address the issue of heterogeneity, in this article, we propose an SLE method based on a long short-term memory (LSTM) network and denoising autoencoders (DAEs). The LSTM network is used to mine temporal dependencies and extract significant eigenvectors from the corrupted inertial sensor observations. Then, DAEs are adopted to automatically eliminate the inherent noise in eigenvectors and obtain denoised eigenvectors. Finally, a regression module maps the denoised eigenvectors to the resulting stride length. To mitigate the heterogeneity, we propose an unperceived model updating framework based on active online learning to establish a personalized model for a given target pedestrian or device. The proposed framework utilizes a magnetism-aided map-matching approach to automatically generate personalized training data and utilizes online learning technologies to evolve the stride-length model. The extensive experimental results demonstrate that the proposed method outperforms other state-of-the-art algorithms and achieves a promising accuracy with a stride-length error rate of 4.59% at a confidence level of 80%."}, "journals/iotj/ShaoLZTYC20": {"title": "Accurate Indoor Positioning Using Temporal-Spatial Constraints Based on Wi-Fi Fine Time Measurements.", "url": "https://doi.org/10.1109/JIOT.2020.2992069", "year": "2020", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Hui Tian 0003": "57/1592-3", "Shuo Yan": "09/8350", "Antonino Crivello": "151/6013"}, "abstract": " Abstract:The IEEE 802.11mc-2016 protocol enables certified devices to obtain precise ranging information using time-of-flight-based techniques. The ranging error increases in indoor environments due to the multipath effect. Traditional methods utilize only the ranging measurements of the current location, thus limiting the abilities to reduce the influence of multipath problems. This article introduces a robust positioning method that leverages the constraints of multiple positioning nodes at different positions. We transfer a sequence of temporal ranging measurements into multiple virtual positioning clients (VPCs) in the spatial domain by considering their spatial constraints. Defining an objective function and the spatial constraints of the VPCs as Karush-Kuhn-Tucker conditions, we solve the positioning estimation with nonconvex optimization. We propose an iterative weight estimation method for the time of flight ranging and the VPC to optimize the positioning model. An extensive experimental campaign demonstrates that our proposal can remarkably improve the positioning accuracy in complex indoor environments."}, "journals/remotesensing/GaoLNZBGXJ20": {"title": "RL-AKF: An Adaptive Kalman Filter Navigation Algorithm Based on Reinforcement Learning for Ground Vehicles.", "url": "https://doi.org/10.3390/rs12111704", "year": "2020", "author": {"Xile Gao": "237/4119", "Haiyong Luo": "00/1531", "Bokun Ning": "237/5272", "Fang Zhao 0003": "72/4898-3", "Linfeng Bao": "94/11423", "Yilin Gong": "257/8553", "Yimin Xiao": "125/1781", "Jinguang Jiang": "26/3479"}, "abstract": ""}, "journals/sensors/HuangLSZY20": {"title": "Accurate and Robust Floor Positioning in Complex Indoor Environments.", "url": "https://doi.org/10.3390/s20092698", "year": "2020", "author": {"Jingyu Huang": "06/8376", "Haiyong Luo": "00/1531", "Wenhua Shao": "134/5920", "Fang Zhao 0003": "72/4898-3", "Shuo Yan": "09/8350"}, "abstract": ""}, "journals/sensors/JiaLWZKWZ20": {"title": "ADST: Forecasting Metro Flow Using Attention-Based Deep Spatial-Temporal Networks with Multi-Task Learning.", "url": "https://doi.org/10.3390/s20164574", "year": "2020", "author": {"Hongwei Jia": "12/6829", "Haiyong Luo": "00/1531", "Hao Wang": "181/2812", "Fang Zhao 0003": "72/4898-3", "Qixue Ke": "237/5325", "Mingyao Wu": "273/3109", "Yunyun Zhao": "34/9712"}, "abstract": ""}, "journals/tim/WangLWLZH20": {"title": "A Spatial-Temporal Positioning Algorithm Using Residual Network and LSTM.", "url": "https://doi.org/10.1109/TIM.2020.2998645", "year": "2020", "author": {"Rongrong Wang": "61/6922", "Haiyong Luo": "00/1531", "Qu Wang": "190/3175", "Zhaohui Li": "46/4444", "Fang Zhao 0003": "72/4898-3", "Jingyu Huang": "06/8376"}, "abstract": " Abstract:With the ever-increasing demand for location-based services in the indoor environments, Wi-Fi-based positioning technology has attracted much attention in decades of years because of its ubiquitous deployment and low cost. There is the fact that Wi-Fi signal not only changes with the distance away from the target, but also changes with time. To improve positioning accuracy and robustness, we consider both the spatial relation and temporal sequential relation simultaneously, and propose a spatial-temporal positioning algorithm that combines residual network and long short-term memory (LSTM) network. In this algorithm, to avoid the degradation problem, we adopt the residual-based network to extract the spatial features of the Wi-Fi signal at the same time slice. Furthermore, the LSTM is used to extract temporal features of the Wi-Fi signal among successive time slices. Finally, a fully connected layer is used to obtain the final location estimation. Extensive experiments on the IPIN2016 data sets demonstrate that our proposed algorithm can obtain 4.93-, 5.40-, 3.20-, and 4.98-m average positioning error on the UAH, CAR, UJIUB, and UJITI subdata set, respectively. The experimental results show that our proposed algorithm outperforms other state-of-the-art positioning algorithms with better accuracy and robustness."}, "journals/access/QinLZWWZ19": {"title": "Toward Transportation Mode Recognition Using Deep Convolutional and Long Short-Term Memory Recurrent Neural Networks.", "url": "https://doi.org/10.1109/ACCESS.2019.2944686", "year": "2019", "author": {"Yanjun Qin": "210/3849", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Chenxing Wang 0001": "144/6318-1", "Jiaqi Wang": "44/740", "Yuexia Zhang": "86/181"}, "abstract": " Abstract:With the rapid development of mobile Internet techniques, using the sensor-rich smartphones to sense various contexts attracts much attention, such as transportation mode recognition. The transportation mode information can help to improve urban planning, traffic management and journey planning. Though much work has been done on the transportation mode recognition using classic machine learning algorithms, the performance of these methods is not reasonable and heavily relies on the effectiveness of handcrafted features. In this paper, we leverage the strong representation ability of deep learning method and present a deep-learning-based algorithm for transportation mode recognition, namely CL-TRANSMODE, which is capable of accurately detecting multiple transportation modes. The algorithm first uses a convolutional neural network (CNN) to learn appropriate and robust feature representations for transportation modes recognition. Then, an LSTM network performs a further learning of the temporal dependencies characteristics on the feature vectors of CNN output. To further enhance the accuracy of transportation mode recognition, several artificial segments and peak features are extracted from the raw sensor measurements. These features characterize the transportation modes over a much long period of time (minutes or hours). By combining the CNN-extracted features and handcrafted features, our proposed CL-TRANSMODE transportation mode recognition algorithm can accurately differentiate eight transportation modes, i.e., walking, running, bicycling, driving a car, riding a bus, taking a metro, taking a train, or being stationary. Extensive experiments on both the SHL and HTC datasets demonstrate that use our proposed CL-TRANSMODE transportation mode recognition algorithm which outperforms the state-of-the-art comparative algorithms. On the SHL dataset, which contain barometric data, the accuracy using the CL-TRANSMODE algorithm can reaches 98.1%."}, "journals/access/WangLYMZHO19": {"title": "Pedestrian Heading Estimation Based on Spatial Transformer Networks and Hierarchical LSTM.", "url": "https://doi.org/10.1109/ACCESS.2019.2950728", "year": "2019", "author": {"Qu Wang": "190/3175", "Haiyong Luo": "00/1531", "Langlang Ye": "237/5548", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Yan Huang 0035": "75/6434-35", "Changhai Ou": "174/7880"}, "abstract": " Abstract:Accurate heading estimation is the foundation of numerous applications, including augmented reality, pedestrian dead reckoning, and human-computer interactions. While magnetometer is a key source of heading information, the poor accuracy of consumer-grade hardware coupled with the pervasive magnetic disturbances makes accurate heading estimation a challenging issue. Heading error is one of the main error sources of pedestrian dead reckoning. To reduce the heading error and enhance robustness, we proposed a novel heading estimation method based on Spatial Transformer Networks (STNs) and Long Short-Term Memory (LSTM), termed DeepHeading, which uses sensors embedded in a smartphone without any historical training data or dedicated infrastructure. We automatically annotate heading data based on map matching, and augment heading data based on device attitude. We leverage the STNs to align the device coordinate system and the navigation coordinate system, allow an unconstrained use of smartphones. Based on the characteristics of pedestrian heading continuity, we designed a hierarchical LSTM-basedSeq2Seq model to estimate the walking heading of the pedestrian. We conducted well-designed experiments to evaluate the performance of deepheading and compared it with the state-of-the-art heading estimation algorithms. The experimental results on real-world demonstrated that deepheading outperformed the compared heading estimation algorithms and achieved promising estimation accuracy with a median heading error of 4.52°, mean heading error of 6.07° and heading error of 9.18° at the confidence of 80% when a pedestrian is walking in indoor environments with magnetic field disturbances. The proposed method is high-efficiency and easy to integrate with various mobile applications."}, "journals/remotesensing/WangYLMZO19": {"title": "Pedestrian Walking Distance Estimation Based on Smartphone Mode Recognition.", "url": "https://doi.org/10.3390/rs11091140", "year": "2019", "author": {"Qu Wang": "190/3175", "Langlang Ye": "237/5548", "Haiyong Luo": "00/1531", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Changhai Ou": "174/7880"}, "abstract": ""}, "journals/remotesensing/WangLLZSW19": {"title": "A Robust Wi-Fi Fingerprint Positioning Algorithm Using Stacked Denoising Autoencoder and Multi-Layer Perceptron.", "url": "https://doi.org/10.3390/rs11111293", "year": "2019", "author": {"Rongrong Wang": "61/6922", "Zhaohui Li": "46/4444", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Wenhua Shao": "134/5920", "Qu Wang": "190/3175"}, "abstract": ""}, "journals/sensors/ZhuLWZNKZ19": {"title": "A Fast Indoor/Outdoor Transition Detection Algorithm Based on Machine Learning.", "url": "https://doi.org/10.3390/s19040786", "year": "2019", "author": {"Yida Zhu": "237/4985", "Haiyong Luo": "00/1531", "Qu Wang": "190/3175", "Fang Zhao 0003": "72/4898-3", "Bokun Ning": "237/5272", "Qixue Ke": "237/5325", "Chen Zhang": "94/4084"}, "abstract": ""}, "journals/sensors/WangYLMZH19": {"title": "Pedestrian Stride-Length Estimation Based on LSTM and Denoising Autoencoders.", "url": "https://doi.org/10.3390/s19040840", "year": "2019", "author": {"Qu Wang": "190/3175", "Langlang Ye": "237/5548", "Haiyong Luo": "00/1531", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Yan Huang 0035": "75/6434-35"}, "abstract": ""}, "journals/sensors/GaoLWZYZ19": {"title": "A Human Activity Recognition Algorithm Based on Stacking Denoising Autoencoder and LightGBM.", "url": "https://doi.org/10.3390/s19040947", "year": "2019", "author": {"Xile Gao": "237/4119", "Haiyong Luo": "00/1531", "Qu Wang": "190/3175", "Fang Zhao 0003": "72/4898-3", "Langlang Ye": "237/5548", "Yuexia Zhang": "86/181"}, "abstract": ""}, "journals/access/ShaoLZMZC18": {"title": "Indoor Positioning Based on Fingerprint-Image and Deep Learning.", "url": "https://doi.org/10.1109/ACCESS.2018.2884193", "year": "2018", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Yan Ma": "31/1970", "Zhongliang Zhao": "123/3334", "Antonino Crivello": "151/6013"}, "abstract": " Abstract:Wi-Fi and magnetic field fingerprinting have been a hot topic in indoor positioning researches because of their ubiquity and location-related features. Wi-Fi signals can provide rough initial positions, and magnetic fields can further improve the positioning accuracies, therefore many researchers have tried to combine the two signals for high-accuracy indoor localization. Currently, state-of-the-art solutions design separate algorithms to process different indoor signals. Outputs of these algorithms are generally used as inputs of data fusion strategies. These methods rely on computationally expensive particle filters, labor-intensive feature analysis, and time-consuming parameter tuning to achieve better accuracies. Besides, particle filters need to estimate the moving directions of particles, limiting smartphone orientation to be stable, and aligned with the user's moving directions. In this paper, we adopted a convolutional neural network (CNN) to implement an accurate and orientation-free positioning system. Inspired by the state-of-the-art image classification methods, we design a novel hybrid location image using Wi-Fi and magnetic field fingerprints, and then a CNN is employed to classify the locations of the fingerprint images. In order to prevent the overfitting problem of the positioning CNN on limited training datasets, we also propose to divide the learning process into two steps to adopt proper learning strategies for different network branches. We show that the CNN solution is able to automatically learn location patterns, thus significantly lower the workforce burden of designing a localization system. Our experimental results convincingly reveal that the proposed positioning method achieves an accuracy of about 1 m under different smartphone orientations, users, and use patterns."}, "journals/ijdsn/WangLM0GWZH18": {"title": "Light positioning: A high-accuracy visible light indoor positioning system based on attitude identification and propagation model.", "url": "https://doi.org/10.1177/1550147718758263", "year": "2018", "author": {"Qu Wang": "190/3175", "Haiyong Luo": "00/1531", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Xile Gao": "237/4119", "Jie Wei": "35/3800", "Yuexia Zhang": "86/181", "Yan Huang 0035": "75/6434-35"}, "abstract": ""}, "journals/ijdsn/ShaoL0C18": {"title": "Toward improving indoor magnetic field-based positioning system using pedestrian motion models.", "url": "https://doi.org/10.1177/1550147718803072", "year": "2018", "author": {"Wenhua Shao": "134/5920", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Antonino Crivello": "151/6013"}, "abstract": ""}, "journals/ijdsn/QinL0ZJ18": {"title": "A traffic pattern detection algorithm based on multimodal sensing.", "url": "https://doi.org/10.1177/1550147718807832", "year": "2018", "author": {"Yanjun Qin": "210/3849", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Zhongliang Zhao": "123/3334", "Mengling Jiang": "210/1382"}, "abstract": ""}, "journals/ijdsn/Wei0L18": {"title": "SP-Loc: A crowdsourcing fingerprint based shop-level indoor localization algorithm integrating shop popularity without the indoor map.", "url": "https://doi.org/10.1177/1550147718815637", "year": "2018", "author": {"Jie Wei": "35/3800", "Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531"}, "abstract": ""}, "journals/jips/ZahidLWZ18": {"title": "Crowdsourcing Software Development: Task Assignment Using PDDL Artificial Intelligence Planning.", "url": "https://doi.org/10.3745/JIPS.04.0055", "year": "2018", "author": {"Tunio Muhammad Zahid": "195/4303", "Haiyong Luo": "00/1531", "Cong Wang 0003": "18/2771-3", "Fang Zhao 0003": "72/4898-3"}, "abstract": ""}, "journals/jips/ZahidLWZGS18": {"title": "Task Assignment Model for Crowdsourcing Software Development: TAM.", "url": "https://doi.org/10.3745/JIPS.04.0064", "year": "2018", "author": {"Tunio Muhammad Zahid": "195/4303", "Haiyong Luo": "00/1531", "Cong Wang 0003": "18/2771-3", "Fang Zhao 0003": "72/4898-3", "Abdul Rehman Gilal": "179/0143", "Wenhua Shao": "134/5920"}, "abstract": ""}, "journals/sensors/WangLMZH18": {"title": "An Infrastructure-Free Indoor Localization Algorithm for Smartphones.", "url": "https://doi.org/10.3390/s18103317", "year": "2018", "author": {"Qu Wang": "190/3175", "Haiyong Luo": "00/1531", "Aidong Men": "48/7458", "Fang Zhao 0003": "72/4898-3", "Yan Huang 0035": "75/6434-35"}, "abstract": ""}, "journals/corr/abs-1804-03961": {"title": "Discriminative Learning-based Smartphone Indoor Localization.", "url": "http://arxiv.org/abs/1804.03961", "year": "2018", "author": {"Jose Luis V. Carrera": "183/1773", "Zhongliang Zhao": "123/3334", "Torsten Braun": "b/TorstenBraun", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3"}, "abstract": "\n      Abstract:  Due to the growing area of ubiquitous mobile applications, indoor\nlocalization of smartphones has become an interesting research topic. Most of\nthe current indoor localization systems rely on intensive site survey to\nachieve high accuracy. In this work, we propose an efficient smartphones indoor\nlocalization system that is able to reduce the site survey effort while still\nachieving high localization accuracy. Our system is built by fusing a variety\nof signals, such as Wi-Fi received signal strength indicator, magnetic field\nand floor plan information in an enhanced particle filter. To achieve high and\nstable performance, we first apply discriminative learning models to integrate\nWi-Fi and magnetic field readings to achieve room level landmark detection.\nFurther, we integrate landmark detection, range-based localization models, with\na graph-based discretized system state representation. Because our approach\nrequires only discriminative learning-based room level landmark detections, the\ntime spent in the learning phase is significantly reduced compared to\ntraditional Wi-Fi fingerprinting or landmark-based approaches. We conduct\nexperimental studies to evaluate our system in an office-like indoor\nenvironment. Experiment results show that our system can significantly reduce\nthe learning efforts, and the localization method can achieve performance with\nan average localization error of 1.55 meters.\n\n    "}, "journals/access/ZahidL00GAS17": {"title": "Impact of Personality on Task Selection in Crowdsourcing Software Development: A Sorting Approach.", "url": "https://doi.org/10.1109/ACCESS.2017.2747660", "year": "2017", "author": {"Tunio Muhammad Zahid": "195/4303", "Haiyong Luo": "00/1531", "Cong Wang 0003": "18/2771-3", "Fang Zhao 0003": "72/4898-3", "Abdul Rehman Gilal": "179/0143", "Ahsanullah Abro": "170/3978", "Wenhua Shao": "134/5920"}, "abstract": " Abstract:Growing demand for software has attracted the attention of the software development industry. Crowdsourced software development has provided a new method for the software industry to produce quality software based on an open-call format. Selecting an appropriate task to develop (developer-end) or evaluate (platform-end) is one of the primary problems in this type of open-call format. Receiving or assigning an improper task to an improper crowdsource (CS) developer does not only decrease the quality of the software deliverables, but also causes overburden on both the platform and the developers. To solve this problem, sorting the tasks based on the developers' human characteristics may increase task relevancy for developers, which can accelerate efficiency and lessen complexity. Thus, this paper has conducted an empirical experiment to measure the influence of personality on task selection based on the important characteristics of a task: money, time, and type. A total of 83 students from the University of Sindh voluntarily participated in four different short-duration rounds of task development using the developed CS platform. The personality types of the participants were measured based on the Myers-Briggs type indicator. In addition, a complex network technique called weighted degree centrality was applied to identify the most suitable personality for task sorting based on money or complexity attractions (i.e., time or type). Based on the results, it can be observed that personality has a significant relationship with task selection. For instance, developers with intuitive (N) and feeling (F) personality traits are primarily focused on the time duration of a project."}, "journals/sensors/LuoZJMZ17": {"title": "Constructing an Indoor Floor Plan Using Crowdsourcing Based on Magnetic Fingerprinting.", "url": "https://doi.org/10.3390/s17112678", "year": "2017", "author": {"Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Mengling Jiang": "210/1382", "Hao Ma": "86/4227", "Yuexia Zhang": "86/181"}, "abstract": ""}, "journals/tii/0003LZPP17": {"title": "HYFI: Hybrid Floor Identification Based on Wireless Fingerprinting and Barometric Pressure.", "url": "https://doi.org/10.1109/TII.2015.2491264", "year": "2017", "author": {"Fang Zhao 0003": "72/4898-3", "Haiyong Luo": "00/1531", "Xuqiang Zhao": "133/3329", "Zhibo Pang": "75/9776", "Hyuncheol Park": "99/5171"}, "abstract": " Abstract:Identifying different floors in multistory buildings is a very important task for precise indoor localization in industrial and commercial applications. The accuracy from existing studies is rather low, especially in multistory buildings with irregular structures such as hollow areas, which is common in various industrial and commercial sites. As a better solution, this paper proposes a hybrid floor identification (HYFI) algorithm, which exploits wireless access point (AP) distribution and barometric pressure information. It first extracts the distribution probability of APs scanned in different floors from offline training fingerprints and adopts Bayesian classification to accurately identify floor in well-partitioned zones without hollow areas. The floor information obtained from wireless AP distribution is then used to initialize and calibrate barometric pressure-based floor identification to compensate variable environmental effects. Extensive experiments confirm that the HYFI approach significantly outperforms purely wireless fingerprinting-based or purely barometric pressure-based floor identification approaches. In our field tests in multistory facilities with irregular hollow areas, it can identify the floor level with more than 96.1% accuracy."}, "journals/js/ShaoZWLZWL16": {"title": "Location Fingerprint Extraction for Magnetic Field Magnitude Based Indoor Positioning.", "url": "https://doi.org/10.1155/2016/1945695", "year": "2016", "author": {"Wenhua Shao": "134/5920", "Fang Zhao 0003": "72/4898-3", "Cong Wang 0003": "18/2771-3", "Haiyong Luo": "00/1531", "Tunio Muhammad Zahid": "195/4303", "Qu Wang": "190/3175", "Dongmeng Li": "190/3195"}, "abstract": ""}, "journals/sensors/XuZWT16": {"title": "Adaptive Sampling-Based Information Collection for Wireless Body Area Networks.", "url": "https://doi.org/10.3390/s16091385", "year": "2016", "author": {"Xiaobin Xu": "98/2004", "Fang Zhao 0003": "72/4898-3", "Wendong Wang": "80/4406", "Hui Tian 0003": "57/1592-3"}, "abstract": ""}, "journals/ijapuc/XuLZTLL11": {"title": "The WiMap: A Dynamic Indoor WLAN Localization System.", "url": "https://doi.org/10.4018/japuc.2011010104", "year": "2011", "author": {"Junjun Xu": "15/10553", "Haiyong Luo": "00/1531", "Fang Zhao 0003": "72/4898-3", "Rui Tao": "82/10553", "Yiming Lin": "02/10552", "Hui Li": "66/3387"}, "abstract": ""}}}