{"id": "223/2313", "name": "Feifei Kou", "Article": {"conf/cicai/SongXDKLX21": {"title": "Multi-view Relevance Matching Model of Scientific Papers Based on Graph Convolutional Network and Attention Mechanism.", "url": "https://doi.org/10.1007/978-3-030-93046-2_61", "year": "2021", "author": {"Jie Song": "09/4756", "Zhe Xue": "116/7294", "Junping Du": "13/1151", "Feifei Kou": "223/2313", "MeiYu Liang": "150/1513", "Mingying Xu": "289/1484"}, "abstract": "Deep learning has been widely used in text matching tasks. However, the existing deep learning models are mainly designed for short texts matching and cannot be directly applied to the search of scientific papers. The main reason is that the differences between long and short texts in scientific paper search have not been fully considered, and the structural information of the text will be lost when the length difference is large. In order to solve the above long-short scientific text matching problem, we propose a multi-view relevance matching model (MVRM) of scientific papers based on graph convolutional network and attention mechanism. First, we use scientific papers abstract to construct interactive graph to retain the structural information in the long text. Each vertex denotes the keyword in the abstract and the edge weight denotes similarity between the keywords. Second, we propose a matching network for interactive graph based on the graph convolution networks. Multiple keywords in the search term form multiple views, and each keyword under each view interacts with the interactive graph. Then the interaction feature vectors from multiple views are generated through graph convolution network. Finally, attention mechanism is used for fusion, and the final matching result is output through the multilayer perceptron. Experiments on several representative scientific paper search datasets demonstrate that our model achieves better performance.KeywordsRelevance matchingGraph convolutional networkAttention mechanismMulti-viewLong-short text matching"}, "conf/cicai/ZhengXDKLX21": {"title": "A Hierarchical Multi-label Classification Algorithm for Scientific Papers Based on Graph Attention Networks.", "url": "https://doi.org/10.1007/978-3-030-93046-2_62", "year": "2021", "author": {"Changwei Zheng": "11/10184", "Zhe Xue": "116/7294", "Junping Du": "13/1151", "Feifei Kou": "223/2313", "MeiYu Liang": "150/1513", "Mingying Xu": "289/1484"}, "abstract": "Scientific paper classification refers to assigning one or more subject categories to papers. This task requires a lot of domain knowledge and heavy manual annotation. With the gradual increase in interdisciplinary research, a paper often has multiple categories. For instance, both Chinese Library Classification (http://www.ztflh.com/) and Engineering Village (EI) have a complete classification system, and there is a hierarchical relationship between the categories. The category of the paper has a hierarchical structure, so the paper classification can be converted into a hierarchical classification problem. However, the existing methods cannot effectively classify papers due to the following two reasons: First, these methods cannot well capture the semantic relationship between papers. Second, they neglect to model the hierarchical structure of labels. In this paper, we propose a hierarchical label attention model based on graph attention network, which utilizes word co-occurrence to model the semantic relationship of papers. We use multiple linear layers to model the category hierarchy and combine every hierarchy of labels through an attention mechanism. The experiments are conducted on CNKI (https://www.cnki.net/) and RCV1 datasets. The experimental results demonstrate that our method is superior to the other methods in the task of scientific paper classification.KeywordsGraph convolutional networkHierarchical classificationMulti-label classification"}, "conf/icbk/ChenDXK20": {"title": "Prediction of Financial Big Data Stock Trends Based on Attention Mechanism.", "url": "https://doi.org/10.1109/ICBK50248.2020.00031", "year": "2020", "author": {"Jiannan Chen": "202/9329", "Junping Du": "13/1151", "Zhe Xue": "116/7294", "Feifei Kou": "223/2313"}, "abstract": " Abstract:Stock trend prediction has always been the focus of research in the field of financial big data. Stock data is complex nonlinear data, while stock price is changing over time. Based on the characteristics of stock data, this paper proposes a financial big data stock trend prediction algorithm based on attention mechanism (STPA). We adopt Bidirectional Gated Recurrent Unit (BGRU) and attention mechanism to capture the long-term dependence of data on time series. The attention mechanism is used to analyze the weight of the impact of data from different time periods on the trend prediction results, thereby reducing the error of stock data change trend prediction and improving the accuracy of trend prediction. We select the daily closing price data of 10 stocks for model training and performance evaluation. Experimental results demonstrate that the proposed method STPA achieves higher precision, recall rate and F1-Score in predicting stock change trends than the other methods. Compared with mainstream methods, STPA improves the precision by 4%, improves recall by 2.5%, and improves F1-Score by 3.2%."}, "conf/icde/KouZCDSX19": {"title": "Interaction-Aware Arrangement for Event-Based Social Networks.", "url": "https://doi.org/10.1109/ICDE.2019.00161", "year": "2019", "author": {"Feifei Kou": "223/2313", "Zimu Zhou": "133/3824", "Hao Cheng": "09/5158", "Junping Du": "13/1151", "Yexuan Shi": "242/5177", "Pan Xu 0001": "11/9718-1"}, "abstract": " Abstract:The last decade has witnessed the emergence and popularity of event-based social networks (EBSNs), which extend online social networks to the physical world. Fundamental on EBSN platforms is to appropriately assign EBSN users to events they are interested to attend, known as event-participant arrangement. Previous event-participant arrangement studies either fail to avoid conflicts among events or ignore the social interactions among participants. In this work, we propose a new event-participant arrangement problem called Interaction-aware Global Event-Participant Arrangement (IGEPA). It globally optimizes arrangements between events and participants to avoid conflicts in events, and not only accounts for user interests, but also encourages socially active participants to join. To solve the IGEPA problem, we design an approximation algorithm which has an approximation ratio of at least 1\\4. Experimental results validate the effectiveness of our solution."}, "journals/fcsc/XueDXLWK22": {"title": "Few-shot node classification via local adaptive discriminant structure learning.", "url": "https://doi.org/10.1007/s11704-022-1259-6", "year": "2022", "author": {"Zhe Xue": "116/7294", "Junping Du": "13/1151", "Xin Xu": "66/3874", "Xiangbin Liu": "36/7142", "Junfu Wang": "276/6628", "Feifei Kou": "223/2313"}, "abstract": "Node classification has a wide range of application scenarios such as citation analysis and social network analysis. In many real-world attributed networks, a large portion of classes only contain limited labeled nodes. Most of the existing node classification methods cannot be used for few-shot node classification. To train the model effectively and improve the robustness and reliability of the model with scarce labeled samples, in this paper, we propose a local adaptive discriminant structure learning (LADSL) method for few-shot node classification. LADSL aims to properly represent the nodes in the attributed graphs and learn a metric space with a strong discriminating power by reducing the intra-class variations and enlarging inter-class differences. Extensive experiments conducted on various attributed networks datasets demonstrate that LADSL is superior to the other methods on few-shot node classification task."}, "journals/ijis/XuDXGKS22": {"title": "A scientific research topic trend prediction model based on multi-LSTM and graph convolutional network.", "url": "https://doi.org/10.1002/int.22846", "year": "2022", "author": {"Mingying Xu": "289/1484", "Junping Du": "13/1151", "Zhe Xue": "116/7294", "Zeli Guan": "241/3177", "Feifei Kou": "223/2313", "Lei Shi": "29/563"}, "abstract": ""}, "journals/tkde/LiangDLXWKW22": {"title": "Video Super-Resolution Reconstruction Based on Deep Learning and Spatio-Temporal Feature Self-Similarity.", "url": "https://doi.org/10.1109/TKDE.2020.3034261", "year": "2022", "author": {"MeiYu Liang": "150/1513", "Junping Du": "13/1151", "Linghui Li": "19/10136", "Zhe Xue": "116/7294", "Xiaoxiao Wang 0006": "01/447-6", "Feifei Kou": "223/2313", "Xu Wang": "181/2815"}, "abstract": " Abstract:To address the problems in the existing video super-resolution methods, such as noise, over smooth and visual artifacts, which are caused by the reliance on limited external training or mismatch of internal similarity patch instances, this study proposes a novel video super-resolution reconstruction algorithm based on deep learning and spatio-temporal feature similarity (DLSS-VSR). The video super-resolution reconstruction mechanism with the joint internal and external constraints is established utilizing the complementary advantages of both external deep correlation mapping learning and internal spatio-temporal nonlocal self-similarity prior constraint. A deep learning model based on deep convolutional neural network is constructed to learn the nonlinear correlation mapping between low-resolution and high-resolution video frame patches. A novel spatio-temporal feature similarity calculation method is proposed, which considers both internal video spatio-temporal self-similarity and external clean nonlocal similarity. For the internal spatio-temporal feature self-similarity, we improve the accuracy and robustness of similarity matching by proposing a similarity measure strategy based on spatio-temporal moment feature similarity and structural similarity. The external nonlocal similarity prior constraint is learned by the patch group-based Gaussian mixture model. The time efficiency for spatio-temporal similarity matching is further improved based on saliency detection and region correlation judgment strategy, which achieves a better tradeoff between super-resolution accuracy and speed. Experimental results demonstrate that the DLSS-VSR algorithm achieves competitive super-resolution quality compared to other state-of-the-art algorithms in both subjective and objective evaluations."}, "journals/corr/abs-2203-08615": {"title": "Scientific and Technological Information Oriented Semantics-adversarial and Media-adversarial Cross-media Retrieval.", "url": "https://doi.org/10.48550/arXiv.2203.08615", "year": "2022", "author": {"Ang Li": "33/2805", "Junping Du": "13/1151", "Feifei Kou": "223/2313", "Zhe Xue": "116/7294", "Xin Xu": "66/3874", "Mingying Xu": "289/1484", "Yang Jiang": "77/4076"}, "abstract": "\n      Abstract:  Cross-media retrieval of scientific and technological information is one of\nthe important tasks in the cross-media study. Cross-media scientific and\ntechnological information retrieval obtain target information from massive\nmulti-source and heterogeneous scientific and technological resources, which\nhelps to design applications that meet users' needs, including scientific and\ntechnological information recommendation, personalized scientific and\ntechnological information retrieval, etc. The core of cross-media retrieval is\nto learn a common subspace, so that data from different media can be directly\ncompared with each other after being mapped into this subspace. In subspace\nlearning, existing methods often focus on modeling the discrimination of\nintra-media data and the invariance of inter-media data after mapping; however,\nthey ignore the semantic consistency of inter-media data before and after\nmapping and media discrimination of intra-semantics data, which limit the\nresult of cross-media retrieval. In light of this, we propose a scientific and\ntechnological information oriented Semantics-adversarial and Media-adversarial\nCross-media Retrieval method (SMCR) to find an effective common subspace.\nSpecifically, SMCR minimizes the loss of inter-media semantic consistency in\naddition to modeling intra-media semantic discrimination, to preserve semantic\nsimilarity before and after mapping. Furthermore, SMCR constructs a basic\nfeature mapping network and a refined feature mapping network to jointly\nminimize the media discriminative loss within semantics, so as to enhance the\nfeature mapping network's ability to confuse the media discriminant network.\nExperimental results on two datasets demonstrate that the proposed SMCR\noutperforms state-of-the-art methods in cross-media retrieval.\n\n    "}, "journals/corr/abs-2203-15595": {"title": "Cross-Media Scientific Research Achievements Retrieval Based on Deep Language Model.", "url": "https://doi.org/10.48550/arXiv.2203.15595", "year": "2022", "author": {"Benzhi Wang": "316/4704", "MeiYu Liang": "150/1513", "Feifei Kou": "223/2313", "Mingying Xu": "289/1484"}, "abstract": "\n      Abstract:  Science and technology big data contain a lot of cross-media\ninformation.There are images and texts in the scientific paper.The s ingle\nmodal search method cannot well meet the needs of scientific researchers.This\npaper proposes a cross-media scientific research achievements retrieval method\nbased on deep language model (CARDL).It achieves a unified cross-media semantic\nrepresentation by learning the semantic association between different modal\ndata, and is applied to the generation of text semantic vector of scientific\nresearch achievements, and then cross-media retrieval is realized through\nsemantic similarity matching between different modal data.Experimental results\nshow that the proposed CARDL method achieves better cross-modal retrieval\nperformance than existing methods. Key words science and technology big data ;\ncross-media retrieval; cross-media semantic association learning; deep language\nmodel; semantic similarity\n\n    "}, "journals/corr/abs-2203-16256": {"title": "Research topic trend prediction of scientific papers based on spatial enhancement and dynamic graph convolution network.", "url": "https://doi.org/10.48550/arXiv.2203.16256", "year": "2022", "author": {"Changwei Zheng": "11/10184", "Zhe Xue": "116/7294", "MeiYu Liang": "150/1513", "Feifei Kou": "223/2313"}, "abstract": "\n      Abstract:  In recent years, with the increase of social investment in scientific\nresearch, the number of research results in various fields has increased\nsignificantly. Accurately and effectively predicting the trends of future\nresearch topics can help researchers discover future research hotspots.\nHowever, due to the increasingly close correlation between various research\nthemes, there is a certain dependency relationship between a large number of\nresearch themes. Viewing a single research theme in isolation and using\ntraditional sequence problem processing methods cannot effectively explore the\nspatial dependencies between these research themes. To simultaneously capture\nthe spatial dependencies and temporal changes between research topics, we\npropose a deep neural network-based research topic hotness prediction\nalgorithm, a spatiotemporal convolutional network model. Our model combines a\ngraph convolutional neural network (GCN) and Temporal Convolutional Network\n(TCN), specifically, GCNs are used to learn the spatial dependencies of\nresearch topics a and use space dependence to strengthen spatial\ncharacteristics. TCN is used to learn the dynamics of research topics' trends.\nOptimization is based on the calculation of weighted losses based on time\ndistance. Compared with the current mainstream sequence prediction models and\nsimilar spatiotemporal models on the paper datasets, experiments show that, in\nresearch topic prediction tasks, our model can effectively capture\nspatiotemporal relationships and the predictions outperform state-of-art\nbaselines.\n\n    "}, "journals/corr/abs-2203-16751": {"title": "An unsupervised cluster-level based method for learning node representations of heterogeneous graphs in scientific papers.", "url": "https://doi.org/10.48550/arXiv.2203.16751", "year": "2022", "author": {"Jie Song": "09/4756", "MeiYu Liang": "150/1513", "Zhe Xue": "116/7294", "Junping Du": "13/1151", "Feifei Kou": "223/2313"}, "abstract": "\n      Abstract:  Learning knowledge representation of scientific paper data is a problem to be\nsolved, and how to learn the representation of paper nodes in scientific paper\nheterogeneous network is the core to solve this problem. This paper proposes an\nunsupervised cluster-level scientific paper heterogeneous graph node\nrepresentation learning method (UCHL), aiming at obtaining the representation\nof nodes (authors, institutions, papers, etc.) in the heterogeneous graph of\nscientific papers. Based on the heterogeneous graph representation, this paper\nperforms link prediction on the entire heterogeneous graph and obtains the\nrelationship between the edges of the nodes, that is, the relationship between\npapers and papers. Experiments results show that the proposed method achieves\nexcellent performance on multiple evaluation metrics on real scientific paper\ndatasets.\n\n    "}, "journals/corr/abs-2204-08476": {"title": "Research on Domain Information Mining and Theme Evolution of Scientific Papers.", "url": "https://doi.org/10.48550/arXiv.2204.08476", "year": "2022", "author": {"Changwei Zheng": "11/10184", "Zhe Xue": "116/7294", "MeiYu Liang": "150/1513", "Feifei Kou": "223/2313", "Zeli Guan": "241/3177"}, "abstract": "\n      Abstract:  In recent years, with the increase of social investment in scientific\nresearch, the number of research results in various fields has increased\nsignificantly. Cross-disciplinary research results have gradually become an\nemerging frontier research direction. There is a certain dependence between a\nlarge number of research results. It is difficult to effectively analyze\ntoday's scientific research results when looking at a single research field in\nisolation. How to effectively use the huge number of scientific papers to help\nresearchers becomes a challenge. This paper introduces the research status at\nhome and abroad in terms of domain information mining and topic evolution law\nof scientific and technological papers from three aspects: the semantic feature\nrepresentation learning of scientific and technological papers, the field\ninformation mining of scientific and technological papers, and the mining and\nprediction of research topic evolution rules of scientific and technological\npapers.\n\n    "}, "journals/corr/abs-2204-11488": {"title": "Mining and searching association relation of scientific papers based on deep learning.", "url": "https://doi.org/10.48550/arXiv.2204.11488", "year": "2022", "author": {"Jie Song": "09/4756", "MeiYu Liang": "150/1513", "Zhe Xue": "116/7294", "Feifei Kou": "223/2313", "Ang Li": "33/2805"}, "abstract": "\n      Abstract:  There is a complex correlation among the data of scientific papers. The\nphenomenon reveals the data characteristics, laws, and correlations contained\nin the data of scientific and technological papers in specific fields, which\ncan realize the analysis of scientific and technological big data and help to\ndesign applications to serve scientific researchers. Therefore, the research on\nmining and searching the association relationship of scientific papers based on\ndeep learning has far-reaching practical significance.\n\n    "}, "journals/cin/XuDGXKSXL21": {"title": "A Multi-RNN Research Topic Prediction Model Based on Spatial Attention and Semantic Consistency-Based Scientific Influence Modeling.", "url": "https://doi.org/10.1155/2021/1766743", "year": "2021", "author": {"Mingying Xu": "289/1484", "Junping Du": "13/1151", "Zeli Guan": "241/3177", "Zhe Xue": "116/7294", "Feifei Kou": "223/2313", "Lei Shi": "29/563", "Xin Xu": "66/3874", "Ang Li": "33/2805"}, "abstract": ""}, "journals/ijon/XuDXKX21": {"title": "A semi-supervised semantic-enhanced framework for scientific literature retrieval.", "url": "https://doi.org/10.1016/j.neucom.2021.07.081", "year": "2021", "author": {"Mingying Xu": "289/1484", "Junping Du": "13/1151", "Zhe Xue": "116/7294", "Feifei Kou": "223/2313", "Xin Xu": "66/3874"}, "abstract": "Scientific literature retrieval provides convenience for researchers to find scientific literature related to the query. It is an important part of scientific research to search related papers given a paper title as query. However, for scientific literature retrieval tasks, most of the existing retrieval methods do not consider sentence-level semantic matching so that the retrieval performance is limited. With the success of neural networks, neural information retrieval methods have been widely studied and achieved good retrieval results. In this paper, we propose a semi-supervised semantic-enhanced scientific literature retrieval framework. The framework is composed of two networks: a self-attention convolutional encoder-decoder network and a sentence-level attention scientific literature retrieval network. By joint training of the two networks, the proposed semi-supervised semantic-enhanced scientific literature retrieval model can fully capture the rich semantic information of scientific text data and leverages human labeled scientific text data to improve the discriminativeness of the learned semantic representation. The retrieval results on two scientific literature datasets demonstrate that the proposed method significantly and consistently outperforms the other baseline methods."}, "journals/tist/CuiDWKX21": {"title": "MVGAN: Multi-View Graph Attention Network for Social Event Detection.", "url": "https://doi.org/10.1145/3447270", "year": "2021", "author": {"Wanqiu Cui": "223/2328", "Junping Du": "13/1151", "Dawei Wang": "39/2537", "Feifei Kou": "223/2313", "Zhe Xue": "116/7294"}, "abstract": "Social networks are critical sources for event detection thanks to the characteristics of publicity and dissemination. Unfortunately, the randomness and semantic sparsity of the social network text bring significant challenges to the event detection task. In addition to text, time is another vital element in reflecting events since events are often followed for a while. Therefore, in this article, we propose a novel method named Multi-View Graph Attention Network (MVGAN) for event detection in social networks. It enriches event semantics through both neighbor aggregation and multi-view fusion in a heterogeneous social event graph. Specifically, we first construct a heterogeneous graph by adding the hashtag to associate the isolated short texts and describe events comprehensively. Then, we learn view-specific representations of events through graph convolutional networks from the perspectives of text semantics and time distribution, respectively. Finally, we design a hashtag-based multi-view graph attention mechanism to capture the intrinsic interaction across different views and integrate the feature representations to discover events. Extensive experiments on public benchmark datasets demonstrate that MVGAN performs favorably against many state-of-the-art social network event detection algorithms. It also proves that more meaningful signals can contribute to improving the event detection effect in social networks, such as published time and hashtags."}, "journals/iajit/ShiDK20": {"title": "A sparse topic model for bursty topic discovery in social networks.", "url": "https://doi.org/10.34028/iajit/17/5/15", "year": "2020", "author": {"Lei Shi": "29/563", "Junping Du": "13/1151", "Feifei Kou": "223/2313"}, "abstract": ""}, "journals/tnn/LiangDYXLKG20": {"title": "Cross-Media Semantic Correlation Learning Based on Deep Hash Network and Semantic Expansion for Social Network Cross-Media Search.", "url": "https://doi.org/10.1109/TNNLS.2019.2945567", "year": "2020", "author": {"MeiYu Liang": "150/1513", "Junping Du": "13/1151", "Cong-Xian Yang": "223/2400", "Zhe Xue": "116/7294", "Hai-Sheng Li 0002": "145/2836-2", "Feifei Kou": "223/2313", "Yue Geng": "23/5510"}, "abstract": " Abstract:Cross-media search from large-scale social network big data has become increasingly valuable in our daily life because it can support querying different data modalities. Deep hash networks have shown high potential in achieving efficient and effective cross-media search performance. However, due to the fact that social network data often exhibit text sparsity, diversity, and noise characteristics, the search performance of existing methods often degrades when dealing with this data. In order to address this problem, this article proposes a novel end-to-end cross-media semantic correlation learning model based on a deep hash network and semantic expansion for social network cross-media search (DHNS). The approach combines deep network feature learning and hash-code quantization learning for multimodal data into a unified optimization architecture, which successfully preserves both intramedia similarity and intermedia correlation, by minimizing both cross-media correlation loss and binary hash quantization loss. In addition, our approach realizes semantic relationship expansion by constructing the image-word relation graph and mining the potential semantic relationship between images and words, and obtaining the semantic embedding based on both internal graph deep walk and an external knowledge base. Experimental results demonstrate that DHNS yields better cross-media search performance on standard benchmarks."}, "journals/ijon/KouDYSLXL19": {"title": "A multi-feature probabilistic graphical model for social network semantic search.", "url": "https://doi.org/10.1016/j.neucom.2018.03.086", "year": "2019", "author": {"Feifei Kou": "223/2313", "Junping Du": "13/1151", "Cong-Xian Yang": "223/2400", "Yan-Song Shi": "223/2263", "MeiYu Liang": "150/1513", "Zhe Xue": "116/7294", "Haisheng Li 0002": "145/2836-2"}, "abstract": "With the rapid development of social network platforms, more and more people are using them to search for material related to their interests. As the texts of social media messages are usually so short, when traditional existing document modeling methods are used in social network search tasks, the problem of semantic sparsity arises, leading to low-quality semantic representation and low-precision social network search results. Fortunately, besides of short text, social media data also has other features, such as timestamps, locations, and its user information. In light of this, to realize precise social network search, we propose a multi-feature probabilistic graphical model (MFPGM), which can generate high-quality semantic representation. To deal with the problem of semantic sparsity, we exploit two strategies in MFPGM. First, we propose a concept named special region and utilize location information to aggregate short text into long text. Second, we introduce the biterm pattern that can generate dense semantic space by supposing that a biterm occurring in the same context has the same topic. In order to generate high-quality semantic representations, we simultaneously model multiple features (i.e., biterm, user, location and timestamp) of social network data to enhance the semantic learning process of MFPGM. We conduct a lot of experiments on real-word datasets, and the comparisons with several state-of-art baseline methods have demonstrated the superiority of our MFPGM on topic quality and search performance. Additionally, with the help of the generated semantic representations, MFPGM allows people to analyze the relationships between time and the popularities of topics."}, "journals/jise/ShiDLK19": {"title": "SRTM: A Sparse RNN-Topic Model for Discovering Bursty Topics in Big Data of Social Networks.", "url": "https://jise.iis.sinica.edu.tw/JISESearch/pages/View/PaperView.jsf?keyId=169_2248", "year": "2019", "author": {"Lei Shi": "29/563", "Junping Du": "13/1151", "MeiYu Liang": "150/1513", "Fei-Fei Kou": "223/2313"}, "abstract": ""}, "journals/ppna/ShiDLK19": {"title": "Dynamic topic modeling via self-aggregation for short text streams.", "url": "https://doi.org/10.1007/s12083-018-0692-7", "year": "2019", "author": {"Lei Shi": "29/563", "Junping Du": "13/1151", "MeiYu Liang": "150/1513", "Feifei Kou": "223/2313"}, "abstract": "Social networks such as Twitter, Facebook, and Sina microblogs have emerged as major sources for discovering and sharing the latest topics. Because social network topics change quickly, developing an effective method to model such topics is urgently needed. However, topic modeling is challenging due to the sparsity problem and the dynamic change of topics in microblog streams. In this study, we propose dynamic topic modeling via a self-aggregation method (SADTM) that can capture the time-varying aspect of topic distributions and resolve the sparsity problem. The SADTM aggregates the observable and unordered short texts as the aggregated document without leveraging an external context to overcome the sparsity problem of short text. Furthermore, we exploit word pairs instead of words for each microblog to generate more word co-occurrence patterns. The SADTM models temporal dynamics by using the topic distribution at previous time steps in microblog streams to infer the current topic from sequential data. Extensive experiments on a real-world Sina microblog dataset demonstrate that our SADTM algorithm outperforms several state-of-the-art methods in topic coherence and cluster quality. Additionally, when applied in a search scene, our SADTM significantly outperforms all baseline methods in terms of the quality of the search results."}, "journals/tist/CuiDWYKZZ19": {"title": "Short Text Analysis Based on Dual Semantic Extension and Deep Hashing in Microblog.", "url": "https://doi.org/10.1145/3326166", "year": "2019", "author": {"Wanqiu Cui": "223/2328", "Junping Du": "13/1151", "Dawei Wang": "39/2537", "Xunpu Yuan": "248/6993", "Feifei Kou": "223/2313", "Liyan Zhou": "161/1605", "Nan Zhou": "06/5140"}, "abstract": "Short text analysis is a challenging task as far as the sparsity and limitation of semantics. The semantic extension approach learns the meaning of a short text by introducing external knowledge. However, for the randomness of short text descriptions in microblogs, traditional extension methods cannot accurately mine the semantics suitable for the microblog theme. Therefore, we use the prominent and refined hashtag information in microblogs as well as complex social relationships to provide implicit guidance for semantic extension of short text. Specifically, we design a deep hash model based on social and conceptual semantic extension, which consists of dual semantic extension and deep hashing representation. In the extension method, the short text is first conceptualized to achieve the construction of hashtag graph under conceptual space. Then, the associated hashtags are generated by correlation calculation based on the integration of social relationships and concepts to extend the short text. In the deep hash model, we use the semantic hashing model to encode the abundant semantic features and form a compact and meaningful binary encoding. Finally, extensive experiments demonstrate that our method can learn and represent the short texts well by using more meaningful semantic signal. It can effectively enhance and guide the semantic analysis and understanding of short text in microblogs."}, "journals/tvt/KouDCSCCL19": {"title": "Common Semantic Representation Method Based on Object Attention and Adversarial Learning for Cross-Modal Data in IoV.", "url": "https://doi.org/10.1109/TVT.2018.2890405", "year": "2019", "author": {"Feifei Kou": "223/2313", "Junping Du": "13/1151", "Wanqiu Cui": "223/2328", "Lei Shi": "29/563", "Pengchao Cheng": "255/8228", "Jiannan Chen": "202/9329", "Jinxuan Li": "255/8173"}, "abstract": " Abstract:With the significant development of the Internet of Vehicles (IoV), various modal data, such as image and text, are emerging, which provide data support for good vehicle networking services. In order to make full use of the cross-modal data, we need to establish a common semantic representation to achieve effective measurement and comparison of different modal data. However, due to the heterogeneous distributions of cross-modal data, there exists a semantic gap between them. Although some deep neural network (DNN) based methods have been proposed to deal with this problem, there still exist several challenges: the qualities of the modality-specific features, the structure of the DNN, and the components of the loss function. In this paper, for representing cross-modal data in IoV, we propose a common semantic representation method based on object attention and adversarial learning (OAAL). To acquire high-quality modality-specific feature, in OAAL, we design an object attention mechanism, which links the cross-modal features effectively. To further alleviate the heterogeneous semantic gap, we construct a cross-modal generative adversarial network, which contains two parts: a generative model and a discriminative model. Besides, we also design a comprehensive loss function for the generative model to produce high-quality features. With a minimax game between the two models, we can construct a shared semantic space and generate the unified representations for cross-modal data. Finally, we apply our OAAL on retrieval task, and the results of the experiments have verified its effectiveness."}, "journals/www/CuiDWKLXZ19": {"title": "Extended search method based on a semantic hashtag graph combining social and conceptual information.", "url": "https://doi.org/10.1007/s11280-018-0584-z", "year": "2019", "author": {"Wanqiu Cui": "223/2328", "Junping Du": "13/1151", "Dawei Wang": "39/2537", "Feifei Kou": "223/2313", "MeiYu Liang": "150/1513", "Zhe Xue": "116/7294", "Nan Zhou": "06/5140"}, "abstract": "Searching for microblog short text by their meaning is a challenging task because of the semantic sparsity of the information in social networks. The extended search approaches are commonly accepted which facilitate short text understanding and search by enriching the short text. However, they only analyze the literal semantics of short text, and the unique social characteristics of social network which also contain semantic information are not utilized well. To better capture the rich semantics in microblog short text, we propose a new microblog short text extended search method based on a semantic hashtag graph by combining social and conceptual information, which enriches each short text by concepts and associated hashtags to represent whole semantic features. Considering the microblog context, we introduce concepts through Wikipedia, as well as semantic consistency of hashtags. Specifically, for conceptual semantics, we propose a conceptual analysis method which merges explicit and implicit information in Wikipedia. For social semantics in hashtags, a semantic hashtag graph which combines social and conceptual information is put forward to generate semantic associated hashtags. We conduct experiments and the results show that our method is obviously better than the other existing state-of-the-art approaches in semantic understanding and search of short text."}, "journals/jcst/KouDYSCLG18": {"title": "Hashtag Recommendation Based on Multi-Features of Microblogs.", "url": "https://doi.org/10.1007/s11390-018-1851-2", "year": "2018", "author": {"Fei-Fei Kou": "223/2313", "Junping Du": "13/1151", "Cong-Xian Yang": "223/2400", "Yan-Song Shi": "223/2263", "Wan-Qiu Cui": "223/2328", "MeiYu Liang": "150/1513", "Yue Geng": "23/5510"}, "abstract": "Hashtag recommendation for microblogs is a very hot research topic that is useful to many applications involving microblogs. However, since short text in microblogs and low utilization rate of hashtags will lead to the data sparsity problem, it is difficult for typical hashtag recommendation methods to achieve accurate recommendation. In light of this, we propose HRMF, a hashtag recommendation method based on multi-features of microblogs in this article. First, our HRMF expands short text into long text, and then it simultaneously models multi-features (i.e., user, hashtag, text) of microblogs by designing a new topic model. To further alleviate the data sparsity problem, HRMF exploits hashtags of both similar users and similar microblogs as the candidate hashtags. In particular, to find similar users, HRMF combines the designed topic model with typical user-based collaborative filtering method. Finally, we realize hashtag recommendation by calculating the recommended score of each hashtag based on the generated topical representations of multi-features. Experimental results on a real-world dataset crawled from Sina Weibo demonstrate the effectiveness of our HRMF for hashtag recommendation."}, "journals/jocs/KouDLLLSY18": {"title": "A semantic modeling method for social network short text based on spatial and temporal characteristics.", "url": "https://doi.org/10.1016/j.jocs.2017.10.012", "year": "2018", "author": {"Feifei Kou": "223/2313", "Junping Du": "13/1151", "Zijian Lin": "207/4667", "MeiYu Liang": "150/1513", "Haisheng Li 0002": "145/2836-2", "Lei Shi": "29/563", "Cong-Xian Yang": "223/2400"}, "abstract": "Given the social network short text native sparsity, semantic inference becomes an infeasible task for conventional topic models. By exploiting the spatial and temporal characteristics of social network data, we propose a social network short text semantic modeling method, named by Spatial and Temporal Topic Model (STTM). To further overcome short text sparsity, STTM leverages co-occurrence word–word pair to reduce the sparsity problem, and moreover, it incorporates time information into the process of topics modeling in order to generate topics with higher quality. Experimental results over four real social media datasets verify the effectiveness of STTM."}, "journals/caaitrit/KouDHY16": {"title": "Social network search based on semantic analysis and learning.", "url": "https://doi.org/10.1016/j.trit.2016.12.001", "year": "2016", "author": {"Feifei Kou": "223/2313", "Junping Du": "13/1151", "Yijiang He": "246/9711", "Lingfei Ye": "192/0991"}, "abstract": "Because of everyone's involvement in social networks, social networks are full of massive multimedia data, and events are got released and disseminated through social networks in the form of multi-modal and multi-attribute heterogeneous data. There have been numerous researches on social network search. Considering the spatio-temporal feature of messages and social relationships among users, we summarized an overall social network search framework from the perspective of semantics based on existing researches. For social network search, the acquisition and representation of spatio-temporal data is the basis, the semantic analysis and modeling of social network cross-media big data is an important component, deep semantic learning of social networks is the key research field, and the indexing and ranking mechanism is the indispensable part. This paper reviews the current studies in these fields, and then main challenges of social network search are given. Finally, we give an outlook to the prospect and further work of social network search."}}}