{"id": "51/944-1", "name": "Hai Huang 0001", "Article": {"conf/bmsb/WangJ0CKC20": {"title": "Artifacts Reduction GAN For Enhancing Quality Of Compressed Panoramic Video.", "url": "https://doi.org/10.1109/BMSB49480.2020.9379855", "year": "2020", "author": {"Xueshu Wang": "289/8705", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1", "Yuanhao Cui": "180/7390", "Michel Kadoch": "36/2183", "Mohamed Cheriet": "69/4317"}, "abstract": " Abstract:Panoramic video has the characteristics of high resolution, massive information and high sense of immersion, bringing unprecedented visual sensory enjoyment to us. However, considering the limited capacity of current cellular network, videos transmitted to users are often encoded, e.g. by High Efficiency Video Coding (HEVC), resulting in block artifact problems that significantly affects the visual quality. Thus, it is necessary to enhance the quality of compressed panoramic videos. Inspired by the convolutional networks (CNN) and generative adversarial networks (GAN), the paper proposes a deep GAN model -Artifacts Reduction GAN (ARGAN) which is able to enhance the quality of compressed panoramic videos. ARGAN has the ability of reducing artifacts caused by HEVC. Meanwhile, it can increase the visual realistic of the enhanced videos. We tested the performance of our model under PSNR, SSIM and Perception Index. Qualitative results are also provided to display the visual effects of ARGAN. Experimental results show that our method is superior to other quality enhancement methods in both qualitative and quantitative aspects."}, "conf/crowncom/YangJH17": {"title": "Meet an Fantastic Sibyl: A Powerful Model in Cognitive Radio Networks.", "url": "https://doi.org/10.1007/978-3-319-76207-4_2", "year": "2017", "author": {"Wei Yang 0014": "03/1094-14", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": "Dynamic spectrum access is challenging, since an individual secondary user usually just has limited sensing abilities. One key insight is that primary user emergence forecasting among secondary users can help to make the most of the inherent association structure in both time and space, it also enables users to obtain more informed spectrum opportunities. Therefore, primary user presence forecasting is vital to cognitive radio networks (CRNs). With this insight, an auto regressive enhanced primary user emergence reasoning (AR-PUER) model for the occurrence of primary user prediction is derived in this paper. The proposed method combines linear prediction and primary user emergence reasoning. Historical samples are selected to train the AR-PUER model in order to capture the current distinction pattern of primary user. The training samples of the primary user emergence reasoning (PUER) model are combined with the recent samples of auto regressive (AR) model tracking recent parallel. Our scheme does not require the knowledge of the signal or of the noise power. Furthermore, the proposed model in this paper is blind in the detection that it does not require information about the channel. To verify the performance of the proposed model, we apply it to the data during the past two months, and then compare it with other method. The simulation results demonstrate that the AR-PUER model is effective and generates the most accurate forecasting of primary user occasion in several cases. Besides, it also performs much better than the commonly used energy detector, which usually suffers from the noise uncertainty problem.KeywordsDynamic spectrum accessLinear predictionAR-PUERCRNs"}, "conf/iccchina/HongJGS0GXL17": {"title": "Inverted antenna subset transmission technique for secure millimeter-wave wireless communication.", "url": "https://doi.org/10.1109/ICCChina.2017.8330319", "year": "2017", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1", "Ning Gao": "47/544", "Jianxiao Xie": "218/2505", "Bohan Li 0005": "123/2549-5"}, "abstract": " Abstract:In order to enhance millimeter-wave (mm-Wave) physical layer security (PLS), we propose inverted antenna subset transmission technique (IAST) based large antenna array. IAST consists of a conventional phased-array architecture followed with inverse phase control component. The main idea for security in IAST is to generate artificial noise (AN) on undesired direction by randomly scrambling received constellation through antenna subset selection, while preserving the constellation points in target direction clear. Using a simplified statistical model, an expression of average signal-to-noise ratio (SNR) is derived as a function of the observation angle. The optimized inverse phase ratio of antenna subset is obtained for the objective of minimizing SNR on undesired direction. Simulation results show that the proposed solution provides higher secrecy performance for target user, generates narrower beamwidth in the target direction and produces greater symbol error rate (SER) to eavesdropper compared current techniques."}, "conf/icspcs/SunHJD17": {"title": "Cyclostationary spectrum sensing based fisher analyzer under stochastic geometric network model.", "url": "https://doi.org/10.1109/ICSPCS.2017.8270471", "year": "2017", "author": {"Shaoka Sun": "194/0900", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588", "Jincai Du": "194/0827"}, "abstract": " Abstract:Although spectrum sensing has been extensively researched, most of the existing works either assume that there is only one primary user (PU) or do not consider the topology of PU network at all. In this paper, a novel stochastic geometric network model is proposed to model the practical circumstances. In this model, the PU network is modeled as a random geometric network that following a Poisson point process (PPP) which can better describe small-scale mobile PUs. Different from the classical Shannon theorem that only considers noise, the aggregated interference caused by PUs located outside the sensing range is taken into account in this paper. The interference known as spatial alarm (SFA) can decrease the second user's (SU's) medium access probability. In this paper, cyclostationary spectrum sensing based partial QR decomposition (CSS-PQR) is adopted in each SU, and to obtain more effective and more accurate detection performance, a location-aware cooperative sensing algorithm that linearly combine multiple sensing results is used. Particularly the Fisher Analyzer (FA) is utilized to determine the linear coefficients. It can be proved that the proposed model is more accordant with practical circumstances, and the simulation results show that the proposed algorithm performs much better than the traditional ones, such as MAJ-OC based, ML-OC based CSS algorithms, in terms of false-alarm probabilities and detection probabilities."}, "conf/mobicom/HongJG0GX17": {"title": "Programmable Weight Phased-Array Transmission for Secure Millimeter-Wave Wireless Communication.", "url": "https://doi.org/10.1145/3130242.3130245", "year": "2017", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Hai Huang 0001": "51/944-1", "Ning Gao": "47/544", "Jiaoxiao Xie": "215/1934"}, "abstract": "\n\t\tWe propose a novel programmable weight phased array (PWPA) architecture and the corresponding transmission schemes for secure millimeter-wave communications. PWPA consists of a conventional phased-array architecture followed by a programable power amplifier used to adjust the weights of array element. We propose new solutions of inverted antenna subset transmission technique (IAST) and optimized weight antenna subset transmission technique (OWAST) based on PWPA. The proposed solutions use inverse phase signal to replace switching-off signal which can generate more artificial noise than conventional solutions on undesired direction. Theoretical and simulation results show that the proposed solutions provide better physical-layer security (PLS) performances compared current techniques.\n\t"}, "conf/iscit/LiyC0J16": {"title": "On massive MIMO performance with a pilot assignment approach based on Hungarian method.", "url": "https://doi.org/10.1109/ISCIT.2016.7751694", "year": "2016", "author": {"Yue Li": "61/500", "Ying Chen": "21/5521", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:In this paper, we propose a pilot assignment method to eliminate pilot contamination and improve the system performance in massive Multiple-Input Multiple-Output(MIMO) Time Division Duplexing(TDD) system. Cells are divided into center parts and edge parts according to the number of pilots and users. The pilot sequence sets are identical to center users, but mutually orthogonal for edge users in different cells. Hungarian method is illustrated to solve the pilot assignment in each pilot sequences subset. The simulation results show that the proposed approach achieves lower mean squared error(MSE) and higher sum rate(SR) in the system than the conventional design with a certain range of increasing signal noise ratio(SNR)."}, "conf/iscit/BiJS016": {"title": "Hierarchical fusion-based cooperative spectrum sensing scheme in cognitive radio networks.", "url": "https://doi.org/10.1109/ISCIT.2016.7751698", "year": "2016", "author": {"Yan Bi": "194/0869", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:Cooperative spectrum sensing scheme has a good effect on the problem of hidden terminal, multipath effect and deep fading. There is also a technique which can make a full use of spectrum resources. In our proposed scheme, clustering is a good idea to avoid the burden of large amount of processing data in fusion center, to reduce the magnitude of cognitive information transmission in the network. The method of location-based is presented to choose cluster heads. The results of each node sensing sent to the cluster heads. Cluster heads make a preliminary decision with the Energy Detection. Then, the preliminary decision is transmitted to the fusion center. The final decision is made in the fusion center by the method of reputation-based. Simulation results show that the scheme can reduce the energy consumption and improve the detection performance effectively."}, "conf/iscit/ChenH0J16": {"title": "Principle component analysis based cooperative spectrum sensing in cognitive radio.", "url": "https://doi.org/10.1109/ISCIT.2016.7751703", "year": "2016", "author": {"Xin Chen": "24/1518", "Fukang Hou": "164/2634", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:This paper introduces an improved cooperative spectrum sensing (CSS) algorithm for cognitive radio (CR) networks based on the machine learning technique. In this scheme, spectrum sensing consists of two steps. The offline training is performed by K-means clustering method and the threshold is defined by the classification result towards unsupervised data. As for the online classification stage, the similarity between the received signal and the cluster in training data is exploited for channel availability decision. The features of both the received signal and the training samples are extracted by principle component analysis (PCA). The fusion center will make final decision according to the local sensing result from differently sensors sequentially. Each sensor is responsible for the analysis towards certain period of the received signal. In this way, the initial sensing result (which will be updated due to the latest input signal) is available within short period of time. If the primary signal existed, the initial sensing result can stop further detection which improves the efficiency of spectrum sensing and avoid more interference to primary users. Compare to the existed methods of spectrum sensing, the threshold of the proposed scheme is measured by feature similarity in multi-dimension rather than a fixed value. In simulation, we evaluate the performance by making comparison between different method and the result reveals that our scheme can achieve better performance and work efficiently."}, "conf/iscit/ZhangZHJ16": {"title": "Improved cyclostationary feature detection based on correlation between the signal and noise.", "url": "https://doi.org/10.1109/ISCIT.2016.7751705", "year": "2016", "author": {"Jingrui Zhang": "01/7697", "Li Zhang": "89/5992", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:With the presence of noise floor, characteristic points of signals are submerged easily in conventional cyclostationary feature detection. In this paper, a new cyclostationary feature detection method based on the correlation between signal and noise is proposed for detection of OFDM based primary users. The proposed scheme aims to improve the noise robustness through making the utmost of the information in the cyclic spectrum of the received signals. Meanwhile, in order to obtain the clearer feature, the signal processing technology is used to deal with the cyclic spectrum. Finally, the classification detection is realized by machine learning. Extensive simulation results demonstrate that proposed method provides superiority detection performance compared to the conventional cyclostationary feature detection, especially in low SNR environment."}, "conf/iscit/DuHJC16": {"title": "Cyclostationary feature based spectrum sensing via low-rank and sparse decomposition in cognitive radio networks.", "url": "https://doi.org/10.1109/ISCIT.2016.7751706", "year": "2016", "author": {"Jincai Du": "194/0827", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588", "Xuqi Chen": "194/0864"}, "abstract": " Abstract:Spectrum sensing is a key component in cognitive radio networks, which allows secondary users to communicate without causing harmful interference to primary users. Cyclostationary feature based spectrum sensing has proven preferable to other methods under low signal-to-noise ratio conditions. To detect the presence of primary signals, conventional cyclostationary feature based schemes tend to simply compare the values of signal features to a predefined threshold. However, such schemes would lead to dramatic performance degradation when signal features are overwhelmed by noise. This paper proposes a novel scheme that applies the low-rank and sparse decomposition technique to cyclostationary feature based spectrum sensing. The spectrum correlation function matrix is decomposed into two matrices, of which the low-rank one represents noise and interference while the sparse one represents cyclostationary features of PU signal. Subsequently, the scheme takes advantage of the signal features in the sparse matrix to determine the presence of PU signal. Simulation results have demonstrated the superiority of our proposed scheme in terms of detection probability and false alarm probability."}, "conf/iscit/ZhangHJ16": {"title": "A modified cyclostationary spectrum sensing based on softmax regression model.", "url": "https://doi.org/10.1109/ISCIT.2016.7751707", "year": "2016", "author": {"Li Zhang": "89/5992", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:In this paper, a modified Cyclostationary Feature Detection (CFD) algorithm based on softmax regression model is proposed, which targets for improving the sensing performance under low signal-to-noise ratio (SNR). The softmax regression model provides excellent classification performance; moreover, it is simple and runs fast compared with other classification algorithms in machine learning. Therefore we choose this model to be used for spectrum sensing, which happens to be a binary hypothesis-testing problem. In this method, cyclostationary characteristic parameters were extracted as the training set and test set Then the softmax classifier which had been trained was used to detect the primary user (PU) exists or not. Numerical results show that the proposed spectrum sensing method has better sensing performance than the traditional CFD method."}, "conf/iscit/SunHJ16": {"title": "Cyclostationary spectrum sensing based partial QR decomposition at low SNR regimes.", "url": "https://doi.org/10.1109/ISCIT.2016.7751708", "year": "2016", "author": {"Shaoka Sun": "194/0900", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:In order to obtain better performance at low SNR regimes and reduce computational complexity in wideband sensing, a novel cyclostationary spectrum sensing (CSS) algorithm exploiting partial QR decomposition is proposed in this paper. At the first step of the CSS algorithm, spectral correlation functions (SCFs) for sampled signals that exhibit cyclostationary are calculated by secondary user (SU) to get an SCFs matrix, and then the SCFs matrix is rotated at an appropriate angle. After that, partial QR decomposition for some major components of the SCFs matrix is performed to sense the presence of the primary users (PUs). The feature that noise components is only related to floor noise makes the proposed CSS algorithm more efficient than energy detections, especially at low SNR regimes. And compared with traditional cyclostationary methods, partial QR decomposition for only some major components can reduce computational complexity largely when the sensing band is wide. Simulation results show that the proposed CSS algorithm performs much better than the traditional ones in terms of false-alarm probabilities, detection probabilities, and computational complexity, such as MAJ-OC based, ML-OC based CSS algorithms. Besides, the proposed CSS algorithm is robust, which can be used for various kinds of modulated signals, such as OFDM, QPSK, MSK, and 16QAM."}, "conf/iscit/Liang0J16": {"title": "Dynamic power allocation for spectrum sharing in interference alignment (IA)-based cognitive radio.", "url": "https://doi.org/10.1109/ISCIT.2016.7751713", "year": "2016", "author": {"Baobin Liang": "194/0818", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:In cognitive radio networks (CRN), underlay spectrum sharing allows secondary users (SUs) to utilize the spectrum on which the primary users (PUs) are working at the same time, without introducing intolerant interference. Interference alignment (IA) is a prospective technique for interference management, and can significantly improve the performance of cognitive radio (CR) networks. Besides, power allocation (PA) in IA-based CR networks is greatly neglected, which can further reinforce its performance. Thus in our paper, PA in IA-based CR networks is analyzed. To satisfy the QoS requirement of the PU, its minimal transmitted power is derived. To maximize the total rate of CRN and maintain the fairness between the competing SUs, the system is modeled as an optimization problem with the constraints of transmission power in IA-based cognitive radio. Based on this study, we propose the optimal transmission power allocation algorithm. Extensive simulation results show that the proposed optimal algorithm can improve the system capacity and maintain the fairness compared to the existing algorithms."}, "conf/iscit/HouCHJ16": {"title": "Throughput performance improvement in cognitive radio networks based on spectrum prediction.", "url": "https://doi.org/10.1109/ISCIT.2016.7751715", "year": "2016", "author": {"Fukang Hou": "164/2634", "Xin Chen": "24/1518", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": " Abstract:Spectrum sensing is used to detect spectrum holes and find active primary users while randomly selecting channel for sensing leads to secondary user's low throughput in cognitive radio networks. Spectrum prediction forecasts future channel status on the basis of historical information, and BP neural network is used as an example of the prediction method. Second users' frame structure is redesigned in this paper based on spectrum prediction, aiming to select the most likely idle channel for sensing. Theoretical and simulation results show that secondary users' throughputs are significantly improved by spectrum prediction. Correlations both in the frequency domain and time domain are compared, and the impacts of the prediction method, traffic intensity, and channel number on the throughput are also investigated in this study."}, "conf/uemcom/MuJHG16": {"title": "A noise reduction method based on subspace approach for speech communication.", "url": "https://doi.org/10.1109/UEMCON.2016.7777860", "year": "2016", "author": {"Junsheng Mu": "185/3832", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1", "Ning Gao": "47/544"}, "abstract": " Abstract:In this paper, a non-orthogonal eigenvector filtering based on subspace approach is proposed for enhancement of corrupted speech signal in speech communication. The proposed method firstly seeks a diagonal matrix and a non-orthogonal matrix to simultaneously diagonalize the covariance matrix of clean speech and noise, then those eigencomponents (eigenvalues and corresponding eigenvectors) whose eigenvectors are not mutually orthogonal are filtered. The threshold to judge whether two adjacent eigenvectors is orthogonal is designed on the basis of the included angle between two adjacent eigenvectors. Besides, the generalized inverse matrix transform is applied to tackle the issue of matrix irreversibility. Experiments indicate the proposed method can obtain an enhanced speech signal with less residual noise and lower speech distortion under strong noise conditions."}, "conf/vtc/LianJS016": {"title": "Frequency Selective Convolutional Neural Networks for Traffic Sign Recognition.", "url": "https://doi.org/10.1109/VTCSpring.2016.7504251", "year": "2016", "author": {"Zifeng Lian": "159/3876", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:Image recognition, especially traffic sign recognition is an important task for autonomous driving and driver assistance systems. A new Convolutional Neural Network model with the ability of feature selection in frequency domain is presented in this paper, called Frequency Selective Filter Aided (FSFA) CNN model. The new model can integrate low-pass and high-pass filters into both forward and backward propagations in order to place special emphases on feature components in different frequency bands. The theoretical basis, as well as forward and backward propagations are also formulated. Experiments on CIFAR and GTSRB traffic sign recognition datasets show that the proposed model yields better performance for the task of image recognition compared with classic methods."}, "conf/icson/ChenJ015": {"title": "A Green SON Scheme Based on SFFR in Future Cellular Networks.", "url": "https://doi.org/10.1007/978-3-319-19746-3_1", "year": "2015", "author": {"Na Chen 0004": "69/3895-4", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/YeJ015": {"title": "A Graph Coloring Based Resource Allocation in Cognitive Networks.", "url": "https://doi.org/10.1007/978-3-319-19746-3_2", "year": "2015", "author": {"Zhengmao Ye": "50/5768", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/RanS015": {"title": "Cognitive Radio Based Resource Scheduling Strategy for LTE-A Self-organizing Network.", "url": "https://doi.org/10.1007/978-3-319-19746-3_4", "year": "2015", "author": {"Tiantian Ran": "143/6637", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/ChenJ015a": {"title": "Analyses of the Interference Mitigation in Ad Hoc Network by Using a Heuristic Scheme.", "url": "https://doi.org/10.1007/978-3-319-19746-3_5", "year": "2015", "author": {"Ying Chen": "21/5521", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/LiSC015": {"title": "A Survey of Fast Algorithms for Inter-prediction High Efficiency Video Coding.", "url": "https://doi.org/10.1007/978-3-319-19746-3_10", "year": "2015", "author": {"Yuewen Li": "164/2618", "Songlin Sun": "76/8195", "Na Chen 0004": "69/3895-4", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/ChenSC015": {"title": "A Survey on SON for Enhanced ICIC.", "url": "https://doi.org/10.1007/978-3-319-19746-3_11", "year": "2015", "author": {"Ying Chen": "21/5521", "Songlin Sun": "76/8195", "Xinzhou Cheng": "164/2599", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/LiSL015": {"title": "Research on Self-Organizing Network Based on MIMO Technology.", "url": "https://doi.org/10.1007/978-3-319-19746-3_12", "year": "2015", "author": {"Chang Li": "58/1568", "Songlin Sun": "76/8195", "Wei Liu": "49/3283", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/FengS015": {"title": "The Key Technology of LTE System in Self-Organized Network.", "url": "https://doi.org/10.1007/978-3-319-19746-3_13", "year": "2015", "author": {"Tianyi Feng": "164/2669", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/WangJ015": {"title": "A Video Transmission System Based on the Self-organizing Networks.", "url": "https://doi.org/10.1007/978-3-319-19746-3_14", "year": "2015", "author": {"Li Wang": "58/6810", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/WangJ015a": {"title": "Fast Intra Prediction Mode Decision Algorithm for HEVC.", "url": "https://doi.org/10.1007/978-3-319-19746-3_15", "year": "2015", "author": {"Danyang Wang": "12/8351", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/HouJ015": {"title": "On Using Game Theory to Solve the Scalable Video Multicasting Problem in Mobile Ad-Hoc Networks.", "url": "https://doi.org/10.1007/978-3-319-19746-3_16", "year": "2015", "author": {"Fukang Hou": "164/2634", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/HuangSL015": {"title": "Research on Rate Control Combined with Joint Source-Channel Coding.", "url": "https://doi.org/10.1007/978-3-319-19746-3_17", "year": "2015", "author": {"Tingting Huang": "78/11061", "Songlin Sun": "76/8195", "Wei Liu": "49/3283", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/DaiJ015": {"title": "A Three-Staged Improved OSIC Algorithm with Lower Complexity in MIMO System.", "url": "https://doi.org/10.1007/978-3-319-19746-3_18", "year": "2015", "author": {"Zhen Dai": "84/9625", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/WeiJ015": {"title": "Improvement of the LR-Aided MIMO SIC Detection Through a Layered System.", "url": "https://doi.org/10.1007/978-3-319-19746-3_19", "year": "2015", "author": {"Zhen Wei": "78/7437", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/icson/ZhangSC015": {"title": "Radio Resource Management Based on NFV and SDN in 4G and 5G HetNet.", "url": "https://doi.org/10.1007/978-3-319-19746-3_20", "year": "2015", "author": {"Fengye Zhang": "164/2638", "Songlin Sun": "76/8195", "Na Chen 0004": "69/3895-4", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "conf/iscit/ChenJSZ0Z15": {"title": "An effective MIMO detection scheme for future wireless HetNet based on MU-MIMO.", "url": "https://doi.org/10.1109/ISCIT.2015.7458304", "year": "2015", "author": {"Na Chen 0004": "69/3895-4", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Fengye Zhang": "164/2638", "Hai Huang 0001": "51/944-1", "Zheng Zhou": "17/4932"}, "abstract": " Abstract:Multi-user spatial multiplexing can significantly increase the performance of wireless networks, such as emerging 4G/5G cellular networks and so on. In this paper, we present and evaluate an effective sphere detection (SD) scheme based on MU-MIMO block diagonization (BD) for future wireless heterogeneous network (HetNet). The proposed scheme is proved to be effective in improving the system symbol error rate (SER) compared with other relative methods. Results also show that in proposed conditions the number of both antennas and users have a significant impact on the system performance."}, "conf/iscit/CuiJSWC015": {"title": "Deep learning based primary user classification in Cognitive Radios.", "url": "https://doi.org/10.1109/ISCIT.2015.7458333", "year": "2015", "author": {"Yuanhao Cui": "180/7390", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Xiaohan Wang": "73/1307", "Dongmei Cheng": "41/6700", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:Deep Belief Networks (DBN) is a very powerful algorithm in deep learning. The DBN has been effectively applied in many areas of machine learning, such as computer vision (CV) and natural language processing (NLP). With the help of deep architecture, their accuracy has been largely improved and their human annotation data which traditional machine learning algorithm extremely rely on could be reduced. In Cognitive Radios (CRs), learning is necessary for its cognition, while two of the key challenges are how to classify primary user agents with their performances and predict their behaviors. The CRs' performance has a positive correlation with the hit rate of learning algorithm's classification and prediction results. In this paper, we study the questions of classification and prediction of user agents. We apply the DBN model to improve accuracy rating of user agent's recognition in CRs with user-centered model, it's the first application of deep learning structure in CRs. The DBN model provides a primary user agent's classification, which is the foundation of the prediction to both idle frequency spectrums and time slots. Experimental results show that the cognitive engine finds a much better detection rate than the CRs engine with shallow learning and other traditional strategy. The simulation results are also tested on the WIFI channel with 5GHz and 2.4GHz."}, "conf/iscit/LiuJSWC015": {"title": "Multilayer Feed-forward Neural Network learning based Dynamic Chinese restaurant model for dynamic spectrum access in cognitive radio networks.", "url": "https://doi.org/10.1109/ISCIT.2015.7458335", "year": "2015", "author": {"Jianlan Liu": "180/7374", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Xiaohan Wang": "73/1307", "Dongmei Cheng": "41/6700", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:As an effective approach to improve spectrum efficiency, cognitive radio network make it possible for secondary users (SU) to share the spectrum with primary users (PU), on the condition that the primary users have preemptive priority. In this paper, we applied the Dynamic Chinese restaurant game, which ideally modeled the spectrum sensing and access in cognitive network. We propose the use of Multilayer Feed-forward Neural Networks (MFNN) as an effective method for users to learn the network state, which can be regarded as how a customer learn the table state in the restaurant. Moreover, in order to select an optimal table for a secondary user, subsequent secondary users' sequential decisions are considered. The effectiveness and efficiency of the proposed scheme is verified in the simulation."}, "conf/avss/BoTSJ014": {"title": "Bit allocation for quality scalability coding of H.264/SVC.", "url": "https://doi.org/10.1109/AVSS.2014.6918662", "year": "2014", "author": {"Wang Bo": "72/6811", "Li Teng": "67/3080", "Songlin Sun": "76/8195", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:An efficient model-based bit allocation algorithm, in this paper, is proposed for quality scalability coding of H.264/scalable video coding (SVC). The conventional Rate-Distortion models are not available for quality scalability coding of H.264/SVC. To overcome this issue, the relationship between the percentage of header bits and quantization parameter is investigated to obtain an accurate single layer rate model. Moreover, MGS/CGS inter-layer MAD affine relationship is employed to extend the Rate-Distortion models from the base layer (BL) to the enhancement layer (EL). Finally the Lagrange solution of the bit allocation problem is worked out. Experimental results show that the proposed bit allocation algorithm outperforms Joint Scalable Video Model (JSVM) software algorithm."}, "conf/ccis/LiuJS014": {"title": "A novel network based on TD-LTE for counter-terrorism emergency communication in urban area.", "url": "https://doi.org/10.1109/CCIS.2014.7175826", "year": "2014", "author": {"Xue Liu": "207/7109", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:It is believed that effective communications are important to a successful response to emergency situations. Especially, when a terrorist attack happens, the ability to share multimedia information promptly and directly affects the ability to fight terrorists and save lives. In this paper, a novel network which is based on TD-LTE is designed for counter-terrorism emergency communication in urban area. With the description of the architecture of the TD-LTE CECN, this paper mainly focuses on the process of accessing to the network. Besides, an example of data flow is provided as well as a simulation to prove the performance of this network. At the end of this paper, a political mechanism is discussed to fight terrorists effectively."}, "conf/iscit/XueJS014": {"title": "Binary-decision-tree-based multiclass Support Vector Machines.", "url": "https://doi.org/10.1109/ISCIT.2014.7011875", "year": "2014", "author": {"Song Xue": "82/2932", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:In this paper, we propose Support Vector Machine classifiers utilizing binary decision tree to solve multiclass problems. In training process, we determine the hyperplane that separates the classes into two categories at the top node and this procedure is repeated until only one class remains. In order to obtain higher accuracy, easier separable class should be separated in the upper node. Hence a decision tree is constructed according to the degree of difficulty to classify classes which is measured by Euclidean distance and standard deviation. The proposed binary decision tree SVM is designed to obtain superior performance in classification accuracy and speed. Its performance is measured on the dataset of Sogou news corpus which has eight classes of news. The method is compared with some traditional methods like one-against-one and one-against-all. The results of the experiments indicate that it has comparative accuracy with other traditional methods and much faster recognition speed."}, "conf/iscit/LiJS014": {"title": "An improved channel estimation based on generalized DFT for OFDM system.", "url": "https://doi.org/10.1109/ISCIT.2014.7011928", "year": "2014", "author": {"Guihong Li": "143/6649", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:The traditional channel estimation based on Discrete Fourier Transform (DFT) for Orthogonal Frequency Division Multiplexing (OFDM) system has significantly outperformed least square (LS) or minimum mean-square error (MMSE) channel estimation by eliminating the impact of noise beyond the maximum channel delay. However, its performance is degraded due to the presence of set correlations among the basis functions. In order to overcome the problem, Generalized Discrete Fourier Transform (GDFT) with nonlinear phase functions which is a generalized theoretical framework for DFT has been introduced to estimate channel in this paper. GDFT can be designed optimally for phase functions based on a variety of correlation metrics to reduce inter-symbol interference (ISI) and inter-carrier interference (ICI) that determine the accuracy of the channel estimators. Simulation results show that GDFT improves the correlation performance dramatically over DFT and channel estimation based on GDFT has better bit-error-rate (BER) performance than that based on DFT."}, "conf/iscit/QuanJS0W14": {"title": "Sparse channel estimation in OFDM systems using improved smooth L0 algorithm.", "url": "https://doi.org/10.1109/ISCIT.2014.7011929", "year": "2014", "author": {"Xi Quan": "180/7460", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1", "Lusha Wang": "33/7433"}, "abstract": " Abstract:The channel response of data communication over orthogonal frequency division multiplexing (OFDM) systems is often required to be known at the receiver. Recently, many wireless multipath channels have been verified to exhibit sparse structures. To exploit the inherent sparsity, many channel estimation methods based on compressive sensing are proposed. In this paper, we introduce a channel estimation strategy using improved smooth L0 (SL0) algorithm. Instead of zero-mean Gaussian function which is the smooth function in smooth L0 algorithm, we utilize the hyperbolic tangent function as the smooth function to get better approximation of L0 norm, then the quasi-newton method is used to recover the signal. Numerical simulations results illustrate the performance gains achieved by the improved method."}, "conf/iscit/QiJS014": {"title": "An improved adaptive user classification algorithm for FFR scheme.", "url": "https://doi.org/10.1109/ISCIT.2014.7011952", "year": "2014", "author": {"Wanbin Qi": "180/7454", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:In general, users are classified as cell-center and cell-edge users based on the SINR threshold in multi-cell orthogonal frequency division multiple access (OFDMA) systems, as frequency spectrum is divided into internal frequency band and external frequency band in fractional frequency reuse (FFR) scheme. Considering the SINR threshold for user classification is always predefined based on experience, an adaptive user classification algorithm is proposed for FFR scheme in this paper. The proposed approach can achieve the optimal SINR threshold adaptively through maximizing the proportion of the harmonic sum of individual user's SINR to the ratio of the number of cell-center users to the number of cell-edge users minus the ratio of the corresponding subcarriers. Not only the user's SINR can be improved but also the variability of the user distribution is considered in the presented approach. Simulation results show that FFR scheme with the optimal threshold performs better than that with the traditional predetermined threshold."}, "conf/iscit/YuSJ014": {"title": "Frame level rate control based on support vector machine in HEVC.", "url": "https://doi.org/10.1109/ISCIT.2014.7011967", "year": "2014", "author": {"Jiaxu Yu": "180/7432", "Sonling Sun": "180/7398", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:This paper proposes a frame level rate control scheme for HEVC based on support vector machine. Firstly, textual features of frames are extracted from video sequence. According to different complexities of textual features, support vector machine is chosen as a classifier for video classification. Secondly, a frame level rate control scheme is proposed to achieve higher coding efficiency based on classification results. According to the experiment results, the proposed algorithm achieves better coding performance than the original rate control scheme JCTVC-K0103 in HEVC."}, "conf/iscit/ChenWSJ014": {"title": "A Video-distribution Adaptive SON Architecture for HetNets in future cellular network.", "url": "https://doi.org/10.1109/ISCIT.2014.7011980", "year": "2014", "author": {"Na Chen 0004": "69/3895-4", "Lusha Wang": "33/7433", "Songlin Sun": "76/8195", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:Future cellular network contains huge scale of potential resource but is restricted by the complexity and heterogeneity of network devices and user equipments (UEs). Video distribution service in cellular networks becomes popular recently but is resource-consuming. This paper proposes a Video-distribution Adaptive SON Architecture (VASONA) that applies self-organization in the Heterogeneous Network (HetNet) in future cellular network and distributes Scalable Video Coding (SVC) data packets coorperatively. Simulation shows that better performance of video distribution service in the future cellular network will be provided by this architecture."}, "conf/pimrc/ZhengQCJ014": {"title": "Compressive sensing based decryption method for covert CDD-OFDM transmission.", "url": "https://doi.org/10.1109/PIMRC.2014.7136126", "year": "2014", "author": {"Yuhan Zheng": "164/6493", "Fei Qi 0003": "59/985-3", "Xinzhou Cheng": "164/2599", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:This paper presents an improved decryption method aiming at covert Orthogonal Frequency Division Multiplexing (OFDM) transmission with cyclic delay diversity (CDD) featured multiple input multiple output (MIMO) technology. Particularly, we take advantage of the inherent sparse structure of multi-path wireless channel as well as Compressive Sensing (CS) technology, which has attracted a considerable attention for its breakthrough on Shannon's sampling theorem. Our work addresses the issues of bounded application range for conventional decryption methods, which is caused by the limitation of channel estimation with respect to uneven pilot arrangement that employed as a physical layer secret key. Besides, our proposed method relaxes minimum requirement for pilot number while the performance gain is improved instead. Simulation results show that our proposed method can achieve a considerable performance gain, with extra rewards of high spectral efficiency and much broader application prospect."}, "conf/grc/CaiJS0CL13": {"title": "P2P traffic identification based on transfer learning.", "url": "https://doi.org/10.1109/GrC.2013.6740374", "year": "2013", "author": {"Lin Cai": "20/8688", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1", "Na Chen 0004": "69/3895-4", "Yueming Lu": "24/334"}, "abstract": " Abstract:With the rapid development of Internet, a large number of peer networks (Peer-to-Peer) applications rise and are widely used. Because of this, it is more difficult for network operators to manage and monitor their networks in a proper way. To identify the peer networks applications generating the traffic traveling through networks is necessary and if we can identify them sooner, we control them better. In this work, we use the machine learning-based classification method to identify the classes of the flows. According to previous work, we choose transfer learning algorithm to classify the traffic, and improve classified results. Finally we compare and evaluate the classification results in terms of the two metrics such as true positive ratio and time expense. Our experiments show that the machine learning algorithm is an efficient algorithm for traffic identification and is able to build a quick identification system."}, "conf/grc/TaoJS0CL13": {"title": "Combining SURF with MSER for image matching.", "url": "https://doi.org/10.1109/GrC.2013.6740423", "year": "2013", "author": {"Lei Tao": "35/8591", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1", "Na Chen 0004": "69/3895-4", "Yueming Lu": "24/334"}, "abstract": " Abstract:Many local features such as Speeded Up Robust Features (SURF) have been widely utilized in image matching due to their notable performances. However, the original SURF algorithm ignores the geometric relationship among SURF features. To overcome this drawback, an improved method combining SURF with Maximally Stable Extremal Regions (MSER) for image matching is proposed in this paper. By combining SURF features into groups and measuring the geometric similarity among features, the discriminative power of the grouped features has been significantly increased. Simulations show that the proposed method outperforms the original SURF algorithm both in match ratio and repeatability."}, "conf/iccve/LiJSH0L13": {"title": "An improved reconstruction method for compressive sensing based OFDM channel estimation.", "url": "https://doi.org/10.1109/ICCVE.2013.6799777", "year": "2013", "author": {"Xingxing Li": "146/0297", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1", "Na Chen 0004": "69/3895-4", "Yueming Lu": "24/334"}, "abstract": " Abstract:In the orthogonal frequency division multiplexing (OFDM) system, channel estimation is significant in that it affects the reliability of coherent detection at the receiver. Compressive sensing based channel estimation demands fewer pilots than traditional methods and improves the resource utilization in a great manner. Greedy algorithms have a weakness in terms of anti-noise capacity. Combining compressive sampling matching pursuit (CoSaMP) with exponential smoothing, an improved reconstruction method is proposed in order to suppress noise. The noise suppression capacity of exponential smoothing is analyzed in theory. Simulation results indicate that the proposed method is superior to CoSaMP especially for high noise or low speed situation at a cost of low additional computational complexity."}, "conf/isctcs/GuoSJ0LC13": {"title": "Effective Rate Control Algorithm for H.264 Based on Scene Change Detection.", "url": "https://doi.org/10.1007/978-3-662-43908-1_12", "year": "2013", "author": {"Yaoyao Guo": "166/3144", "Songlin Sun": "76/8195", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1", "Yueming Lu": "24/334", "Na Chen 0004": "69/3895-4"}, "abstract": "The standard rate control algorithm works with all the levels such as the GOP, frame, and unit levels. However, it cannot allocate bits reasonably under the condition of scene change. In this paper, an efficient rate control algorithm to detect scene change and reallocate the channel target bits of H.264 is proposed. The proposed method can detect scene change effectively and change the length of GOP adaptively, so the target bits can be allocated more reasonably than standard rate control algorithm.\nKeywordsRate controlScene changeH.264Adaptively GOPJVT-G012"}, "conf/isspit/SunJS013": {"title": "The Subaperture Secondary Range Compression Algorithm for near space squint SAR.", "url": "https://doi.org/10.1109/ISSPIT.2013.6781904", "year": "2013", "author": {"Yi Sun": "65/2709", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:This paper discusses squint synthetic aperture radar (SAR) imaging in the near space platform and proposes an improved Secondary Range Compression (SRC) Algorithm, Subaperture Secondary Range Compression (SSRC) Algorithm. The key step is to use the subaperture approach in the SRC algorithm. First, the original signals are divided into subapertures in the azimuth direction of the time domain to image independently, and then the sub-bands of the frequency domain are combined to form the final SAR image. The method reduces coupling in the range and azimuth direction of the echo signal under the squint imaging mode, and addresses the problems of squint SAR in near space including overlong synthetic aperture and motion error. Simulation through point targets demonstrates the improvement in azimuth resolution, ISLR and PSLR, which verifies the effectiveness of this proposed SSRC algorithm in near space squint SAR imaging."}, "conf/vtc/GuoSJ013": {"title": "A Stable Expected Complexity Sphere Detection with IRA Enhancement.", "url": "https://doi.org/10.1109/VTCSpring.2013.6691846", "year": "2013", "author": {"Xiaolong Guo": "13/10726", "Songlin Sun": "76/8195", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:A new detection method based on sphere decoding (SD) is proposed in this paper to approach near-maximum likelihood (ML) performance for multi-input multi- output (MIMO) detection. The feature of the proposed method is that the complexity which means the electric power consumption in detection processing is stable for a wide range of signal-to-noise ratios (SNRs) and a number of antennas. We hold the complexity by a tree pruning mechanism which obtains detection radius through the close-form expression for the SD expected complexity R.Gowaikar and B.Hassibi, 2007. And the Increasing Radii Algorithm (IRA) mechanism is used in the method to reduce the SER at the stable expected complexity. The simulation results show that the method gets a low stable expected complexity without sacrificing much in terms of performance."}, "conf/icnidc/ZhengJS012": {"title": "Range Migration Subaperture Algorithm for spotlight SAR in near space.", "url": "https://doi.org/10.1109/ICNIDC.2012.6418817", "year": "2012", "author": {"Ping Zheng": "16/3342", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:Spotlight Synthetic Aperture Radar (SAR) is an imaging mode with high resolution and widely used in spaceborne and airborne platforms as well as the platform in near space - a new position in space. In this paper, a new algorithm, Range Migration Sub-aperture Algorithm (RMSA), is proposed which is applicable to the spotlight SAR imaging mode in near space. It can reduce the limitation of Pulse Repetition Frequency (PRF) and radar power, and solve the problems of spotlight SAR in near space such as overlong synthetic aperture, motion error, etc. And through the simulation and contrast, the algorithm is verified to be effective."}, "conf/ccis/XiaSJ011": {"title": "A variable parameter efficient μ-law improved proportionate affine projection algorithm.", "url": "https://doi.org/10.1109/CCIS.2011.6045135", "year": "2011", "author": {"Xiao Xia": "64/3109", "Songlin Sun": "76/8195", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:The proportionate affine projection algorithm (APA) was developed for echo cancellation. To further improve the convergence rate and tracking ability, in this paper, a variable parameter μ of the μ-law compression is applied to a recently μ-law “memory”-improved proportionate APA (MMIPAPA). In proposed algorithm, the parameter μ is not constant, but time varying and adaptive. Compared with MMIPAPA, simulation results show that the proposed algorithm, termed the adaptive μ-law “memory”-improved proportionate APA (AMMIPAPA), achieves better convergence performance and owns better tracking ability."}, "conf/edutainment/HuangTWSJ10": {"title": "Node Localization for Distributed Simulation Based on Logical Node Group in Simulation Grid.", "url": "https://doi.org/10.1007/978-3-642-14533-9_30", "year": "2010", "author": {"Hai Huang 0001": "51/944-1", "Lei Tian": "04/2026", "Wei Wu 0008": "95/6985-8", "Songlin Sun": "76/8195", "Xiaojun Jing": "98/3588"}, "abstract": "Node localization for federate migration in simulation grid is studied. Both the load of computing node and the difference of communication delay in simulation grid are considered in locating the destination node of migrating federate. Simulation grid is divided into a number of logical node groups in each of which the communication delays are approximate between nodes. Locating processes includes intra-group processes and delay-centered inter-group processes. The average communication delay among federates is minimized.KeywordsNode localizationdistributed simulationlogical node groupsimulation gridcommunication delay"}, "conf/edutainment/ZhangH07": {"title": "Federate Job Mapping Strategy in Grid-Based Virtual Wargame Collaborative Environment.", "url": "https://doi.org/10.1007/978-3-540-73011-8_91", "year": "2007", "author": {"Jing Zhang 0063": "05/3499-63", "Hai Huang 0001": "51/944-1"}, "abstract": "A crucial issue for grid-based virtual wargame collaborative environment is that of mapping federate jobs to grid nodes efficiently. Because there exits large amount of interactions among federates, it is a challenging work to design an efficient federate mapping strategy. In this paper, we established an objective function for federate job mapping which takes into consideration not only the load of grid nodes, but also network utilization. Experimental results show that the proposed federate job mapping strategy can contribute to load balancing of the virtual wargame collaborative environment.KeywordsGrid NodeTask AllocationSimulation GridSimulation ApplicationHigh Level ArchitectureThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/icannga/TianHH07": {"title": "Multi-objective Optimal Public Investment: An Extended Model and Genetic Algorithm-Based Case Study.", "url": "https://doi.org/10.1007/978-3-540-71618-1_35", "year": "2007", "author": {"Lei Tian": "04/2026", "Liyan Han": "90/6578", "Hai Huang 0001": "51/944-1"}, "abstract": "Under the multi-region and multi-sector consideration, the previous double-objective optimal public investment model is extended to involve optimal employment rate objective and time-flow total income maximization objective first. Then genetic algorithm is applied to solve the multi-objective model. Finally a case study is carried out to verify the superiority of the genetic algorithm-based solution to traditional public investment distribution approach.KeywordsGenetic AlgorithmEmployment RatePublic InvestmentTotal IncomeBinary StringThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/edutainment/HuangWTZ06": {"title": "Federate Migration in Grid-Based Virtual Wargame Collaborative Environment.", "url": "https://doi.org/10.1007/11736639_75", "year": "2006", "author": {"Hai Huang 0001": "51/944-1", "Wei Wu 0008": "95/6985-8", "Xin Tang": "35/7028", "Zhong Zhou": "95/4490"}, "abstract": "Recently, grid-based virtual wargame collaborative environment has become a hot topic, in which load balance plays an important role. In this paper, we survey existing technologies in federate migration for the purpose of balancing load, and focus on the selection of destination node for a federate to migrate to. Different from traditional methods, the proposed method takes into consideration not only the load of CPU & memory, but also communications among federates when selecting the destination node. Moreover, the procedure of migration is described and a prototype is implemented on the basis of Globus Toolkit 3.0 to validate its functionality and performance.KeywordsSource NodeDestination NodeMigration TimeGrid ServiceHigh Level ArchitectureThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/icnc/LeiLHH06": {"title": "A Genetic Algorithm-Based Double-Objective Multi-constraint Optimal Cross-Region Cross-Sector Public Investment Model.", "url": "https://doi.org/10.1007/11881223_58", "year": "2006", "author": {"Tian Lei": "57/6036", "Liu Lieli": "07/2901", "Liyan Han": "90/6578", "Hai Huang 0001": "51/944-1"}, "abstract": "An optimal public investment model with two objective functions considering efficiency & equity and several constraints such as taxes and capital transfer loss are established by dividing public & private sectors and relaxing several original hypotheses respectively. And the objective functions and constraints are handled to adapt the model into the double-objective multi-constraint programming model suitable for genetic algorithm-based solution. Then encoding and decoding approaches are designed. Finally a case study is carried out to validate the proposed model and the GA-based solution.KeywordsPublic InvestmentOptimal Objective FunctionSimple LaborCapital TransferAggregative Production FunctionThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/icnc/WuHZL05": {"title": "A Genetic Algorithm-Based Routing Service for Simulation Grid.", "url": "https://doi.org/10.1007/11539902_95", "year": "2005", "author": {"Wei Wu 0008": "95/6985-8", "Hai Huang 0001": "51/944-1", "Zhong Zhou": "95/4490", "Zhongshu Liu": "32/1285"}, "abstract": "A genetic algorithm-based routing service for building a multicast distributed tree on Simulation Grid is proposed. Different from existing algorithms, the proposed routing algorithm doesn’t demand that all the routers in the whole network have multicast functionality. It can meet federates’ QoS requirements and minimize the bandwidth consumption. We formalize the routing as a multi-objective optimization problem, which is NP-hard, and apply GA (Genetic Algorithm) to solve it. Also, we focus on the two important aspects of encoding & decoding and fitness function construction in our GA, and present the procedure of seeking the optimal paths. Experiment results have showed that the proposed approach is feasible.KeywordsGenetic AlgorithmSpan TreeMulticast TreeGrid EnvironmentGrid InfrastructureThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/gcc/HuangWZW04": {"title": "Resource Discovery Mechanism for Large-Scale Distributed Simulation Oriented Data Grid.", "url": "https://doi.org/10.1007/978-3-540-30208-7_60", "year": "2004", "author": {"Hai Huang 0001": "51/944-1", "Shaofeng Wang": "28/6813", "Yan Zhang": "04/3348", "Wei Wu 0008": "95/6985-8"}, "abstract": "A new type of resource discovery mechanism is proposed for simulation oriented data grid. By introducing distributed resource brokers at edge routers of each domain, a majority of resource discovery queries can be processed solely by resource brokers at edge routers, instead of accessing remote global resource broker. The response time and network overhead of resource discovery is reduced and system scalability is enhanced. Experiment results show that the proposed resource discovery mechanism is feasible.KeywordsData GridGrid ResourceResource ProviderResource AccessResource DiscoveryThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "journals/ijcta/HuangLTMJ21": {"title": "A novel FCNs-ConvLSTM network for video salient object detection.", "url": "https://doi.org/10.1002/cta.2924", "year": "2021", "author": {"Hai Huang 0001": "51/944-1", "Chang Liu": "52/5716", "Lei Tian": "04/2026", "Junsheng Mu": "185/3832", "Xiaojun Jing": "98/3588"}, "abstract": ""}, "journals/access/YangHJLZ20": {"title": "Social Interaction Assisted Resource Sharing Scheme for Device-to-Device Communication Towards Green Internet of Things.", "url": "https://doi.org/10.1109/ACCESS.2020.2986785", "year": "2020", "author": {"Wei Yang 0014": "03/1094-14", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588", "Zhannan Li": "190/2614", "Chunsheng Zhu": "02/8276"}, "abstract": "Topic: Green Communications on Wireless Networks"}, "journals/access/WangCMHMS20": {"title": "Improved Danmaku Emotion Analysis and Its Application Based on Bi-LSTM Model.", "url": "https://doi.org/10.1109/ACCESS.2020.3001046", "year": "2020", "author": {"Shaokang Wang": "86/7693", "Yihao Chen": "205/4031", "Hongjun Ming": "269/2627", "Hai Huang 0001": "51/944-1", "Lingxian Mi": "269/2814", "Zengyi Shi": "269/2616"}, "abstract": " Abstract:With the rapid development of social media, danmaku video provides a platform for users to communicate online. To some extent, danmaku video provides emotional timing information and an innovative method to analyze video data. In the age of big data, studying the characteristics of danmaku and its emotional tendencies can not only help us understand the psychological characteristics of users but also feedback the effective information of users to video platforms, which can help the platforms optimize related short video recommendations so that it can provide a more accurate solution for the selection of audiences during video production. However, danmaku is different from traditional comments. Current emotion classification methods are only suitable for two-dimensional classification which are not suitable for danmaku emotion analysis. Aiming at the problems such as the colloquialism, diversity, spelling errors, structural non-linearity informal language on the Internet, diversity of social topics, and context dependency of emotion analysis of the danmaku data, this paper proposes an improved emotion analysis model based on Bi-LSTM model to classify the further four-dimensional emotions of Pleasure, Anger, Sorrow and Joy. Furthermore, we add tags such as comment time and user name to the danmaku information. Experimental results show that the improved model has higher Accuracy, Recall, Precision, and F1-Score under the same conditions compared with the CNN and SVM. The classification effect of improved model is close to the SOTA. Experimental results also show that the improved model can be effectively applied to the analysis of irregular danmaku emotion."}, "journals/iet-com/MuXHJ20": {"title": "Computation-constrained spectrum sensing in IoT-based scenarios.", "url": "https://doi.org/10.1049/iet-com.2019.1367", "year": "2020", "author": {"Junsheng Mu": "185/3832", "Dongliang Xie": "27/3906", "Hai Huang 0001": "51/944-1", "Xiaojun Jing": "98/3588"}, "abstract": ""}, "journals/access/YangJH18": {"title": "An Intelligent Human Behavior-Based Reasoning Model for Service Prediction in Smart Home.", "url": "https://doi.org/10.1109/ACCESS.2018.2879904", "year": "2018", "author": {"Wei Yang 0014": "03/1094-14", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": " Abstract:With the rapid development of technologies and improvement of living conditions, people are increasingly concerned about their life safety, convenience, and comfortableness. Household intelligence starts to play an increasingly important role in improving people living environment. This paper focuses on service prediction in smart home automatic control systems, and proposes an intelligent human behavior-based reasoning model on the basis of linear prediction and case-based reasoning. Hardware and software are designed after analysis of the embedded architecture. In addition, an embedded smart home platform is built up and implemented to validate the proposed human behavior-based reasoning algorithm."}, "journals/icl/MuJHG18": {"title": "Subspace-Based Method for Spectrum Sensing With Multiple Users Over Fading Channel.", "url": "https://doi.org/10.1109/LCOMM.2017.2741938", "year": "2018", "author": {"Junsheng Mu": "185/3832", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1", "Ning Gao": "47/544"}, "abstract": " Abstract:Spectrum sensing with single primary user (PU) has attracted the attention of researchers due to its influence on the scarce radio spectrum. Yet, the co-existence of multiple PUs within the sensing region is considered rarely. In this letter, spectrum sensing with multiple users over fading channel is investigated based on subspace filtering in the same frequency band. The corresponding closed-form solution of the false alarm and detection probabilities is given together with simulation verifications."}, "journals/itiis/YangJH18": {"title": "Spectrum Usage Forecasting Model for Cognitive Radio Networks.", "url": "https://doi.org/10.3837/tiis.2018.04.006", "year": "2018", "author": {"Wei Yang 0014": "03/1094-14", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1"}, "abstract": ""}, "journals/icl/GaoJHM17": {"title": "Robust Collaborative Spectrum Sensing Using PHY-Layer Fingerprints in Mobile Cognitive Radio Networks.", "url": "https://doi.org/10.1109/LCOMM.2017.2656901", "year": "2017", "author": {"Ning Gao": "47/544", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1", "Junsheng Mu": "185/3832"}, "abstract": " Abstract:Collaborative spectrum sensing has been proposed to significantly improve the performance of spectrum sensing in cognitive radio networks (CRNs). However, a serious attack, called a primary user emulation attack (PUEA), could decrease the performance of collaborative spectrum sensing. In this letter, according to mobile CRNs, we propose a novel robust collaborative spectrum sensing method using physical-layer fingerprints power in a multipath Rayleigh fading channel. Moreover, a fingerprints-power-belief-based noncentral detection algorithm is designed to defend against PUEAs. Simulation results show that our proposed method can rapidly detect the presence of a primary user under PUEAs with good performance."}, "journals/iet-bmt/MaJHCM17": {"title": "Palm vein recognition scheme based on an adaptive Gabor filter.", "url": "https://doi.org/10.1049/iet-bmt.2016.0085", "year": "2017", "author": {"Xin Ma": "18/6265", "Xiaojun Jing": "98/3588", "Hai Huang 0001": "51/944-1", "Yuanhao Cui": "180/7390", "Junsheng Mu": "185/3832"}, "abstract": ""}}}