{"id": "67/876-1", "name": "Hong Luo 0001", "Article": {"conf/cscwd/QiHSL22": {"title": "A Knowledge Graph-Based Abstractive Model Integrating Semantic and Structural Information for Summarizing Chinese Meetings.", "url": "https://doi.org/10.1109/CSCWD54268.2022.9776298", "year": "2022", "author": {"Peng Qi": "59/9474", "Zhen Huang": "22/3870", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:With the rapid increase of users, online meeting platforms have accumulated massive meeting transcripts. However, it is still a challenge for users to quickly master the chief information and manage the meetings, despite there are already some useful text summarization models. In this paper, a Knowledge Graph-based Meeting Summarization Framework is proposed to tackle this challenge. First, a two-layers meeting domain Knowledge Graph is developed to integrate more information of meetings. Based on which, an encoder-decoder architecture is utilized to summarize meetings. For encoding meetings, a structural-level and semantic-level embedding strategy is considered, concretely, the Knowledge Graph is embedded to obtain the structural information, an interaction intention recognition model and a two-level transformer mechanism are devised to get the semantic information. Finally, the structural information and semantic information are combined and fed into the decoding network to generate meeting summaries. Extensive experiments on the Chinese meeting dataset show that our summarization framework outperforms other state-of-the-art models."}, "conf/globecom/0002LSO20": {"title": "Value-driven Cache Replacement Strategy in Mobile Edge Computing.", "url": "https://doi.org/10.1109/GLOBECOM42002.2020.9348106", "year": "2020", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:The mobile edge computing greatly reduces the transmission delay by offloading computing job to the base station, which is closer to the user. It solves the problem of high delay in cloud computing. Since the edge server has limited resources, improving the efficiency of computation offloading becomes a problem that needs to be addressed. Considering the data is reusable, it is a feasible solution to use the cache to improve the efficiency of computation offloading. In order to make the cache better serve the computation offloading process, we must design a reasonable cache replacement strategy. The traditional cache replacement strategy only considers the cache hit ratio, but ignores the cache value. It is not applicable to the edge computing process. In this paper, a new cache replacement strategy is proposed for the cache replacement problem in mobile edge computing, which is more suitable for computation offloading process. First, we define the cache value based on the priority of computing job. Then, we define the problem of maximizing the cache value in mobile edge computing as a multiobjective optimization problem. Finally, in order to find a suitable Pareto solution, we propose a cache replacement strategy based on the ideal point method. The experimental results show that the proposed algorithm results are significantly better than the existing competitive cache replacement methods."}, "conf/icc/YangLSO20": {"title": "Energy-efficient Collaborative Offloading for Multiplayer Games with Cache-Aided MEC.", "url": "https://doi.org/10.1109/ICC40277.2020.9148751", "year": "2020", "author": {"Xuemei Yang": "82/1133", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:Nowadays mobile multiplayer games have been an usual recreation, however energy-limited mobile devices confine the game running time. Noticing the component-based multiplayer game is a loosely coupled application whose components are nearly always required among players in one or more rounds, we study the collaboration of players to develop an energy-efficient offloading scheme. We formulate a 0-1 integer nonlinear programming problem to minimize the overall energy cost on player side under time-delay constraint. The problem is intractable to find the optimal solution, thus we propose a heuristic Two-phase Greedy-based Collaborative Offloading Algorithm (TGCOA) for the objective of cost minimization, while including more energy savings for low-energy players. In each round, we preferentially cache components saving more energy per data size for subsequent rounds, then preferentially offload components saving more energy for current round. Meanwhile, we always assign valid player with highest remaining energy to the uploading tasks. Simulations show that the energy cost ratios of our proposal are significantly down by 1.55% to 99.62% compared to four competing methods under different cache limitations and repeatability factors. Meanwhile, our proposal enables a 6.00% to 14.80% lower energy cost proportion for low-energy players compared to the four methods."}, "conf/iwcmc/Liu0L19": {"title": "An ANTLR-based Feature Extraction and Detection System for Scratch.", "url": "https://doi.org/10.1109/IWCMC.2019.8766735", "year": "2019", "author": {"Pai Liu": "169/2508", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:Scratch, a visual programming language used by youth, has received widespread attention of education field. Quality Hound is an effective tool to detect the features of Scratch. However, its detection rules are not sufficiently complete, which incurs incomprehensive results. In this paper, we propose an ANTLR-based feature extraction and detection system to solve this problem. Specifically, nine novel programming feature detection rules are abstracted and applied in our model. The experimental results show our system can effectively extract programming features from projects and provide feedback for students and teachers."}, "conf/icc/WangLOW18": {"title": "The Internet of Things Service Recommendation Based on Tripartite Graph with Mass Diffusion.", "url": "https://doi.org/10.1109/ICCW.2018.8403756", "year": "2018", "author": {"Pingquan Wang": "174/4942", "Hong Luo 0001": "67/876-1", "Mohammad S. Obaidat": "91/2882", "Tin-Yu Wu": "44/3992"}, "abstract": " Abstract:With the increasing presence and adoption of the smart device in the Internet of Things (IoT), the service recommendation is becoming more and more important. In this paper, we proposed a service recommendation scheme based on the mass diffusion dynamic tag tripartite graph. We extracted the users' habit features of using the IoT device service as the dynamic tag and then built the tripartite graph. Through the positive and backward mass diffusion on the tripartite graph, we got the resource value of the service. We finally obtained the recommendation list through the comprehensive calculation of the energy state, the user similarity, the bearing capacity, and the service resource value of the mass diffusion results. The experiments showed that the recommendation precision of the service recommendation scheme we proposed was at least 12% higher than the other algorithms."}, "conf/icc/WeiLOW18": {"title": "An Active Updating Strategy for Caching Periodic Data in the Internet of Things.", "url": "https://doi.org/10.1109/ICC.2018.8422545", "year": "2018", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Mohammad S. Obaidat": "91/2882", "Tin-Yu Wu": "44/3992"}, "abstract": " Abstract:Named Data Network (NDN) can cache data in the router to reduce the data transmission cost and hence can be used in the resource limited Internet of Things systems. However, there are still some problems. Particularly for periodic data, if the cached data can't be updated in real time, the data content will be outdated. However, if each cache node updates the data frequently, it will cost a lot of unnecessary network traffic. In this paper, we improve the traditional NDN routing procedure and propose an active updating strategy for periodic data to further reduce the network traffic. First, we create an Interest Record Table and modify the Content Store to store the periodic information. Then, we modify the router work-flow to allow the router node to actively update the cache data. Finally, we propose an algorithm based on user's access regularity to calculate the update time point. Experimental results indicate that the proposed approach can reduce the network traffic by about 33.8% on average compared to the existing competing methods."}, "conf/icc/ZhongTLOW18": {"title": "Staged Incentive Mechanism for Mobile Crowd Sensing.", "url": "https://doi.org/10.1109/ICC.2018.8422550", "year": "2018", "author": {"Shan Zhong": "94/1198", "Dan Tao": "80/4888", "Hong Luo 0001": "67/876-1", "Mohammad S. Obaidat": "91/2882", "Tin Yu Wu": "44/3992"}, "abstract": " Abstract:In the context of mobile crowd sensing, incentive mechanism is crucial to recruit mobile users to participate in the sensing task and ensure participants to provide high-quality sensing data. In this paper, we investigate a staged incentive mechanism for mobile crowd sensing. We firstly divide the incentive process into two stages: recruiting stage and sensing stage. In the recruiting stage, we introduce the payment incentive coefficient and design a Stackelberg based game method. The participants can be recruited via game interaction. In the sensing stage, we propose a time-space correlation algorithm in the interaction and the winners can be screened after the sensing task. Finally, Extensive experiments show that compared to the existing positive auction incentive mechanism (PAIM) and reverse auction incentive mechanism (RAIM), our staged incentive mechanism (SIM) can effectively improve participants' motivation and achieve high-quality sensing data from both space dimension and time dimension by extending the motivation from the recruitment stage to the sensing process."}, "conf/bigcom/Xie0L17": {"title": "Secured Data Storage Scheme Based on Block Chain for Agricultural Products Tracking.", "url": "https://doi.org/10.1109/BIGCOM.2017.43", "year": "2017", "author": {"Chao Xie": "04/5576", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:The Internet of Things technology has been widely used in the quality tracking of agricultural products, however, the safety of storage for tracked data is still a serious challenge. Recently, with the expansion of blockchain technology applied in cross-industry field, the unchangeable features of its stored data provide us new vision about ensuring the storage safety for tracked data. Unfortunately, when the blockchain technology is directly applied in agricultural products tracking and data storage, it is difficult to automate storage and obtain the hash data stored in the blockchain in batches base on the identity. Addressing this issue, we propose a double-chain storage structure, and design a secured data storage scheme for tracking agricultural products based on blockchain. Specifically, the chained data structure is utilized to store the blockchain transaction hash, and together with the chain of the blockchain to form a double-chain storage, which ensures the data of agricultural products will not be maliciously tampered or destructed. Finally, in the practical application system, we verify the correctness and security of the proposed storage scheme."}, "conf/globecom/LiLWO17": {"title": "Operating Mode Optimization for Nodes of Data Supply Chain.", "url": "https://doi.org/10.1109/GLOCOM.2017.8254438", "year": "2017", "author": {"Peng Li": "83/6353", "Hong Luo 0001": "67/876-1", "Tin-Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:E-Health Systems are transforming the whole healthcare process to become more efficient and less expensive. QoS is usually used as a key criterion for E-Health service. The study shows that QoS of data supply chain are highly related to operating mode of nodes. However, existing optimization methods seldom took this observation into account, which shall decrease the optimal performance. In this paper, we propose an operating mode optimization strategy for nodes of data supply chain environments including E-Health Systems. First, a QoS mathematical model is developed. Then, we put forward the objective function to balance the data freshness, hit rate and cost from the aspects of users and service providers. To this end, we present a novel operating mode selection algorithm. It selects appropriate candidate operating modes for each node when generating composite operating mode of nodes with optimal QoS values. Experimental results indicate that the effectiveness of the proposed approach outperforms the existing methods by at least 20%."}, "conf/icc/LiLWO17": {"title": "QoS prediction method for data supply chain based on context.", "url": "https://doi.org/10.1109/ICC.2017.7997260", "year": "2017", "author": {"Peng Li": "83/6353", "Hong Luo 0001": "67/876-1", "Tin-Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:Due to the execution paradigm may be different at different invocation time, users obtain different QoS when interacting with the same Data Supply Chain (DSC). However, existing QoS prediction methods seldom took this observation into consideration, which shall decrease the prediction accuracy. In this paper, we propose a context-based QoS prediction method for data supply chain. First, a QoS mathematical model is developed for considering the mass data transmission across elementary sub-chains. Then, two execution paradigms of data supply chain are discussed. Besides, we explored several special context factors of data supply chain (such as invocation time, data source update period and execution paradigm) which influence QoS. By processing such context information, we can obtain the part of data supply chain which is need to execute when the user query occurs and leverage them to predict QoS. Experimental results indicate that our approach improves the prediction accuracy and efficiency of QoS when compared to previous methods."}, "conf/icc/SunLWO17": {"title": "Adaptive and safe presentation strategy of image information on social platform.", "url": "https://doi.org/10.1109/ICC.2017.7997040", "year": "2017", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Tin-Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:With the development of social network, there are more and more people to share pictures on social platforms. Since the information contained in picture has the different requirements for confidentiality, it makes the selective presentation of secret information to be an urgent problem. Estimating user's privilege of gaining some regions based on his/her attributes is a novel solution. But there are few perfect solutions aiming at the strategy of adaptive calculation for user's privilege in the existing literatures, especially for the scenario in which the real values of some attributes have priorities. In this work, based on the cipher text-policy attribute-based encryption (CP-ABE), we propose an adaptive and safe presenting scheme for the information contained in a picture. This scheme firstly embeds the confidential data outside the secret region, and generates the image mosaic in the secret region; when someone requesting the original version of image, it adaptively calculates the recovery privilege of requestor with the strategy proposed in this paper, then precisely present some regions based on the privilege level of requestor. Moreover, we firstly propose the vote-attribute which facilitates the attribute revocation. The experiments demonstrate that, based on the privilege level, the proposed scheme can safely present the original version of the corresponding image region, and expediently achieve the attribute revocation. Compared with other algorithms, our scheme can restore the original version of image with only 1/2 secret data, and spend little time over the attribute revocation. Besides, the average of peak signal to noise ratio (PSNR) is 4dB more than the algorithms available, and the standard variance of PSNR is less than 0.4."}, "conf/ucami/WangLS17": {"title": "IOT Service Recommendation Strategy Based on Attribute Relevance.", "url": "https://doi.org/10.1007/978-3-319-67585-5_4", "year": "2017", "author": {"Pingquan Wang": "174/4942", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": "In this article, we research on the service recommendation strategy in the IoT. The user attribute similarity and the attribute correlation of user and device service are computed, and the recommendation system is recommended based on the calculation results. In order to solve the cold start problem, we propose the tensor linear regression model. The experiment results show the recommendation strategy was effective.KeywordsIoTService recommendationAttribute relevanceTensorCold start"}, "conf/bigcom/LiLSL16": {"title": "Similarity Search Algorithm over Data Supply Chain Based on Key Points.", "url": "https://doi.org/10.1007/978-3-319-42553-5_1", "year": "2016", "author": {"Peng Li": "83/6353", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Xinming Li": "145/0602"}, "abstract": "In this paper, we target at similarity search among data supply chains, which plays essential role in optimizing the chain and extending its value. This problem is very challenging for application-oriented data supply chains because the high complexity of data supply chain makes the computation of similarity extremely complex and inefficiency. In this paper, we propose a feature space representation model based on key points, which can extract the key features from sub-sequences of the original data supply chain and simplify the original data supply chain into a feature vector form. Then, we formulate the similarity computation of key points based on the multi-scale features. Further, we propose an improved hierarchical clustering algorithm for similarity search over data supply chains. The main idea is to separate sub-sequences into disjoint groups such that each-group meets one specific clustering criteria, and thus the cluster containing the query object is the similarity search result. The experimental results show that the proposed approach is both effective and efficient for data supply chain retrieval.KeywordsData supply chainSimilarity searchFeature spaceHierarchical clustering"}, "conf/icce-tw/LiG016": {"title": "Accurate indoor localization based on the inertial navigation and the iBeacon.", "url": "https://doi.org/10.1109/ICCE-TW.2016.7520932", "year": "2016", "author": {"Yatao Li": "98/4958", "Yingying Guo": "51/7390", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:Indoor localization is an important primitive that can enable many ubiquitous computing applications. This paper improves the scheme of landmark and inertial navigation to address reliable and accurate indoor localization. We use the iBeacon as the landmark. To optimize the inertial navigation, we integrate exploit the calibration function of the iBeacon for step length and heading estimation. For tackling the challenges of eliminating the difference of mobile devices, we have developed a reliable parameter learning algorithm. The results of extensive experiments on multiple devices show that our localization system performed well in terms of accuracy and universality."}, "conf/msn/SunLS16": {"title": "Privacy-Preserving Recoverable Photo Sharing in Mobile Social Network.", "url": "https://doi.org/10.1109/MSN.2016.033", "year": "2016", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:It is common to take photos and share them by smartphone in mobile social network at present, but the sharer may need to mask partial areas of the photo to avoid leaking the privacy. Reversible image mosaic can mask the privacy very well. However, there is little discussion on how to effectively control and safely store the mosaic information for recovering. In this paper, we first propose a prediction algorithm of reversible image mosaic size (PARIMoS), which can calculate the maximum number of mosaic blocks according to the image quality of non-mosaic area and the recovery quality of mosaic required by user. And then, we propose an efficient and reliable generating algorithm of reversible image mosaic (GAoRIM). In GAoRIM, we compress the secret information of the mosaic area with twice-run-length-encoding and then store the compressed result in special non-mosaic areas of image separately. Therefore, it can ensure reliable recovery even the image is partly stained, and hardly change the roughness of non-mosaic area. The experiment results show that the biggest change of average roughness in the non-mosaic area is less than 0:5%. Comparing with the similar algorithms, on average, the amount of data protected by GAoRIM is at least 8:70% higher than theirs while the peak signal noise ratio (PSNR) of stego image without mosaic is similar to theirs."}, "conf/globecom/SunLWO15": {"title": "A PSNR-Controllable Data Hiding Algorithm Based on LSBs Substitution.", "url": "https://doi.org/10.1109/GLOCOM.2014.7417631", "year": "2015", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Tin Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:There are more and more systems using mobile devices to perform sensing tasks, but these increase the risk of leakage of personal privacy and data. Data hiding is one of the important ways for information security. Even though many data hiding algorithms have worked on providing more hiding capacity or higher PSNR, there are few algorithms that can control PSNR effectively while ensuring hiding capacity. In this paper, with controllable PSNR based on LSBs substitution- PSNR-Controllable Data Hiding (PCDH), we first propose a novel encoding plan for data hiding. In PCDH, we use the remainder algorithm to calculate the hidden information, and hide the secret information in the last x LSBs of every pixel. Theoretical proof shows that this method can control the variation of stego image from cover image, and control PSNR by adjusting parameters in the remainder calculation. Then, we design the encoding and decoding algorithms with low computation complexity. Experimental results show that PCDH can control the PSNR in a given range while ensuring high hiding capacity. In addition, it can resist well some steganalysis. Compared to other algorithms, PCDH achieves better tradeoff among PSNR, hiding capacity, and computation complexity."}, "conf/icpads/WangLS15": {"title": "A Habit-Based SWRL Generation and Reasoning Approach in Smart Home.", "url": "https://doi.org/10.1109/ICPADS.2015.101", "year": "2015", "author": {"Pingquan Wang": "174/4942", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:In this paper, we propose a habit-based SWRL generation and reasoning approach in smart home. Definition and recognition of habits of daily living can provide humanized smart home for assisted living application, especially for people with memory deficits. This paper presents Recognizing Habit of Daily Living(RHDL) by discovering and monitoring smart home context information. The habit and habit association of using electrical appliances are defined explicitly for the first time. The generation rules between habit/complex habit and SWRL are designed, and the reasoning is based on the Semantic Web Rule Language(SWRL). The ontology model for the RHDL is designed and the prototype system of RHDL is implemented using protege and Jess tools."}, "conf/iih-msp/WangSL14": {"title": "Service Conflict Detection and Avoidance Based on Scene with Urgency Degree.", "url": "https://doi.org/10.1109/IIH-MSP.2014.192", "year": "2014", "author": {"Xukai Wang": "160/1881", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:Service conflict is an essential issue in smart home automation, which causes the service execution inefficient and inconvenient. In this paper, we propose a conflict detection and avoidance schema based on scene with urgency degree. First, we classify services into five categories. Users can customize their specific scene using different categories of services which can be set with their own urgency degree. Second, we propose a formal service model, ETA, which includes environment variable, trigger and actuator to describe each service. In the design phase of a scene, we use ETA model to detect conflict among the services with same urgency degree. While in the execution phase of a scene, it is effective to avoid service conflict by using its higher urgency degree to choose which service can be executed properly."}, "conf/msn/LuoLS13": {"title": "Efficient Sleep Scheduling for Avoiding Inter-Cluster Interference in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/MSN.2013.16", "year": "2013", "author": {"Hong Luo 0001": "67/876-1", "Jianming Liao": "140/8505", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Clustering sensor nodes is an effective method for achieving high energy efficiency and flexible data aggregation in wireless sensor networks. However, scheduling all clusters to avoid the inter-cluster interference and meanwhile send all observation to the sink quickly is a difficult problem. In this paper, we use interference graph to model the inter-cluster collision problem and propose an efficient sleep scheduling mechanism in the clustered wireless sensor networks. We firstly divide the clusters into layers, then transform the cluster-tree network into the interference graph of clusters, and thereby divide all clusters on one layer into different independent sets. All clusters in the same independent set can work simultaneously without interference, while all independent sets are scheduled one by one for collision-free. To reduce the total delay of data report in the whole network, we propose three kinds of rules to sort the independent sets. Simulation and analysis show that the degree-based sorting rule works best. The practical experiments also verify this conclusion."}, "conf/dcoss/ZhaoMSLL12": {"title": "Adaptive Synchronization Control with Multi-level Buffer in Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.1109/DCOSS.2012.25", "year": "2012", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Liang Liu 0001": "10/6178-1"}, "abstract": " Abstract:In Wireless Multimedia Sensor Networks (WMSNs), data fusion and collaborative in-network processing operations often require effective multimedia synchronization control. Extensive researches have been done in the traditional networks. Most of these works assume that there exists a powerful synchronization controller in the network. However, for WMSNs, the in-network processing of the multimedia content is usually performed based on the resource-constrained sensors. Traditional synchronization control algorithms fail to run on the low-end hardware platform. In this paper, we propose an adaptive synchronization control scheme with multi-level buffer to address this problem. Main contributions of this paper are as follows. (i) To overcome the resource constraint of WMSNs, we perform the synchronization control in a distributed way by combining the sensors in the stream transmission path. (ii) By evaluating the current network state, we adjust the level number of the buffer adaptively to balance the delay and delay jitter. (iii) Through analyzing the buffer state of each level, we propose an efficient packet scheduling scheme to reduce the delay jitter actively. (iv) We implement the proposed scheme and verify its effectiveness in our practical WMSNs platform. The experiment results show that the proposed scheme can maintain the streams synchronization effectively with the low-end sensors."}, "conf/msn/LuoLS11": {"title": "Semantics-Based Service Mining Method in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/MSN.2011.69", "year": "2011", "author": {"Hong Luo 0001": "67/876-1", "Lei Liu": "21/2715", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Wireless Sensor Networks are attracting lots of attention for its broad application areas, and hence the services provided by WSNs become much more diverse. But with the development of in-depth applications, service discovery and composition are challenges to the end users. Service mining is a new technique in Internet which can discover new composite services from the abundantly existing services in Internet to meet the users' needs. However, those service mining methods are not practical in the energy-exhausted and application-oriented WSNs. In this paper, we develop a semantics-based service mining method for WSNs, to provide users with interesting composite services. In this method, services are combined and recommended to users actively according to the calculation of service similarity and an up datable semantic database. By the results of service similarity, useless compositions are filtered out so that energy consumption on service flooding can be reduced. The update strategy of semantic database is also given out, by which the composite services can keep up with time and be more applicative. The benefits of the proposed method are that all operations such as calculating, filtering, and updating are simple enough and can be performed at broker nodes."}, "conf/wowmom/ZhaoMSL11": {"title": "Distributed audio synchronization scheme using audio endpoint inWASNs.", "url": "https://doi.org/10.1109/WoWMoM.2011.5986385", "year": "2011", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:In Wireless Audio Sensor Networks (WASNs), many applications such as target tracking, data fusion and localization, often require precise synchronization among audio streams. Extensive researches have been done under the assumption that wireless channel is well enough and the cluster head is power supplied. However, these conditions can not be satisfied in many applications. When audio event occurs, the burst of data is usually coupled with a high packet loss rate. Besides, the cluster head is usually battery-powered, especially in the wild environment. In this paper, we propose a distributed audio synchronization scheme to address these challenges. By dynamically detecting the endpoint of the audio streams and marking the start point of the audio synchronization obviously at the reporting sensor, we can eliminate the sound propagation delay effectively and synchronize the audio streams precisely even under the high packet loss rate. Moreover, by handling the synchronization task in a distributed way, we can lighten the burden of the cluster head and prolong the lifetime of the whole network greatly. To improve the flexibility of the scheme, we also propose a self-adaptive algorithm which can adjust the parameters of the synchronization according to the network condition. Experimentally, we show that the proposed scheme can synchronize the audio streams under different conditions with low energy cost."}, "conf/wowmom/ZhaoMSLM11": {"title": "Enhanced surveillance platform with low-power wireless audio sensor networks.", "url": "https://doi.org/10.1109/WoWMoM.2011.5986188", "year": "2011", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "XuFei Mao": "26/775"}, "abstract": " Abstract:Video surveillance system, which can provide real-time display of the monitored scene and video playback, has been employed in many areas including: commercial security, accident investigation, law enforcement and emergency response. However, audio which carries important information not available in video is usually not taken seriously and used effectively. In this paper, we develop an enhanced surveillance platform by introducing the low-power wireless audio sensor networks (WASNs). We can obtain more comprehensive and precise monitoring without the limitation of the line-of-sight and lighting condition. Moreover, this platform is designed and built for providing key support to varieties of applications. This article describes the platform architecture, including design, implementation, and performance. We describe the audio sensor platform which can deliver high-quality audio over sensor network by multi-hops with low power requirement. In addition, we present the multimedia synchronization mechanism in the heterogeneous network which is the foundation of applications in the proposed platform. Our experiments include an in-depth analysis of the bottlenecks within the platform as well as measurements for the various components."}, "conf/icdcs/LuoWSML10": {"title": "Adaptive Sampling and Diversity Reception in Multi-hop Wireless Audio Sensor Networks.", "url": "https://doi.org/10.1109/ICDCS.2010.32", "year": "2010", "author": {"Hong Luo 0001": "67/876-1", "Jinge Wang": "70/5470", "Yan Sun 0004": "181/2323-4", "Huadong Ma": "04/6217", "Xiang-Yang Li 0001": "l/XiangYangLi"}, "abstract": " Abstract:Wireless Audio Sensor Networks (WASNs) can provide event detection, object tracking and audio stream monitoring through cooperative audio sensor nodes. Extensive researches have focused on sound detection and source localization, but little work is on the monitoring and recovery of audio stream. To clearly reconstruct the real-time audio stream from WASNs, both the quantity and quality of samples provided by sensor nodes should be carefully considered. In this work, we propose a novel approach termed \"adaptive sampling and diversity reception\", which can significantly reduce the energy consumption of network while maintaining high accuracy of audio stream. On one hand, by selectively picking sampling nodes and adaptively adjusting their sampling rates, sufficient samples arrive at the fusion node for high recovering fidelity. On the other hand, through Maximal-Ratio-Combining(MRC)-like signal fusion scheme at the fusion node, the signal-to-noise ratio (SNR) of combined audio is further improved. Meanwhile, we propose a heuristic algorithm of sampling rate assignment which can select a set of optimal sampling nodes and hence minimize the energy consumption on data transmission. Analytically and experimentally, we show that the proposed scheme can improve the signal recovering fidelity tremendously with low energy cost."}, "conf/icpads/ZhaoMLS10": {"title": "Adaptive Audio Synchronization Scheme Based on Feedback Loop with Local Clock in Wireless Audio Sensor Networks.", "url": "https://doi.org/10.1109/ICPADS.2010.21", "year": "2010", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Wireless Audio Sensor Networks (WASNs) can provide event detection, object tracking and emergency response through cooperative audio sensor nodes. Effective collaboration of audio sensors requires precise synchronization among audio streams. Some researches have been done on the timestamp mechanism based on time synchronization ignoring propagation delay and many other researches have focused on the synchronization of simple gunshot or scream. However, for the synchronization of intermittent and fluctuating audio stream, there still exists many challenges. In this paper, we propose an effective audio synchronization scheme which can synchronize the intermittent audio streams adaptively while maintain low energy cost. On one hand, we obtain audio synchronization without global clock which save energy tremendously. On the other hand, by introducing a feedback loop mechanism, we can keep a high audio synchronization fidelity even when the audio source moves around and the sound strength varies with time. Furthermore, we discuss the extension for flexibility and scalability of this scheme when there exist several sound sources simultaneously or the audio source moves among clusters. Through experiments on a WASNs platform and simulations, we show that the proposed scheme is desirable to guarantee the accuracy of audio synchronization in practical environment with low energy cost."}, "journals/apin/QiSLG22": {"title": "Scratch-Rec: a novel Scratch recommendation approach adapting user preference and programming skill for enhancing learning to program.", "url": "https://doi.org/10.1007/s10489-021-02970-7", "year": "2022", "author": {"Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": "Among teenagers, online programming learning platforms, such as Scratch, have obtained promising achievements for guiding beginners. However, with the ever-growing number of users, there is an urgent issue that learners are confused by the massive amounts of programming resources and cannot find projects that fulfill their tastes and programming skills. To tackle this issue, we propose Scratch-Rec, which is a novel Scratch recommendation model considering programming preferences and programming skills, to help users find suitable programming resources. In Scratch-Rec, we first design a project embedding scheme to convert projects into vectors that preserve source code features and semantic features. Based on the embeddings, we propose a water wave diffusion model to analyze users’ diverse preferences and aggregate their programming preferences along links in a user-project interaction graph. To track the evolving programming skills of users, we advance a programming skill learning model that combines long-short term memory networks (LSTM) with an attention network. LSTM models the time-dependency programming skills while the attention network weighs the importance of projects. Then, users’ programming preferences and programming skills are merged and input to multilayer perceptron neural networks for final probability predictions. Extensive experiments on the Scratch dataset show that Scratch-Rec performs better than other state-of-the-art models in recommending programming projects."}, "journals/ijis/QiWSL22": {"title": "ScratchGAN: Network representation learning for scratch with preference-based generative adversarial nets.", "url": "https://doi.org/10.1002/int.22730", "year": "2022", "author": {"Peng Qi": "59/9474", "Yilei Wang": "37/4826", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ijis/QiSL22": {"title": "Scratch-RL: A preference-driven adversarial reinforcement reasoning framework over knowledge graphs for explainable recommendation of Scratch.", "url": "https://doi.org/10.1002/int.22931", "year": "2022", "author": {"Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/tetc/QiSLG22": {"title": "Scratch-DKG: A Framework for Constructing Scratch Domain Knowledge Graph.", "url": "https://doi.org/10.1109/TETC.2020.2996710", "year": "2022", "author": {"Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:With the rapid development of programming platforms, how to utilize the tremendous amount of data produced by the platforms, such as Scatch, has been a big challenge to researchers. The growing data is not only huge, but also heterogeneous and diverse, leading that the existing tools cannot effectively extract valuable information. In this article, considering particular features of Scratch data, we propose an effective framework about constructing a Scratch Domain Knowledge Graph (Scratch-DKG). Our framework includes four modules which are designed to process the semi-structured data, users profile data, projects data and programming knowledge points, respectively. For webpages, we design a template-based wrapper method to extract triples from the semi-structured data. As for users profile data, we improve DeepDive, which is a useful tool to extract information but with the problem of wrong labeling, to extract knowledge triples by the proposed Secondary Labeling Algorithm. For projects data, we propose an advanced keywords extraction method (S-TextRank) to extract keywords triples. For programming knowledge points, we develop a frequently contiguous block combinations mining algorithm to extract the potential domain information of Scratch. Finally, extensive experiments are carried out to evaluate the performance of our proposed methods. The experimental results show that, compared to other competing methods, our proposal can extract more correct and comprehensive Scratch triples."}, "journals/tetc/ChaiSLG22": {"title": "DWES: A Dynamic Weighted Evaluation System for Scratch based on Computational Thinking.", "url": "https://doi.org/10.1109/TETC.2020.3044588", "year": "2022", "author": {"Xiaolin Chai": "305/2325", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Scratch is a programming environment, which is widely adopted as the first language to enter the programming world. Since Scratch projects are rich in multimedia resources, it can be time-consuming to judge them by hand, requiring manual execution with the understanding of each project. Auto-judgment tools come into being, they can rapidly evaluate the project in some way. Unfortunately, the existing tools are too rigid and they ignore the diversity of Scratch projects. To address this issue, we propose a new dynamic weighted evaluation system (DWES). First, we define a new computational thinking (CT) evaluation criteria from eight aspects. Second, based on the proposed criteria, we present an analysis tool that automatically assesses the CT skills of the learners’ projects. Third, considering the characteristics of projects, we dynamically adjust the evaluation results according to types, so that a single standard is no longer applied roughly to all. This process is data-driven, we consider the CT performance and scripts of projects. We prove the rationality of the evaluation criteria from the aspect of program complexity. Through the correlation analysis between DWES CT scores and experts’ ratings, we find that compared with Dr. Scratch, the correlation coefficient has increased."}, "journals/tnse/RenSLG22": {"title": "A Demand-Driven Incremental Deployment Strategy for Edge Computing in IoT Network.", "url": "https://doi.org/10.1109/TNSE.2021.3120270", "year": "2022", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Edge Computing brings great opportunities to enable the Internet of Things (IoT) vision. But the physical edge server deployment problem still poses a major challenge, which dramatically affects the service ability and service cost of edge computing. Previous work mostly assume that the edge servers are installed at one time. However, due to ever-increasing services, limited budget and evolving techniques, it is more reasonable to deploy edge servers in a gradual fashion. In this paper, we propose a demand-driven incremental deployment strategy (DDID) to resolve this problem. First, a novel demand model is designed to quantify the rigid and non-rigid demand of IoT services for edge computing. Then, we formulate the edge server multi-period deployment problem as a bi-level integer linear program model. The lower-level placement is to minimize the overall deployment cost throughout a planning horizon. We adopt a subgradient optimization with Lagrangian dual to solve this subproblem. In the upper-level allocation, due to the capacity limitation, we adopt a best-effort tuning scheme to prioritize the high demand services with multiple objectives. This subproblem is addressed by an improved MOEA/D (Multi-objective Evolutionary Algorithm Based on Decomposition). Finally, we evaluate the DDID in synthetic topologies. Experimental results show that, compared to the one-time deployment method, it reduces the deployment cost by 18% on average with acceptable service ability loss for edge computing."}, "journals/iotj/YangLSZG21": {"title": "Coalitional Game-Based Cooperative Computation Offloading in MEC for Reusable Tasks.", "url": "https://doi.org/10.1109/JIOT.2021.3064186", "year": "2021", "author": {"Xuemei Yang": "82/1133", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Junwei Zou": "48/8378", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Mobile-edge computing (MEC) has been a promising solution for Internet-of-Things (IoT) applications to obtain latency reduction and energy savings. In view of the loosely coupled application, multiple devices can use the same task code and different input parameters to obtain diverse results. This motivates us to study the cooperation between devices for eliminating the repeated data transmission. Leveraging coalitional game theory, we formalize the cooperative offloading process of a reusable task into a coalitional game to maximize the cost savings. In particular, we first propose an efficient coalitional game-based cooperative offloading (CGCO) algorithm for the single-task model, and then expand it into a CGCO-M algorithm for the multiple-task model with jointly applying a two-stage flow shop scheduling approach, which helps to obtain an optimal task schedule. It is proved that our CGCO and CGCO-M can achieve the Nash-stable solution with convergence guarantee, and CGCO can obtain an optimal solution. The simulations show that CGCO is equal to the optimal exhaustive search (ES) method and CGCO-M is close to ES in terms of cost ratios. Cost ratios of CGCO and CGCO-M are significantly down by 41.08% and 83.70% compared to local executions, respectively. Meanwhile, CGCO-M obtains 41.46% and 89.74% reductions when reuse factors are 0.1 and 1, which means CGCO-M can save more cost with higher reuse density."}, "journals/tnsm/RenSLG21": {"title": "SILedger: A Blockchain and ABE-based Access Control for Applications in SDN-IoT Networks.", "url": "https://doi.org/10.1109/TNSM.2021.3093002", "year": "2021", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:The Software Defined Network in Internet of Things (SDN-IoT) is enjoying growing popularity due to its flexibility, automaticity and programmability. However, there is still a lack of proper permission management on SDN-IoT applications (SIApps), especially when the SIApp’s required northbound interfaces are located in multiple heterogeneous controllers without mutual trust. Existing access control methods are usually based on centralized models, proprietary controllers, trusting conditions or manual operations. It can incur unnecessary performance degradation and poor scalability. To solve this problem, this paper proposes a SIApps’ ledger (SILedger), an open, trusted, and decentralized access control mechanism based on blockchain and attribute-based encryption (ABE). It can not only support effective authorization of SIApps in heterogeneous and untrusted SDN-IoT control domains, but also record all interactions between SIApps and resources, and thus facilitate SIApps further charging, analysis and audit. The main idea is that the SIApps are authorized using access tokens encrypted by ABE, and these tokens are seen as the currency of blockchain to be distributed. Specifically, we re-design blockchain transaction, token encryption, token initialization and token update schemes to achieve cross-domain, fine-grained and flexible SIApps’ permission management. In order to mitigate the delay and complexity problem of blockchain and ABE, we devise an access control framework that separates authorization from call process of SIApps. Finally, we perform security analysis and implement a FISCO-BCOS-based prototype for SILedger. The experimental results show that it can provide effective access control for SIApps with negligible overheads."}, "journals/sensors/WeiLS20": {"title": "Mobility-Aware Service Caching in Mobile Edge Computing for Internet of Things.", "url": "https://doi.org/10.3390/s20030610", "year": "2020", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": ""}, "journals/sj/WeiLSO20": {"title": "Cache-Aware Computation Offloading in IoT Systems.", "url": "https://doi.org/10.1109/JSYST.2019.2903293", "year": "2020", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:In the Internet of Things (IoT) environment, due to the limited computing power of terminal equipment, edge-cloud computing is a good solution for sharing the computation resources. Terminals can offload partial computations to the edge servers for energy saving and reduce the data transmission delays since the edge servers are usually deployed near the terminal devices. However, in the existing solutions, there is still a lot of unnecessary data transmission when the data used in the offloading jobs of several terminals are related. Adding a shareable cache to the edge server and allowing different computing jobs to share the related data can further reduce the data transmission cost and job delay. In this paper, we study the computation offloading method with cached data and propose a novel cache-aware computation offloading strategy for edge-cloud computing in IoT. First, we formulize the cache-aware computation offloading location problem, our goal is to minimize the equivalent weighted response time of all jobs with computing power and cache capacity constraints. Then, we derive the global optimum solution based on transforming the problem to the transportation problem. Next, since the terminal device is difficult to obtain global status information, we propose an online computation offloading strategy, which is convenient in practical deployment. Finally, experiments show that our online offloading strategy approximates the global optimal solution and it reduces the weighted response time by about 26.13% on average compared to other competing algorithms."}, "journals/access/SunLS19": {"title": "Data Hiding for Ensuring the Quality of the Host Image and the Security of the Message.", "url": "https://doi.org/10.1109/ACCESS.2019.2907530", "year": "2019", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Concealing a message in the APPn markers of a JPEG image not only protects the security of the message but also induces no change to the quality of the image. However, from the existing literature, whether it is a plaintext message or a ciphertext message hidden in APPn, it is easy for an attacker to identify the confidentiality of the hidden message, which is not conducive to the security of the message. Inspired by the natural language processing (NLP) and format-preserving encryption (FPE), this paper proposes a data hiding method, which is focused on the quality assurance of the host image and the concealment of the plain text having complete semantics based on the NLP and FPE. This method first uses the NLP and FPE to identify and encrypt the sensitive words in the plain text and then hides the ciphertext text with the plaintext style in the APPn of a JPEG image after replacing the plaintext words with the ciphertext words that have the plaintext style. The experimental results confirm that the structure, size, and quality of the host image do not show any changes before or after the data hiding and the recovered host image is also identical to its original appearance. In addition, the strategy that the semantic similarity is regulated autonomously by the user also makes it possible to obtain the ideal ciphertext words with very low similarity. Moreover, more than 80% of the ciphertext texts have reasonable semantics. Compared with the existing literature, our algorithm has a better performance."}, "journals/access/SunLS19a": {"title": "Progressive Image Restoration Based on CP-ABE With Constant-Size Ciphertext and Constant Bilinear Calculation.", "url": "https://doi.org/10.1109/ACCESS.2019.2952640", "year": "2019", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Sharing photos on an open social platform with one-to-many features increases the leakage risk of information of the shared photos. Ciphertext-policy attribute-based encryption (CP-ABE) is a one-to-many public key cryptosystem, and its access policy can be set by data owners. Therefore, if we share the protected image on the social platform and encrypt the restoration parameters of the shared image with CP-ABE, then only the accessor whose attribute set satisfies the access policy of CP-ABE can decrypt the ciphertext corresponding to his/her attribute level and then restore the image with the corresponding sharpness level. Consequently, image information protection is realized in a one-to-many scenario. However, for the existing CP-ABE, only when further shortening its ciphertext, reducing the number of bilinear pairing calculations during decryption, and ensuring flexible access policies is it beneficial for CP-ABE to be widely used in popular smart terminals that can run social software. Furthermore, existing algorithms for restoring images also have room for improvement in terms of time and space requirements. For this reason, we propose a progressive image restoration strategy based on the improved CP-ABE in this paper. For the improvement of CP-ABE, we design a new encryption scheme to achieve a shorter constant-size ciphertext, construct an auxiliary function to help the independent authority centers generate private keys for users in new ways, design a decryption algorithm with only one bilinear pairing calculation, and provide the update algorithms for attribute revocation. Subsequently, we build a distributed CP-ABE based on our improved CP-ABE, and the correctness and security of the proposed CP-ABE algorithm are also proven. In addition, we follow the tree access policy to support the access policy, including AND, OR, NOT and threshold operations simultaneously, to adapt to the requirement of some user attributes that undergo frequent changes. Moreover, b..."}, "journals/iotj/RenSLG19": {"title": "BLLC: A Batch-Level Update Mechanism With Low Cost for SDN-IoT Networks.", "url": "https://doi.org/10.1109/JIOT.2018.2868708", "year": "2019", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Software defined networks have been a driving force of the Internet of Things (IoT) advancement in the devices management and network control. One of the important challenges remaining to be resolved is how to safely complete the network update with low resources' consumption. In this paper, we propose a new batch-level update mechanism with low cost (BLLC) to solve this problem. Its main idea is to bundle control commands and update networks from the destination to the source of new flows. Specifically, we first build update trees for all new flows according to the network states and consistency properties. Then, the new rules in an update tree are packaged into a single control packet (UBCP). Furthermore, a virtual destination-based algorithm is devised to minimize the number of finally formed UBCPs. The generated UBCPs will successively pass all IoT nodes to be updated, and instruct them to apply the required operations. If the control channel is wireless, we introduce a cooperative transmission mechanism to enhance the reliability of the UBCPs' forwarding. Finally, we evaluate our scheme by comprehensive experiments. The results show that the BLLC reduces the link cost by 68% on the average with a slight performance loss in the update time."}, "journals/iotj/RenSLG19a": {"title": "A Novel Control Plane Optimization Strategy for Important Nodes in SDN-IoT Networks.", "url": "https://doi.org/10.1109/JIOT.2018.2888504", "year": "2019", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:One of the crucial technologies for future Internet of Things (IoT) is software defined networks, which provides a centralized and programmable control ability for operators. However, the current single control plane deployed on the remote IoT gateway may incur a bottleneck with the continuous growth of IoT devices and applications. In this paper, we propose a two-level hierarchy (the master and slave) control framework to resolve this problem. Additionally, a novel slave controller placement strategy (SCPS) is presented to further optimize the control performance. In SCPS, we first design a synthetic IoT node importance assessment model based on an improved analytic hierarchy process and fuzzy integral. It considers the device attributes, service attributes, and control frequency. Then we formulate the slave controller placement as a binary integer program problem. It is solved by a modified binary particle swarm optimization algorithm to optimize the control delay and control cost of critical IoT nodes. Finally, we carry out extensive experiments to evaluate the performance of our strategy. The results show that, compared to other competing methods, it approximately reduces the control delay of important IoT nodes by 30.56%."}, "journals/sj/RenSLO19": {"title": "A New Scheme for IoT Service Function Chains Orchestration in SDN-IoT Network Systems.", "url": "https://doi.org/10.1109/JSYST.2019.2921786", "year": "2019", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:With the rapid development of novel techniques like software-defined networks and network function virtualization, the newer concept-service function chains (SFCs)-can be applied in the Internet of Things (IoT) to promote its further advancements. However, due to the unique characteristics and requirements of the IoT, the current optimization methods cannot be directly used to implement IoT service function chains (IoTSFCs). In this paper, we present a novel orchestration scheme to resolve this problem. It contains two steps: compose and place IoTSFCs. In the composition stage, a multicriterion-based arrangement algorithm is designed to determine the order of involved IoT network functions. Moreover, we modify a traditional SFC definition language to describe the composed IoTSFCs. In the placement stage, we formulate this subproblem as a mixed-integer linear programming model. Then, a genetic-algorithm-based heuristic method and a tradeoff mechanism are used to solve it. Finally, we conduct extensive numerical simulations to evaluate the performance of the proposed scheme. The results show that it can approximately reduce the control latency by 50% and the bandwidth consumption by 40% on average."}, "journals/ahswn/SunLSO18": {"title": "Reversible Image Mosaic Technology Providing Large Protection Size and High Image Quality.", "url": "https://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-42-number-3-4-2018/ahswn-42-3-4-p-259-293/", "year": "2018", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": ""}, "journals/tjs/LiWLLO17": {"title": "Constructing data supply chain based on layered PROV.", "url": "https://doi.org/10.1007/s11227-016-1838-0", "year": "2017", "author": {"Peng Li": "83/6353", "Tin-Yu Wu": "44/3992", "Xinming Li": "145/0602", "Hong Luo 0001": "67/876-1", "Mohammad S. Obaidat": "91/2882"}, "abstract": "The inability to effectively construct data supply chain in distributed environments is becoming one of the top concerns in big data area. Aiming at this problem, a novel method of constructing data supply chain based on layered PROV is proposed. First, to abstractly describe the data transfer processes from creation to distribution, a data provenance specification presented by W3C is used to standardize the information records of data activities within and across data platforms. Then, a distributed PROV data generation algorithm for multi-platform is designed. Further, we propose a tiered storage management of provenance based on summarization technology, which reduces the provenance records by compressing mid versions so as to realize multi-level management of PROV. In specific, we propose a hierarchical visual technique based on a layered query mechanism, which allows users to visualize data supply chain from general to detail. The experimental results show that the proposed approach can effectively improve the construction performance for data supply chain."}, "journals/wicomm/GuoSLG16": {"title": "Accurate indoor localization based on crowd sensing.", "url": "https://doi.org/10.1002/wcm.2733", "year": "2016", "author": {"Yingying Guo": "51/7390", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Nadra Guizani": "144/7266"}, "abstract": ""}, "journals/thms/SunWLL15": {"title": "Conflict Detection Scheme Based on Formal Rule Model for Smart Building Systems.", "url": "https://doi.org/10.1109/THMS.2014.2364613", "year": "2015", "author": {"Yan Sun 0004": "181/2323-4", "Xukai Wang": "160/1881", "Hong Luo 0001": "67/876-1", "Xiang-Yang Li 0001": "l/XiangYangLi"}, "abstract": " Abstract:Smart building systems can provide flexible and configurational sensing and controlling operations according to users' requirements. As the number and the complexity of service rules customized by users have significantly increased, there is an increasing danger of conflict during the interaction process between users and the system. To address this issue, we propose a new rule conflict detection scheme tailored for the smart building system. First, we present a formal rule model UTEA based on User, Triggers, Environment entities, and Actuators. This model can handle not only controlled devices with discrete status but also real-valued environmental data such as temperature and humidity. In addition, this model takes multiple users with different authorities into account. Second, we define 11 rule relations and further classify conflicts into five categories. Third, we implement a rule storage system for detecting conflicts and design a conflict detection algorithm, which can detect the conflict between two rules as well as cycle conflict/multicross contradiction among multiple rules. We evaluated our scheme in a real smart building system with more than 30 000 service rules. The experiment results show that our scheme improves the performance in terms of error/missed-detection rates and running time."}, "journals/ahswn/SunTL14": {"title": "Advanced Gateway Based on FPGA for Smart Home.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-22-number-1-2-2014/ahswn-22-1-2-p-135-156/", "year": "2014", "author": {"Yan Sun 0004": "181/2323-4", "Shaoju Tang": "159/2447", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ahswn/ZhaoMSL14": {"title": "A Distributed Audio Synchronization Scheme for Wireless Audio Sensor Networks.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-22-number-3-4-2014/ahswn-22-3-4-p-231-257/", "year": "2014", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ahswn/ZhaoMSL13": {"title": "A Distributed Audio Synchronization Scheme for Wireless Audio Sensor Networks.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-19-number-3-4-2013/ahswn-19-3-4-p-213-239/", "year": "2013", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ijdsn/SunCL13": {"title": "Adaptive Scheduling and Routing Scheme for Delay Guarantee in Wireless Sensor Networks.", "url": "https://doi.org/10.1155/2013/801758", "year": "2013", "author": {"Yan Sun 0004": "181/2323-4", "Cong Chen": "81/3425", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ijdsn/ZhaoMSL12": {"title": "Design and Implementation of Enhanced Surveillance Platform with Low-Power Wireless Audio Sensor Network.", "url": "https://doi.org/10.1155/2012/854325", "year": "2012", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/tdsc/SunLD12": {"title": "A Trust-Based Framework for Fault-Tolerant Data Aggregation in Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.1109/TDSC.2012.68", "year": "2012", "author": {"Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:For wireless multimedia sensor networks (WMSNs) deployed in noisy and unattended environments, it is necessary to establish a comprehensive framework that protects the accuracy of the gathered multimedia information. In this paper, we jointly consider data aggregation, information trust, and fault tolerance to enhance the correctness and trustworthiness of collected information. Based on the multilayer aggregation architecture of WMSNs, we design a trust-based framework for data aggregation with fault tolerance with a goal to reduce the impact of erroneous data and provide measurable trustworthiness for aggregated results. By extracting statistical characteristics from different sources and extending Josang's trust model, we propose how to compute self-data trust opinion, peer node trust opinion, and peer data trust opinion. According to the trust transfer and trust combination rules designed in our framework, we derive the trust opinion of the sink node on the final aggregated result. In particular, this framework can evaluate both discrete data and continuous media streams in WMSNs through a uniform mechanism. Results obtained from both simulation study and experiments on a real WMSN testbed demonstrate the validity and efficiency of our framework, which can significantly improve the quality of multimedia information as well as more precisely evaluate the trustworthiness of collected information."}, "journals/tpds/LuoTMD11": {"title": "Data Fusion with Desired Reliability in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/TPDS.2010.93", "year": "2011", "author": {"Hong Luo 0001": "67/876-1", "Huixiang Tao": "17/9914", "Huadong Ma": "04/6217", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:Energy-efficient and reliable transmission of sensory information is a key problem in wireless sensor networks. To save more energy, in-network processing such as data fusion is a widely used technique, which, however, may often lead to unbalanced information among nodes in the data fusion tree. Traditional schemes aim at providing reliable transmission to individual data packets from source node to the sink, but seldom offer the desired reliability to a data fusion tree. In this paper, we explore the problem of Minimum Energy Reliable Information Gathering (MERIG) when performing data fusion. By adaptively using redundant transmission on fusion routes without acknowledgments, packets with more information are delivered with higher reliability. For different data fusion topologies, such as star, chain, and tree, we provide optimal solutions to compute the number of transmissions for each node. We also propose practical, distributed approximation algorithms for chain and tree topologies. Analytical proofs and simulation results show that energy-efficient information reliability can be guaranteed in an unreliable wireless environment with the help of our proposed schemes."}, "journals/tmc/LuoLD09": {"title": "Distributed Algorithm for En Route Aggregation Decision in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/TMC.2008.82", "year": "2009", "author": {"Hong Luo 0001": "67/876-1", "Yonghe Liu": "43/5082", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:In sensor networks, en route aggregation decision regarding where and when aggregation shall be performed along the routes has been explicitly or implicitly studied extensively. However, existing solutions have omitted one key dimension in the optimization space, namely, the aggregation cost. In this paper, focusing on optimizing over both transmission and aggregation costs, we develop an online algorithm capable of dynamically adjusting the route structure when sensor nodes join or leave the network. Furthermore, by only performing such reconstructions locally and maximally preserving existing routing structure, we show that the online algorithm can be readily implemented in real networks in a distributed manner requiring only localized information. Analytically and experimentally, we show that the online algorithm promises extremely small performance deviation from the offline version, which has already been shown to outperform other routing schemes with static aggregation decision."}, "journals/network/LuoLD07": {"title": "Routing Correlated Data in Wireless Sensor Networks: A Survey.", "url": "https://doi.org/10.1109/MNET.2007.4395109", "year": "2007", "author": {"Hong Luo 0001": "67/876-1", "Yonghe Liu": "43/5082", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:Sensory data gathered from sensor nodes in physical proximity tend to exhibit strong correlation. To minimize such redundancy and hence curtail the load in wireless sensor networks with a goal to conserve energy, effective in-network fusion schemes have been extensively proposed in the literature. To this end, routing schemes supporting data fusion are extremely important as they dictate where and when sensory data streams shall intersect with each other and thus fusion will be performed. In this article we briefly articulate this problem and classify recently proposed routing schemes supporting data fusion in wireless sensor networks into three categories: routing-driven, coding-driven, and fusion-driven. We also give an overview of various algorithms in each category by summarizing their design approaches, benefits, and drawbacks."}, "journals/tc/LuoLLD06": {"title": "Adaptive Data Fusion for Energy Efficient Routing in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/TC.2006.157", "year": "2006", "author": {"Hong Luo 0001": "67/876-1", "Jun Luo": "42/2501", "Yonghe Liu": "43/5082", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:While in-network data fusion can reduce data redundancy and, hence, curtail network load, the fusion process itself may introduce significant energy consumption for emerging wireless sensor networks with vectorial data and/or security requirements. Therefore, fusion-driven routing protocols for sensor networks cannot optimize over communication cost only—fusion cost must also be accounted for. In our prior work [2], while a randomized algorithm termed MFST is devised toward this end, it assumes that fusion shall be performed at any intersection node whenever data streams encounter. In this paper, we design a novel routing algorithm, called Adaptive Fusion Steiner Tree (AFST), for energy efficient data gathering. Not only does AFST jointly optimize over the costs for both data transmission and fusion, but also AFST evaluates the benefit and cost of data fusion along information routes and adaptively adjusts whether fusion shall be performed at a particular node. Analytically and experimentally, we show that AFST achieves better performance than existing algorithms, including SLT, SPT, and MFST."}, "journals/tmc/LuoLD06": {"title": "Routing Correlated Data with Fusion Cost in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/TMC.2006.171", "year": "2006", "author": {"Hong Luo 0001": "67/876-1", "Yonghe Liu": "43/5082", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:In this paper, we propose a routing algorithm called Minimum Fusion Steiner Tree (MFST) for energy efficient data gathering with aggregation (fusion) in wireless sensor networks. Different from existing schemes, MFST not only optimizes over the data transmission cost, but also incorporates the cost for data fusion, which can be significant for emerging sensor networks with vectorial data and/or security requirements. By employing a randomized algorithm that allows fusion points to be chosen according to the nodes' data amounts, MFST achieves an approximation ratio of {\\frac{5}{4}}\\log(k+1), where k denotes the number of source nodes, to the optimal solution for extremely general system setups, provided that fusion cost and data aggregation are nondecreasing against the total input data. Consequently, in contrast to algorithms that only excel in full or nonaggregation scenarios without considering fusion cost, MFST can thrive in a wide range of applications."}}}