{"id": "15/6060-1", "name": "Hongbo Wang 0001", "Article": {"conf/icccsec/FengLDW19": {"title": "Research on Pedestrian Attribute Recognition Based on Semantic Segmentation in Natural Scene.", "url": "https://doi.org/10.1007/978-3-030-24268-8_46", "year": "2019", "author": {"Xin Feng": "30/5155", "Yangyang Li": "32/1000", "Haomin Du": "245/1591", "Hongbo Wang 0001": "15/6060-1"}, "abstract": "Smart city is a new term given to society by technology, and cameras are important infrastructure for building a smart city. How to use camera information efficiently and effectively plays an important role in people’s daily life and maintain social order. Pedestrian information accounts for a large proportion of camera information, so we hope to make good use of pedestrian information. Previous works use traditional machine learning methods and neural network to identify pedestrian attributes, mainly judge the existence of pedestrian attributes in natural scenes. However, it’s not enough to judge whether an attribute exist or not, getting the position of an attribute often gives you more information. In this paper, we propose to use semantic segmentation to obtain the position information of pedestrian attributes. We first propose pedestrian attribute semantic dataset in natural scene called PASD (Pedestrian attribute semantic dataset), which select 27 visualized pedestrian attributes. Deeplabv3+ is used to perform experiments on PASD, which obtain the mIoU (mean intersection over union) baseline of 27 pedestrian attributes. For getting useful conclusion, we conduct data analysis about mIoU from three aspects: attribute distribution, accuracy and resolution.KeywordsPedestrian attributeLocation informationSemantic segmentation"}, "conf/iiki/ZhaoFCWYW17": {"title": "A multi-dimensional hierarchical performance evaluation model for edge cloud platform.", "url": "https://doi.org/10.1016/j.procs.2018.03.013", "year": "2017", "author": {"Yue Zhao 0022": "48/76-22", "Xin Feng": "30/5155", "Na Chen 0007": "69/3895-7", "Yaoguang Wang": "64/1402", "Yijun Yu": "74/6710", "Hongbo Wang 0001": "15/6060-1"}, "abstract": ""}, "conf/icnc/YueWWDC16": {"title": "A comprehensive data-driven approach to evaluating quality of experience on large-scale internet video service.", "url": "https://doi.org/10.1109/FSKD.2016.7603395", "year": "2016", "author": {"Ting Yue": "94/8028", "Anming Wei": "160/6217", "Hongbo Wang 0001": "15/6060-1", "Xiang-Dong Deng": "187/9493", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Internet video is currently one of the most popular Internet services, accounting for more than 50% of the overall Internet traffic. Various access patterns of users worldwide contribute to increasing complex scenarios of Internet video. Under the circumstances, there emerges a valuable yet challenging topic that industry and academia keep focusing on: how to evaluate quality of experience (QoE) of Internet video in the wild? In this paper, we propose a comprehensive data-driven approach to evaluate QoE based on massive dataset extracted from a large-scale Internet video service provider. With the methods of feature engineering and fuzzy theory, we exploit user's situational features and session's quality features. Then we conceive an appropriate QoE evaluating model called bagging-based Bayesian factorization machine to correlate the aforementioned features with user's QoE. The experimental results demonstrate that our approach is adaptive for QoE evaluation on Internet video both in efficiency and effectiveness. Moreover, our approach achieves higher degree of accuracy compared with baseline methods, including what associated works present."}, "conf/smartcity/WangW15": {"title": "SP-TCP: Scheduling Perceived TCP in Virtualized Datacenters.", "url": "https://doi.org/10.1109/SmartCity.2015.91", "year": "2015", "author": {"Jianjian Wang": "130/0337", "Hongbo Wang 0001": "15/6060-1"}, "abstract": " Abstract:Virtualization technology has played an increasingly important role in modern datacenters and cloud computing. With the rapid development of hardware, the capability of single physical server has become more and more powerful. So it has been a trend that deploying multiple VMs (Virtual Machines) on a single physical host, which is so called virtual machine consolidation. High degree of VM consolidation will likely make VMs experience a long scheduling delay, which would in turn affect the standard TCP round-trip time(RTT) measurement and further more lead to TCP RTO(Retransmission Timeout), a symbol of network congestion. In this paper, we present the design, implementation, and evaluation of SP-TCP, a Scheduling Perceived TCP. SP-TCP will detect the schedule event and notify all those related VMs, including senders and receivers. Our evaluation of a SP-TCP prototype on Xen shows that SP-TCP has a better performance than standard TCP."}, "conf/cse/ZhangYWW14": {"title": "Predicting the Quality of Experience for Internet Video with Fuzzy Decision Tree.", "url": "https://doi.org/10.1109/CSE.2014.230", "year": "2014", "author": {"Yuran Zhang": "160/6150", "Ting Yue": "94/8028", "Hongbo Wang 0001": "15/6060-1", "Anming Wei": "160/6217"}, "abstract": " Abstract:In this paper, we attempt to predict users' quality of experience (QoE) with the log data collected from the web sites of Internet video service providers. To this end, we first collect service log data in the wild from one of the Top 5 most popular providers in China. Then we do a series of data preprocessing to format the original semi-structured log data to structured. We calculate several key video quality metrics, such as join time and frame rate, and explore the distributions of each quality metric, as well as the relationship between individual quality metric and user engagement. Considering that user engagement may be a result of comprehensive effect of several metrics, we apply fuzzy decision tree (FDT), a kind of classification algorithms in the area of machine learning, to develop the predictive model of user QoE for Internet video. Finally, we compare the prediction accuracy of our model with the model developed using decision tree on several different datasets. Our model separately achieves about 20% and 10% improvement in prediction accuracy on the dataset of sessions with the same content type and the dataset of sessions with mobile access devices."}, "conf/ccgrid/LiWDLC13": {"title": "Operating Cost Reduction for Distributed Internet Data Centers.", "url": "https://doi.org/10.1109/CCGrid.2013.106", "year": "2013", "author": {"Yangyang Li": "32/1000", "Hongbo Wang 0001": "15/6060-1", "Jiankang Dong": "86/7607", "Junbo Li": "74/8487", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:In order to provide low latency, pay-as-you-go infrastructure, Cloud service provider has built a large number of geo-distributed data centers. Nowadays, energy cost has become increasingly important fraction of data center operating cost. Researchers' attentions are attracted to propose many methods to reduce the electricity cost for data centers. However, another significant operating cost, Internet bandwidth cost, has been neglected. Because both the electricity prices and bandwidth prices are varied with time and regions, it is not easy to minimize the operating cost while response to workload timely. As a solution, based on Lyapunov optimization framework, we propose an online control policy to achieve close-to-optimal performance with tradeoff between cost and delay. The advantage of our solution is that we do not need any future knowledge on the stochastic model (e.g., bandwidth prices and electricity prices). The results from our simulations on real workload trace and price data demonstrated that our solution is effective."}, "conf/ccgrid/DongJWLZC13": {"title": "Energy-Saving Virtual Machine Placement in Cloud Data Centers.", "url": "https://doi.org/10.1109/CCGrid.2013.107", "year": "2013", "author": {"Jiankang Dong": "86/7607", "Xing Jin": "02/2442", "Hongbo Wang 0001": "15/6060-1", "Yangyang Li": "32/1000", "Peng Zhang": "21/1048", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:In cloud data centers, different mapping relationships between virtual machines (VMs) and physical machines (PMs) cause different resource utilization, therefore, how to place VMs on PMs to improve resource utilization and reduce energy consumption is one of the major concerns for cloud providers. The existing VM placement schemes are to optimize physical server resources utilization or network resources utilization, but few of them focuses on optimizing multiple resources utilization simultaneously. To address the issue, this paper proposes a VM placement scheme meeting multiple resource constraints, such as the physical server size (CPU, memory, storage, bandwidth, etc.) and network link capacity to improve resource utilization and reduce both the number of active physical servers and network elements so as to finally reduce energy consumption. Since VM placement problem is abstracted as a combination of bin packing problem and quadratic assignment problem, which is also known as a classic combinatorial optimization and NP-hard problem, we design a novel greedy algorithm by combining minimum cut with the best-fit, and the simulations show that our solution achieves better results."}, "conf/hpcc/JinWWCL13": {"title": "A Partners Assisted Virtual Machine Live Storage Migration for Intensive Disk I/O Workloads.", "url": "https://doi.org/10.1109/HPCC.and.EUC.2013.240", "year": "2013", "author": {"Xing Jin": "02/2442", "Hongbo Wang 0001": "15/6060-1", "Jianjian Wang": "130/0337", "Shiduan Cheng": "35/3871", "Jihan Li": "147/1361"}, "abstract": " Abstract:Live migration of virtual machine (VM) enables mobility of VM and contributes to advantages of virtualization like energy saving, high availability, fault tolerance and work load balancing. However solutions of VMs' migration in both theoretical and industrial areas concentrate more on memory migration other than storage migration. Lots of applications with intensive disk I/O operations rely on local storage, especially when it comes to high performance computing. Migration of shared storage is also of necessity for consolidation and workload balance. Current approaches on storage migration can hardly work effectively in disk I/O intensive environment. They cannot reduce migration time and guarantee the disk I/O performance of VMs at the same time. This paper proposes an approach called Partners Assisted Storage Migration (PASM). We are the first to utilize disk I/O ability of pre-allocated storage nodes to relieve the competition between VMs' intensive disk I/O and storage migration. It can migrate VMs' storage effectively comparing to current methods: post-copy and write-mirror. Experiments including single VM's migration and multiple VMs' migration show that PASM can save 78.9% migration time and achieve additional 27.1% in disk I/O performance over existing methods."}, "conf/icdcsw/ZhangWLDLC13": {"title": "SmartShuffle: Managing Online Virtual Machine Shuffle in Virtualized Data Centers.", "url": "https://doi.org/10.1109/ICDCSW.2013.51", "year": "2013", "author": {"Peng Zhang": "21/1048", "Hongbo Wang 0001": "15/6060-1", "Junbo Li": "74/8487", "Jiankang Dong": "86/7607", "Yangyang Li": "32/1000", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Virtual machine (VM) live migration provides spatial flexibility by rearranging VM placement (i.e., VM shuffle) in several scenarios, including server consolidation, power consumption saving, fault tolerance, QoS management and network congestion resolving. However, VM live migration would consume scarce bandwidth and even cause network congestion. Since the bandwidth used by VM migration is usually the same as the services running in the VM, migration traffic would dominate network path and affect other application traffic as the traffic of a VM migration is usually several GBs. It gets worse in VM shuffle where plenty of VMs are needed to be moved. In this paper, we explore the opportunity to manage online VM shuffle and minimize the impact to data center networks. An efficient online VM shuffle scheduling method named SmartShuffle is presented. SmartShuffle tries to minimize the VM shuffle duration by coordinating VM migration in a proper scheduling order. VMs benefiting others maximally are migrated preferentially. We employ the simulated annealing algorithm to search for a solution for SmartShuffle. Our evaluation shows that SmartShuffle decreases the shuffle duration dramatically."}, "conf/icdcsw/DongWJLZC13": {"title": "Virtual Machine Placement for Improving Energy Efficiency and Network Performance in IaaS Cloud.", "url": "https://doi.org/10.1109/ICDCSW.2013.48", "year": "2013", "author": {"Jiankang Dong": "86/7607", "Hongbo Wang 0001": "15/6060-1", "Xing Jin": "02/2442", "Yangyang Li": "32/1000", "Peng Zhang": "21/1048", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Under the premise of ensuring application performance, how to place virtual machines (VMs) on physical machines (PMs) to improve resource utilization and reduce energy consumption is one of the major concerns for cloud providers in IaaS cloud. The existing VM placement schemes are mostly to reduce energy consumption by optimizing utilization of physical server or network elements, but the issue of aggressive consolidation of VM is ignored, which may lead to network performance degradation. To address the issue, this paper proposes a VM placement scheme based on a new two-stage heuristic algorithm to optimize network performance and to reduce energy consumption of physical servers and network elements, so as to finally achieve the tradeoff between energy efficiency and network performance. The simulations show that our solution achieves good results."}, "conf/cluster/LiWZDC12": {"title": "D4D: Inter-datacenter Bulk Transfers with ISP Friendliness.", "url": "https://doi.org/10.1109/CLUSTER.2012.44", "year": "2012", "author": {"Yangyang Li": "32/1000", "Hongbo Wang 0001": "15/6060-1", "Peng Zhang": "21/1048", "Jiankang Dong": "86/7607", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Cloud infrastructure providers (CIPs) usually build a large number of geo-distributed data centers to cater to the recent proliferation of Cloud Computing. The CIPs commonly use multiple internet service providers (ISPs) to interconnect their geo-distributed data centers. Diurnal patterns and leftover bandwidth were effectively exploited by past studies to improve bandwidth utilization and minimize cost on inter-data center traffic. However, the growing number of inter-domain traffic was neglected. Inter-domain communications may become the potential bottleneck of inter-data center bulk transfers. Moreover, the rising inter-domain traffic increases the ISP operational cost, which will be not beneficial to reduce the CIPs' bandwidth cost or improve the quality of services over a long run. In this paper, we present a scheduling scheme that considers both bandwidth utilization and ISPs friendliness via a store-and-forward mechanism. The problem is modeled on a time-expanded graph. We compared our scheme with general bulk transfers mechanism under several different simulation settings. The results demonstrate that our strategy reduces the inter-domain traffic tremendously and achieves the ISP-friendliness significantly."}, "conf/cluster/MaWDLC12": {"title": "ME2: Efficient Live Migration of Virtual Machine with Memory Exploration and Encoding.", "url": "https://doi.org/10.1109/CLUSTER.2012.52", "year": "2012", "author": {"Yanqing Ma": "121/1531", "Hongbo Wang 0001": "15/6060-1", "Jiankang Dong": "86/7607", "Yangyang Li": "32/1000", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Live migration of virtual machine plays an important role in data center, which can successfully migrate virtual machine from one physical machine to another with only slight influence on upper workload. It can be used to facilitate hardware maintenance, load balancing, fault-tolerance and power-saving, especially in cloud computing data centers. Although the pre-copy is the prevailing approach, it cannot distinguish which memory page is used, resulting in transferring large amounts of useless memory pages. This paper presents a novel approach Memory Exploration and Encoding (ME2), which first identifies useful pages and then utilizes Run Length Encode algorithm to quickly encode memory, to efficiently decrease the total transferred data, total migration time and downtime. Experiments demonstrate that ME2 can significantly decrease 50.5% of total transferred data, 48.2% of total time and 47.6% of downtime on average compared with Xen's pre-copy algorithm."}, "conf/cluster/ZhaoWDC12": {"title": "A Reliable and High-Performance Distributed Storage System for P2P-VoD Service.", "url": "https://doi.org/10.1109/CLUSTER.2012.48", "year": "2012", "author": {"Jing Zhao": "69/5882", "Hongbo Wang 0001": "15/6060-1", "Jiankang Dong": "86/7607", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Online video service has become one of the main Internet applications, especially video-on-demand (VoD). Most VoD systems are based on P2P technology currently. As the number of users and media files grows rapidly on demand, the storage capacity of source media files becomes limited. Besides, the system performance and user experience drops obviously when online users do not share the same data. In this paper, we present a reliable and high-performance distributed storage system for P2P-VoD service based on Hadoop Distribute File System (HDFS). The reliability and scalability of the system are proved through experiments. The results also verify that the data response time and server utilizations get improved, which means the system gets a better performance."}, "conf/pdcat/LiWDC12": {"title": "Application Utility-Based Bandwidth Allocation Scheme for Data Center Networks.", "url": "https://doi.org/10.1109/PDCAT.2012.55", "year": "2012", "author": {"Yangyang Li": "32/1000", "Hongbo Wang 0001": "15/6060-1", "Jiankang Dong": "86/7607", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:The key infrastructure of Cloud Computing is data center which is shared by many tenants. Each tenant's application competes for acquiring more network bandwidth in order to maximize its utility. However, this may cause interference among these diverse applications. Malicious competition not only degrades its performance, but also makes the overall performance of the data center poor and ineffective. To ensure the Quality of Services (QoS) and achieve high network utilization, in this paper, we propose a bandwidth allocation scheme for data center networks (DCNs), which is based on an application utility-based model. In our scheme, multi-path feature of DCN is leveraged to improve the network utilization, and utility functions are constructed to differentiate the throughput and delay sensibilities of different applications. Moreover, our scheme is suitable for arbitrary DCN topologies and without modification on current hardware. The numerical simulation shows that our scheme can provide bandwidth guarantee, fine-grained service differentiation and achieve high network utilization."}, "conf/ieeecmc/ZhangWC11": {"title": "Shrinking MTU to Mitigate TCP Incast Throughput Collapse in Data Center Networks.", "url": "https://doi.org/10.1109/CMC.2011.68", "year": "2011", "author": {"Peng Zhang": "21/1048", "Hongbo Wang 0001": "15/6060-1", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:More and more data centers are built using commodity TCP/IP and Ethernet networks because of their low cost and ease-of-use. But TCP would experience catastrophic throughput collapse in a communication pattern, termed \"Incast\", where multiple senders simultaneously send data to a receiver. This phenomenon potentially arises in many typical applications, such as distributed storage, Map Reduce and web search. However, solutions proposed by former research either are not easy to implement or high in cost. In this paper, we present a simple and cost-effective method - shrinking MTU - to mitigate TCP In cast throughput collapse. Through analysis and extensive simulations, decreasing MTU size can delay the onset of In cast."}, "conf/aina/LiuWLC08": {"title": "Modeling and Quantifying the Impact of P2P File Sharing Traffic on Traditional Internet Traffic.", "url": "https://doi.org/10.1109/WAINA.2008.103", "year": "2008", "author": {"Yaning Liu": "99/8280", "Hongbo Wang 0001": "15/6060-1", "Yu Lin": "74/2577", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Peer-to-peer (P2P) applications consume most of Internet bandwidth and cause access network congestion. They severely deteriorate the performance of the traditional Internet applications. Previous researches have studied the mechanisms to improve the aggregate throughput of P2P traffic, but there doesn't exist any research to predict and quantify its impact. In this work, we develop a performance modeling system of P2P file sharing traffic and traditional Internet traffic (Web traffic) to quantify the impact of P2P file sharing traffic on Web traffic in the congested access network. We answer the following questions from a user's point of view: How many P2P concurrent connections and what proportion between P2P traffic and Web traffic will guarantee certain Web performance. The simulation results demonstrate that our model is accurate and efficient."}, "conf/globecom/LiuWLCS08": {"title": "Friendly P2P: Application-Level Congestion Control for Peer-to-Peer Applications.", "url": "https://doi.org/10.1109/GLOCOM.2008.ECP.334", "year": "2008", "author": {"Yaning Liu": "99/8280", "Hongbo Wang 0001": "15/6060-1", "Yu Lin": "74/2577", "Shiduan Cheng": "35/3871", "Gwendal Simon": "16/5928"}, "abstract": ""}, "conf/iccS/WangLJC06": {"title": "Easily-Implemented Adaptive Packet Sampling for High Speed Networks Flow Measurement.", "url": "https://doi.org/10.1007/11758549_17", "year": "2006", "author": {"Hongbo Wang 0001": "15/6060-1", "Yu Lin": "74/2577", "Yuehui Jin": "18/3125", "Shiduan Cheng": "35/3871"}, "abstract": "An Easily-implemented Adaptive Packet Sampling (EAPS) is presented in this paper, which overcomes the shortcoming of NetFlow and Adaptive Netflow. EAPS is easy to be hardware-implemented and scalable for high-speed networks. Additionally, EAPS is automatically adaptive to traffic rate under resource constrains, thus it is convenient to be used by network operators. Experiments are conducted with the real network traces. Results show that EAPS is more accurate than ANF over links with light load or traffic fluctuations."}, "conf/globecom/LinKWCZ04": {"title": "A fuzzy-based algorithm to remove clock skew and reset from one-way delay measurement [Internet end-to-end performance measurement].", "url": "https://doi.org/10.1109/GLOCOM.2004.1378218", "year": "2004", "author": {"Yu Lin": "74/2577", "Geng-Sheng Kuo": "02/5060", "Hongbo Wang 0001": "15/6060-1", "Shiduan Cheng": "35/3871", "Shihong Zou": "16/4301"}, "abstract": " Abstract:Packet one-way delay (OWD) traces are important measurements for analyzing end-to-end performance in the Internet. Due to the fact that the clocks at the end systems are usually not synchronized, the OWD measurements can be quite inaccurate. For the more challenging case with clock resets, i.e., the clocks are reset to some reference times during the measurement period, the OWD measurements can be even worse. We propose a new algorithm to estimate and remove the relative clock skews and clock resets from measurements, based on fuzzy-clustering analysis. Numerical experiments shows that, compared with existing techniques such as linear programming and the convex-hull approach, the new algorithm is more accurate and robust."}, "journals/access/WangDZY20": {"title": "A Comprehensive Overview of Person Re-Identification Approaches.", "url": "https://doi.org/10.1109/ACCESS.2020.2978344", "year": "2020", "author": {"Hongbo Wang 0001": "15/6060-1", "Haomin Du": "245/1591", "Yue Zhao 0022": "48/76-22", "Jiming Yan": "261/8100"}, "abstract": " Abstract:Person re-identification, identifying and tracking pedestrians in cross-domain monitoring systems, is an important technology in the computer vision field and of real significance for the construction of smart cities. With the development of deep learning techniques, especially convolutional neural networks, this technology has received more extensive attention and improvement in recent years and a large number of noteworthy achievements have emerged. This paper provides a comprehensive overview of person re-identification approaches to assist researchers in quickly understand this field with preference as well as to provide a more structured framework. By reviewing more than 300 re-identification related papers, the focus of these studies is summarized as information extraction, metric learning, post-processing, efficiency improvement, labeling cost reduction, and data type expansion. This classification is then organized based on different technologies, and on this basis, the pros and cons of each technology are analyzed. Moreover, this overview summarizes the difficulties and challenges of re-identification and discusses the possible research directions for reference."}, "journals/access/WangYCJW20": {"title": "BSENet: A Data-Driven Spatio-Temporal Representation Learning for Base Station Embedding.", "url": "https://doi.org/10.1109/ACCESS.2020.2980597", "year": "2020", "author": {"Xinyu Wang": "68/1277", "Tan Yang": "155/5723", "Yidong Cui": "03/8966", "Yuehui Jin": "18/3125", "Hongbo Wang 0001": "15/6060-1"}, "abstract": " Abstract:Base station (BS) plays a critical role in the wireless network. There has been some research on exploring the spatio-temporal information of BS in different fields. However, these works lack re-usability, which require the new researcher to re-do the work of representing the spatio-temporal information. To solve this problem, we propose a neural network model based on autoencoder and representation learning called BSENet to learn embedding of BS based on raw data. The embedding contains spatio-temporal information of BS. In this way, other fields that are related to BS can make use of spatio-temporal information with BSENet embeddings. Besides the spatial information, BSENet can maintain the independence of BS. Moreover, we use bi-directional LSTM to get temporal information and propose a time dropout method to improve the generalization ability. We propose a soft threshold to consider all spatial relations. In addition, we introduce weight to enhance compatibility. We treat the missing states as the inputs to deal with the missing values. The results of clustering show that BSENet embedding is better than other embeddings. In experiments of mobile traffic prediction, BSENet embedding helps a temporal model to improve the Mean Squared Error (MSE) from 0.01463 to 0.01334, which is similar to 0.01302 of a spatio-temporal model. At the same time, the training time increases a little but is still 5.0times5.0 times faster than spatio-temporal model."}, "journals/ijon/YueWCS20": {"title": "Deep learning based QoE evaluation for internet video.", "url": "https://doi.org/10.1016/j.neucom.2019.12.082", "year": "2020", "author": {"Ting Yue": "94/8028", "Hongbo Wang 0001": "15/6060-1", "Shiduan Cheng": "35/3871", "Jie Shao": "02/5139"}, "abstract": "The issue of quality of experience (QoE) evaluation in Internet video is challenging for mainly two facts. One is the sophisticated interactions between features from different entities: user, system and context. The other is the heterogeneity of feature type, i.e., sequential and non-sequential characteristics of features. To address above challenges, we propose a hybrid network model that integrates a deep neural network (DNN) and an improved recurrent neural network (RNN) for representation learning of view-level QoE evaluation. Non-sequential side information and time difference of sequential features are incorporated to different layers of RNN. Attention mechanism is applied for further improvement of RNN. Based on the output of attention network, we propose a graph-based ranking algorithm to conduct user behavior analyzing, which is useful to online decision of service providers. We conduct experiments on a real-world dataset from a large-scale VoD services provider. The results demonstrate that our method is more effective over the state-of-the-art methods for QoE evaluation."}, "journals/access/WangHC19": {"title": "A Survey of Vehicle Re-Identification Based on Deep Learning.", "url": "https://doi.org/10.1109/ACCESS.2019.2956172", "year": "2019", "author": {"Hongbo Wang 0001": "15/6060-1", "Jiaying Hou": "190/4470", "Na Chen 0007": "69/3895-7"}, "abstract": " Abstract:Vehicle re-identification is one of the core technologies of intelligent transportation systems, and it is crucial for the construction of smart cities. With the rapid development of deep learning, vehicle re-identification technologies have made significant progress in recent years. Therefore, making a comprehensive survey about the vehicle re-identification methods based on deep learning is quite indispensable. There are mainly five types of deep learning-based methods designed for vehicle re-identification, i.e. methods based on local features, methods based on representation learning, methods based on metric learning, methods based on unsupervised learning, and methods based on attention mechanism. The major contributions of our survey come from three aspects. First, we give a comprehensive review of the current five types of deep learning-based methods for vehicle re-identification, and we further compare them from characteristics, advantages, and disadvantages. Second, we sort out vehicle public datasets and compare them from multiple dimensions. Third, we further discuss the challenges and possible research directions of vehicle re-identification in the future based on our survey."}, "journals/mta/YueWC18": {"title": "Learning from users: a data-driven method of QoE evaluation for Internet video.", "url": "https://doi.org/10.1007/s11042-018-5918-4", "year": "2018", "author": {"Ting Yue": "94/8028", "Hongbo Wang 0001": "15/6060-1", "Shiduan Cheng": "35/3871"}, "abstract": "Improving quality of experience (QoE) is increasingly significant for Internet video content providers. The essential issue is how to evaluate QoE under the complex circumstance of Internet video. Based on the massive user data extracted from a large scale Video-on-Demand (VoD) provider, we present a data-driven, comprehensive and extendible study on the problems of QoE evaluation. The main works of this paper include obtaining QoE-associated features via feature engineering and building an evaluation model on features of different aspects for Internet video QoE. Firstly, for feature engineering, we propose to introduce pattern features of user viewing behaviors that interact with user-perceived video quality. A new method of frequent time series pattern mining is proposed to find typical patterns. We correlate user experience with user-perceived quality features and user behavior pattern features, and consider the impact of confounding factors by applying them as context features into modeling. Secondly, interdependency among features is challenging for QoE evaluation modeling. And the high dimension of feature vector should be considered. To address these challenges, we develop an ensemble method to model the interactions between features and their intricate relationships to user experience. Experiments demonstrate that our approach could achieve sound results in comparison with other related works."}, "journals/join/LiWDLC13": {"title": "Differentiated Bandwidth Guarantees for Cloud Data Centers.", "url": "https://doi.org/10.1142/S0219265913600025", "year": "2013", "author": {"Yangyang Li": "32/1000", "Hongbo Wang 0001": "15/6060-1", "Jiankang Dong": "86/7607", "Junbo Li": "74/8487", "Shiduan Cheng": "35/3871"}, "abstract": ""}, "journals/tnn/LinWKCL05": {"title": "A fuzzy-based approach to remove clock skew and reset from one-way delay measurement.", "url": "https://doi.org/10.1109/TNN.2005.853413", "year": "2005", "author": {"Yu Lin": "74/2577", "Hongbo Wang 0001": "15/6060-1", "Geng-Sheng Kuo": "02/5060", "Shiduan Cheng": "35/3871", "Qi Li": "181/2688"}, "abstract": " Abstract:One-way delay (OWD) traces are important measurements for analyzing end-to-end performance on the Internet. It is still a great challenge to provide a scalable solution for large-scale OWD measurement. Because the clocks at end systems are usually not synchronized, the OWD measurements are often inaccurate. For the more challenging case with clock resets to some reference times during the measurement, the OWD measurements are more inaccurate. Furthermore, the measurement data often exhibit considerable network-induced noise when the network is heavily loaded. All the existing OWD measurement techniques, such as linear programming and convex-hull approach (CHA), try to solve this problem by deterministic mathematics model. However, they often fail to distinguish clock resets from temporary Internet congestion. Based on the fuzzy-clustering analysis, this paper proposes a new algorithm to estimate and remove the clock skews and resets from measurement results. This algorithm has been implemented as a tool called fuzzy-based OWD corrector (FOC). The paper then presents OWD measurements of several Internet paths using FOC. Numerical experiments demonstrate that FOC is more accurate and robust than the existing techniques. FOCs computation complexity O(N) is similar to that of CHA and its computing time is much less than that of convex-hull technique."}}}