{"id": "46/5223-1", "name": "Hui Gao 0001", "Article": {"conf/icc/Zhang00W22": {"title": "Multi-User Semantic Communications for Cooperative Object Identification.", "url": "https://doi.org/10.1109/ICCWorkshops53468.2022.9814491", "year": "2022", "author": {"Yimeng Zhang": "60/7633", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1", "Fengyu Wang": "56/7635"}, "abstract": " Abstract:In this paper, a multi-user semantic communication system is studied to execute object-identification tasks, where correlated source data among different users is transmitted via a shared channel, and the introduced inter-user data-stream interference (IDI) deteriorates the identification performance severely. Traditional solutions adopt powerful channel codes for individual data protection, e.g., very low coding rate, to guarantee the identification performance, at the cost of sacrificing the real-time requirements. We propose to exploit the data correlation among users to perform cooperative identification. Specifically, by designing a convolutional neural network (CNN) based framework and constructing a combination of loss functions, a deep learning (DL) based multi-user semantic communication system for cooperative object identification, named DeepSC-COl, is proposed to fuse individual semantic features into a global feature through dynamically-tailored weights. In this way, multiple semantic features are jointly leveraged for identification without an extra increase of latency. Evaluation results show that the proposed DeepSC-COI outperforms the non-cooperative scheme with the performance gain of 86.9% at -3 dB, in terms of mean Average Precision (mAP)."}, "conf/iwcmc/HuL0022": {"title": "Heterogeneity-Aware Federated Learning for Device Anomaly Detection in Industrial loT.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9824996", "year": "2022", "author": {"Zhuoer Hu": "286/9545", "Yueming Lu": "24/334", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1"}, "abstract": " Abstract:With the popularity and application of the Industrial Internet of Things (1IoT), device anomaly detection is considered as one of the important challenges in IloT implementation. However, the privacy sensitivity of device data and the high heterogeneity of IloT devices make it impossible for traditional schemes to achieve efficient, accurate, and privacy-protected device anomaly detection in IloT networks. In this study, we propose an intelligent anomaly detection architecture for IloT networks based on federated optimization algorithms and deep learning (DL). In particular, an online, adaptive, and semi-supervised device anomaly detection model is designed, and a heterogeneity-aware federated learning algorithm, called Clustered-FedProx, is presented. The Clustered-FedProx algorithm considers the differences in computational power and data statistical distribution among IloT devices, whereby multiple devices can be coordinated to train a global DL model in highly heterogeneous networks. Simulation results show that the proposed scheme can achieve more stable and accurate performance than conventional schemes."}, "conf/icc/Wang0QZ0PL21": {"title": "Deep Neural Network-Based Robust Spectrum Sensing: Exploiting Phase Difference Distribution.", "url": "https://doi.org/10.1109/ICC42927.2021.9500743", "year": "2021", "author": {"Yang Wang": "181/2842", "Wenjun Xu 0001": "14/2062-1", "Zhijin Qin": "157/9149", "Yimeng Zhang": "60/7633", "Hui Gao 0001": "46/5223-1", "Miao Pan": "16/1033", "Jiaru Lin": "32/2368"}, "abstract": " Abstract:As an enabling technology to address spectrum shortage, spectrum sensing has been investigated a lot. However, the uncertainties in the detection environment, including noise uncertainty and carrier frequency (CF) mismatch, still remain as the main challenges of spectrum sensing, which greatly degrades the sensing performance of typical sensing methods, such as energy detection and cyclostationary detection. To this end, this paper proposes two robust spectrum sensing schemes by leveraging the difference between the phase difference (PD) distribution of noise-perturbed signal and that of Gaussian noise. Specifically, the compact approximation of the PD distribution is first derived to enable the extraction of the features of PD distributions, which are robust to noise uncertainty and CF mismatch. Based on these features, two sensing schemes based on the deep neural network (DNN), referred to as DNN-based PD distribution detection (PDD) and blind PDD (BPDD), are proposed to detect spectrum holes in cases with known CF and unknown CF, respectively. Simulation results show that our proposed schemes are more robust to CF mismatch and noise uncertainty in comparison with the existing sensing schemes. Furthermore, when the CF of the sensed signal is unknown, the proposed BPDD significantly outperforms existing blind sensing schemes."}, "conf/icc/XingLGL21": {"title": "Wireless Traffic Prediction with Series Fluctuation Pattern Clustering.", "url": "https://doi.org/10.1109/ICCWorkshops50388.2021.9473514", "year": "2021", "author": {"Xudong Xing": "271/8652", "Yuanjie Lin": "276/1927", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:Accurate traffic prediction is vital in intelligent wireless network, which enables intelligent operation to improve the quality of experience of users. In this paper, we propose a wireless traffic prediction architecture with series fluctuation pattern clustering. We first extract fluctuation pattern, i.e., the baseline feature, from the original series, while retaining the noise component, i.e., the residual feature. Then a hierarchical density-based strategy is proposed to cluster the baseline feature and extract the unique fluctuation pattern. Furthermore, we propose a LSTM-based neural network model, called TPBLN, to fit the baseline feature of each cluster set with a parameterized residual feature processing. As compared to conventional schemes without series fluctuation pattern extracting and clustering, or boosting tree-based schemes, our proposed architecture reduces the mutual influence among series with different fluctuation patterns before the predicting. Moreover, we use real data to experiment and therefore have the potential to better adapt to the real environment. The experiment results show that the proposed scheme effectively improves the prediction performance compared to the reference schemes."}, "conf/icc/Zou00B0D21": {"title": "Low-Complexity Linear Equalization for OTFS Systems with Rectangular Waveforms.", "url": "https://doi.org/10.1109/ICCWorkshops50388.2021.9473771", "year": "2021", "author": {"Tingting Zou": "36/8873", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1", "Zhisong Bie": "26/2992", "Zhiyong Feng 0001": "48/195-1", "Zhiguo Ding 0001": "64/361-1"}, "abstract": " Abstract:Orthogonal time frequency space (OTFS) is a promising technology for high-mobility wireless communications. However, the equalization realization in practical OTFS systems is a great challenge. In this paper, we first investigate the structure of the delay-Doppler domain effective channel matrix for more practical full-cyclic-prefix OTFS systems, and then reveal the block-circulant property and quasi-banded sparse structure of equalization matrices for the two typical linear equalization methods, i.e., zero-forcing and minimum mean square error. Then, two low-complexity linear equalizers are proposed, where Fast Fourier Transform and lower-upper (LU) factorization are efficiently leveraged to reduce the complexity. Compared with the existing low-complexity linear equalizers, the proposed equalizers improve the performance without additional complexity."}, "conf/icc/ChengJ0XB20": {"title": "OTFS Based Receiver Scheme with Multi-Antennas in High-Mobility V2X Systems.", "url": "https://doi.org/10.1109/ICCWorkshops49005.2020.9145313", "year": "2020", "author": {"Junqiang Cheng": "248/7878", "Chenglu Jia": "260/0474", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1", "Zhisong Bie": "26/2992"}, "abstract": " Abstract:Vehicle-to-everything (V2X) is considered as one of the most important applications of future wireless communication networks. However, the Doppler effect caused by the vehicle mobility may seriously deteriorate the performance of the vehicular communication links, especially when the channels exhibit a large number of Doppler frequency offsets (DFOs). Orthogonal time frequency space (OTFS) is a new waveform designed in the delay-Doppler domain, and can effectively convert a doubly dispersive channel into an almost non-fading channel, which makes it very attractive for V2X communications. In this paper, we design a novel OTFS based receiver with multi-antennas to deal with the high-mobility challenges in V2X systems. We show that the multiple DFOs associated with multipaths can be separated with the high-spatial resolution provided by multi-antennas, which leads to an enhanced sparsity of the OTFS channel in the delay-Doppler domain and bears a potential to reduce the complexity of the message passing (MP) detection algorithm. Based on this observation, we further propose a joint MP-maximum ration combining (MRC) iterative detection for OTFS, where the integration of MRC significantly improves the convergence performance of the iteration and gains an excellent system error performance. Finally, we provide numerical simulation results to corroborate the superiorities of the proposed scheme."}, "conf/pimrc/JiaC0X20": {"title": "High-Resolution Channel Estimation for Intelligent Reflecting Surface-Assisted MmWave Communications.", "url": "https://doi.org/10.1109/PIMRC48278.2020.9217312", "year": "2020", "author": {"Chenglu Jia": "260/0474", "Junqiang Cheng": "248/7878", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1"}, "abstract": " Abstract:In this paper, we study the high-resolution channel estimation problem for intelligent reflecting surface (IRS)-assisted millimeter wave (mmWave) multiple-input-multiple-output (MIMO) communications, which is a prerequisite to guarantee further high-rate data transmission. Considering the typical sparsity of mmWave channels, we formulate the cascaded channel estimation problem from a sparse signal recovery perspective, and then propose a novel two-step cascaded channel estimation protocol to estimate the cascaded user-IRS-base station channel with high-resolution for IRS-assisted mmWave MIMO communications. More specifically, the first step is to estimate the coarse angular domain information (ADI) and further establish the robust uplink by beam training. In the second step, by exploiting the coarse ADI, an adaptive grid matching pursuit (AGMP) algorithm is proposed to estimate the high-resolution cascaded channel state information (CSI) with low complexity. Simulation results verify that the proposed two-step channel estimation protocol significantly outperforms the state-of-the-art scheme, i.e., beam training based channel estimation, and meanwhile can reap near-optimal system performance achieved by perfect CSI."}, "conf/pimrc/LinGXL20": {"title": "Dynamic Antenna Configuration for 3D Massive MIMO System via Deep Reinforcement Learning.", "url": "https://doi.org/10.1109/PIMRC48278.2020.9217272", "year": "2020", "author": {"Yuanjie Lin": "276/1927", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:We study the optimized dynamic antenna parameters configuration for the 3D massive multiple-input multiple- out (MIMO) system in a heterogeneous network (HetNet) with overlaid macrocells and smallcells. In particular, we propose a deep reinforcement learning (DRL) approach to jointly adjust three key antenna parameters, namely, downtilt angle, vertical and horizontal half-power beamwidths of the macro base stations (mBSs) automatically in a dynamic environment with strong user mobility. More specifically, employing the gridded user location information (ULI), we propose a novel mix Q-learning algorithm to efficiently address the challenging joint optimization problem, which integrates a parallel hyper-parameter updating mechanism in dual sub-networks and a technique of prioritized replay buffer. The resultant neural network can efficiently learn the historical experience in an online fashion and achieve excellent sum-rate performance with affordable trials. Moreover, thanks to the proposed gridded ULI, our DRL-empowered antenna configuration framework can easily fit various HetNet deployments with variable user densities. Numerical results show that the average weighted sum-rate is increased by 4.59 bit/s/Hz, and the average performance improvement is up to 24.82% as compared to the reference scheme without gridded ULI."}, "conf/globecom/DengXL0XF19": {"title": "Energy Efficient UAV-Enabled Multicast Systems: Joint Grouping and Trajectory Optimization.", "url": "https://doi.org/10.1109/GLOBECOM38437.2019.9013786", "year": "2019", "author": {"Chang Deng": "16/1003", "Wenjun Xu 0001": "14/2062-1", "Chia-Han Lee": "53/5898", "Hui Gao 0001": "46/5223-1", "Wenbo Xu 0003": "81/4590-3", "Zhiyong Feng 0001": "48/195-1"}, "abstract": " Abstract:We study an energy-efficient unmanned aerial vehicle (UAV) multicast system, in which ground terminals (GTs) requiring a common information (CI) are grouped and a UAV flies to each group to deliver the CI using minimum energy consumption. A machine learning (ML) empowered joint multicast grouping and UAV trajectory optimization framework is proposed to tackle the challenging joint optimization problem. In this framework, we first propose the compressed-feature regression and clustering machine learning (C2ML) for multicast grouping. A support vector regression (SVR) is trained with the silhouette coefficient, a one- dimensional compressed feature regarding the distribution of GTs, to efficiently determine the number of groups that guides the K-means clustering to approach the optimal multicast grouping. With the C2ML- enabled multicast grouping, we solve the UAV trajectory optimization problem by formulating an equivalent centroid-adjustable traveling salesman problem (CA- TSP). An efficient CA-TSP inspired iterative optimization algorithm is proposed for UAV trajectory planning. The proposed ML-empowered joint optimization framework, which integrates the offline C2ML-enabled multicast grouping and the online CA-TSP inspired UAV- trajectory optimization, is shown to achieve excellent energy-saving performance."}, "conf/icc/KeGXLGF19": {"title": "Position Prediction Based Fast Beam Tracking Scheme for Multi-User UAV-mmWave Communications.", "url": "https://doi.org/10.1109/ICC.2019.8761775", "year": "2019", "author": {"Yongning Ke": "245/3211", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1", "Lixin Li": "01/4301", "Li Guo": "02/929", "Zhiyong Feng 0001": "48/195-1"}, "abstract": " Abstract:Unmanned aerial vehicle (UAV) millimeter-wave (mmWave) communication is emerging as a promising technique for future networks with flexible network topology and ultra-high data transmission rate. Within such full-dimensionally dynamic mmWave network, beam-tracking is challenging and critical, especially when all the UAVs are in motion for some collaborative tasks that require high-quality communications. In this paper, we propose a fast beam tracking scheme, which is built on an efficient position prediction of multiple moving UAVs. In particular, a Gaussian process based machine learning scheme is proposed to achieve fast and accurate UAV position prediction with quantifiable positional uncertainty. Based on the prediction results, the beam-tracking can be confined within some specific spatial regions centered on the predicted UAV positions. In contrast to the full-space searching based scheme, our proposed position prediction based beam tracking requires little system overhead and thus achieves high net spectrum efficiency. Moreover, we also propose a practical communication protocol embedding our beam-tracking scheme, which monitors the channel evolution and triggers the UAV position prediction for beam-tracking, transmit-receive beam pair selection and data transmission. Simulation results validate the advantages of our scheme over the existing works."}, "conf/icc/Xin0TCL19": {"title": "Energy-Efficient Power Control for Ultra-Dense Networks with Distributed Antenna Arrays.", "url": "https://doi.org/10.1109/ICCW.2019.8757032", "year": "2019", "author": {"Jincan Xin": "244/9078", "Hui Gao 0001": "46/5223-1", "Yuande Tan": "244/8757", "Ruohan Cao": "36/10736", "Yueming Lu": "24/334"}, "abstract": " Abstract:We study the energy efficiency (EE) optimization problem of a ultra-dense small cell network. In each cell, based on the fog radio access network architecture, multiple distributed antenna arrays are connected to a mobile edge computing server to provide collaborative service to the users. We optimize the network EE by a novel distributed non-cooperative power control game with leakage interference-to-signal ratio constraints (NPG-LSC). Considering the backhaul power consumption, each cell independently optimizes its own EE while limiting the interference to other cells through the LSC. The proposed scheme enjoys lower complexity compared with the centralized method while achieving better network EE over the conventional game solution without leakage interference constraints. We prove that the formulated NPG-LSC scheme has a unique Nash equilibrium. Finally, simulation results show that the proposed scheme effectively improves the network EE."}, "conf/icc/ZhangXGPFH19": {"title": "Position-Attitude Prediction Based Beam Tracking for UAV mmWave Communications.", "url": "https://doi.org/10.1109/ICC.2019.8761981", "year": "2019", "author": {"Jinglin Zhang": "83/2890", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1", "Miao Pan": "16/1033", "Zhiyong Feng 0001": "48/195-1", "Zhu Han 0001": "83/514"}, "abstract": " Abstract:Millimeter wave offers large bandwidth for high data-rate unmanned aerial vehicle (UAV)-to-UAV communications. Because of high mobility and attitude variations, it is challenging to maintain the communication link among the navigating UAVs with narrow beam in the mmWave band. To the best of our knowledge, this is the first paper to establish a transmission-oriented UAV attitude prediction model for the UAV-to-UAV mmWave communication link. In particular, a position-attitude prediction based beam tracking algorithm is proposed. First, a Guassian Process (GP) based learning algorithm is presented for the transmitting UAV to predict the position and attitude of the receiving UAV by using the previous position-attitude data and exploiting the relationship between the position and attitude. Then, the analog beamforming vectors are derived by using the predicted spatial angles. Simulation results demonstrate that the proposed learning algorithm can achieve high accurate position-attitude prediction, and the beam tracking algorithm considering UAV attitude variations significantly outperforms the existing algorithms with only position information."}, "conf/icip/XinL019": {"title": "Random Part Localization Model for Fine Grained Image Classification.", "url": "https://doi.org/10.1109/ICIP.2019.8802935", "year": "2019", "author": {"Qi Xin": "77/2901", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:Fine-grained recognition is challenging due to its subtle local inter-class differences versus large intra-class variations. Finding those subtle traits that fully characterize the object is not straightforward. In this paper, we present a novel random part localization model, which first extracts the foreground object using the saliency map, and then localizes the discriminative parts through a set of potential regions in a random way based on their contribution to classification. We train three convolutional neural networks to capture the features that belong to different levels and average their classification results as our final prediction score. Experiments show that our approach achieves competitive performance compared with state-of-the-art methods on three publicly available fine-grained recognition datasets (CUB200-2011, Stanford Cars and FGVC-Aircraft)."}, "conf/wcnc/Tan0XCL19": {"title": "A Learning and RSRP-Based Interference Topology Management Scheme for Ultra-Dense Networks.", "url": "https://doi.org/10.1109/WCNC.2019.8885880", "year": "2019", "author": {"Yuande Tan": "244/8757", "Hui Gao 0001": "46/5223-1", "Jincan Xin": "244/9078", "Ruohan Cao": "36/10736", "Yueming Lu": "24/334"}, "abstract": " Abstract:We consider an ultra-dense network (UDN), where serious interference may exist due to the densely deployed base stations (BSs) and user equipment (UE). Noting that the conventional interference management (IM) scheme is not readily applicable, in this paper, we propose a novel interference topology management (ITM) scheme to achieve low-complexity IM in UDNs. The proposed ITM scheme consists of two stages, namely, the optimized BS clustering stage and the decentralized UE-cluster association stage. In the first stage, a novel unsupervised learning-based BS clustering algorithm is proposed, which outperforms the conventional clustering method. Then, a decentralized UE-cluster association algorithm is proposed, which doesn't need to exchange the channel information among clusters, and significantly save system overheads as compared to the centralized solutions. The results show that our ITM scheme can improve the system throughput at lower complexity as compared to other related schemes."}, "conf/eusipco/CaoW0WL18": {"title": "Blind Channel Direction Separation Against Pilot Spoofing Attack in Massive MIMO System.", "url": "https://doi.org/10.23919/EUSIPCO.2018.8553024", "year": "2018", "author": {"Ruohan Cao": "36/10736", "Tan F. Wong": "72/1500", "Hui Gao 0001": "46/5223-1", "Dongqing Wang": "89/827", "Yueming Lu": "24/334"}, "abstract": " Abstract:This paper considers a pilot spoofing attack scenario in a massive MIMO system. A malicious user tries to disturb the channel estimation process by sending interference symbols to the base-station (BS) via the uplink. Another legitimate user counters by sending random symbols. The BS does not possess any partial channel state information (CSI) and distribution of symbols sent by malicious user a priori. For such scenario, this paper aims to separate the channel directions from the legitimate and malicious users to the BS, respectively. A blind channel separation algorithm based on estimating the characteristic function of the distribution of the signal space vector is proposed. Simulation results show that the proposed algorithm provides good channel separation performance in a typical massive MIMO system."}, "conf/icc/Li0LL18": {"title": "Deep Q-Learning Based Dynamic Resource Allocation for Self-Powered Ultra-Dense Networks.", "url": "https://doi.org/10.1109/ICCW.2018.8403505", "year": "2018", "author": {"Han Li": "07/1429", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:Though enhancing the capacity and coverage of cellular networks to meet the explosive increasing of traffic demands, Ultra-Dense Network (UDN) suffers from great power consumption and greenhouse gas emission. Turning small base stations (SBS) off dynamically according to the network operating conditions is a promising solution to enhance energy efficiency (EE). Inspired by the success of Deep Q-learning Network(DQN) on solving complicated real-time control problems and the usage of energy-harvesting(EH) in UDNs, without any prior knowledge about energy arrival, data arrival and channel state information, we present a DQN-based framework for dynamic resource allocation in EH-UDN. Specially, joint optimization problem is formulated, considering both EE and quality of service (QoS) of the network. Then according to the application scenario, the action space, state space and reward function of the proposed DQN-based framework are defined and formulated. We evaluate the performance of the proposed framework by comparing it with the classic Q-learning framework via simulation. Numerical results show that our proposed scheme can enhance EE while taking good control of the QoS."}, "conf/icc/MaLZ0Y18": {"title": "High Energy Efficiency Transmission in MIMO Satellite Communications.", "url": "https://doi.org/10.1109/ICC.2018.8422808", "year": "2018", "author": {"Yuanyuan Ma": "66/4603", "Tiejun Lv": "77/4591", "Xuewei Zhang": "131/2976", "Hui Gao 0001": "46/5223-1", "Shui Yu": "90/3575"}, "abstract": " Abstract:In this paper, we propose a high energy efficiency transmission scheme in multi-beam MIMO satellite systems. Satellite is regarded as a two-way decode-and- forward (DF) relay, where multiple pairs of users exchange information within pair. Zero-forcing transceivers are employed at the satellite. The challenge is that of deriving an accurate yet tractable expression of the system-level energy efficiency (EE) to be used as our objective function. To tackle this challenge, firstly, a closed-form expression of the EE is derived under the assumption of perfect satellite channel. Secondly, based on this analytical expression, we formulate a resource allocation optimization problem for the EE maximization by jointly optimizing satellite power and users power, subject to limited transmit power and minimum quality-of-service (QoS) constraints. Finally, the successive convex approximation technique is invoked to transform the original optimization problem into a concave fractional programming problem, which is then efficiently solved by the existed methods. Simulation results demonstrate the effectiveness of the proposed algorithms."}, "conf/icc/Xin0L18": {"title": "Opportunistic Interference Mitigation for D-TDD in Ultra-Dense Networks.", "url": "https://doi.org/10.1109/ICCW.2018.8403526", "year": "2018", "author": {"Qi Xin": "77/2901", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:Dynamic time-division duplexing (D-TDD) is a promising solution to address the fast and varying traffic demands in ultra-dense networks (UDNs). However, in addition to conventional interference, the cross-link interference (CI) resulted by asymmetric uplink (UL) and downlink (DL) transmission in D-TDD operation may further degrade system performance. In this paper, we propose a novel opportunistic interference mitigation (OIM) framework to enhance D-TDD in UDNs by exploiting multi-user diversity in conjunction with interference-aware transmission. In particular, we first decompose the interference patterns experienced by D-TDD in a typical three- cell network, and propose novel interference alignment (IA) inspired opportunistic user scheduling and transmission schemes for each interference pattern. Our scheme mainly relies on the reference signal space (RSS) that guides the transmit beamforming and user scheduling to align the generated interference at a predefined subspace in each AP receiver with best effort. Numerical results show that our schemes can effectively mitigate the CI in D-TDD, and in conjunction with modified opportunistic IA for pure UL/DL transmission, our OIM framework achieves substantial performance again over the conventional schemes."}, "conf/icc/ZhaoL0CJ18": {"title": "Uplink Resource Allocation in Mobile Edge Computing-Based Heterogeneous Networks with Multi-Band RF Energy Harvesting.", "url": "https://doi.org/10.1109/ICC.2018.8422201", "year": "2018", "author": {"Yisheng Zhao": "14/7474", "Victor C. M. Leung": "36/4847", "Hui Gao 0001": "46/5223-1", "Zhonghui Chen": "154/0199", "Hong Ji 0001": "83/2179-1"}, "abstract": " Abstract:Resource allocation in mobile edge computing (MEC)- based wireless networks with energy harvesting has attracted great attention. However, existing works assume that mobile devices are stationary while harvesting energy. In this paper, an uplink resource allocation strategy is developed in MEC-based heterogeneous networks. A random mobility model is designed to describe the movement of the user equipment (UE). Meanwhile, the UE can harvest energy from six frequency bands while moving along a certain path. The energy harvesting model of the UE is given by an integral expression. The objective of the resource allocation problem is to maximize the energy efficiency (EE) under the constraints of energy consumption, total data rate requirement, sub-carrier allocation, and transmission power. A quantum-behaved particle swarm optimization (QPSO) algorithm is employed to obtain a sub-optimal solution. Numerical results show that the amount of energy harvested by the UE decreases as the moving speed increases. Moreover, the QPSO algorithm has higher EE than an existing particle swarm optimization algorithm."}, "conf/iswcs/ZhangJ0LX18": {"title": "Performance Analysis of Small Cell Networks Using Accurate Path Loss Model at 39 GHz.", "url": "https://doi.org/10.1109/ISWCS.2018.8491202", "year": "2018", "author": {"Yangying Zhang": "228/2501", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Bohan Li": "123/2549", "Jianxiao Xie": "218/2505"}, "abstract": " Abstract:In this paper, we apply an accurate millimeter wave (mmWave) path loss model, obtained from outdoor measurement operated at 39 GHz in Qingdao, China, into the stochastic geometry analysis to investigate the system performance of small cell networks (SCNs) with non-identical user equipment (UE) - base station (BS) antenna heights. The analytical expressions for coverage probability and outage probability are derived in detail, which are functions of BS density and absolute difference between the antenna heights of BS and UE. The analytical results of coverage probability and outage probability are verified through Monte Carlo simulation. Our study shows that as the SCNs become denser, the impact of antenna heights difference on coverage and outage probability is more significant."}, "conf/wcnc/HaoL018": {"title": "AN-aided robust secure beamforming design in MIMO two-way relay systems with PNC.", "url": "https://doi.org/10.1109/WCNC.2018.8377032", "year": "2018", "author": {"Yunqin Hao": "221/0415", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:This paper investigates the artificial noise (AN)-aided robust secure beamforming design for multiple-input multiple-output (MIMO) two-way relaying (TWR) systems based on physical layer network coding (PNC). In terms of signal-to-interference-and-noise ratio (SINR), we propose two robust beamforming designs to optimize worst-case secrecy sum rate in the presence of an eavesdropper, where the eavesdropper's channel state information (ECSI) is imperfect. In low SINR regime, we give a robust joint beamforming design. Since the optimization problem is non-convex, we use a zero-forcing (ZF) constraint on AN beamforming, and after approximating the objective function, the non-convex problem is formulated into a semidefinite programming (SDP). On the other hand, in high SINR regime, we provide a quality-of-service (QoS)-based robust beamforming design, in which the optimal solution can be efficiently obtained by employing an iterative algorithm based on Taylor expansion and semidefinite relaxation (SDR) techniques. Numerical results show the efficiency of the proposed schemes."}, "conf/wcnc/Li0LL18": {"title": "Deep reinforcement learning based computation offloading and resource allocation for MEC.", "url": "https://doi.org/10.1109/WCNC.2018.8377343", "year": "2018", "author": {"Ji Li": "98/2427", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:Mobile edge computing (MEC) has the potential to enable computation-intensive applications in 5G networks. MEC can extend the computational capacity at the edge of wireless networks by migrating the computation-intensive tasks to the MEC server. In this paper, we consider a multi-user MEC system, where multiple user equipments (UEs) can perform computation offloading via wireless channels to an MEC server. We formulate the sum cost of delay and energy consumptions for all UEs as our optimization objective. In order to minimize the sum cost of the considered MEC system, we jointly optimize the offloading decision and computational resource allocation. However, it is challenging to obtain an optimal policy in such a dynamic system. Besides immediate reward, Reinforcement Learning (RL) also takes a long-term goal into consideration, which is very important to a time-variant dynamic systems, such as our considered multi-user wireless MEC system. To this end, we propose RL-based optimization framework to tackle the resource allocation in wireless MEC. Specifically, the Q-learning based and Deep Reinforcement Learning (DRL) based schemes are proposed, respectively. Simulation results show that the proposed scheme achieves significant reduction on the sum cost compared to other baselines."}, "conf/wcsp/ZhangXCGL18": {"title": "Joint Subcarrier Assignment and Downlink-Uplink Time-Power Allocation for Wireless Powered OFDM-NOMA Systems.", "url": "https://doi.org/10.1109/WCSP.2018.8555663", "year": "2018", "author": {"Jingru Zhang": "22/10441", "Wenjun Xu 0001": "14/2062-1", "Wei Chen": "181/2832", "Hui Gao 0001": "46/5223-1", "Jiaru Lin": "32/2368"}, "abstract": " Abstract:In this paper, a wireless powered orthogonal frequency division multiplexing (OFDM)-non-orthogonal multiple access (NOMA) system is considered. The subcarrier assignment, energy harvesting/information transmission (EH/IT) time allocation, and downlink-uplink power allocation are jointly optimized to maximize the system sum-throughput while taking user fairness into account. Due to the intractability of the considered problem, we first decompose the original problem into two subproblems, namely, subcarrier assignment subproblem with fairness consideration and joint downlink-uplink time-power allocation subproblem. For subcarrier assignment sub-problem, with given joint downlink-uplink time-power allocation, a locally optimal subcarrier assignment algorithm is proposed based on the many-to-many matching theory. Then with given subcarrier assignment, an algorithm based on golden section method, iterative water-filling and projected subgradient method is proposed for achieving the optimal solution to joint downlink-uplink time-power allocation subproblem. An alternate iteration framework is further proposed to jointly optimize two subproblems for maximizing the system sum-throughput. Simulation results validate the effectiveness of the proposed algorithms, i.e., the proposed framework approaches to the joint downlink-uplink time-power allocation optimal solution with less than 5% throughput loss compared to the upper bound and with only about 40% complexity of the interior-point algorithm."}, "conf/globecom/Liu0TLL17": {"title": "Energy Efficient Resource Allocation in Multi-User Downlink Non-Orthogonal Multiple Access Systems.", "url": "https://doi.org/10.1109/GLOCOM.2017.8254197", "year": "2017", "author": {"Qian Liu 0004": "33/85-4", "Hui Gao 0001": "46/5223-1", "Fangqing Tan": "70/10505", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:Non-orthogonal multiple access (NOMA) has been investigated recently as a candidate radio access technology for the fifth generation (5G) networks due to its high spectrum efficiency (SE). As green radio which focuses on energy efficiency (EE) becomes an inevitable trend, energy efficient design is becoming more and more important. In this paper, we focus on energy efficient resource allocation problem in multi-user downlink NOMA system with the aim to optimize subchannel assignment and power allocation to maximize the system EE. We propose a novel low-complexity suboptimal subchannel assignment algorithm and obtain the optimal power allocation coefficients among subchannel multiplexed users. To further improve the system EE, unequal power allocation across subchannels (UPAAS) scheme including an optimal solution and a suboptimal Dinkelbach-like algorithm is studied. Simulation results show the effectiveness of our proposed resource allocation algorithms."}, "conf/globecom/LiuLGL17": {"title": "Enhanced Physical Layer Security for Ultra-Dense D2D Communications Underlaying Cellular Networks with Full-Duplex Users.", "url": "https://doi.org/10.1109/GLOCOMW.2017.8269199", "year": "2017", "author": {"Chenchen Liu": "151/4584", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we investigate the security issues for ultra-dense Device-to-Device (D2D) communications underlaying cellular networks with eavesdroppers (Eves) overhearing D2D communications. As D2D links are vulnerable to security threats, we try to enhance the D2D security performance by introducing full-duplex cellular users (FD-CUEs), and the FD-CUEs intend to jam Eves by transmitting artificial noise while simultaneously receiving useful signal from its serving base station. Using stochastic geometry, the D2D connection probability, which refers to D2D users transmit signal successfully, the D2D secrecy probability, which refers to the probability that the transmitted secrecy information cannot be decoded by any Eve, and the FD-CUE connection probability are analyzed. Moreover, we propose an effective algorithm to improve the D2D secrecy probability subject to the security constraints. Our analytical results match well with the simulations. From the simulation results, it is clear that the D2D ergodic secrecy rate of the proposed scheme outperforms that of the traditional D2D underlaying cellular networks without FD-CUEs."}, "conf/globecom/YanGLL17": {"title": "Energy-Efficient Resource Allocation in Ultra-Dense Networks with Massive MIMO.", "url": "https://doi.org/10.1109/GLOCOMW.2017.8269191", "year": "2017", "author": {"Yuanyuan Yan": "213/5000", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:We study the energy-efficient resource allocation in ultra-dense networks (UDNs) with massive multiple- input multiple-out (MIMO), where the densely deployed BSs are equipped with massive antenna arrays to communicate with multiple users. Aiming to design a practical resource allocation scheme in the presence of strong interference in UDNs, we propose a semi-distributed interference-aware (IA) resource allocation to achieve high energy efficiency (EE). In particular, a coordinator is introduced to collect the local interference-information estimated by each BS and then fed back the synthesized global interference-information to each BS to enable parallel and cell-wise optimizations. Focusing the capability of massive MIMO in UDNs, we further propose a joint optimization of the active BS antennas, user scheduling and transmission power within the IA resource allocation framework for EE. Numerical results show our IA joint optimization scheme significantly improves the EE performance over the conditional interference-unaware scheme in UDNs with massive MIMO."}, "conf/globecom/ZhangRGLL17": {"title": "Analysis of Caching and Transmitting Scalable Videos in Cache-Enabled Small Cell Networks.", "url": "https://doi.org/10.1109/GLOCOM.2017.8254672", "year": "2017", "author": {"Xuewei Zhang": "131/2976", "Yuan Ren 0003": "69/4334-3", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we investigate the cache-enabled small cell networks to provide on-demand video services with differential perceptual qualities, i.e., standard definition video (SDV) and high definition video (HDV). As the extension technology of advanced video coding/H.264, scalable video coding is adopted in the considered networks and videos to be transmitted are divided into a base layer (BL) and N enhancement layers (ELs). In our proposed caching protocol, the n-th small cell base station (SBS) caches BLs and the n-th EL of the most popular videos. Depending on the distances between the typical user and SBSs in the observed cluster, the closest SBS is regarded as the serving node (SN) and the others are cooperative nodes (CNs). When SDV is required, the SN will transmit BL of the required video file to the typical user, while SN and CNs can cooperatively transmit BL and ELs to provide superior video quality if HDV is required. Based on the proposed caching and transmission protocol, we derive the expressions of the key performance indicators, i.e., local serving probability, ergodic service rate and service delay. Numerical results validate the theoretical analysis and show the superiority of our proposed scheme compared to the benchmarks."}, "conf/icc/LvGSS17": {"title": "Energy efficiency of two-tier heterogeneous networks with energy harvesting.", "url": "https://doi.org/10.1109/ICC.2017.7997011", "year": "2017", "author": {"Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Zai Shi": "203/9361", "Xin Su 0001": "54/3643-1"}, "abstract": " Abstract:In this paper we consider a two-tier heterogeneous network (HetNet) where pico base stations (BSs) can harvest energy from macro BSs. Three cases of special interests are investigated, i.e., pico BSs are deployed 1) without battery and power grid, 2) with power grid, and 3) with battery. In particular, a practical dual-slope path loss model is employed to facilitate the performance analysis. By means of stochastic geometry and Gamma second order moment matching, a compact expression of the distribution of harvested energy is derived. Then the network's energy efficiency (EE) is introduced and optimized with carefully designed system parameters. Finally, an important conclusion is obtained as follows: only when the intensity of pico BSs is high can HetNets with energy harvesting improve the network's EE compared with the conventional HetNets without energy harvesting."}, "conf/icc/LiuTLG17": {"title": "Energy efficiency and spectral-efficiency tradeoff in downlink NOMA systems.", "url": "https://doi.org/10.1109/ICCW.2017.7962665", "year": "2017", "author": {"Qian Liu 0004": "33/85-4", "Fangqing Tan": "70/10505", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:Non-orthogonal multiple access (NOMA) has been investigated recently as a candidate radio access technology for the fifth generation (5G) mobile communication due to its high spectral efficiency (SE). Green radio (GR) which focuses on energy efficiency (EE) is becoming an inevitable trend. In this paper, we study the tradeoff between EE and SE in downlink NOMA systems. The tradeoff problem is formulated as an optimization problem in which the basic idea is to maximize EE under a satisfying minimum SE requirement. It is proved that the system EE is a strictly quasi-concave function of transmission power. By formulating the optimization problem as a bilayer optimization problem, the optimal solution to the optimization problem is obtained, including optimal power allocation coefficients among multiplexed users and optimal transmission power value. Simulation results are provided to further confirm our theoretical findings and the effectiveness of our proposed power allocation scheme for achieving a flexible tradeoff between EE and SE."}, "conf/icc/WuZSGL17": {"title": "On energy efficiency optimization in downlink MIMO-NOMA.", "url": "https://doi.org/10.1109/ICCW.2017.7962690", "year": "2017", "author": {"Pan Wu": "00/1145", "Jie Zeng 0001": "00/2446-1", "Xin Su 0001": "54/3643-1", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:Non-orthogonal multiple access (NOMA) is a promising technique for the fifth generation mobile communication system due to its high spectral efficiency (SE). Previous works focus on user scheduling or/and power allocation to achieve the maximization of sum rate. However, the energy efficiency (EE) has not been well studied for NOMA systems. In this paper, we aim to optimize user scheduling and power allocation to maximize the EE of the downlink multiple-input multiple-output (MIMO) NOMA system. There are two scheduling schemes with low complexity and signaling overhead. In the signal space alignment (SSA) based user scheduling scheme, we use the SSA with reference signal space to schedule the users. In the max-collinearity user scheduling approach, we schedule the users considering maximum collinearity among users. Furthermore, we use the sequential convex approximation (SCA) to transform the original optimal problem into a convex optimization problem, so that an optimal power allocation strategy can be obtained. The results show that our algorithms can achieve higher EE when the transmitting power is relatively low. Besides, the sum rate of the center users is higher using the second scheduling approach."}, "conf/iccchina/HongJGS0GXL17": {"title": "Inverted antenna subset transmission technique for secure millimeter-wave wireless communication.", "url": "https://doi.org/10.1109/ICCChina.2017.8330319", "year": "2017", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Songlin Sun": "76/8195", "Hai Huang 0001": "51/944-1", "Ning Gao": "47/544", "Jianxiao Xie": "218/2505", "Bohan Li 0005": "123/2549-5"}, "abstract": " Abstract:In order to enhance millimeter-wave (mm-Wave) physical layer security (PLS), we propose inverted antenna subset transmission technique (IAST) based large antenna array. IAST consists of a conventional phased-array architecture followed with inverse phase control component. The main idea for security in IAST is to generate artificial noise (AN) on undesired direction by randomly scrambling received constellation through antenna subset selection, while preserving the constellation points in target direction clear. Using a simplified statistical model, an expression of average signal-to-noise ratio (SNR) is derived as a function of the observation angle. The optimized inverse phase ratio of antenna subset is obtained for the objective of minimizing SNR on undesired direction. Simulation results show that the proposed solution provides higher secrecy performance for target user, generates narrower beamwidth in the target direction and produces greater symbol error rate (SER) to eavesdropper compared current techniques."}, "conf/iccchina/LiGJSH17": {"title": "SDN and MEC can accelerate the beam training in mmWave outdoor communications.", "url": "https://doi.org/10.1109/ICCChina.2017.8330465", "year": "2017", "author": {"Bohan Li 0005": "123/2549-5", "Hui Gao 0001": "46/5223-1", "Xiaojun Jing": "98/3588", "Songlin Sun": "76/8195", "Yuanquan Hong": "215/1935"}, "abstract": " Abstract:Applying mmWave technology to mobile communications has recently received increasing attention. One of the major technical challenges is to handle the frequent handover caused by mobility and blockage. Aiming to address this problem, we abstract the network layer to the physical layer via a cross-layer method and perform handovers in a centralized way based on software defined networking. In addition, in order to maintain enough user throughputs and reduce latency during handover procedure, we also propose a fast semi-offline beam training scheme, which takes advantage of mobile edge computing to pre-store the power delay angular profile data of the mmWave channel. The proposed scheme can ensure seamless connections when users are moving into a non-line-of-sight area, thereby providing users with better quality of service for promising applications in the fifth-generation networks, like augmented reality. We use data of field measurement to initially analyze the network throughput and latency for outdoor mmWave networks, which shows that our proposed system is reliable, scalable, and implementable."}, "conf/milcom/Ma0LL17": {"title": "Novel user clustering schemes for downlink NOMA system.", "url": "https://doi.org/10.1109/MILCOM.2017.8170745", "year": "2017", "author": {"Yuyu Ma": "210/6666", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we propose novel user clustering schemes for downlink non-orthogonal multiple access (NOMA) system, where an N-antenna base station (BS) selects and serves 2N users from K single antenna user equipments (UEs) (K â‰¥ 2N and K is even). In particular, we propose a signal difference and alignment (SDA) framework to achieve fair and spectral efficient user clustering for NOMA with flexible performance-complexity tradeoff. To be more specific, the BS sorts UEs according to their large-scale fading (LSF) gains and selects N primary UEs with the highest LSF gains to guide the downlink zero-forcing beamforming (ZFBF) vector. Then the BS selects N complementary UEs from the second half of the sorted UE set based on the principle of signal space alignment (SSA). Unlike conventional user scheduling, SDA framework uses the ordered set to create signal strength difference for NOMA while employing opportunistic SSA method to select complementary UEs with minimal inter-cluster interference leakage. Moreover, the SDA framework can enable distributed implementation with graceful performance at lower system overhead. Numerical results verify that the proposed schemes improve the performance in downlink NOMA system."}, "conf/milcom/LiuLT0L17": {"title": "On the performance of mode selection for hybrid-duplex D2D communications.", "url": "https://doi.org/10.1109/MILCOM.2017.8170849", "year": "2017", "author": {"Chenchen Liu": "151/4584", "Tiejun Lv": "77/4591", "Weijun Tang": "131/6399", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, a transmission mode selection scheme is proposed for device-to-device (D2D) communications underlay cellular networks, where potential D2D (p-D2D) users reuse the spectrum of uplink cellular users (CUEs). The developed framework is used to analyze and understand how the underlay D2D communication affects the cellular network performance. Unlike most of the previous researchers who only consider the performance for the full-duplex (FD) or half-duplex (HD) D2D network, we investigate the performance for hybrid FD/HD-D2D communications and propose a novel mode selection scheme for D2D users. In particular, we present a tractable analytical framework for a hybrid-duplex D2D-enabled cellular network, and the outage performances of the FD/HD-D2D receiver and the typical CUE are presented. Meanwhile, the spectral efficiency (SE) of the hybrid-duplex D2D-enabled cellular networks is given. Finally, numerical results are presented to verify the proposed scheme. From the simulation results, we can see that the proposed scheme can improve system SE."}, "conf/mobicom/HongJG0GX17": {"title": "Programmable Weight Phased-Array Transmission for Secure Millimeter-Wave Wireless Communication.", "url": "https://doi.org/10.1145/3130242.3130245", "year": "2017", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Hai Huang 0001": "51/944-1", "Ning Gao": "47/544", "Jiaoxiao Xie": "215/1934"}, "abstract": "\n\t\tWe propose a novel programmable weight phased array (PWPA) architecture and the corresponding transmission schemes for secure millimeter-wave communications. PWPA consists of a conventional phased-array architecture followed by a programable power amplifier used to adjust the weights of array element. We propose new solutions of inverted antenna subset transmission technique (IAST) and optimized weight antenna subset transmission technique (OWAST) based on PWPA. The proposed solutions use inverse phase signal to replace switching-off signal which can generate more artificial noise than conventional solutions on undesired direction. Theoretical and simulation results show that the proposed solutions provide better physical-layer security (PLS) performances compared current techniques.\n\t"}, "conf/wcnc/FengGWLG17": {"title": "A Noncoherent Differential Transmission Scheme for Multiuser Massive MIMO Systems.", "url": "https://doi.org/10.1109/WCNC.2017.7925583", "year": "2017", "author": {"Jing Feng": "69/6320", "Hui Gao 0001": "46/5223-1", "Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Weibin Guo": "18/2432"}, "abstract": " Abstract:A noncoherent multiuser transmission scheme is proposed for massive multiple-input multiple-output (M-MIMO) systems without explicit channel estimation. In particular, each user uses differential PSK modulation and the receiver employs differential detection. First, we propose a simple user selection scheme to optimize the distributions of power space profile (PSP) of individual users which alleviates the overlap of PSPs. Then, each output stream of the weighing filter is fed into a noncoherent successive interference cancellation (N-SIC) processor, and finally into a soft-input soft-output (SISO) multiple-symbol differential detector(MSDD). Employing the autocorrelation receiver (AcR) and the belief propagation(BP) message passing algorithm, the proposed SISO-MSDD framework can be easily integrated with advanced channel coding. The proposed scheme bears the potential to solve the high channel estimation overhead for conventional coherent M-MIMO systems. Simulation results show that the BER performance can be significantly improved within a few iterations of the proposed scheme."}, "conf/wcnc/LvLG17": {"title": "Novel User Scheduling Algorithms for Carrier Aggregation System in Heterogeneous Network.", "url": "https://doi.org/10.1109/WCNC.2017.7925894", "year": "2017", "author": {"Tiejun Lv": "77/4591", "Chenchen Liu": "151/4584", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, the carrier aggregation (CA) is applied to Heterogeneous Networks (HetNets) consisting of a macro base station (MBS) and low-power pico base stations (PBSs). The PBSs are distributed in the outer space of the disk centered at the MBS and the closed-form solution of the radius of the disk is analyzed. In the CA based HetNet, firstly, a practical user association scheme is proposed to classify the users into macrocell user (MUs) and pico-cell users (PUs). Secondly, a PU-centric cooperative transmission strategy is proposed to increase the data rate of PUs. Then, in order to eliminate the cross-tier interference in HetNet, the MUs and PUs schedule different component carriers (CCs) according to different algorithms. For the MUs, an improved simulated annealing (SA) scheduling algorithm is proposed to maximize the sum rate of the MUs. Compared with the existing SA, the inner loop of the proposed SA is redesigned. Consequently, the best value can be obtained more quickly. For PUs, a location information based low-complexity maximize minimum distance (MMD) algorithm is proposed to reduce the interference from PBSs to PUs as much as possible. Overall, an integrated scheme is proposed to improve the performance. At last, numerical results demonstrate the performance of the proposed schemes."}, "conf/wcnc/ZhangGL17": {"title": "Multicast Beamforming for Scalable Videos in Cache-Enabled Heterogeneous Networks.", "url": "https://doi.org/10.1109/WCNC.2017.7925617", "year": "2017", "author": {"Xuewei Zhang": "131/2976", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:This paper investigates multicast beamforming for scalable videos in cache-enabled heterogeneous networks, where a macro base station (MBS) and multiple small base stations (SBSs) serve multicast group users on-demand video services. Inspired by the main idea of the scalable video coding, the extension technology of the H.264/advanced video coding, each video is divided into a base layer (BL) and an enhancement layer (EL). The BL can provide the fundamental viewing quality and adding EL to the received BL can guarantee superior perceptual experience. The MBS and multiple SBSs cache the BLs and ELs of the most popular videos, respectively. Employing the transmission schemes in coordinated multi-point, i.e., parallel transmission and joint transmission, the MBS and SBSs parallelly transmit BLs and ELs while the SBSs cooperatively transmit the ELs if higher video qualities are required. To improve the quality of the received videos for users whose requirements can be satisfied locally, our aim is to maximize the weighted sum rate of them and this problem can be converted into an iterative second-order cone programming problem by successive convex optimization with low complexity. Numerical results demonstrate the advantage of our proposed scheme compared to the benchmark scheme, i.e., only MBS serving the end users, even when the transmit power of each SBS is kept low."}, "conf/eusipco/WangCGZL16": {"title": "Secure beamforming and artificial noise design for simultaneous wireless information and power transfer in interference networks.", "url": "https://doi.org/10.1109/EUSIPCO.2016.7760432", "year": "2016", "author": {"Weichen Wang": "96/8577", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Jian Zhou": "97/97", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We study a secure communication of a two-user interference network. In this network, two transmitters send information and artificial noise simultaneously to two users and energy receivers (ERs), and ERs are likely to perform as eavesdroppers. We propose a joint beamforming and artificial noise design to maximize the total energy harvested by ERs subject to the secrecy sum rate requirement and power constraints. The proposed design constitutes an optimization problem, which is non-convex yet can be further transformed into a two-stage problem. In the first stage, by introducing an auxiliary variable, we can reformulate the non-convex as a second-order cone program (SOCP) problem, and the constrained concave convex procedure based algorithm is proposed to make this SOCP problem tractable. In the second stage, the auxiliary variable is obtained by the one-dimensional line search. Numerical results demonstrate the effectiveness of the proposed algorithm."}, "conf/eusipco/LiRGL16": {"title": "Opportunistic interference alignment approach in device-to-device communications underlaying cellular networks.", "url": "https://doi.org/10.1109/EUSIPCO.2016.7760566", "year": "2016", "author": {"Xiaomeng Li": "02/9850", "Yuan Ren 0003": "69/4334-3", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We consider Device-to-Device (D2D) communications underlaying cellular networks with multiple cellular users (CUs) and multi-pair direct D2D users (DUs). In this considered scenario, we propose a novel opportunistic interference alignment (OIA) scheme to improve the sum rate of the whole networks. DUs are opportunistically selected based on the reference signal space (RSS) of the CUs. According to the RSS, the DUs can calculate the scheduling metric which represents the strength of D2D interference to CUs. Then, we select the DUs according to the computing result. Unlike most of the existing methods, the proposed OIA scheme relies on the local channel state information, which is more realistic in practice. In addition, in view of the angle between the interference caused by each DU and the RSS, several scheduling strategies are designed to enhance the performance. Numerical results show that the proposed scheme can improve the performance of the network."}, "conf/globecom/ZhangGTL16": {"title": "Resource Allocation of Energy-Efficient Multi-User Massive MIMO Systems.", "url": "https://doi.org/10.1109/GLOCOMW.2016.7849028", "year": "2016", "author": {"Yun Zhang": "02/6428", "Hui Gao 0001": "46/5223-1", "Fangqing Tan": "70/10505", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we develop a low-complexity resource allocation scheme for energy-efficient multi-user massive multiple-input multiple-output (MIMO) systems, which aims at optimizing the number of antennas, user selection and power allocation jointly. The system model considers channel estimation error for zero-forcing processing with a realistic power consumption. The energy efficiency (EE) maximization problem is a mixed integer and non-convex program, which is intractable to solve. The new scheme decomposes the original challenge into two sub-problems, and they can be tackled efficiently. The simulation results show that the utility of the proposed algorithm can achieve close- to-optimal EE performance with much lower complexity."}, "conf/icc/ZhangLG16": {"title": "A stochastic geometry based two-stage energy consumption minimization strategy via sleep mode with QoS constraint.", "url": "https://doi.org/10.1109/ICCW.2016.7503769", "year": "2016", "author": {"Kailai Zhang": "50/8987", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:With the ever-increasing demand for data traffic, high dense cellular networks are gaining extensive attention. But at the same time dense deployment of small cells results in high energy consumption and operating cost. Sleep mode for high dense cellular networks is emerging as a promising way to meet green communication. The aim of this paper is to use the two-stage strategy for reducing the energy consumption of high dense deployed cellular networks by turning some base stations (BSs) into sleep mode. The distribution of BSs and users is modeled as Poisson point process. By using the tools of stochastic geometry, we derive the network load and overload possibility of BSs. Based on the derived results, in the first stage, we randomly turn some BSs from the dense networks into sleep mode so as to reduce the density and power consumption of BSs while maintaining the quality of service of users. In the second stage, some of the remaining BSs are further turned into sleep mode by means of the proposed selection algorithm. Our two-stage strategy can significantly simplify the complexity of finding a relatively good result. Numerical results validate the analysis and show that the proposed strategy can significantly reduce energy consumption."}, "conf/icc/TangGSL16": {"title": "Joint source-relay selection in two-way full-duplex relay network.", "url": "https://doi.org/10.1109/ICCW.2016.7503849", "year": "2016", "author": {"Yanan Tang": "161/4654", "Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We investigate the outage probability of a variablegain amplify-and-forward (AF) relay network. A multi-source multi-relay network is considered with one destination and twoway traffic, where each node is equipped with two antennas and works on a full-duplex (FD) transmission mode. Meanwhile, the number of sources and relays is M and N, respectively. The residual self-interference, leaking from the full-duplex node's output to its input, exists in each node, and selective combing is performed at the source and the destination. In particular, we propose a practical joint source-relay selection scheme for this network, aiming to harvest selective diversity and power gain for reliable transmission. Unlike the existing schemes, we take the direct link from the source to the destination into consideration; therefore, it bears the potential to improve system stability. The proposed scheme only needs the local channel state information (CSI), and can be operated in a distributed manner. Furthermore, we derive a tight closed-form lower bound for the outage probability with the proposed scheme, and a simple asymptotic expression is also obtained with clear insights into the achievable diversity order. Our analysis shows that full cooperative diversity gain is achievable with the proposed scheme, and the selection on sources provides additional power gain. Finally, numerical results consolidate our theoretical analysis and show the effectiveness of the proposed scheme."}, "conf/milcom/WangGSL16": {"title": "Joint channel allocation, mode selection and power control in D2D-enabled femtocells.", "url": "https://doi.org/10.1109/MILCOM.2016.7795369", "year": "2016", "author": {"Min Wang": "181/2695", "Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:Femtocells and the device-to-device (D2D) communication can improve the system capacity in heterogeneous networks. To mitigate the interference caused by users in femtocells and improve the uplink capacity of femtocells, we investigate the users' uplink capacity maximization problem in D2D-enabled femtocells with channel allocation, mode selection and power control. Considering the rate requirement of cellular users and D2D users in femtocells and the interference limit of users served by the macro base station, the problem is formulated as a non-convex mixed integer optimization problem which is difficult to be solved directly. Firstly, the problem is transformed into a convex problem with the channel allocation variable relaxed. Then the dual decomposition method is utilized to solve the transformed problem. Numerical results confirm that the proposed method can enhance the uplink capacity of femtocells significantly."}, "conf/milcom/WangCGL16": {"title": "Robust beamforming and power allocation for secrecy in multi-pair decode-and-forward relay networks.", "url": "https://doi.org/10.1109/MILCOM.2016.7795385", "year": "2016", "author": {"Weichen Wang": "96/8577", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We address a robust beamforming design and power allocation problem for a multi-pair one-way relay network, where the single-antenna users of each pair implement communication via a decode-and-forward multi-antenna relay. In this network, a secure user and other unclassified users coexist with a multi-antenna eavesdropper, and only the imperfect eavesdropper's channel state information (ECSI) is available. We aim to maximize the worst-case secrecy rate of the secure user while guaranteeing the quality of service of the unclassified users with a total power constraint. Motivated by this challenge, we explore the beamforming design and power allocation among the sources and the relay with the channel matrix error. Unfortunately, the proposed design constitutes a non-convex problem, which involves an infinite number of constraints because of the imperfect ECSI. To this end, we propose an efficient algorithm by using the techniques of semidefinite relaxation, successive convex approximation and S-procedure techniques. Following a similar optimization framework, we further investigate the scheme with the channel covariance matrix error. Simulation results validate the effectiveness of the proposed algorithm."}, "conf/milcom/WangCGL16a": {"title": "Secure beamforming and power allocation for multi-pair decode-and-forward relay networks.", "url": "https://doi.org/10.1109/MILCOM.2016.7795491", "year": "2016", "author": {"Weichen Wang": "96/8577", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We study secrecy communication for a multi-pair decode-and-forward (DF) relay network (MP-DFRN), where one of the singe-antenna sources is wiretapped by a single-antenna eavesdropper. In particular, we aim to maximize the secrecy rate of the secure source while guaranteeing the quality of service (QoS) at the destinations with a total power constraint. The optimization requires a joint beamforming and power allocation at the multi-antenna relay, and this problem turns out to be non-convex. To this end, an efficient algorithm is proposed by using the techniques of successive convex approximation and constrained concave convex procedure. Following a similar optimization framework, we further investigate the transmit power minimization problem with secrecy and QoS constraints. Our study suggests a new and efficient framework to achieve secrecy communication in the MP-DFRN, and also reveals the interplay between the achievable secrecy rate and the total power budget."}, "conf/wicon/Feng0WLG16": {"title": "Noncoherent Joint Multiple Symbol Differential Detection and Channel Decoding in Massive MIMO System.", "url": "https://doi.org/10.1007/978-3-319-72998-5_25", "year": "2016", "author": {"Jing Feng": "69/6320", "Hui Gao 0001": "46/5223-1", "Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Weibin Guo": "18/2432"}, "abstract": "A noncoherent joint multiple symbol differential detection (MSDD) and channel decoding framework is proposed for massive multiple-input multiple-output (M-MIMO) system. The proposed framework bears the potential to solve the high channel estimation overhead for conventional coherent M-MIMO systems. Employing the autocorrelation receiver (AcR) and the belief propagation (BP) message passing algorithm, the proposed soft-input soft-output (SISO) MSDD can be easily integrated with advanced channel coding. Simulation results show that the BER performance can be significantly improved within a few iterations of the proposed scheme.KeywordsMSDDMassive MIMOSISOBP"}, "conf/chinacom/XingZSLG15": {"title": "Grouping-oriented admission control strategy in LTE-A/WLAN network.", "url": "https://doi.org/10.1109/CHINACOM.2015.7497908", "year": "2015", "author": {"Rongrong Xing": "172/6584", "Jie Zeng 0001": "00/2446-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:As the fifth generation of mobile technology (5G) is positioned to address the demands and business contexts of 2020 and beyond, many people devote themselves to explore a novel network architecture and communication solution. With the 5G springing up, the style of how people acquire, manage and engage with information will change. To meet this growing trend, a grouping-oriented admission control is proposed. The traditional heterogeneous network improves itself to realize anti-frequency networking by small base stations deployed in L-TEA and WLAN. The small base stations in one groups working in different frequency enhance the system energy efficiency. The strategy improves the quality of service users markedly. The simulation results shed light on that the admission control strategy really has a good effect on the improvement of the system performance."}, "conf/chinacom/LiuSZLG15": {"title": "Iterative grouping calibration for channel reciprocity in TDD MU-MIMO systems.", "url": "https://doi.org/10.1109/CHINACOM.2015.7498060", "year": "2015", "author": {"Qiang Liu 0030": "61/3234-30", "Xin Su 0001": "54/3643-1", "Jie Zeng 0001": "00/2446-1", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, we propose a new iterative grouping calibration algorithm for channel reciprocity in MU-MIMO (multiuser multiple-input multiple-output) systems. We assume the system operate in Time-division duplex (TDD). Because the TDD channel is reciprocal, we can use the uplink channel to estimate the downlink channel. The free-space electromagnetic channel can be regard as reciprocal channel in TDD channel. However, the generalized channel do not only consist of free-space electromagnetic channel, but also include transceiver circuitry. And in general case, the transceiver circuitry isn't perfect. For that reason, the reciprocity of generalized channel is destroyed. In this paper, we set a base station with one antenna to be the reference user, then we divide the MIMO BS antennas into N groups. We assume the users and every antenna group reform a new user-antenna group, the scope of transceiver circuitry coherence time in different user-antenna group are different. We only calibrate one user-antenna group in one free-space electromagnetic channel coherence time. The iterative grouping calibration algorithm in this paper can improve the channel capacity by transmitting pilot and signal at the same time slot. And the iterative grouping calibration algorithm goes especially well with massive mimo systems and high-speed mobile environment for its flexible antenna grouping."}, "conf/icc/ZhouCGZL15": {"title": "Secure beamforming and artificial noise design in interference networks with imperfect ECSI.", "url": "https://doi.org/10.1109/ICCW.2015.7247216", "year": "2015", "author": {"Jian Zhou": "97/97", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Cong Zhang 0003": "18/2908-3", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:This paper investigates the joint robust beamforming and artificial noise design in two-user interference networks, where one of the two pairs is wiretapped by an external eavesdropper, and only imperfect eavesdropper's channel state information (ECSI) is available for the two pairs. Under individual transmission power constraint, our goal is to maximize the worst-case achievable secrecy rate of the wiretapped node and guarantee the signal-to-interference-plus-noise ratio (SINR) requirement at the wiretap-free node. In particular, considering the channel vectors and channel covariance matrices errors, we first model the imperfect ECSI in the sense of ellipsoidal uncertainties. In the sequel, our design goal is transformed into solving a non-convex optimization problem which can be further reformulated as a two-stage problem. With the help of rank relaxation and one dimensional line search, the considered two-stage problem is solved efficiently. Simulation results demonstrate the effectiveness of the proposed design in different scenarios."}, "conf/icc/LiGLS15": {"title": "Nonparametric belief propagation based positioning via distributed network formation.", "url": "https://doi.org/10.1109/ICCW.2015.7247281", "year": "2015", "author": {"Xiaopeng Li": "45/1827", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Xin Su 0001": "54/3643-1"}, "abstract": " Abstract:Nonparametric belief propagation (NBP) algorithm is a popular probabilistic localization method in wireless sensor networks. It is particle-based and can be applied in nonlinear and non-Gaussian inference problems. However, NBP has practical limitations in dense networks due to the high computational complexity and network traffic resulting from the ranging and information exchanges with neighboring nodes in cooperative localization. In this paper, we design a distributed network formation approach to select a sufficient number of beneficial links resulting in a new network for cooperative localization, which improves the efficiency of localization owing to the reduction of redundant links. In addition, we develop a metric to judge and filter the invalid NBP particles, which can increase the accuracy of the localization. Simulation results show that the proposed scheme outperforms conventional methods."}, "conf/icc/ZhouCGLL15": {"title": "Secrecy communication of wireless information and power transfer system with green relay.", "url": "https://doi.org/10.1109/ICCW.2015.7247481", "year": "2015", "author": {"Jian Zhou": "97/97", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Haijing Liu": "33/9282", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we propose a secrecy communication scheme for half-duplex amplify-forward relay networks in the presence of multiple eavesdroppers. Unlike conventional relay network, we consider that the relay is â€œgreenâ€, i.e., it is powered by the energy harvested from the relay observations. The transmission can be divided into two time slots. In the first time slot, the source and destination transmit signal and artificial noise (AN), respectively. The dual use of AN in jamming eavesdroppers and providing wireless energy for the relay is advocated. At the relay, the received signal is divided into two parts by power splitter and goes into energy harvester and information transceiver, respectively. In the second time slot, the â€œgreenâ€ relay forwards the information to destination using the energy scavenged in the first time slot. The eavesdroppers can wiretap during both slots. Our scheme is to maximize the secrecy rate subject to the total transmit power constraint or minimize the total transmit power subject to the secrecy rate requirement. By applying successive convex approximation approach, we can convert these challenging non-convex problems into second-order cone program based iterative problems. Simulation results show the effectiveness of the proposed scheme."}, "conf/iccchina/YueGYLZ15": {"title": "Low complexity joint beamforming and power splitting for massive MIMO multicasting SWIPT.", "url": "https://doi.org/10.1109/ICCChina.2015.7448681", "year": "2015", "author": {"Zhaohui Yue": "164/8809", "Hui Gao 0001": "46/5223-1", "Chau Yuen": "01/753", "Tiejun Lv": "77/4591", "Jie Zeng 0001": "00/2446-1"}, "abstract": " Abstract:This paper considers simultaneous wireless information and power transfer in massive multiple-input multiple-output (MIMO) multicasting systems where the base station (BS) is equipped with a very large number of antennas and each mobile station (MS) can receive both information and energy from the signal sent by the BS simultaneously via a power splitting (PS) device, whereby the received signal is split such that a portion of the signal power is fed to the information decoder and the remaining portion of the power to the energy harvester of the receiver. We propose a joint multicast transmit beamforming and receive PS scheme for minimizing the transmit power of the BS subject to signal-to-noise ratio and energy harvesting constraints at each MS. Due to the asymptotic orthogonality of the channel vectors when the number of transmit antennas is large, we are able to obtain the closed-form asymptotically optimal beamforming vector and PS parameters. Therefore the proposed scheme enjoys relatively low computational complexity. Both scenarios of perfect and imperfect channel state information at BS are evaluated. Simulation results verify the effectiveness of the proposed scheme."}, "conf/iccchina/ZhangGSL15": {"title": "Joint femtocell clustering and selective beamforming for interference mitigation in heterogeneous networks.", "url": "https://doi.org/10.1109/ICCChina.2015.7448698", "year": "2015", "author": {"Deyue Zhang": "86/10652", "Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:A joint femtocell clustering and selective beamforming scheme is proposed to mitigate the severe interference at femtocell base stations (FBSs) caused by the uplink transmissions of macrocell users (MUs) within the heterogeneous networks (HetNets). Firstly, a number of adjacent FBSs are clustered according to a low complexity location-aware scheme, while their serving femtocell users (FUs) and some strongly interfering MUs are also enclosed in the cluster to perform uplink transmission. It is noted that the proposed clustering scheme actually splits the coverage of the considered HetNets, and further coarsely confines the dominating interference sources within each cluster. Then, both beamforming at the in-cluster FUs and MUs are designed with a strategy to minimize the generated interference (MinGI) toward some selected interference-vulnerable FBS(s) within each cluster. By employing such low-complexity selective beamforming, the in-cluster interference is significantly mitigated. In general, the proposed joint scheme notes the heterogeneous distribution of strong interference sources within the HetNets, and effectively mitigates the overall interference in a divide-and-conquer fashion with emphasis. Numerical results show that the proposed scheme outperforms the state-of-the-arts."}, "conf/iccchina/ZhouGCL15": {"title": "Secure beamforming design in wiretap MISO interference channels.", "url": "https://doi.org/10.1109/ICCChina.2015.7448620", "year": "2015", "author": {"Jian Zhou": "97/97", "Hui Gao 0001": "46/5223-1", "Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we study the secrecy communication in two-user MISO interference networks where an eavesdropper is only interested in one of the transmitters, i.e., transmitter 1. We propose a generalized beamforming design to maximize the achievable secrecy rate of transmitter 1 while guaranteeing the quality of service (QoS) of the other destination. The non-convex problem can be transformed into a two-stage problem. The inner stage is a semidefinite program (SDP) problem based on the semidefinite relaxation (SDR) and the outer stage is a one dimensional line search problem. It is also shown in the proof that the SDR is always tight and yields a rank-one solution. Furthermore, we also propose a low-complexity null-space beamforming design scheme in which the beamforming vectors can be obtained by solving a second-order cone program (SOCP) problem. Simulation results show the effectiveness of the two proposed schemes in improving the secrecy rate performance."}, "conf/vtc/WangGYL15": {"title": "Low Complexity User Scheduling Design for Multi-Pair Two-Way Relay Channels.", "url": "https://doi.org/10.1109/VTCSpring.2015.7145921", "year": "2015", "author": {"Yan Wang": "59/2227", "Hui Gao 0001": "46/5223-1", "Chau Yuen": "01/753", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we consider low-complexity user scheduling schemes for the multi-pair two-way relay channel, where L pairs of single antenna users are selected from K pairs to perform pair-wise information exchange via an N\nr\n-antenna amplify-and-forward (AF) relay (N\nr\n â‰¥ 2L - 1) with analogue network coding (ANC). We first propose a simple channel norm (CN) based scheme, which enables low-complexity implementation. Then, we propose a near-optimal user scheduling by jointly considering the pair-wise channels norms and orthogonality among all the users (CNO-A), which requires global channel state information (CSI) and centralized computation at the relay. It is noted that CNO-A scheme can achieve comparable performance as the optimal scheduling with reduced computational complexity. Finally, we propose a two-step selective CNO scheme (CNO-S), which strikes a flexible balance between complexity/CSI overhead and performance. CNO-S significantly reduces CSI overhead and computational complexity at the relay, while achieving comparable performance as the CNO-A scheme. Numerical results and complexity analysis not only show that the proposed schemes are feasible and effective, but also demonstrate their advantages over the existing schemes."}, "conf/vtc/YueGCL15": {"title": "The Sum-Rate Maximization Precoding for Multiuser MIMO SWIPT Systems.", "url": "https://doi.org/10.1109/VTCSpring.2015.7146132", "year": "2015", "author": {"Zhaohui Yue": "164/8809", "Hui Gao 0001": "46/5223-1", "Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:This paper proposes a linear precoding that aims at maximizing the sum-rate in a multiuser multiple-input multiple-output (MU-MIMO) simultaneous wireless information and power transfer (SWIPT) system. In this scenario some receivers harvest energy while the others decode information at the same time. The sum-rate for information decoding users is considered as the optimization policy where the transmit power constraint and power harvesting per user constraints are taken into account. Since the objective function of the sum-rate maximization problem is non-convex, it is difficult to find the optimal solution. Thus, we propose an iterative algorithm to find a locally optimal design based on a sequential convex approximation (SCA) method. In this way, the non-convex optimization problem is approximated by a convex program at each iteration. Finally, with the aid of the concept of the Rate-Energy (R-E) region simulation results show that the proposed scheme achieves significant improvement compared to existing works."}, "conf/vtc/ZhangGRLY15": {"title": "Novel Opportunistic Interference Mitigation Schemes for Heterogeneous Networks.", "url": "https://doi.org/10.1109/VTCSpring.2015.7145957", "year": "2015", "author": {"Deyue Zhang": "86/10652", "Hui Gao 0001": "46/5223-1", "Yuan Ren 0003": "69/4334-3", "Tiejun Lv": "77/4591", "Chau Yuen": "01/753"}, "abstract": " Abstract:This paper considers to mitigate the uplink cross- tier interference (CI) in heterogeneous networks (HetNets) by the idea of opportunistic transmission. Firstly, we introduce the conventional opportunistic interference alignment (OIA) into HetNets and it indeed reduces the CI from the macrocell users (MUs) effectively. Interestingly, based on the unique characteristic in HetNets, the performance of OIA can be further improved. Therefore, the novel opportunistic interference mitigation (OIM) schemes based on adaptive reference signal spaces (A-RSSs) are proposed. In the novel OIM, an A-RSS is defined for each FBS and the A-RSS of a FBS constantly updates as the channel state information (CSI) of its FUs changes. According to the A-RSSs of all FBSs, each MU calculates its scheduling metric and the macrocell base station (MBS) selects MUs by the metrics. However, broadcasting the A-RSS constantly makes the system more complicated, so a complexity- performance tradeoff is considered. To decrease the complexity of the system, the quantization codebook is introduced and the quantized A-RSS based OIM is proposed. At last, extensive simulations are conducted. It is shown that, in terms of femtocells, the performance of novel OIM is better than that of the codebook based OIM (CB-OIM) and the performance of CB-OIM is better than that of conventional OIA."}, "conf/vtc/ZhouCGZL15": {"title": "Secure Beamforming Design in Wiretap MISO Interference Channels.", "url": "https://doi.org/10.1109/VTCSpring.2015.7146073", "year": "2015", "author": {"Jian Zhou": "97/97", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Cong Zhang 0003": "18/2908-3", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we study the secrecy communication in two-user MISO interference networks where an external eavesdropper is interested in the messages transmitted by both transmitters. We propose a beamforming design to maximize the achievable secrecy sum rate of the transmitters subject to the individual power constraint at each transmitter. To transform this complex non-convex problem into a convex one, we propose an iterative algorithm based on the constrained concave convex procedure (CCCP) and successive convex approximation (SCA). It is observed that the proposed algorithm converges fast to a stationary point within a few iterations. Furthermore, we also propose a low-complexity null-space beamforming design scheme in which the beamforming vectors have closed-form solutions. Simulation results show the effectiveness of the two proposed schemes in improving the secrecy sum rate performance."}, "conf/wcnc/LiGCL15": {"title": "Nonparametric belief propagation based cooperative localization: A minimum spanning tree approach.", "url": "https://doi.org/10.1109/WCNC.2015.7127737", "year": "2015", "author": {"Xiaopeng Li": "45/1827", "Hui Gao 0001": "46/5223-1", "Hong Cai": "22/4111", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:Nonparametric belief propagation (NBP) algorithm can result in approximately optimal performance for probabilistic localization in wireless sensor networks without loops theoretically. However, in loopy networks the accuracy of NBP is doubtful and the computational complexity is high. In this paper, a novel approach running NBP on a minimum spanning tree (MST) is proposed, which mitigates the influence of loops and significantly reduces the computational cost as compared with the conventional NBP schemes. In addition, different from other spanning trees, the MST can confine more NBP particles into the bounding circle. Therefore, it shows better resistance to measurement errors. Numerical results show that the proposed method achieves better performance in terms of accuracy in highly connected networks, and the computational cost is much lower than the conventional NBP methods."}, "conf/wocc/LiuSZGLXX15": {"title": "An improved relative channel reciprocity calibration method in TDD massive MIMO systems.", "url": "https://doi.org/10.1109/WOCC.2015.7346185", "year": "2015", "author": {"Qiang Liu 0030": "61/3234-30", "Xin Su 0001": "54/3643-1", "Jie Zeng 0001": "00/2446-1", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Xibin Xu": "98/2265", "Chiyang Xiao": "151/6226"}, "abstract": " Abstract:In this paper, we introduce an improved relative channel reciprocity calibration method in TDD massive multiple-input multiple-output (MIMO) systems. The improved calibration method divide the massive MIMO system into one Single-Input Single-Output (SISO) system and two Single-Input Multiple-Output (SIMO) systems instead of calibrating the massive MIMO directly. We select the channel with high channel gain to be the reference channel (the SISO system), the antennas of the SISO system are the reference antennas. At the same station the reference antenna and the other antennas consist the SIMO system. The three systems include all the receive circuitry and the transmit circuitry information of the massive MIMO system. We calibrate the three systems and acquire the calibration coefficients. Then we use the calibration coefficients of the three systems to calibrate the massive MIMO system. The proposed calibration method in this paper can reduce the amount of feedback and the computation complexity compared with calibrating the massive MIMO directly. What's more, the improved calibration method outperforms the traditional calibration method under high-speed mobile environment."}, "conf/wocc/ZengXSGLX15": {"title": "Admission control strategy in LTE-A and WLAN integrated network.", "url": "https://doi.org/10.1109/WOCC.2015.7346186", "year": "2015", "author": {"Jie Zeng 0001": "00/2446-1", "Rongrong Xing": "172/6584", "Xin Su 0001": "54/3643-1", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Xibin Xu": "98/2265"}, "abstract": " Abstract:With the rising of smart devices and data-intensive service, more and more people have been dedicated to the study of a novel network architecture and communication solution. As 5G revolutionizes how humans acquire, manage and engage with information, this trend will accelerate. To meet this evolution, a novel admission control strategy in LTE-A and WLAN integrated network is proposed in this paper. In the coexistence scenario of macro base stations and pico base stations, the pico base stations could use LTE-A or WLAN. In the proposed strategy, part of the users in the extension range of the pico cell are selected to redistribute the served base station and served access network. This admission control strategy could keep LTE-A network and WLAN network balanced and not crowded. We investigate the performance of this strategy for different scenarios. The simulation results shed light on that the admission control strategy really has a good effect on the improvement of the system performance."}, "conf/globecom/CaiGLLS14": {"title": "Propagation controlled cooperative positioning in wireless networks using bootstrap percolation.", "url": "https://doi.org/10.1109/GLOCOM.2014.7036844", "year": "2014", "author": {"Hong Cai": "22/4111", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334", "Xin Su 0001": "54/3643-1"}, "abstract": " Abstract:In this paper, bootstrap percolation is introduced to control the information propagation for efficient cooperative positioning in wireless networks. Particularly, we obtain a novel linear least square (LLS) estimator for the localization of agent nodes. Exploiting the idea of bootstrap percolation, agent nodes sequentially get activated and estimate their positions with an adaptive location updating rule. The rule is designed to first localize the more reliable agent nodes with at least three connections to the active nodes, and then gradually relax such connection constraints in each iteration so as to localize the agent nodes with fewer connections. Due to the activation characteristic, error propogation can be mitigated and energy is well managed. In addition, taking the uncertainty of the positional information into account, positioning errors can be further reduced. Simulations show that the proposed schemes improve the localization accuracy and use fewer links than traditional methods."}, "conf/globecom/TanGLZ14": {"title": "Achievable sum rate analysis of ZF receivers in 3D MIMO with Rayleigh/log-normal fading channels.", "url": "https://doi.org/10.1109/GLOCOMW.2014.7063533", "year": "2014", "author": {"Fangqing Tan": "70/10505", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Jie Zeng 0001": "00/2446-1"}, "abstract": " Abstract:Three dimensions multiple-input multiple-output (3D MIMO) system is now gaining a growing interest among researchers in wireless communication, the reason can be attributed to its potential to enable a variety of strategies like user specific 3D beamforming and cell-splitting. In this paper, we pursue the performance evaluation of 3D MIMO system employing zero-forcing (ZF) receivers, accounting for both large and small-scale fading. In particular, we consider the classical log-normal model and antenna gain with tilting angle, we derive the optimal tilting angle for 3D MIMO system which maximizes the sum rate, furthermore, based on the optimal tilting angle, we propose a closed-form linear approximation on the achievable sum rate in the asymptotically high signal-to-noise ratio (SNR) and low-SNR regime, respectively. We investigate the effect of antenna tilting angle, number of base station (BS) antennas and the distance between BS and the center of building on the achievable sum rate performance of 3D MIMO."}, "conf/globecom/ZhangGLLS14": {"title": "Beamforming for secure two-way relay networks with physical layer network coding.", "url": "https://doi.org/10.1109/GLOCOM.2014.7037059", "year": "2014", "author": {"Cong Zhang 0003": "18/2908-3", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334", "Xin Su 0001": "54/3643-1"}, "abstract": " Abstract:We investigate the secrecy beamforming in two-way relay channels (TWRC) with physical layer network coding (PNC). The multi-antenna relay broadcasts the superimposed signal of two user messages with secrecy beamforming after receiving the signals transmitted by the two legitimate users. We first propose a lower bound of the secrecy sum rate to quantify the secrecy performance of the TWRC with PNC. Because the maximization of the lower bound is non-convex under total power constraint, we propose a joint beamforming and power allocation scheme, in which the problem is successively approximated by several convex semidefinite programs. In order to reduce the complexity, we further propose an suboptimal scheme with closed-form solution. Numerical results indicate that the proposed schemes with PNC achieve much better secrecy sum-rate performance than the traditional AF schemes."}, "conf/icc/BiGL14": {"title": "Joint source-relay selection and transmission mode selection in two-way relay networks.", "url": "https://doi.org/10.1109/ICCW.2014.6881213", "year": "2014", "author": {"Gaoli Bi": "150/6335", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:A joint source-relay selection and transmission mode selection scheme is proposed for two-way relay networks. The proposed scheme adaptively switches from one-way and two-way transmission mode according to the channel state information (CSI) of the selected relay and source. The proposed joint scheme utilizes the direct link channels and the time-varying character of the channels, therefore, it is more reliable than the existing schemes. A tight closed-form lower bound and an asymptotic expression in high SNR regime for the outage probability of the proposed scheme are derived. From these theoretical results, our scheme is shown to achieve the maximal diversity order of M + N, where M and N are the number of source nodes and relay nodes, respectively. Finally, simulation results validate the theoretical analysis."}, "conf/icc/LongGL14": {"title": "Asymmetric signal space alignment for multi-pair two-way relaying network.", "url": "https://doi.org/10.1109/ICCW.2014.6881214", "year": "2014", "author": {"Wei Long": "33/1429", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we investigate asymmetric signal space alignment (ASSA) for the multi-pair two-way relaying (TWR) network, which consists of three pairs of single-antenna users and a two-antenna common access relay. In this particular scenario, the traditional signal space alignment (SSA) scheme has to rely on symbol extension for the reason of insufficient spatial dimensions. Moreover, the naive zero-forcing (ZF) based scheme only achieves 1 degrees of freedom (DOF). By utilizing ASSA, the DOF of 1.5 can be obtained without symbol extension. In addition, in order to further improve the sum rate, a joint beamforming optimization (JBO) algorithm is presented, which jointly optimizes the beam vectors of the users and relay. In consideration of the case with more than three pairs of users, we also propose a semi-orthogonal aligned user-pair scheduling (SAUS) method, which not only facilitates the ASSA scheme, but also harvests the multiuser diversity (MuD) to enhance the performance."}, "conf/icc/GaoRYL14": {"title": "A distributed user scheduling scheme for MIMO multi-way relay channel.", "url": "https://doi.org/10.1109/ICC.2014.6884084", "year": "2014", "author": {"Hui Gao 0001": "46/5223-1", "Yuan Ren 0003": "69/4334-3", "Chau Yuen": "01/753", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:A simple distributed user scheduling (DUS) scheme is proposed for the MIMO multi-way relay channel (MWRC), where K (K â‰¥ 2) M-antenna (M â‰¥ 2) users are selected from K clusters of users to conduct all-cast information exchange via an M-antenna amplify-and-forward (AF) relay. In particular, the proposed DUS is based on the individual performance metric calculated by each user with its local channel state information (CSI). Therefore, DUS bypasses global CSI and complicated computations at the scheduling center, both are often inevitable with traditional centralized user scheduling (CUS). Furthermore, the outage performance of DUS is analyzed and the achievable multi-user diversity (MuD) order is derived. Numerical results validate the theoretical derivations and show that DUS achieves comparable performances to CUS in the considered scenarios."}, "conf/iccchina/Li0L14": {"title": "Outage analysis of MIMO multiuser broadcast scheduling with MMSE receiver.", "url": "https://doi.org/10.1109/ICCChina.2014.7008233", "year": "2014", "author": {"Rongsheng Li": "147/5827", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In future wireless communication systems, multiple-input multiple-output (MIMO) technique and multi-user scheduling may play a key role in enhancing link reliability and spectral efficiency. In addition, linear signal processing is near-optimal when the number of the antennas becomes very large in the next generation wireless network. In this paper, we aim to investigate overall outage performance of multi-user MIMO broadcast system using minimum mean squared error receivers. Several scheduling algorithms are considered over Rayleigh fading channel. Tight and closed-form upper bounds of the overall outage probabilities are derived for two round-robin scheduling algorithms and two feedback-based opportunistic scheduling algorithms. Our analysis indicates that there exists an performance gap between opportunistic scheduling algorithm and stream-specific opportunistic scheduling algorithm. This gap is related to the number of transmit data streams N\nt\n and the number of users K, and the gap becomes larger as N\nt\n and K increase."}, "conf/iccchina/BaiGLY14": {"title": "Low-complexity user scheduling in the downlink massive MU-MIMO system with linear precoding.", "url": "https://doi.org/10.1109/ICCChina.2014.7008306", "year": "2014", "author": {"Ou Bai": "47/6083", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Chau Yuen": "01/753"}, "abstract": " Abstract:In this paper, we investigate low-complexity user scheduling schemes for the downlink (DL) massive multiuser multiple-input multiple-output (MU-MIMO) system, where an M-antenna (M is very large) base station (BS) serves K (K > 2) N-antenna (N > 1) users with linear transceivers. Establishing the theoretical foundation of our scheduling schemes, we first investigate the asymptotic sum-rates of this system with both singular value decomposition (SVD) and regularized zero-forcing (RZF) precoders. In particular, we assume that both M and N go to infinity with a bounded ratio to perform the theoretical derivations with random matrix theory (RMT). In addition, the influence of imperfect channel estimation is also considered. Interestingly, the analysis indicates the existence of an optimal number of served users K\n1\n in terms of asymptotic sum-rate, which motivates our low complexity user scheduling schemes. Unlike the conventional schemes with complicated computations and instantaneous channel state information, our user scheduling schemes are based on semi-analytical solutions with only statistic CSI. Simulation results validate our theoretical derivations and show the advantages of our schemes in the massive MU-MIMO system."}, "conf/ict/LiuGHL14": {"title": "Low-complexity transmission mode selection in MU-MIMO systems.", "url": "https://doi.org/10.1109/ICT.2014.6845070", "year": "2014", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Anzhong Hu": "137/0253", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We propose a low-complexity transmission strategy in multi-user multiple-input multiple-output downlink systems. The adaptive strategy adjusts the precoding methods, denoted as the transmission mode, to improve the system sum rates while maintaining the number of simultaneously served users. Three linear precoding transmission modes are discussed, i.e., the block diagonalization zero-forcing, the cooperative zero-forcing (CZF), and the cooperative matched-filter (CMF). Considering both the number of data streams and the multiple-antenna configuration of users, we modify the common CZF and CMF modes by allocating data streams. Then, the transmission mode is selected between the modified ones according to the asymptotic sum rate analyses. As instantaneous channel state information is not needed for the mode selection, the computational complexity is significantly reduced. Numerical simulations confirm our analyses and demonstrate that the proposed scheme achieves substantial performance gains with very low computational complexity."}, "conf/ict/LiGLL14": {"title": "Joint relay transmit-receive antenna selection and opportunistic source selection strategy for full-duplex relaying.", "url": "https://doi.org/10.1109/ICT.2014.6845076", "year": "2014", "author": {"Rongsheng Li": "147/5827", "Hui Gao 0001": "46/5223-1", "Wei Long": "33/1429", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we investigate a cooperative relay network where two users exchange messages through a full-duplex relay. A joint relay transmit-receive antenna selection and opportunistic source selection (RAS-OSS) strategy is proposed to improve the performance of the full-duplex relay network, when the roles of the antennas at the full-duplex relay are not predefined. Both of the amplify-and-forward (AF) and decode-and-forward (DF) protocols are considered at the relay. Asymptotic approximations of average transmission rate and outage probability are derived to evaluate the performance of the network when the RAS-OSS strategy is adopted. Both analytical and numerical results reveal that the asymptotic approximations are tight in high signal-to-noise ratio regime and the RAS-OSS strategy improves the performance of the network under both AF and DF protocols."}, "conf/ict/LiuGLL14": {"title": "A novel scheme for downlink opportunistic interference alignment.", "url": "https://doi.org/10.1109/ICT.2014.6845114", "year": "2014", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Wei Long": "33/1429", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper we propose a downlink codebook-based opportunistic interference alignment (OIA) in a three-cell MIMO system. A codebook composed of multiple transmit vector sets is utilized to improve the multiuser selection diversity. The sum rate increases as the size of the codebook grows. In addition, during the user selection, effective channel gain and alignment metric are combined to generate a novel criterion, which improves the system performance, especially at low SNR. Furthermore, a threshold-based feedback approach is introduced to reduce the feedback load in the proposed scheme. Both the analytical results and simulations show that the proposed scheme provides significant improvement in terms of sum rates with no feedback load growth and slight increase of complexity."}, "conf/milcom/ZhangGLL14": {"title": "Robust Beamforming and Jamming for Secure AF Relay Networks with Multiple Eavesdroppers.", "url": "https://doi.org/10.1109/MILCOM.2014.89", "year": "2014", "author": {"Cong Zhang 0003": "18/2908-3", "Hui Gao 0001": "46/5223-1", "Haijing Liu": "33/9282", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we study the secrecy transmission in multi-antenna relay networks with multiple eavesdroppers. The relay employs the amplify-and-forward relaying protocol and simultaneously sends the artificial noise to interfere the eavesdroppers. It is assumed that only imperfect channel state information on the main and eavesdropping channels is available at the relay. We exploit the robust beam forming and jamming to maximize the worst-case secrecy rate under a total relay power budget. Because of the infinitely nonconvex constraints, the problem is difficult to solve. Therefore, we approximate the problem into several tractable semi definite programs by semi definite relaxation, S-procedure, and the successive convex approximation techniques. Simulation results show the effectiveness of the proposed scheme."}, "conf/milcom/BiGLW14": {"title": "Alamouti-based Schemes for Full-Duplex Two-Way Relay Networks.", "url": "https://doi.org/10.1109/MILCOM.2014.263", "year": "2014", "author": {"Gaoli Bi": "150/6335", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Wenqing Wang": "03/4982"}, "abstract": " Abstract:In this paper, we propose a new full-duplex (FD) scheme based on Alamouti space-time code for the two-way amplify-and-forward (AF) relay networks. Compared with the conventional full-duplex two-way relay scheme, the proposed scheme can exploit the direct link instead of neglecting it or considering it as interference. Therefore the proposed scheme has a much better outage performance than the existing schemes. In order to further improve the performance of the considered system, two hybrid half/full duplex two-way relay schemes are also proposed in this paper. These hybrid schemes eliminate the platform phenomenon of the outage probability caused by the residual self-interference. We characterize the instantaneous capacity of the proposed Alamouti based FD scheme. And numerical results are provided to prove the superiority of the three proposed schemes."}, "conf/vtc/BaiLG14": {"title": "Blind Interference Neutralization in 3-Cell Interference Channel with Shared Relay.", "url": "https://doi.org/10.1109/VTCSpring.2014.7022845", "year": "2014", "author": {"Ou Bai": "47/6083", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, a novel scheme called blind interference neutralization is provided in the 3- cell interference channel with a shared instantaneous relay. The shared relay not only receives signals from sources, but also sends signals to destinations with a processing matrix. With the proposed scheme, each destination is able to pick up its own desired signal without encountering inter-user interference (IUI). In particular, the sources are blind in the sense that no channel state information (CSI) is required for transmit beamforming. Numerical simulation shows that the proposed scheme, compared with others, can increase the sum rate performance."}, "conf/vtc/CaiLGH14": {"title": "TOA Estimation Using Checking Window for IR-UWB Energy Detection Receivers.", "url": "https://doi.org/10.1109/VTCSpring.2014.7023127", "year": "2014", "author": {"Hong Cai": "22/4111", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Anzhong Hu": "137/0253"}, "abstract": " Abstract:Precise ultra-wideband (UWB) ranging requires accurate estimation of time of arrival (TOA). In this paper,a novel TOA estimation approach using checking window is proposed for energy detection (ED) receivers in dense multipath channels. Unlike the traditional methods that treat the multipath components (MPCs) as interference sources, the proposed scheme exploits the MPCs to consolidate the detection of the first path (FP). By detecting dense threshold-crossing (TC) events over successive energy samples with the checking window, the MPCs are collected, and the false TC events that sparsely distributed in the noise region can be recognized and neglected for the FP detection. As a result, the early false detection is reduced and the leading edge detection is improved. Simulations demonstrate the effectiveness and robustness of the proposed scheme in IEEE 802.15.4a channels."}, "conf/vtc/LiLG14": {"title": "A More Accurate Outage Analysis for ZF-Based MIMO AF Two-Way Relaying by Order Statistics.", "url": "https://doi.org/10.1109/VTCSpring.2014.7022782", "year": "2014", "author": {"Rongsheng Li": "147/5827", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, a more accurate outage performance analysis is obtained by employing order statistics for multiple-input multiple-out two-way relay system with joint transmit/receive zero-forcing. Furthermore, closed-form upper and lower bounds are first derived for the overall outage probability when there exist spatial correlations at the relay. Analysis and simulation results indicate that the upper bound derived with order statistics is tight under various spatial correlations at the relay, and it is also tighter than that derived by eigenvalues of Wishart matrices over independent identically distributed Rayleigh fading channel. For example, when the relay is equipped with 4, 6 and 8 antennas, the upper bounds derived with order statistics are 2dB, 3dB and 4dB tighter than those with eigenvalues, respectively. In particular, when the numbers of antennas equipped at the users are greater than that equipped at the relay, the derived upper bound is nearly identical to the exact results."}, "conf/vtc/LiuGL14": {"title": "Low-Complexity Multiuser MIMO Downlink User Selection Based on Large-Scale Fading.", "url": "https://doi.org/10.1109/VTCFall.2014.6966042", "year": "2014", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We propose a low-complexity user selection scheme with zero-forcing precoding in multiuser MIMO downlink systems, where the base station (BS) is equipped with large-scale antenna arrays and the number of candidate-users is relatively small. The BS obtains the channel state information (CSI) of the user equipments (UEs) through the pilot-based minimum mean-square error channel estimation. Taking both the channel propagation and the UE location distribution into consideration, we first derive a deterministic approximation of the ergodic sum rate and investigate the optimal number of active UEs, K*, in the sense of sum rate maximization. Then, K* UEs are selected for simultaneous data transmission according to their large-scale channel fading. Small-scale channel fading is not taken into account in the selection procedure, thus reducing the computational complexity dramatically as well as improving the robustness of the proposed scheme in practice. Numerical simulations suggest that whether perfect CSI is available at the BS, our proposed scheme achieves high sum rate performance with very low complexity."}, "conf/vtc/WangLGH14": {"title": "Tight Semidefinite Relaxation for Combinatorial Optimization in UWB Multiuser Detection Systems.", "url": "https://doi.org/10.1109/VTCSpring.2014.7023124", "year": "2014", "author": {"Chanfei Wang": "154/3583", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Anzhong Hu": "137/0253"}, "abstract": " Abstract:In this paper, two near-optimal detectors based on the convex optimization algorithm are proposed for multiuser detection (MUD) in the ultra-wide bandwidth (UWB) systems. The first detector performs semidefinite relaxation (SDR) to approximate the optimum multiuser detection (OMD) which is a nondeterministic polynomial time hard (NP-hard) problem. When the cutting planes generation algorithm is employed to strengthen the relaxation of the SDR, a tight MUD detector for combinatorial optimization is obtained by adding triangle inequalities to the well-known SDR in strict feasible region. Simulations demonstrate that the semidefinite programming (SDP) approaches can provide bit error rate (BER) performance close to the OMD efficiently using the interior point method, and the tight detector provides a better BER performance than the previous detector with a slightly higher complexity."}, "conf/vtc/ZhangLCG14": {"title": "Improving Secrecy Outage Probability with Symbol Extension.", "url": "https://doi.org/10.1109/VTCSpring.2014.7022947", "year": "2014", "author": {"Cong Zhang 0003": "18/2908-3", "Tiejun Lv": "77/4591", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:This paper reveals symbol extension is capable of improving secrecy performance in the multiple-input single-output (MISO) wiretap channel. We propose a symbol extension scheme jointly with the existing beamforming and artificial noise generation strategy to exploit the time variation of fading channel. After multiplying the data symbol vector by a proper designed square matrix, the data symbol can be extended to multiple time-slots. As a result, without any symbol rate loss, the proposed scheme enhances the secrecy performance in terms of secrecy outage probability. Furthermore, we also analyze the asymptotic secrecy outage probability and derive the achievable diversity order. Both analytical and numerical results show that the proposed scheme can bring more diversity gains into secrecy communication."}, "conf/wcnc/RenGYLL14": {"title": "Intra-cell performance aware uplink opportunistic interference alignment.", "url": "https://doi.org/10.1109/WCNC.2014.6952083", "year": "2014", "author": {"Yuan Ren 0003": "69/4334-3", "Hui Gao 0001": "46/5223-1", "Chau Yuen": "01/753", "Tiejun Lv": "77/4591", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we consider a K-cell multi-user interference network, where S single-antenna users are selected within each cell to carry out the uplink transmission with their M-antenna home base station, where 2 â‰¤ S â‰¤ M <; KS. For the considered scenario, a novel intra-cell performance aware opportunistic interference alignment (OIA) scheme is proposed to mitigate the inter-cell interference while reducing the intra-cell power loss caused by zero-forcing receiving. Unlike the traditional OIA schemes, the proposed scheme reuses the reference signal subspace (RSS) to balance not only the inter-cell interference but also the desired signal power and the intra-cell power leakage. It is shown that the refined selection further improves the achievable sum rate as compared to the existing schemes, and this observation is theoretically analyzed. Finally, numerical results validate that our scheme outperforms the existing uplink OIA schemes."}, "conf/wcnc/CaiLGHL14": {"title": "An optimized first path detector for UWB ranging using error characteristics.", "url": "https://doi.org/10.1109/WCNC.2014.6952325", "year": "2014", "author": {"Hong Cai": "22/4111", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Anzhong Hu": "137/0253", "Yueming Lu": "24/334"}, "abstract": " Abstract:The key of time of arrival (TOA) estimation in ultra wideband (UWB) ranging is to detect the first path (FP). In this paper, we propose an optimized FP detector with the adaptive threshold in the absence of prior channel state information (CSI). In particular, the error information (EI) set is introduced to guide the threshold adjustment and determine the TOA estimate with a novel iterative algorithm. The EI set captures the characteristics of major errors regarding the inappropriate threshold. After the iterative process, the proposed scheme is shown to achieve the asymptotic optimal threshold without large number of repeated pulses. Therefore, the proposed scheme efficiently improves the TOA estimation accuracy as compare to the traditional schemes. Simulation results validate the effectiveness and superiority of the proposed scheme."}, "conf/wcnc/WangLGHL14": {"title": "Generalized likelihood ratio test multiple-symbol detection for MIMO-UWB: A semidefinite relaxation approach.", "url": "https://doi.org/10.1109/WCNC.2014.6952353", "year": "2014", "author": {"Chanfei Wang": "154/3583", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Anzhong Hu": "137/0253", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, semidefinite relaxation (SDR) technology is exploited for the multiple-symbol detection (MSD) over the multiple-input multiple-output (MIMO) ultra-wideband (UWB) systems. The existing scheme generalized likelihood ratio test (GLRT) MSD jointly detect multiple symbols, however, it entails a complexity of O(2\nM\n), where M is the observation window size. To this end, SDR is employed to reformulate the GLRT detection into a semidefinite programming (SDP) model, and two detectors, randomization-SDR (RSDR) and eigenvector-SDR (ESDR) are proposed on the order of O(M\n3.5\n) and O(M\n3\n), respectively. Complexity analysis validates that the SDR-MSD strategy is desirable owing to its reduced complexity, compared with the exponential-complexity sphere decoding (SD) MSD. Furthermore, Monte-Carlo simulations demonstrate that the proposed SDR detectors provide the bit error rate (BER) performance almost the same with that of the SD method, and the RSDR outperforms the ESDR at the price of slightly higher complexity."}, "conf/globecom/GaoRYL13": {"title": "Distributed Scheduling Achieves the Optimal Multiuser Diversity Gain for MIMO-Y Channel.", "url": "https://doi.org/10.1109/GLOCOMW.2013.6824953", "year": "2013", "author": {"Hui Gao 0001": "46/5223-1", "Yuan Ren 0003": "69/4334-3", "Chau Yuen": "01/753", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:A distributed user scheduling scheme is proposed to harvest multiuser diversity (MuD) for the MIMO-Y channel. A three-party information exchange model is considered, where three representatives are selected from three clusters of users to exchange information via a fixed-gain amplify-and-forward (AF) relay. In particular, a novel MIMO-Y transmission scheme is proposed with the reference signal space (RSS), which enables the distributed transmit/receive beamforming and scheduling of the users. It is shown that the proposed distributed scheduling achieves the same MuD gain as the optimal centralized one, while significantly reducing the complexity and feedback. Moreover, the outage probability of the proposed scheme is quantified, and the achievable MuD gain is shown to be the minimum number of candidates in the three clusters. Finally, numerical results validate our theoretical derivations."}, "conf/icc/LongLGLL13": {"title": "Asymmetric signal space alignment for Y channel with single-antenna users.", "url": "https://doi.org/10.1109/ICC.2013.6655340", "year": "2013", "author": {"Wei Long": "33/1429", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334", "Enjie Liu": "85/1448"}, "abstract": " Abstract:In this paper, we study the amplify-and-forward (AF) relaying based signaling scheme for the Y channel consisting of three single-antenna users and a two-antenna relay. In such a particular scenario, traditional signal space alignment for network coding (SSA-NC) scheme is not feasible. Moreover, the time division based multi-user multiple-input multiple-output (MU-MIMO) scheme has to rely on time division mode, i.e., more than two time slots are required to complete the whole communication process, which results in throughput loss. We develop an asymmetric signal space alignment (ASSA) scheme to enable all the users to finish information exchange with each other via the relay within two time slots. Brief degrees of freedom (DOF) analysis and numerical simulations have been provided to demonstrate that the proposed signaling technique significantly outperforms the conventional time division based MU-MIMO scheme."}, "conf/icc/ZhouLLGLL13": {"title": "Limited feedback schemes based on inter-cell interference alignment in two-cell interfering MIMO-MAC.", "url": "https://doi.org/10.1109/ICC.2013.6655413", "year": "2013", "author": {"Ruixue Zhou": "31/9724", "Tiejun Lv": "77/4591", "Wei Long": "33/1429", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334", "Enjie Liu": "85/1448"}, "abstract": " Abstract:In this paper, we propose two kinds of interference alignment (IA) schemes with limited feedback for the two-cell interfering multi-user multiple-input multiple-output multiple access channel (MIMO-MAC). Since IA with limited feedback results in residual interference for the quantization error, more effective schemes are introduced to reduce the residual interference in this paper compared with the ever work. The first kind of schemes means that the precoding matrices at the transmitters are the quantization value after obtaining the IA close-form solution of the precoding and decoding matrices at the receivers. This kind of schemes has been generalized to K users in this paper, and decoding matrices design is considered to reduce the quantization error to improve the performance. For the second kind of schemes, the beamforming vectors are chosen in the codebooks directly which guarantee the inter-cell interference (ICI) are most aligned. Monte-Carlo simulations illustrate that the proposed schemes outperform the existing schemes."}, "conf/icc/HuLGLL13": {"title": "Pilot design for large-scale multi-cell multiuser MIMO systems.", "url": "https://doi.org/10.1109/ICC.2013.6655444", "year": "2013", "author": {"Anzhong Hu": "137/0253", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334", "Enjie Liu": "85/1448"}, "abstract": " Abstract:Large-scale multi-cell multiuser multiple-input multiple-output (LS-MIMO) systems can greatly increase the spectral efficiency. But the performance of these systems is deteriorated by pilot contamination. In this paper, first, a pilot design criterion is proposed by exploiting the orthogonality of channel vectors of LS-MIMO systems. Second, following this criterion, Chu sequences based pilots are designed. Because of the proposed pilots, the channel estimate of most terminals of a cell is only interfered by the partial cells rather than all the other cells, where the latter is caused by traditional pilots. As a result, pilot contamination is mitigated. Numerical results verify the effectiveness of the proposed pilots."}, "conf/icc/GaoYSL13": {"title": "Multiuser diversity for MIMO-Y channel: Max-min selection and diversity analysis.", "url": "https://doi.org/10.1109/ICC.2013.6655519", "year": "2013", "author": {"Hui Gao 0001": "46/5223-1", "Chau Yuen": "01/753", "Himal A. Suraweera": "69/3561", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, a MIMO-Y channel based three-group information exchange problem is considered, where users from each group would like to exchange information with the other users in another two groups. In particular, a Max-Min user selection is proposed, which aims to harvest the multiuser diversity gain for reliable transmission in the MIMO-Y channel. The impacts of user configurations on the multiuser diversity gains are investigated by theoretical bounds as well as numerical results. It is shown that, by adding a few users in only one or two groups, the overall system performance can be improved significantly. This observation reveals an interesting behavior of MIMO-Y channel, i.e., the local configuration has a global impact. However, we prove that such asymmetrical multiuser diversity gain does not scale with the number of users. Finally, we show that multiuser diversity gain scales with the number of users if we add an equal number of users in all three groups."}, "conf/icc/GaoLZSL12": {"title": "Zero-forcing based MIMO two-way relay with relay antenna selection: Transmission scheme and diversity analysis.", "url": "https://doi.org/10.1109/ICC.2012.6364597", "year": "2012", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Shengli Zhang": "41/4882", "Xin Su 0001": "54/3643-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:The combination of physical-layer network coding (PNC) and multiple-input multiple-output (MIMO) is expected to improve the throughput of two-way relay network. In this paper, we propose a zero-forcing based MIMO two-way relay scheme in conjunction with a simple Max-Min relay antenna selection. This scheme solves the unpractical constraint encountered by many existing MIMO two-way relay schemes for application, which requires the relay to equip fewer antennas than the end node. Our scheme, on the other hand, benefits from the dedicated relay that has more antennas than the end node. A notable diversity advantage is obtained from judicious relay antenna selection. The reliability of the simple ZF based MIMO two-way relay is therefore improved. Of particular note, this paper extends our previous study to 1) support the more general application with non-binary PNC and 2) give a complete analysis on the attained end-to-end diversity with explicit theoretical result under i.i.d. Rayleigh fading channel."}, "conf/milcom/FangSLGL12": {"title": "Joint quantization strategy for uplink cooperative cellular interference alignment with limited feedback.", "url": "https://doi.org/10.1109/MILCOM.2012.6415732", "year": "2012", "author": {"Di Fang": "142/2761", "Sixi Su": "143/1520", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Wei Long": "33/1429"}, "abstract": " Abstract:We consider the uplink three-cell single-user cellular systems with limited feedback interference alignment (IA). Considering the exchange of channel state information (CSI) between base stations (BSs), IA solution can be done at BSs. Then the indices of the quantized precoding vectors are fed back to users. A joint quantization strategy, which quantizes the precoding vectors for different users jointly, is proposed. The proposed quantization scheme enlarges the codebooks and quantizes precoding vectors jointly through the exchange of codebook information between BSs. The quantized precoding vectors for different users are set to have a same index. Only one of the three BSs is appointed to broadcast the same index so that the total feedback cost would not be increased. With the proposed quantization scheme, the quantization errors are mitigated and the system sum rate is increased. A quantization criterion, which we refer to as the maximum sum rate criterion, is also proposed. Compared with the general minimum chordal distance criterion, the proposed quantization criterion can achieve a higher sum rate. Performance improvement of the proposed scheme is analyzed. Simulations also confirm its effectiveness."}, "conf/pimrc/ZhouLGLL12": {"title": "A new limited feedback scheme for interference alignment in two-cell interfering MIMO-MAC.", "url": "https://doi.org/10.1109/PIMRC.2012.6362610", "year": "2012", "author": {"Ruixue Zhou": "31/9724", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Wei Long": "33/1429", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we propose a new interference alignment scheme with limited feedback for the two-cell interfering multi-user multiple-input multiple-output multiple access channel (MIMO-MAC), which provides better performance compared with other schemes when the number of feedback bits is same. Then, we analyse the rate loss for the quantization error, and show that the rate loss is only impacted by the residual inter-cell interference. By characterizing the rate loss as a function of the number of feedback bits, a bits allocation algorithm is introduced to further improve the system throughput. Monte-Carlo simulations illustrate that our proposed scheme outperforms the existing schemes."}, "conf/pimrc/MaLZGL12": {"title": "Cognitive interference mitigation in heterogeneous femto-macro cell networks.", "url": "https://doi.org/10.1109/PIMRC.2012.6362707", "year": "2012", "author": {"Yanhui Ma": "122/5547", "Tiejun Lv": "77/4591", "Jie Zhang": "84/6889", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we study the cognitive interference management (CIM) scheme in the coexistence networks of macro-cells and femtocells. A single-channel detection based spectrum allocation algorithm is proposed to enhance the performance of femtocells considering the co-tier interference and co-tier interference. The proposed scheme converts the complex interference environment into several specific channel categories and successfully recognizes these channel patterns, while the group-channel resource allocation algorithm does not distinguish the interference channels in detail and operates on the continuous group of channels. Therefore, femtocell base stations (FBSs) can recognize the spectral environment more completely and allocate more available channels. As a result, our scheme is able to significantly improve the femtocell spectral efficiency and the signal-to-interference-and-noise ratio (SINR) performance of femtocell users (FUEs), meanwhile, it avoids the strong interference on the existing macrocell. Numerical simulations verify the conclusions."}, "conf/vtc/LongLGL12": {"title": "Interference Alignment for Multi-User Multi-Way Relaying X Networks.", "url": "https://doi.org/10.1109/VETECS.2012.6240007", "year": "2012", "author": {"Wei Long": "33/1429", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we consider a multi-way relaying channel where 2K users are divided into two groups averagely and each of them exchanges messages with every user of the other group via an intermediate relay. We term it multi-user multi-way relaying X network. We design the beamforming vectors at the users and the relay to achieve an interference alignment (IA) solution. Meanwhile, we investigate the feasibility conditions on the required amount of antennas for each node. Brief theoretical analysis and numerical simulations have been provided to demonstrate that the degrees of freedom (DOF) of 2K\n2\n is obtained."}, "conf/wcnc/ZhangLGL12": {"title": "Joint uplink power and subchannel allocation in cognitive radio network.", "url": "https://doi.org/10.1109/WCNC.2012.6214332", "year": "2012", "author": {"Jie Zhang": "84/6889", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we consider the resource allocation problem in the uplink transmission of an orthogonal frequency-division multiple access (OFDMA) based cognitive radio (CR) network. The resource allocation aims to maximize the uplink throughput of secondary users (SUs) in CR network under the constraints of the primary user (PU) interference and the transmit power limits of SUs. In general, the optimal joint power and subchannel allocation is known as NP-hard. To ease the computation complexity while maintain good performance, we propose a novel particle swarm optimization (PSO) based joint uplink power and subchannel allocation algorithm to solve this resource allocation problem. Due to the combinatorial nature of the resource allocation problem, our algorithm in which power continuously changes while the subchannel allocation strategy alters in the iteration process can obtain better performance than the existing decomposition based algorithm that subchannel assignment and power allocation are implemented separately. Simulation results show the effectiveness of the proposed algorithm."}, "conf/globecom/CaoLLG11": {"title": "Symbol-Based Physical-Layer Network Coding with MPSK Modulation.", "url": "https://doi.org/10.1109/GLOCOM.2011.6134096", "year": "2011", "author": {"Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591", "Feichi Long": "05/9362", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, the application of MPSK modulation to physical-layer network coding (PNC) with multiple antennas scheme is investigated. A linear complexity scheme with the capacity of achieving diversity is proposed assuming symbol- level synchronization only. In the proposed scheme, called symbol-based PNC, the constant amplitude of MPSK modulation symbols is exploited and the product of two end transmitted symbols, which is actually related to another modulation symbol, is considered as network code. The autocorrelation of received signal is calculated in the relay node equipped with multiple antennas, which contributes to compact the search space for the intended network code. Two detectors are designed for achieving diversity at the cost of linear complexity. We also investigate the power allocation for symbol-based PNC. The advantages of symbol- based PNC can be summarized as two points. First, it requires symbol-level time synchronization only rather than stringent carrier-phase synchronization. Second, it is linear in complexity with respect to the constellation size. Simulations show that symbol- based PNC can achieve diversity gain."}, "conf/globecom/GaoSLWW11": {"title": "Physical-Layer Network Coding Aided Two-Way Relay for Transmitted-Reference UWB Networks.", "url": "https://doi.org/10.1109/GLOCOM.2011.6133672", "year": "2011", "author": {"Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591", "Taotao Wang": "26/8604", "Zicheng Wang": "24/10098"}, "abstract": " Abstract:A physical-layer network coding (PNC) aided two-way relay scheme is proposed for Transmitted-Reference (TR) UWB networks. In particular, a novel noncoherent UWB-PNC detector is investigated for the TR UWB networks. Inheriting the simplicity of the TR-UWB receiver, the proposed PNC detector is based on the autocorrelation receiver (AcR) with simple structure, which effectively suppresses the multi-user interference and harvests the multipath energy. Equipped with the proposed TR UWB-PNC detector, the relay node first detects the bitwise XORed symbol directly from the overlapped information bearing waveforms transmitted from the source nodes, then broadcasts the estimate of the XORed symbol to achieve efficient two-way relay. Simulation results show that, compared with the non-relay, one-way relay and two-way relay with time division multiple access (TDMA) and network coded broadcasting (NCBC), the proposed PNC aided two-way scheme significantly improves both the energy and spectral efficiencies of the TR-UWB networks."}, "conf/globecom/GaoSLZ11": {"title": "Joint Relay Antenna Selection and Zero-Forcing Spatial Multiplexing for MIMO Two-Way Relay with Physical-Layer Network Coding.", "url": "https://doi.org/10.1109/GLOCOM.2011.6133673", "year": "2011", "author": {"Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591", "Zhang Zhang": "94/2468"}, "abstract": " Abstract:We consider a multiple-input multiple-output (MIMO) two-way relay network with two N\nT\n-antenna (N\nT\n â‰¥ 2) end nodes and one dedicated NR-antenna (N\nR\n >; N\nT\n) relay node. A physical-layer network coding (PNC) based joint relay antenna selection and zero-forcing (ZF) spatial multiplexing scheme is proposed to support N\nT\n streams of bidirectional data exchanging with the help of N\nT\n out of N\nR\n selected antennas at the relay node. The optimum relay antennas are selected by a Max-Min criterion with respect to the post-processing SNR of the whole system and then the linear ZF based MIMO two- way relay transmission is achieved with the help of the selected relay antennas. The optimum relay antenna selection not only fulfills the ZF based scheme's requirement on the number of effective relay antennas but also provides an end-to-end diversity advantage to the N\nT\n streams of bidirectional data exchanging with linear transceiver at each end node. The diversity order of the proposed scheme is analyzed. Explicit diversity order d = N\nR\n - 1 is obtained theoretically for N\nT\n = 2 streams of bidirectional data exchanging. For N\nT\n â‰¥ 2 cases, a conjecture that d = N\nR\n - N\nT\n + 1 is obtained based on simulation results."}, "conf/icc/WangLG11": {"title": "Noncoherent Multiple Symbol Detection for MIMO Ultra-Wideband Systems.", "url": "https://doi.org/10.1109/icc.2011.5962903", "year": "2011", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, we investigate noncoherent Multiple-Input Multiple-Output (MIMO) ultra-wideband (UWB) systems where the signal is encoded by Differential Space-Time Block Code (DSTBC). Considering the specific signal format of DSTBC-UWB system and employing the property of DSTBC, a noncoherent multiple symbol detection (MSD) scheme is developed by generalized likelihood ratio testing (GLRT) approach. Although the proposed MSD scheme can enhance the performance of DSTBC-UWB system, the complexity of the exhaustive search based MSD exponentially increases with observation window size. To decrease the computational complexity, the original MSD metric is transformed into another equivalent form which can be implemented by sphere decoding (SD) for DSTBC-UWB system. Moreover, a suboptimal Decision-Feedback (DF) based MSD with lower complexity than SD based MSD is proposed to further reduce the computational complexity."}, "conf/icc/ZhangLSG11": {"title": "Dual XOR in the Air: A Network Coding Based Retransmission Scheme for Wireless Broadcasting.", "url": "https://doi.org/10.1109/icc.2011.5963121", "year": "2011", "author": {"Zhang Zhang": "94/2468", "Tiejun Lv": "77/4591", "Xin Su 0001": "54/3643-1", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this paper, a novel dual XOR hybrid automatic retransmission request scheme XOR\n2\n-HARQ is proposed for wireless broadcasting. Distinct from the traditional network coding (NC) based HARQ (NC-HARQ), an additional XOR operation is introduced to dynamically combine lost packets from the individual receiver instead of conducting XOR operation only across lost packets from different receivers. Furthermore, based on the linear block code's perspective, we optimize the retransmission strategy to yield optimal diversity gain. Analytical results show that conditioned on the same packet error ratio (PER), the retransmission rounds needed for XOR\n2\n-HARQ is strictly less than that of NC-HARQ, and the simulation results consolidate our analysis to show a significant reduction of required retransmissions."}, "conf/ict/CaoL0C11": {"title": "A novel detection strategy based on ant colony optimization for MIMO systems.", "url": "https://doi.org/10.1109/CTS.2011.5898987", "year": "2011", "author": {"Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Pengfei Chang": "30/10098"}, "abstract": " Abstract:This paper proposes two detection schemes based on a novel strategy associated with ant colony optimization (ACO) for multiple-input multiple-output (MIMO) systems. By employing heuristic values and pheromone levels, we jointly exploit local and global information about solution space to constitute transition probability. The proposed constitution rule evaluates the reliability of possible solution more efficiently than previous research. Besides, the unreliable solutions in terms of pheromone levels are deleted before each iteration for reducing the scale of solution space. Both simulations and analysis confirm that the proposed schemes provide improved tradeoff between complexity and performance over traditional detectors."}, "conf/ict/00010L11": {"title": "Combined MRC-like reception and transmit diversity for physical-layer network coding with multiple-antenna relay.", "url": "https://doi.org/10.1109/CTS.2011.5898940", "year": "2011", "author": {"Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:A novel spatial diversity scheme is proposed for physical-layer network coding (PNC) aided two-way relay network with a multiple-antenna relay node. Distinct from the traditional virtual-MIMO based MIMO-NC/PNC schemes, a novel PNC-specific maximal-ratio-combining like (MRC-L) scheme is designed to achieve receive diversity in the multiple-access (MA) phase, and the space-time coding (STC) is adopted to achieve transmit diversity in the broadcast (BC) phase. Both analysis and simulation results prove that the proposed scheme achieves an end-to-end diversity gain and greatly outperforms the virtual-MIMO based MIMO-NC/PNC schemes and the SISO-PNC scheme in fading channel."}, "conf/ict/LongL0C11": {"title": "DSmT based scheduling algorithm in opportunistic beamforming systems.", "url": "https://doi.org/10.1109/CTS.2011.5898983", "year": "2011", "author": {"Feichi Long": "05/9362", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Pengfei Chang": "30/10098"}, "abstract": " Abstract:A novel approach based on Dezert-Smarandache Theory (DSmT) is proposed for scheduling in opportunistic beamforming (OBF) systems. By jointly optimizing among system throughput, fairness and time delay of each user, the proposed algorithm can achieve larger system throughput and lower average time delay with approximately the same fairness and acceptable complexity, as compared with the proportional fair scheduler (PFS). Furthermore, unlike the case in PFS, the parameter used for tradeoff between system throughput and fairness is valid for various practical settings, since the weight that each user accounts for in the base station's (BS) choice can be appropriately calculated in DSmT's framework. Simulation results verify that the proposed algorithm outperforms PFS and other conventional scheduling algorithms in terms of the four proposed indexes."}, "conf/milcom/CaoLG11": {"title": "Symbol-based physical-layer network coding for two-way relay channel.", "url": "https://doi.org/10.1109/MILCOM.2011.6127678", "year": "2011", "author": {"Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:A symbol-based physical layer network coding (PNC) scheme is proposed for the two-way relay channel where the relay node is equipped with multiple antennas. Unlike the traditional binary PNC that focuses mainly on BPSK modulation, the proposed symbol-based PNC is tailored for the general MPSK modulation. In particular, the product of the two modulated signals is considered as a network-coded symbol, which exploit the characteristic of MPSK modulation to compact the solution space of the intended network-coded symbol. Based on the autocorrelation of the received signal at the relay node, a novel PNC-oriented detection scheme is developed to estimate the network-coded symbol for broadcasting. The proposed scheme achieves receive diversity advantage with linear complexity at the relay node. In addition, the proposed scheme can effectively handle information exchanging with asymmetric data rates between the two sources. Simulation results show that the proposed scheme outperforms other linear-MIMO detection based counterparts in terms of diversity order, and it also outperforms the existing decode-and-forward (DF) and amplify-and-forward (AF) approaches when dealing with the asymmetric information exchanging."}, "conf/vtc/ChangLWGL11": {"title": "MMSE Modified Multi-User MIMO Downlink Transmission with Imperfect CSI.", "url": "https://doi.org/10.1109/VETECS.2011.5956259", "year": "2011", "author": {"Pengfei Chang": "30/10098", "Tiejun Lv": "77/4591", "Taotao Wang": "26/8604", "Hui Gao 0001": "46/5223-1", "Yonghua Li": "30/5918"}, "abstract": " Abstract:By introducing the leakage concept, the maximum signal-to-leakage-and-noise ratio (SLNR) scheme has been served as a candidate precoding scheme in the advanced long term evolution (LTE-Advanced) communication system. However, the original scheme allocates every user the same transmit power and takes the matched filter to decode the receive signals, which results in the limited bit error rate (BER) performance. With the antenna correlation at BS and the channel estimation error for every user, we design a modified matrix by minimizing the system Mean Square Error (MMSE) after maximizing the SLNR under the total transmit power constraint. At each user, a linear decoder is calculated based on the MMSE criteria in the presence of imperfect channel state information (ICSI). Due to the dynamic power allocation during the parallel data streams and the linear MMSE (LMMSE) receiver, the proposed scheme can mitigate the residual interference induced by ICSI and improve the system BER performance efficiently."}, "conf/vtc/WangLGL11": {"title": "A Novel Two-Way Relay UWB Network with Joint Non-Coherent Detection in Multipath.", "url": "https://doi.org/10.1109/VETECS.2011.5956243", "year": "2011", "author": {"Zicheng Wang": "24/10098", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yonghua Li": "30/5918"}, "abstract": " Abstract:In this paper, we propose a decode-and-forward (DF) two-way relay ultra-wideband (UWB) network with a joint-demodulated non-coherent receiver to boost the system throughput. We consider a three nodes relay network with two terminals exchanging information via a relay node during two time slots. After jointly detecting the simultaneously arrived signals, the relay node broadcasts the XORed signal to each terminal. A novel non-coherent receiver with energy detector (ED) is employed and the power allocation optimization is performed based on the result of the approximate effective signal to noise ratio (SNR). Simulation results show that the proposed technique achieves significant improvement over the existing nonrelay and relay schemes on system throughput."}, "conf/vtc/WangLGL11a": {"title": "A Multi-Layer Orthogonal Block Coded Transmission Scheme for Noncoherent Ultra-Wideband Communications.", "url": "https://doi.org/10.1109/VETECS.2011.5956347", "year": "2011", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yonghua Li": "30/5918"}, "abstract": " Abstract:A multi-layer orthogonal block coded transmission scheme is proposed in this paper to enhance the performance of the noncoherent Ultra-Wideband impulse radio (UWB-IR) system. The design employs a novel Multiple Orthogonal Block Coded Modulation (MOBCM), which transmits multiple information bearing orthogonal codewords with an ingenious layered structure. At the receiver side, a correspondent noncoherent multiple codeword detection technique is developed to jointly detect multiple codewords and exploit the high energy efficiency inherent in the MOBCM. Solid performance gain is achieved and our design reduces the general performance gap between noncoherent and coherent receiver for UWB-IR system."}, "conf/wcnc/YuLGCX11": {"title": "Hybrid subcarrier exclusivity and sharing scheme with optimized bit loading in uplink multi-cell OFDMA system.", "url": "https://doi.org/10.1109/WCNC.2011.5779107", "year": "2011", "author": {"Xuefen Yu": "55/8603", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Pengfei Chang": "30/10098", "Haijiao Xi": "62/10238"}, "abstract": " Abstract:Hybrid subcarrier exclusivity and sharing (HSEnS) scheme with optimized bit loading in uplink multicell OFDMA system is proposed in this paper. Optimizing bit loading under subcarrier exclusivity (SE) and subcarrier sharing (SS) schemes in two adjacent cells is analyzed. Bit loading criteria and boundary setting procedures for convex optimizing bit loading under SS scheme are proposed. And bit loading boundaries for convex optimizing bit loading under SE and SS scheme can be obtained. The HSEnS scheme is proposed to combine the advantages of SE and SS schemes for making tradeoff between throughput performance and algorithm failure rate when interference is strong, moderate or weak. Simulations support our proposals and HSEnS with optimized bit loading outperforms other schemes."}, "conf/wcnc/ChangLWGX11": {"title": "An unified transmit power allocation scheme with imperfect CSI in both multi-user MIMO downlink and uplink.", "url": "https://doi.org/10.1109/WCNC.2011.5779377", "year": "2011", "author": {"Pengfei Chang": "30/10098", "Tiejun Lv": "77/4591", "Taotao Wang": "26/8604", "Hui Gao 0001": "46/5223-1", "Haijiao Xi": "62/10238"}, "abstract": " Abstract:In this paper, we proposed an effective and unified transmit power allocation (TPA) scheme for the Singular Value Decomposition (SVD)-Assisted multi-user multiple-input multiple-output (MU-MIMO) downlink (DL) and uplink (UL) transmissions in the presence of imperfect channel state information (ICSI). The existing power allocation policies for the SVD-Assisted MU-MIMO system, such as equal power allocation (EPA) in the DL and maximum signal-to-noise ratio (MSNR) policy in UL have been developed under the perfect CSI case. However, the EPA scheme doesn't exploit the CSI and ignores the Bit Error Rate (BER) difference among all singular values meanwhile the MSNR method neglects the noise enhancement caused by the decoding operation at Base Station (BS). Aiming at solving these problems, the proposed TPA scheme takes the smallest singular value and the noise enhancement into account and derives an unified expression for DL and UL. Under the ICSI, the proposed scheme can exploit the power allocation operation to mitigate the residual interference induced by ICSI and improve the system BER performance efficiently."}, "conf/icc/GaoLSL10": {"title": "Optimized Block Coded Noncoherent UWB Impulse Radio with IFI and ISI Pre-Mitigation.", "url": "https://doi.org/10.1109/ICC.2010.5502702", "year": "2010", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Xin Su 0001": "54/3643-1", "Biao Liu": "50/10062"}, "abstract": " Abstract:Existing inter-frame interference (IFI) and intersymbol interference (ISI) mitigation schemes for noncoherent UWB Impulse Radio (UWB-IR) mainly focus on signal processing after nonlinear autocorrelation receiver (AcR) or energy detector (ED). Steering the wheel, a simple but effective IFI and ISI pre-mitigation scheme is proposed in this paper, which realizes IFI and ISI mitigation before ED. Block coded modulation is adopted and the pre-mitigation scheme relies on optimized block code design. The optimization jointly considers the signal interference-patterns before ED and the properties of codewords. Thanks to the matching among codes, interference and detection scheme, leaked signal energy is partially used for detection. IFI and ISI mitigation is thus realized. It is showed in simulations that distinct performance improvement is achieved under moderate IFI and ISI."}, "conf/icc/LiuLG10": {"title": "Blind Synchronization and Demodulation for Noncoherent Ultra-Wideband System with Robustness against ISI and IFI.", "url": "https://doi.org/10.1109/ICC.2010.5502704", "year": "2010", "author": {"Biao Liu": "50/10062", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:Synchronization is a crucial task and big challenge for ultra-wideband (UWB) systems, especially in the presence of inter-symbol interference(ISI) and inter-frame interference (IFI). This paper proposes a blind synchronization and demodulation algorithm that is capable of mitigating ISI and IFI for noncoherent UWB system. Employing a series of codeword matching and averaging operations, the proposal can suppress interference and noise effectively. Moreover, it can acquire synchronization rapidly and improve the bit error rate (BER) performance significantly thanks to efficiently exploiting the observed signals. Simulation results demonstrate the substantial performance improvement compared to existing methods."}, "conf/pimrc/WangGL09": {"title": "Dual Orthogonal Space-Time Coded Modulation and noncoherent detection for multiantenna Ultra-Wideband communications.", "url": "https://doi.org/10.1109/PIMRC.2009.5450131", "year": "2009", "author": {"Taotao Wang": "26/8604", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, two novel space-time coded modulation and corresponding noncoherent detection schemes for Ultra-Wideband (UWB) impulse radio system are proposed. An additional orthogonality is introduced to original Orthogonal Space-Time Block Code (OSTBC) for performance enhancement in the proposed two schemes, which is termed as Dual Orthogonal Space-Time Coded Modulation (DOSTCM). The specially designed signal structures from the DOSTCM exploit the advantage of multiantenna system and enable simple but effective noncoherent detection. Simulation results show our schemes achieve outstanding bit error rate (BER) performance."}, "journals/iotj/FuSGWTLL22": {"title": "Improving Person Reidentification Using a Self-Focusing Network in Internet of Things.", "url": "https://doi.org/10.1109/JIOT.2021.3084978", "year": "2022", "author": {"Meixia Fu": "195/8075", "Songlin Sun": "76/8195", "Hui Gao 0001": "46/5223-1", "Danshi Wang": "186/3142", "Xiaoyun Tong": "243/3235", "Qiang Liu 0030": "61/3234-30", "Qilian Liang": "52/5208"}, "abstract": " Abstract:Person reidentification (re-ID), which is a significant and potential application in the Internet of Things (IoT), aims to retrieve pedestrians of interest given a labeled image in a camera network. Now, it is still existing many challenges that severely influence feature representation in practical scenarios. Many methods adopt the attention mechanism in convolutional neural network (CNN) to improve the ability of feature learning. Although they only apply 1-D attention block in the popular deep learning architecture, the learned features are not discriminative for the feature representation. In this work, we investigate a self-focusing network (SFNet) that considers both the channel-dimensional attention and spatial-dimensional attention to adaptively learn more discriminative features. Namely, we embed the new attention module into the common backbone network, which can focus on the salient region by inhibiting the redundant features. Specifically, we design eight variants of the channel-dimensional attention and spatial-dimensional attention throughout the entire network and explore the most powerful feature representation. The heatmaps of different layers are visualized to intuitively present the performance of SFNet. Furthermore, we compare SFNet with the prior work on three popular person re-ID benchmarks by abundant experiments."}, "journals/sensors/HuGWHL22": {"title": "Joint Optimization for Mobile Edge Computing-Enabled Blockchain Systems: A Deep Reinforcement Learning Approach.", "url": "https://doi.org/10.3390/s22093217", "year": "2022", "author": {"Zhuoer Hu": "286/9545", "Hui Gao 0001": "46/5223-1", "Taotao Wang": "26/8604", "Daoqi Han": "249/1047", "Yueming Lu": "24/334"}, "abstract": ""}, "journals/tvt/GaoJXYFL22": {"title": "Machine Learning-Empowered Beam Management for mmWave-NOMA in Multi-UAVs Networks.", "url": "https://doi.org/10.1109/TVT.2022.3172443", "year": "2022", "author": {"Hui Gao 0001": "46/5223-1", "Chenglu Jia": "260/0474", "Wenjun Xu 0001": "14/2062-1", "Chau Yuen": "01/753", "Zhiyong Feng 0001": "48/195-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:We consider a mission-driven multiple unmanned aerial vehicles (multi-UAVs) network with millimeter-wave (mmWave) transmissions, where a leader UAV (LUAV) communicates with a large number of follower UAVs (FUAVs) simultaneously via a uniform planar array with only a limited number of radio frequency chains. Since only a few orthogonal beams are available and mission-driven UAV networks are autonomous and delay-sensitive, non-orthogonal multiple access (NOMA) over these beams is considered for agility and efficiency. In particular, aiming to address these challenges of highly dynamic mobility, we propose a machine learning framework to enable agile analog beam management for mmWave-NOMA transmissions. The proposed beam management aims to achieve efficient beam tracking and NOMA-grouping-aware analog beamforming optimization to facilitate mmWave-NOMA transmissions by judiciously utilizing angular domain information (ADI). More specifically, a Gaussian process machine learning-based ADI prediction scheme is proposed to track the angular dynamics of FUAVs, which facilitates fast beam-tracking for mmWave-NOMA transmissions. Moreover, by exploiting the predicted ADI, an unsupervised-learning-based FUAV grouping scheme is proposed to facilitate mmWave-NOMA transmissions with high radio-frequency chain efficiency, while a deep learning-based NOMA-grouping-aware fast transmit beamforming optimization scheme is proposed to improve the coverage of mmWave-NOMA transmissions in highly dynamic multi-UAVs networks. Simulation results validate the performance advantages of our proposed beam management scheme against state-of-the-art schemes."}, "journals/access/HanXCGL21": {"title": "Anti-Collision Voting Based on Bluetooth Low Energy Improvement for the Ultra-Dense Edge.", "url": "https://doi.org/10.1109/ACCESS.2021.3079120", "year": "2021", "author": {"Daoqi Han": "249/1047", "Lingyi Xu": "193/4012", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:Due to the popularity of short-range communications and the ultra-dense deployment of the Internet of Things (IoT), the occurrence of severe signal collision in crowded nodes is becoming increasingly critical. We propose a scheme called anti-collision voting based on Bluetooth low energy improvement for the ultra-dense edge, in which one topic can be identified and separated from the others to enable intensive voting. The scheme alleviates the exponential growth of advertising collisions and achieves efficient consensus between the devices and humans by localized the message advertising. The previous proposals focused on enhancing the hardware and optimizing the parameters to establish a connection for interaction. Considering the limitation of connective devices, our scheme adopts a novel advertising model in which the nodes can promptly exit the advertising state by actively responding. In addition, the scheme merges active responses into a group to notify the advertising nodes and randomly chooses a channel to reduce redundancy and save energy. The simulations demonstrate that the scheme can reduce the collisions by more than 90% and channel occupancy by half, while doubling the capacity and efficiently supporting intensive voting within edge networks."}, "journals/icl/JinBLXG21": {"title": "A Simple Two-Stage Equalizer for OTFS With Rectangular Windows.", "url": "https://doi.org/10.1109/LCOMM.2020.3043841", "year": "2021", "author": {"Chenxi Jin": "270/8856", "Zhisong Bie": "26/2992", "Xuehong Lin": "83/7210", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:Orthogonal time-frequency space (OTFS) bears the potential to achieve excellent performance in high mobility scenarios. However, conventional linear equalizer performs poorly. In this letter, we propose a novel two-stage equalizer, wherein received signals are judiciously processed in two domains. First, in the time-frequency domain, a sliding window-assisted minimum mean square error (SW-MMSE) equalizer is proposed to restrict the inter-carrier interference effectively. Then in the second stage, a delay-doppler domain equalizer further mitigates the residual inter-symbol interference of the first stage. Our proposed two-stage equalizer enjoys low implementation complexity, and simulation validates its performance advantage over the conventional one-stage MMSE equalizer."}, "journals/iotj/ZhangXGPHZ21": {"title": "Codebook-Based Beam Tracking for Conformal Array-Enabled UAV mmWave Networks.", "url": "https://doi.org/10.1109/JIOT.2020.3005394", "year": "2021", "author": {"Jinglin Zhang": "83/2890", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1", "Miao Pan": "16/1033", "Zhu Han 0001": "83/514", "Ping Zhang 0003": "77/2428-3"}, "abstract": " Abstract:Millimeter wave (mmWave) communications can potentially meet the high data-rate requirements of unmanned-aerial-vehicle (UAV) networks. However, as the prerequisite of mmWave communications, the narrow directional beam tracking is very challenging because of the 3-D mobility and attitude variation of UAVs. Aiming to address the beam tracking difficulties, we propose to integrate the conformal array (CA) with the surface of each UAV, which enables the full spatial coverage and the agile beam tracking in highly dynamic UAV mmWave networks. More specifically, the key contributions of our work are threefold: 1) a new mmWave beam tracking framework is established for the CA-enabled UAV mmWave network; 2) a specialized hierarchical codebook is constructed to drive the directional radiating element (DRE)-covered cylindrical CA, which contains both the angular beam pattern and the subarray pattern to fully utilize the potential of the CA; and 3) a codebook-based multiuser beam tracking scheme is proposed, where the Gaussian process machine learning-enabled UAV position/attitude prediction is developed to improve the beam tracking efficiency in conjunction with the tracking-error aware adaptive beamwidth control. Simulation results validate the effectiveness of the proposed codebook-based beam tracking scheme in the CA-enabled UAV mmWave network, and demonstrate the advantages of CA over the conventional planner array in terms of spectrum efficiency and outage probability in the highly dynamic scenarios."}, "journals/scn/HanWHGLL21": {"title": "A Novel Classified Ledger Framework for Data Flow Protection in AIoT Networks.", "url": "https://doi.org/10.1155/2021/6671132", "year": "2021", "author": {"Daoqi Han": "249/1047", "Songqi Wu": "286/9520", "Zhuoer Hu": "286/9545", "Hui Gao 0001": "46/5223-1", "Enjie Liu": "85/1448", "Yueming Lu": "24/334"}, "abstract": ""}, "journals/sj/CaoWYLG21": {"title": "Attack Detection for Massive MIMO Relay System.", "url": "https://doi.org/10.1109/JSYST.2020.3034242", "year": "2021", "author": {"Ruohan Cao": "36/10736", "Yuan Wan": "58/3589", "Huayan Yu": "308/7808", "Yueming Lu": "24/334", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:This article focuses on a two-hop relay system, where a potential malicious single-antenna relay may forward altered symbols to a base station (BS) equipped with massive antennas, while the BS also receives signals from direct channel between itself and the source. The main challenge is that the malicious relay may not only alter symbols, but also transmit misleading pilot symbols to impair the channel estimation at the BS. With this regard, we investigate attack detection without reliable channel estimation. During each channel coherence interval, the BS receives pilot signal, namely, reference vector (RV), and immediately examines reliability of the RV by utilizing its massive antennas. If it is reliable, the received information signals, namely, information vectors, will be projected into the RV. The projection gives compressed signal with one dimension. After \nnn\n intervals, the BS could obtain an \nnn\n-length sequence of compressed signals across \nnn\n different channel coherence intervals and an \nnn\n-length sequence of direct signals from the direct channel. We prove that arbitrary attacks are detectable by comparing empirical distribution of these two sequences with its \na priori\n stochastic distribution. Furthermore, simulation confirms that our proposed schemes outperform other existing attack detection methods."}, "journals/tifs/HongGJH21": {"title": "Rebuttal to \"Comments on 'Fixed Region Beamforming Using Frequency Diverse Subarray for Secure MmWave Wireless Communications\"'.", "url": "https://doi.org/10.1109/TIFS.2021.3067204", "year": "2021", "author": {"Yuanquan Hong": "215/1935", "Hui Gao 0001": "46/5223-1", "Xiaojun Jing": "98/3588", "Yuan He 0009": "11/1735-9"}, "abstract": " Abstract:Concerns have been raised about our recently published article on the fixed region beamforming using frequency diverse subarray for secure mmWave wireless communications. In a comment, the authors thought our precoding vector normalization method of the sidelobe randomization scheme has a flaw and proposed a non-physical-layer-security-oriented (non-PLS-oriented) normalization method by keeping the norm of the steering vector as a unit. However, we believe our PLS-oriented normalization method of the transmit beamforming vector is correct and reasonable from the PLS perspective, i.e., we hope to keep the target use's beampattern gain unit. In this rebuttal, we further clarify and justify our scheme to show its correctness. In addition, we also present a generalized normalization method to compare our proposed PLS-oriented scheme and the non-PLS-oriented scheme in the comment to offer useful insights."}, "journals/twc/XuKLGFZ21": {"title": "Data-Driven Beam Management With Angular Domain Information for mmWave UAV Networks.", "url": "https://doi.org/10.1109/TWC.2021.3080519", "year": "2021", "author": {"Wenjun Xu 0001": "14/2062-1", "Yongning Ke": "245/3211", "Chia-Han Lee": "53/5898", "Hui Gao 0001": "46/5223-1", "Zhiyong Feng 0001": "48/195-1", "Ping Zhang 0003": "77/2428-3"}, "abstract": " Abstract:Unmanned aerial vehicles (UAVs) have extensive civilian and military applications, but establishing a UAV network providing high data rate communications with low delay is a challenge. Millimeter wave (mmWave), with its high bandwidth nature, can be adopted in the UAV network to achieve high speed data transfer. However, it is difficult to establish and maintain the mmWave communication links due to the mobility of UAVs. In this paper, a beam management scheme utilizing angular domain information (ADI) is proposed to rapidly establish and reliably maintain the communication links for the mmWave UAV network. Firstly, Gaussian process machine learning (GPML)-enabled position prediction is proposed to facilitate coarse-ADI acquisition through the proposed UAV clustering algorithm. Then, with the proposed confined-ADI acquisition which removes the redundancy in the coarse-ADI acquisition, fast beam tracking with respectively the single-beam pattern and the multi-beam pattern is achieved. Finally, a data-driven beam pattern selection scheme is proposed for improving the spectrum efficiency. Simulation results verify the outstanding performance of the proposed beam management for mmWave UAV networks."}, "journals/wcl/GaoCHY21": {"title": "Robust Beamforming for RIS-Assisted Wireless Communications With Discrete Phase Shifts.", "url": "https://doi.org/10.1109/LWC.2021.3107319", "year": "2021", "author": {"Hui Gao 0001": "46/5223-1", "Kai Cui 0005": "75/7278-5", "Chongwen Huang": "183/6637", "Chau Yuen": "01/753"}, "abstract": " Abstract:In this letter, we study the robust beamforming design for the reconfigurable intelligent surface (RIS)-assisted communication systems from a multi-antenna access point (AP) to a single-antenna user under imperfect channel state information (CSI), where the RIS has only a finite number of phase shifts at each element. In particular, considering the cascaded AP-RIS-user channel estimation error, we aim to jointly optimize the transmit beamforming at the AP and discrete phase shifts of RIS to minimize the transmission power of AP, subject to a signal-to-noise ratio constraint at the user. To tackle the non-convex optimization problem, we decouple it into two subproblems and propose a novel alternative optimization framework. More specifically, the robust beamforming of AP is first obtained through S-Procedure and semidefinite relaxation. Then we recast the discrete phase shift constraint at RIS into an equivalent convex one, and propose an efficient algorithm to obtain a near optimal solution. Finally, the two subproblems are iteratively optimized to obtain joint robust beamforming. Simulation results show that the proposed scheme can approach the performance of the perfect CSI counterpart and substantially outperform traditional non-robust methods."}, "journals/iotj/ZhangSFGL20": {"title": "Data-Aided Doppler Frequency Shift Estimation and Compensation for UAVs.", "url": "https://doi.org/10.1109/JIOT.2019.2943608", "year": "2020", "author": {"Qixun Zhang": "58/5815", "Huiqing Sun": "73/8441", "Zhiyong Feng 0001": "48/195-1", "Hui Gao 0001": "46/5223-1", "Wei Li 0007": "64/6025-7"}, "abstract": " Abstract:With the surge of Internet of Things (IoT) applications using unmanned aerial vehicles (UAVs), there is a huge demand for the mobile broadband service with gigabyte per second data rate in the UAV-aided fifth generation (5G) IoT system. However, Doppler frequency shift (DFS) deteriorates the link performance of UAV-aided 5G system in the highly dynamic and mobile scenarios. Therefore, a data-aided DFS estimation and compensation approach is proposed to optimize the DFS estimation process using historical estimation results, aiming to achieve a fast and accurate DFS compensation. The performance of the proposed DFS estimation algorithm is evaluated by both cost function of accuracy based on frame structure and Cramer-Rao lower bound in terms of the mean-squared error and signal-to-noise ratio. Furthermore, an adaptive frequency-domain DFS compensation algorithm is designed by leveraging DFS estimation results to enhance the quality of communication link for UAV-aided 5G system, achieving an optimal tradeoff between accuracy and complexity. Finally, both link-level simulation platform and hardware testbed are designed and developed to evaluate the performance of our proposed data-aided approach over other conventional algorithms."}, "journals/tifs/HongJGH20": {"title": "Fixed Region Beamforming Using Frequency Diverse Subarray for Secure mmWave Wireless Communications.", "url": "https://doi.org/10.1109/TIFS.2020.2969576", "year": "2020", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Yuan He 0009": "11/1735-9"}, "abstract": " Abstract:Millimeter-wave (mmWave) using conventional phased array (CPA) enables highly directional and fixed angular beamforming (FAB), therefore enhancing physical layer security (PLS) in the angular domain. However, as the eavesdropper is located in the direction pointed by the mainlobe of the information-carrying beam, information leakage is inevitable and FAB cannot guarantee PLS performance. To address this threat, we propose a novel fixed region beamforming (FRB) by employing a frequency diverse subarray (FDSA) architecture to enhance the PLS performance for mmWave communications. In particular, we carefully introduce multiple frequency offset increments (FOIs) across subarrays to achieve a sophisticated beampattern synthesis that ensures a confined information transmission only within the desired angle-range region (DARR) in close vicinity of the target user. More specifically, we formulate the secrecy rate maximization problem with FRB over possible subarray FOIs, and consider two cases of interests, i.e., without/with the location information of eavesdropping, both turn out to be NP-hard. For the unknown eavesdropping location case, we propose a seeker optimization algorithm to minimize the maximum sidelobe peak of the beampattern outside the DARR. As for the known eavesdropping location case, a block coordinate descend linear approximation algorithm is proposed to minimize the sidelobe level in the eavesdropping region. Moreover, we propose an inverted subarray subset technique to further randomize the sidelobes against sensitive eavesdropping. By using the proposed FRB, the mainlobes of all subarrays are constructively superimposed in the DARR while the sidelobes are destructively overlayed outside the DARR. Therefore, FRB exhibits prominent effect on confining information transmission within the DARR. Numerical simulations demonstrate that the proposed FDSA-based FRB can provide superior PLS performance over the CPA-based FAB."}, "journals/tvt/ZhengCGL20": {"title": "Guaranteeing Information Transfer Integrity Through Two Non-Colluding Malicious Nodes Against i.i.d. Attacks.", "url": "https://doi.org/10.1109/TVT.2020.3025305", "year": "2020", "author": {"Xiaofeng Zheng": "11/11005", "Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:This paper considers channel coding problems with the requirement of guaranteeing information integrity in the presence of malicious relays (MRs). The proved random channel coding scheme yields to an achievable rate formula which is identical to its counterpart obtained in the non-MRs system as long as a non-manipulable condition is satisfied. No pre-shared secret or secret transmission is needed for the proved scheme. Hence the obtained rate is generally larger than those achieved based on secret transmission schemes. In addition, we further prove that the systems with binary symmetric channels (BSCs) and binary erasure channels (BECs) are readily to satisfy the non-manipulable condition. Simulations based on turbo codes are also presented. The results indicate that our theoretical work is still available to practical channel codes."}, "journals/wcl/LiangXGPLDZ20": {"title": "Throughput Optimization for Cognitive UAV Networks: A Three-Dimensional-Location-Aware Approach.", "url": "https://doi.org/10.1109/LWC.2020.2974946", "year": "2020", "author": {"Xiaopeng Liang": "213/5037", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1", "Miao Pan": "16/1033", "Jiaru Lin": "32/2368", "Qian Deng": "122/1740", "Ping Zhang 0003": "77/2428-3"}, "abstract": " Abstract:An effective throughput optimization problem is studied in cognitive unmanned aerial vehicle networks (CUAVNs), where a leading unmanned aerial vehicle (LUAV) serving as an aerial mobile access point and sensing node receives data from a group of following unmanned aerial vehicles (FUAVs). For the case of single FUAV, the joint optimizing of three-dimensional location and spectrum sensing duration of LUAV is formulated to maximize FUAV's throughput. The original non-convex problem is tackled by iteratively optimizing two convex sub-problems. For the case of multiple FUAVs, the preferable LUAV location of each FUAV can be individually calculated by using the algorithm developed for the single FUAV case, and then the final LUAV location is obtained by solving a well-formulated weighted sum problem. Numerical results show that our proposed single FUAV algorithm and throughput weighted sum based on multiple FUAVs algorithm can approach the optimal one with only 2% performance loss. Moreover, compared to the only time-dimension spectrum sensing scheme, the effective throughput of FUAV rises about 500% with the proposed schemes."}, "journals/corr/abs-2003-01400": {"title": "OTFS Based Receiver Scheme With Multi-Antennas in High-Mobility V2X Systems.", "url": "https://arxiv.org/abs/2003.01400", "year": "2020", "author": {"Junqiang Cheng": "248/7878", "Chenglu Jia": "260/0474", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1", "Zhisong Bie": "26/2992"}, "abstract": "\n      Abstract:  Vehicle-to-everything (V2X) is considered as one of the most important\napplications of future wireless communication networks. However, the Doppler\neffect caused by the vehicle mobility may seriously deteriorate the performance\nof the vehicular communication links, especially when the channels exhibit a\nlarge number of Doppler frequency offsets (DFOs). Orthogonal time frequency\nspace (OTFS) is a new waveform designed in the delay-Doppler domain, and can\neffectively convert a doubly dispersive channel into an almost non-fading\nchannel, which makes it very attractive for V2X communications. In this paper,\nwe design a novel OTFS based receiver with multi-antennas to deal with the\nhigh-mobility challenges in V2X systems. We show that the multiple DFOs\nassociated with multipaths can be separated with the high-spatial resolution\nprovided by multi-antennas, which leads to an enhanced sparsity of the OTFS\nchannel in the delay-Doppler domain and bears a potential to reduce the\ncomplexity of the message passing (MP) detection algorithm. Based on this\nobservation, we further propose a joint MP-maximum ration combining (MRC)\niterative detection for OTFS, where the integration of MRC significantly\nimproves the convergence performance of the iteration and gains an excellent\nsystem error performance. Finally, we provide numerical simulation results to\ncorroborate the superiorities of the proposed scheme.\n\n    "}, "journals/corr/abs-2005-14064": {"title": "Codebook-Based Beam Tracking for Conformal ArrayEnabled UAV MmWave Networks.", "url": "https://arxiv.org/abs/2005.14064", "year": "2020", "author": {"Jinglin Zhang": "83/2890", "Wenjun Xu 0001": "14/2062-1", "Hui Gao 0001": "46/5223-1", "Miao Pan": "16/1033", "Zhu Han 0001": "83/514", "Ping Zhang 0003": "77/2428-3"}, "abstract": "\n      Abstract:  Millimeter wave (mmWave) communications can potentially meet the high\ndata-rate requirements of unmanned aerial vehicle (UAV) networks. However, as\nthe prerequisite of mmWave communications, the narrow directional beam tracking\nis very challenging because of the three-dimensional (3D) mobility and attitude\nvariation of UAVs. Aiming to address the beam tracking difficulties, we propose\nto integrate the conformal array (CA) with the surface of each UAV, which\nenables the full spatial coverage and the agile beam tracking in highly dynamic\nUAV mmWave networks. More specifically, the key contributions of our work are\nthree-fold. 1) A new mmWave beam tracking framework is established for the\nCA-enabled UAV mmWave network. 2) A specialized hierarchical codebook is\nconstructed to drive the directional radiating element (DRE)-covered\ncylindrical conformal array (CCA), which contains both the angular beam pattern\nand the subarray pattern to fully utilize the potential of the CA. 3) A\ncodebook-based multiuser beam tracking scheme is proposed, where the Gaussian\nprocess machine learning enabled UAV position/attitude predication is developed\nto improve the beam tracking efficiency in conjunction with the tracking-error\naware adaptive beamwidth control. Simulation results validate the effectiveness\nof the proposed codebook-based beam tracking scheme in the CA-enabled UAV\nmmWave network, and demonstrate the advantages of CA over the conventional\nplanner array in terms of spectrum efficiency and outage probability in the\nhighly dynamic scenarios.\n\n    "}, "journals/access/ZhangJG19": {"title": "An Agile-Beam NOMA Scheme in Millimeter Wave Networks.", "url": "https://doi.org/10.1109/ACCESS.2019.2958346", "year": "2019", "author": {"Yangying Zhang": "228/2501", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1"}, "abstract": "Topic: Millimeter-Wave Communications: New Research Trends and Challenges"}, "journals/corr/abs-1902-03909": {"title": "Blind Channel Separation in Massive MIMO System under Pilot Spoofing and Jamming Attack.", "url": "http://arxiv.org/abs/1902.03909", "year": "2019", "author": {"Ruohan Cao": "36/10736", "Tan F. Wong": "72/1500", "Hui Gao 0001": "46/5223-1", "Dongqing Wang": "89/827", "Yueming Lu": "24/334"}, "abstract": "\n      Abstract:  We consider a channel separation approach to counter the pilot attack in a\nmassive MIMO system, where malicious users (MUs) perform pilot spoofing and\njamming attack (PSJA) in uplink by sending symbols to the basestation (BS)\nduring the channel estimation (CE) phase of the legitimate users (LUs). More\nspecifically, the PSJA strategies employed by the MUs may include (i) sending\nthe random symbols according to arbitrary stationary or non-stationary\ndistributions that are unknown to the BS; (ii) sending the jamming symbols that\nare correlative to those of the LUs. We analyze the empirical distribution of\nthe received pilot signals (ED-RPS) at the BS, and prove that its\ncharacteristic function (CF) asymptotically approaches to the product of the\nCFs of the desired signal (DS) and the noise, where the DS is the product of\nthe channel matrix and the signal sequences sent by the LUs/MUs. These\nobservations motivate a novel two-step blind channel separation method, wherein\nwe first estimate the CF of DS from the ED-RPS and then extract the alphabet of\nthe DS to separate the channels. Both analysis and simulation results show that\nthe proposed method achieves good channel separation performance in massive\nMIMO systems.\n\n    "}, "journals/corr/abs-1903-10252": {"title": "Fixed Region Beamforming using Frequency Diverse Subarray for Secure Mmwave Wireless Communications.", "url": "http://arxiv.org/abs/1903.10252", "year": "2019", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1", "Yuan He 0009": "11/1735-9"}, "abstract": "\n      Abstract:  Millimeter-wave (mmWave) using conventional phased array (CPA) enables highly\ndirectional and fixed angular beamforming (FAB), therefore enhancing physical\nlayer security (PLS) in the angular domain. However, as the eavesdropper is\nlocated in the direction pointed by the mainlobe of the information-carrying\nbeam, information leakage is inevitable and FAB cannot guarantee PLS\nperformance. To address this threat, we propose a novel fixed region\nbeamforming (FRB) by employing a frequency diverse subarray (FDSA) architecture\nto enhance the PLS performance for mmWave directional communications. In\nparticular, we carefully introduce multiple frequency offset increments (FOIs)\nacross subarrays to achieve a sophisticated beampattern synthesis that ensures\na confined information transmission only within the desired angle-range region\n(DARR) in close vicinity of the target user. More specifically, we formulate\nthe secrecy rate maximization problem with FRB over possible subarray FOIs, and\nconsider two cases of interests, i.e., without/with the location information of\neavesdropping, both turn out to be NP-hard. For the unknown eavesdropping\nlocation case, we propose a seeker optimization algorithm to minimize the\nmaximum sidelobe peak of the beampattern outside the DARR. As for the known\neavesdropping location case, a block coordinate descend linear approximation\nalgorithm is proposed to minimize the sidelobe level in the eavesdropping\nregion. By using the proposed FRB, the mainlobes of all subarrays are\nconstructively superimposed in the DARR while the sidelobes are destructively\noverlayed outside the DARR. Therefore, FRB takes prominent effect on confining\ninformation transmission within the DARR. Numerical simulations demonstrate\nthat the proposed FDSA-based FRB can provide superior PLS performance over the\nCPA-based FAB.\n\n    "}, "journals/corr/abs-1909-00524": {"title": "Low-Complexity Linear Equalizers for OTFS Exploiting Two-Dimensional Fast Fourier Transform.", "url": "http://arxiv.org/abs/1909.00524", "year": "2019", "author": {"Junqiang Cheng": "248/7878", "Hui Gao 0001": "46/5223-1", "Wenjun Xu 0001": "14/2062-1", "Zhisong Bie": "26/2992", "Yueming Lu": "24/334"}, "abstract": "\n      Abstract:  Orthogonal time frequency space (OTFS) modulation can effectively convert a\ndoubly dispersive channel into an almost non-fading channel in the\ndelay-Doppler domain. However, one critical issue for OTFS is the very high\ncomplexity of equalizers. In this letter, we first reveal the doubly block\ncirculant feature of OTFS channel represented in the delay-Doppler domain. By\nexploiting this unique feature, we further propose zero-forcing (ZF) and\nminimum mean squared error (MMSE) equalizers that can be efficiently\nimplemented with the two-dimensional fast Fourier transform. The complexity of\nour proposed equalizers is gracefully reduced from\n$\\mathcal{O}\\left(\\left(NM\\right)^{3}\\right)$ to\n$\\mathcal{O}\\left(NM\\mathrm{log_{2}}\\left(NM\\right)\\right)$, where $N$ and $M$\nare the number of OTFS symbols and subcarriers, respectively. Analysis and\nsimulation results show that compared with other existing linear equalizers for\nOTFS, our proposed linear equalizers enjoy a much lower computational\ncomplexity without any performance loss.\n\n    "}, "journals/corr/abs-1911-08133": {"title": "Low-Complexity Linear Equalization for OTFS Systems with Rectangular Waveforms.", "url": "http://arxiv.org/abs/1911.08133", "year": "2019", "author": {"Wenjun Xu 0001": "14/2062-1", "Tingting Zou": "36/8873", "Hui Gao 0001": "46/5223-1", "Zhisong Bie": "26/2992", "Zhiyong Feng 0001": "48/195-1", "Zhiguo Ding 0001": "64/361-1"}, "abstract": "\n      Abstract:  Orthogonal time frequency space (OTFS) is a promising technology for\nhigh-mobility wireless communications. However, the equalization realization in\npractical OTFS systems is a great challenge when the non-ideal rectangular\nwaveforms are adopted. In this paper, first of all, we theoretically prove that\nthe effective channel matrix under rectangular waveforms holds the\nblock-circulant property and the special Fourier transform structure with\ntime-domain channel. Then, by exploiting the proved property and structure, we\nfurther propose the corresponding low-complexity algorithms for two mainstream\nlinear equalization methods, i.e., zero-forcing (ZF) and minimum mean square\nerror (MMSE). Compared with the existing direct-matrix-inversion-based\nequalization, the complexities can be reduced by a few thousand times for ZF\nand a few hundred times for MMSE without any performance loss, when the numbers\nof symbols and subcarriers are both 32 in OTFS systems.\n\n    "}, "journals/jstsp/HongJG18": {"title": "Programmable Weight Phased-Array Transmission for Secure Millimeter-Wave Wireless Communications.", "url": "https://doi.org/10.1109/JSTSP.2018.2822048", "year": "2018", "author": {"Yuanquan Hong": "215/1935", "Xiaojun Jing": "98/3588", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:We propose a novel programmable weight phased array (PWPA) architecture and the corresponding schemes for secure millimeter-wave communications. PWPA consists of a conventional phased-array architecture followed by a programable power amplifier used to change the weights of amplitude of antenna element. We propose new schemes of inverted antenna subset transmission technique and optimized weight antenna subset transmission technique based on PWPA, which generate more artificial noise than conventional schemes in the undesired directions. We provide performance evaluation in infinite resolution and finite resolution of phase shifters. Aiming to reduce the sidelobe level, a simulated annealing particle swarm optimization based algorithm is proposed to construct a smaller codebook, which achieves the sidelobe attenuation of 21.12 dB and 5.1 dB in a specific undesired direction and all undesired directions, respectively. Theoretical and simulation results show that the proposed solutions provide superior physical layer security performance. The average symbol error rate and secrecy capacity of the proposed schemes achieve higher robustness against eavesdropper's gain and transmission distance. Moreover, the secrecy capacity of the proposed scheme is stable within 1.5 degrees of phase error of PSs, and the performance gain over the existing schemes is about 33.0%."}, "journals/sensors/GuoL0C18": {"title": "Artificial Intelligence-Based Semantic Internet of Things in a User-Centric Smart City.", "url": "https://doi.org/10.3390/s18051341", "year": "2018", "author": {"Kun Guo": "79/3642", "Yueming Lu": "24/334", "Hui Gao 0001": "46/5223-1", "Ruohan Cao": "36/10736"}, "abstract": ""}, "journals/vlsisp/GaoGSL18": {"title": "Throughput and Energy Efficiency of Wireless Powered Multi-tier MIMO HetNets.", "url": "https://doi.org/10.1007/s11265-018-1354-y", "year": "2018", "author": {"Hui Gao 0001": "46/5223-1", "Jun Gao": "82/4977", "Zai Shi": "203/9361", "Tiejun Lv": "77/4591"}, "abstract": "Wireless powered communications have been recently proposed as a variable power solution for the heterogeneous networks (HetNets) with small and flexible deployments of low-power base stations (BSs). In this paper, we consider the wireless powered multi-tier multi-input multi-output (MIMO) HetNets, where the multi-antenna BSs perform downlink transmission. In particular, we consider two cases of interests, i.e., 1) energy harvesting (EH) without energy beamforming (EB) tier and 2) EH with EB tier. Using tools of stochastic geometry, we perform analysis on the throughput and energy efficiency (EE) of the considered network. Closed-form and tractable results are obtained to reveal interesting insights that the proposed wireless-powered MIMO HetNets can achieve higher EE as compared to the conventional HetNets without EH, and the EE performance can be further improved by introducing well-designed EB across tiers."}, "journals/wicomm/ChenDLG18": {"title": "Improved Convolutional Neural Network for Chinese Sentiment Analysis in Fog Computing.", "url": "https://doi.org/10.1155/2018/9340194", "year": "2018", "author": {"Haoping Chen": "227/1012", "Lukun Du": "227/0934", "Yueming Lu": "24/334", "Hui Gao 0001": "46/5223-1"}, "abstract": ""}, "journals/access/ZhaoLZGCJ17": {"title": "Energy-Efficient Sub-Carrier and Power Allocation in Cloud-Based Cellular Network With Ambient RF Energy Harvesting.", "url": "https://doi.org/10.1109/ACCESS.2017.2667678", "year": "2017", "author": {"Yisheng Zhao": "14/7474", "Victor C. M. Leung": "36/4847", "Chunsheng Zhu": "02/8276", "Hui Gao 0001": "46/5223-1", "Zhonghui Chen": "154/0199", "Hong Ji 0001": "83/2179-1"}, "abstract": "Topic: Emerging Trends, Issues, and Challenges in Energy-Efficient Cloud Computing"}, "journals/access/RenLGL17": {"title": "Secure Wireless Information and Power Transfer in Heterogeneous Networks.", "url": "https://doi.org/10.1109/ACCESS.2017.2682277", "year": "2017", "author": {"Yuan Ren 0003": "69/4334-3", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yingxiang Li": "195/4849"}, "abstract": "Topic: Exploiting the Benefits of Interference in Wireless Networks: Energy Harvesting and Security"}, "journals/access/WangGL17": {"title": "Energy-Efficient User Association and Power Control in the Heterogeneous Network.", "url": "https://doi.org/10.1109/ACCESS.2017.2690305", "year": "2017", "author": {"Min Wang": "181/2695", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We consider a heterogeneous network (HetNet) containing primary users (PUs) and secondary users (SUs). Ordinary cellular users are characterized as PUs, while SUs are the unlicensed users, sensors, or some other Internet of Things equipments. The PUs occupy all the channels in the HetNet and the SUs try to reuse the channels of PUs. We consider two transmission modes for SUs, i.e., the SU can associate with the base station (BS) directly or through the help of its cooperative relay. The optimization of energy efficiency (EE) of SUs is considered. Particularly, we focus on user association (BS selection, channel allocation, and mode selection) and power control to optimize the uplink EE of the communication between the SU and the BS. The original problem is formulated as a non-convex and mixed-integer optimization problem. To get a tractable solution, we propose an iterative optimization algorithm. The alterative optimization method decomposes the original problem into three subproblems. In each iteration, the three subproblems are solved by using the sum-of-ratios programming algorithm, the parametric Dinkelbach algorithm, and convex optimization. Then, the proposed scheme repeats the iteration until convergence. Numerical results confirm that the proposed method can improve the uplink EE performance for SUs."}, "journals/icl/ZhaoGBCJ17": {"title": "Echo State Network for Fast Channel Prediction in Ricean Fading Scenarios.", "url": "https://doi.org/10.1109/LCOMM.2016.2632120", "year": "2017", "author": {"Yisheng Zhao": "14/7474", "Hui Gao 0001": "46/5223-1", "Norman C. Beaulieu": "62/6601", "Zhonghui Chen": "154/0199", "Hong Ji 0001": "83/2179-1"}, "abstract": " Abstract:A fast channel prediction scheme is proposed for Ricean fading scenarios. By employing an echo state network (ESN), the scheme is able to obtain smaller prediction error than previous designs. Simulation results show that the ESN prediction method has lower normalized mean squared error than the traditional autoregressive, discrete wavelet transform, and support vector machine prediction approaches. The symbol error rate gap between the perfect and predicted channel state information is small."}, "journals/itiis/Tang0SL17": {"title": "Joint Destination-Relay Selection and Antenna Mode Selection in Full-Duplex Relay Network.", "url": "https://doi.org/10.3837/tiis.2017.06.002", "year": "2017", "author": {"Yanan Tang": "161/4654", "Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591"}, "abstract": ""}, "journals/ppna/RenGL17": {"title": "Robust beamforming and artificial noise design in interference networks with wireless information and power transfer.", "url": "https://doi.org/10.1007/s12083-016-0509-5", "year": "2017", "author": {"Yuan Ren 0003": "69/4334-3", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": "In this paper, the robust beamforming and artificial noise design is investigated in two-user interference networks with wireless information and power transfer. Specifically, we focus on the secure communication of the two pairs in the presence of an energy receiver (ER) which acts as the potential eavesdropper and intends to wiretap the confidential message transmitted to one of the information receivers (IRs). With only imperfect eavesdropperâ€™s channel state information (ECSI) at the transmitters, our goal is to minimize the total transmit power, while guaranteeing the worst-case secrecy rate requirement at the wiretapped IR, the signal-to-interference-plus-noise ratio requirement at the wiretap-free IR and the energy harvesting requirement at the ER. In particular, we first model the imperfect ECSI in the sense of ellipsoidal uncertainties. Then, our design goal can be further reformulated as a two-stage optimization problem. With the help of rank relaxation and one-dimensional line search, the considered two-stage problem can be solved efficiently. Simulation results verify the effectiveness of the proposed design in different scenarios."}, "journals/sj/LiuGYL17": {"title": "Low-Complexity Downlink User Selection for Massive MIMO Systems.", "url": "https://doi.org/10.1109/JSYST.2015.2422475", "year": "2017", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this paper, we propose a pair of low-complexity user selection schemes with zero-forcing precoding for multiuser massive multiple-input-multiple-output downlink systems, in which the base station is equipped with a large-scale antenna array. First, we derive approximations of the ergodic sum rates of the systems invoking the conventional random user selection (RUS) and the location-dependent user selection (LUS). Then, the optimal number of simultaneously served user equipments (UEs),i.e., K*, is investigated to maximize the sum rate approximations. Upon exploiting K*, we develop two user selection schemes, namely, K*-RUS and K*-LUS, where K* UEs are selected either randomly or based on their locations. Both the proposed schemes are independent of the instantaneous channel state information of small-scale fading, therefore enjoying the same extremely low computational complexity as that of the conventional RUS scheme. Moreover, both of our proposed schemes achieve significant sum rate improvement over the conventional RUS. In addition, it is worth noting that, like the conventional RUS, the K*-RUS achieves good fairness among UEs."}, "journals/tvt/LvWG17": {"title": "Factor Graph Aided Multiple-Symbol Differential Detection in the Broadcasting Phase of a Network Coding Based UWB Relay System.", "url": "https://doi.org/10.1109/TVT.2016.2623652", "year": "2017", "author": {"Tiejun Lv": "77/4591", "Chanfei Wang": "154/3583", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:A factor-graph-aided multiple-symbol differential detection (FG-MSDD) is proposed and its performance is analyzed and evaluated in the broadcasting phase (i.e., the downlink phase) of an ultra-wideband (UWB) two-way relay system (TWRS). In the downlink of the TWRS, the relay is transmitting network-coded information to the sources, and each source node aims to calculate a posteriori probabilities (APPs) of the information symbols from the relay node. A sampling method based on the modified autocorrelation receiver is proposed for FG-MSDD, which has a trellis structure. The trellis can be decomposed into multiple subtrellises depending on the FG factorization. Then, a methodology for APPs is derived when the forward-and-backward message passing is performed on the subtrellises. The main advantage of FG-MSDD is that it exploits soft information accurately with the aid of the bidirectional message passing. In addition, the proposed FG-MSDD, in conjunction with any soft-input soft-output (SISO) decoding scheme, is capable of obtaining an iterative detection algorithm. Various performance evaluation results obtained by means of computer simulations have verified that the proposed algorithm improves detection performance for the noncoherent UWB TWRS."}, "journals/tvt/GaoWL17": {"title": "Energy Efficiency and Spectrum Efficiency Tradeoff in the D2D-Enabled HetNet.", "url": "https://doi.org/10.1109/TVT.2017.2754424", "year": "2017", "author": {"Hui Gao 0001": "46/5223-1", "Min Wang": "181/2695", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:We investigate the tradeoff between energy efficiency (EE) and spectrum efficiency (SE) in the heterogeneous network composed of a macro base station (BS), several pico BSs, and device-to-device (D2D) communication pairs during the uplink transmission. A utility function of the tradeoff between EE and SE is defined first. Then, we formulate the tradeoff utility maximization problem as a joint channel allocation and power control problem for cellular and D2D users. The original problem is transformed into a more tractable subtractive form, and we further decompose the problem into several subproblems that can be solved separately. Numerical results confirm the effectiveness of the proposed scheme and offer valuable insights. Compared with EE, SE is much less sensitive to the variation of the tradeoff factor, which indicates that our proposed scheme can achieve high EE while guaranteeing a fairly large value of SE with a properly chosen EE-SE tradeoff factor."}, "journals/twc/WangLGZ17": {"title": "Joint Multiple Symbol Differential Detection and Channel Decoding for Noncoherent UWB Impulse Radio by Belief Propagation.", "url": "https://doi.org/10.1109/TWC.2016.2623301", "year": "2017", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shengli Zhang": "41/4882"}, "abstract": " Abstract:This paper proposes a belief propagation (BP) message passing algorithm-based joint multiple symbol differential detection (MSDD) and channel decoding scheme for noncoherent differential ultra-wideband impulse radio (UWB-IR) systems. MSDD is an effective means to improving the performance of noncoherent differential UWB-IR systems. To optimize the overall detection and decoding performance, this paper proposes a novel soft-in soft-out (SISO) MSDD scheme for noncoherent differential UWB-IR. We first propose a new sampling mechanism for the noncoherent auto-correlation receiver to sample the received UWB-IR signal. The proposed sampling mechanism can exploit the dependences (imposed by the differential modulation) among data symbols throughout the whole packet. The signal probabilistic model has a hidden Markov chain structure. We use a factor graph to represent this hidden Markov chain. Then, we apply BP message passing algorithm on the factor graph to develop an SISO MSDD scheme, which is easy to integrate with SISO channel decoding to form a joint MSDD and channel decoding scheme. Performance results of bit error rate simulations and EXIT chart analyses indicate the performance advantages of our scheme over the previous MSDD scheme."}, "journals/access/LvYG16": {"title": "Semi-Blind Channel Estimation Relying on Optimum Pilots Designed for Multi-Cell Large-Scale MIMO Systems.", "url": "https://doi.org/10.1109/ACCESS.2016.2543300", "year": "2016", "author": {"Tiejun Lv": "77/4591", "Shaoshi Yang": "03/10239", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:Channel estimation in the presence of pilot contamination-induced inter-cell interference (ICI) is a major challenge in large-scale multiple-input multiple-output (LS-MIMO) systems. In this paper, a subspace-based semi-blind channel estimator (SBCE) relying on an optimum pilot design (in the sense of minimizing the channel estimation error covariance) is proposed for LS-MIMO systems. The proposed SBCE is capable of exploiting the asymptotic orthogonality of the channel vectors encountered in LS-MIMO systems, while taking advantage of both the optimized pilots and the data symbols. In order to ensure the best-possible performance of the proposed SBCE, we analyze the properties to be satisfied by the optimal pilots and then design these pilots relying on Zadoff-Chu sequences. As a beneficial result, the intra-cell interference is completely eliminated, and the ICI is substantially reduced. Our analytical and numerical results confirm that the performance of the proposed SBCE is superior to that of the representative state-of-the-art channel estimators in practical LS-MIMO systems, which have a finite number of base station antennas and data symbols available to be capitalized on for channel estimation."}, "journals/access/GaoLSYC16": {"title": "Energy-Efficient Resource Allocation for Massive MIMO Amplify-and-Forward Relay Systems.", "url": "https://doi.org/10.1109/ACCESS.2016.2570805", "year": "2016", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Xin Su 0001": "54/3643-1", "Hong Yang": "47/5740", "John M. Cioffi": "40/1964"}, "abstract": " Abstract:Energy-efficient resource allocation is investigated for multi-pair massive MIMO amplify-and-forward relay systems, where a dedicated relay assists pairwise information exchange among many pieces of single-antenna user equipment (UE). The system energy efficiency (EE) is theoretically analyzed by employing large system analysis and random matrix theory. This analytical result provides excellent approximation for the system with a moderate number of antennas, and it also enables several efficient algorithms, working with a different knowledge of channel state information (CSI), to maximize the system EE by scheduling the optimal numbers of relay antennas and UE pairs as well as the corresponding relay transmission power. In contrast to the conventional resource allocation schemes, the proposed algorithms avoid complicated matrix calculations and the instantaneous CSI of small-scale fading; therefore, they are computationally efficient with low CSI overhead. The proposed optimization framework sheds light on the optimized system configurations, and it also offers an efficient way to achieve EE-oriented resource allocation for the multi-pair massive MIMO relay systems."}, "journals/access/RenLGY16": {"title": "Wireless Information and Energy Transfer in Multi-Cluster MIMO Uplink Networks Through Opportunistic Interference Alignment.", "url": "https://doi.org/10.1109/ACCESS.2016.2580681", "year": "2016", "author": {"Yuan Ren 0003": "69/4334-3", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": "Topic: Green Communications and Networking for 5G Wireless"}, "journals/access/WangLG16": {"title": "Robust Beamforming and Power Allocation for Secrecy in DF Relay Networks With Imperfect Channel State Information.", "url": "https://doi.org/10.1109/ACCESS.2017.2649568", "year": "2016", "author": {"Weichen Wang": "96/8577", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:We address a robust beamforming design and power allocation problem for a one-way multi-antenna relay network, where the multi-antenna source implements communication with the multi-antenna destination via a decode-and-forward (DF) relay in the presence of the multiple single-antenna eavesdroppers. The eavesdroppers can only overhear the information flowed from the relay to the destination in the second hop. We aim to maximize the worst-case secrecy rate in the condition that the global channel state information (CSI) is imperfect. To this end, we propose the joint beamforming and power allocation design for the worst-case secrecy rate maximization. However, our proposed design constitutes a non-convex problem, which involves an infinite number of constraints because of the imperfect CSI. To make the problem more tractable, we approximate the problem into several tractablesemidefinite programs by semidefinite relaxation, successive convex approximation, and S-procedure techniques, and we propose an iterative algorithm to solve the problem. Furthermore, we show that the proposed algorithm is also applicable for the case the Gaussian wiretap model, where only the eavesdroppers' CSI is imperfect. Simulation results validate the effectiveness of the proposed algorithm."}, "journals/sigpro/LvTGY16": {"title": "A beamspace approach for 2-D localization of incoherently distributed sources in massive MIMO systems.", "url": "https://doi.org/10.1016/j.sigpro.2015.10.020", "year": "2016", "author": {"Tiejun Lv": "77/4591", "Fangqing Tan": "70/10505", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": "In this paper, a generalized low-complexity beamspace approach is proposed for two-dimensional localization of incoherently distributed sources with a uniform cylindrical array (UCyA) in large scale/massive multiple-input multiple-output (MIMO) systems. The received signal vectors in the antenna-element space are transformed into the beamspace by employing beamforming vectors. As a beneficial result, the total dimensions of the received signal vectors are significantly reduced. In addition, it is shown that the error introduced by the transformation decreases as the number of UCyA antennas increases. The UCyA is composed of multiple uniform circular arrays (UCAs), and the beamspace array response matrices of adjacent UCAs are linearly related. Then, the linear relation is exploited to estimate the nominal elevation direction-of-arrivals (DOAs) directly and the nominal azimuth DOAs based on a low-complexity search algorithm. In contrast, the linear relation in the traditional approach is based on approximations and the associated search algorithm is more complicated. Numerical results demonstrate that the proposed approach outperforms the existing approach in terms of both performance and complexity in the context of massive MIMO systems."}, "journals/spl/GaoLWB16": {"title": "Energy-Efficient and Secure Beamforming for Self-Sustainable Relay-Aided Multicast Networks.", "url": "https://doi.org/10.1109/LSP.2016.2600105", "year": "2016", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Weichen Wang": "96/8577", "Norman C. Beaulieu": "62/6601"}, "abstract": " Abstract:The relay-aided multicast network is considered, where an NT -antenna source multicasts confidential messages to N single-antenna legitimate users via a self-sustainable M-antenna regenerative relay. In particular, the relay is powered by the energy harvested from the radio signal of the source, and there are K unauthorized eavesdroppers wiretapping the channel. Assuming the knowledge of statistical channel state information of eavesdroppers, we aim to minimize the source transmission power via energy-efficient beamforming, subject to the signal-to-noise ratios of legitimate users/relay, the power constraint at the relay, and the outage constraints of the eavesdroppers. An efficient algorithm is developed by using the iterative first-order Taylor expansion and successive convex approximation, where the original nonconvex problem is transformed and solved."}, "journals/tifs/CaoWLGY16": {"title": "Detecting Byzantine Attacks Without Clean Reference.", "url": "https://doi.org/10.1109/TIFS.2016.2596140", "year": "2016", "author": {"Ruohan Cao": "36/10736", "Tan F. Wong": "72/1500", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": " Abstract:We consider an amplify-and-forward relay network composed of a source, two relays, and a destination. In this network, the two relays are untrusted in the sense that they may perform Byzantine attacks by forwarding altered symbols to the destination. Note that every symbol received by the destination may be altered, and hence, no clean reference observation is available to the destination. For this network, we identify a large family of Byzantine attacks that can be detected in the physical layer. We further investigate how the channel conditions impact the detection against this family of attacks. In particular, we prove that all Byzantine attacks in this family can be detected with asymptotically small miss detection and false alarm probabilities by using a sufficiently large number of channel observations if and only if the network satisfies a non-manipulability condition. No pre-shared secret or secret transmission is needed for the detection of these attacks, demonstrating the value of this physical-layer security technique for counteracting Byzantine attacks."}, "journals/tsp/LvGLYH16": {"title": "Space-Time Hierarchical-Graph Based Cooperative Localization in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/TSP.2015.2480038", "year": "2016", "author": {"Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Xiaopeng Li": "45/1827", "Shaoshi Yang": "03/10239", "Lajos Hanzo": "92/5955"}, "abstract": " Abstract:It has been shown that cooperative localization is capable of improving both the positioning accuracy and coverage in scenarios where the global positioning system (GPS) has a poor performance. However, due to its potentially excessive computational complexity, at the time of writing the application of cooperative localization remains limited in practice. In this paper, we address the efficient cooperative positioning problem in wireless sensor networks. A space-time hierarchical-graph based scheme exhibiting fast convergence is proposed for localizing the agent nodes. In contrast to conventional methods, agent nodes are divided into different layers with the aid of the space-time hierarchical-model and their positions are estimated gradually. In particular, an information propagation rule is conceived upon considering the quality of positional information. According to the rule, the information always propagates from the upper layers to a certain lower layer and the message passing process is further optimized at each layer. Hence, the potential error propagation can be mitigated. Additionally, both position estimation and position broadcasting are carried out by the sensor nodes. Furthermore, a sensor activation mechanism is conceived, which is capable of significantly reducing both the energy consumption and the network traffic overhead incurred by the localization process. The analytical and numerical results provided demonstrate the superiority of our space-time hierarchical-graph based cooperative localization scheme over the benchmarking schemes considered."}, "journals/tvt/CaoGLYH16": {"title": "Phase-Rotation-Aided Relay Selection in Two-Way Decode-and-Forward Relay Networks.", "url": "https://doi.org/10.1109/TVT.2015.2442622", "year": "2016", "author": {"Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Shaoshi Yang": "03/10239", "Shanguo Huang": "53/9389"}, "abstract": " Abstract:This paper proposes a relay selection (RS) scheme that aims to improve the end-to-end symbol error rate (SER) performance of a two-way relay network (TWRN). The TWRN consists of two single-antenna sources and multiple relays employing a decode-and-forward (DF) protocol. It is shown that the SER performance is determined by the minimum decision distance (DD) observed in the TWRN. However, the minimum DD is likely to be made arbitrarily small by channel fading. To tackle this problem, a phase rotation (PR)-aided RS scheme is proposed to enlarge the minimum DD, which, in turn, improves the SER performance. The proposed PR-based scheme rotates the phases of the transmitted symbols of one source and of the selected relay according to the channel state information (CSI), aiming for increasing all DDs to be above a desired bound. The lower bound is further optimized by using a MaxMin-RS criterion associated with the channel gains. It is demonstrated that the PR-aided MaxMin-RS approach achieves full diversity gain and improved array gain. Furthermore, compared with the existing DF-based schemes, the proposed scheme allows more flexible relay antenna configurations."}, "journals/twc/WangLGY16": {"title": "A Belief Propagation-Based Framework for Soft Multiple-Symbol Differential Detection.", "url": "https://doi.org/10.1109/TWC.2016.2598169", "year": "2016", "author": {"Chanfei Wang": "154/3583", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": " Abstract:Soft noncoherent detection, which relies on calculating the a posteriori probabilities (APPs) of the bits transmitted with no channel estimation, is imperative for achieving excellent detection performance in high-dimensional wireless communications. In this paper, a high-performance belief propagation (BP)-based soft multiple-symbol differential detection (MSDD) framework, dubbed BP-MSDD, is proposed with its illustrative application in differential space-time block-code(DSTBC)-aided ultra-wideband impulse radio (UWB-IR) systems. First, we revisit the signal sampling with the aid of a trellis structure and decompose the trellis into multiple subtrellises. Furthermore, we derive an APP calculation algorithm, in which the forward-and-backward message passing mechanism of BP operates on the subtrellises. The proposed BP-MSDD is capable of significantly outperforming the conventional hard-decision MSDDs. However, the computational complexity of the BP-MSDD increases exponentially with the number of MSDD trellis states. To circumvent this excessive complexity for practical implementations, we reformulate the BP-MSDD, and additionally propose a Viterbi algorithm-based hard-decision MSDD (VA-HMSDD) and a VA-based soft-decision MSDD (VA-SMSDD). Moreover, both the proposed BP-MSDD and VA-SMSDD can be exploited in conjunction with soft channel decoding to obtain powerful iterative detection and decoding-based receivers. Simulation results demonstrate the effectiveness of the proposed algorithms in DSTBC-aided UWB-IR systems."}, "journals/wcl/LvGCZ16": {"title": "Co-Ordinated Secure Beamforming in K-User Interference Channel With Multiple Eavesdroppers.", "url": "https://doi.org/10.1109/LWC.2016.2519905", "year": "2016", "author": {"Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Ruohan Cao": "36/10736", "Jian Zhou": "97/97"}, "abstract": " Abstract:In this letter, we consider secrecy communications over multiple-input single-output K-user interference channel in the presence of multiple eavesdroppers. Each legitimate data link is wiretapped by several eavesdroppers. To keep the eavesdroppers ignorant of the confidential messages, we propose a co-ordinated secure beamforming scheme for maximizing the secrecy sum-rate subject to the individual power constraint of each transmitter. To solve the resultant nonconvex problem, we approximate it into a few semidefinite programs (SDPs) by employing the semidefinite relaxation (SDR) technique and a conservative convex approximation. It is demonstrated experimentally that the proposed algorithm converges within a few iterations. Furthermore, we prove that the SDP problem obtained via SDR always yields a rank-one solution such that the SDR is tight. Simulations show the efficacy of the proposed scheme."}, "journals/corr/CaoWLGY16": {"title": "Detecting Byzantine Attacks Without Clean Reference.", "url": "http://arxiv.org/abs/1607.05332", "year": "2016", "author": {"Ruohan Cao": "36/10736", "Tan F. Wong": "72/1500", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": "\n      Abstract:  We consider an amplify-and-forward relay network composed of a source, two\nrelays, and a destination. In this network, the two relays are untrusted in the\nsense that they may perform Byzantine attacks by forwarding altered symbols to\nthe destination. Note that every symbol received by the destination may be\naltered, and hence no clean reference observation is available to the\ndestination. For this network, we identify a large family of Byzantine attacks\nthat can be detected in the physical layer. We further investigate how the\nchannel conditions impact the detection against this family of attacks. In\nparticular, we prove that all Byzantine attacks in this family can be detected\nwith asymptotically small miss detection and false alarm probabilities by using\na sufficiently large number of channel observations \\emph{if and only if} the\nnetwork satisfies a non-manipulability condition. No pre-shared secret or\nsecret transmission is needed for the detection of these attacks, demonstrating\nthe value of this physical-layer security technique for counteracting Byzantine\nattacks.\n\n    "}, "journals/corr/WangLGY16": {"title": "A Belief Propagation Based Framework for Soft Multiple-Symbol Differential Detection.", "url": "http://arxiv.org/abs/1608.01296", "year": "2016", "author": {"Chanfei Wang": "154/3583", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": "\n      Abstract:  Soft noncoherent detection, which relies on calculating the \\textit{a\nposteriori} probabilities (APPs) of the bits transmitted with no channel\nestimation, is imperative for achieving excellent detection performance in\nhigh-dimensional wireless communications. In this paper, a high-performance\nbelief propagation (BP)-based soft multiple-symbol differential detection\n(MSDD) framework, dubbed BP-MSDD, is proposed with its illustrative application\nin differential space-time block-code (DSTBC)-aided ultra-wideband impulse\nradio (UWB-IR) systems. Firstly, we revisit the signal sampling with the aid of\na trellis structure and decompose the trellis into multiple subtrellises.\nFurthermore, we derive an APP calculation algorithm, in which the\nforward-and-backward message passing mechanism of BP operates on the\nsubtrellises. The proposed BP-MSDD is capable of significantly outperforming\nthe conventional hard-decision MSDDs. However, the computational complexity of\nthe BP-MSDD increases exponentially with the number of MSDD trellis states. To\ncircumvent this excessive complexity for practical implementations, we\nreformulate the BP-MSDD, and additionally propose a Viterbi algorithm\n(VA)-based hard-decision MSDD (VA-HMSDD) and a VA-based soft-decision MSDD\n(VA-SMSDD). Moreover, both the proposed BP-MSDD and VA-SMSDD can be exploited\nin conjunction with soft channel decoding to obtain powerful iterative\ndetection and decoding based receivers. Simulation results demonstrate the\neffectiveness of the proposed algorithms in DSTBC-aided UWB-IR systems.\n\n    "}, "journals/icl/WangGL15": {"title": "Soft-Input Soft-Output Non-Coherent Detection for Differential Space-Time Block Code Systems.", "url": "https://doi.org/10.1109/LCOMM.2015.2413956", "year": "2015", "author": {"Chanfei Wang": "154/3583", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:A soft-input soft-output non-coherent detection algorithm is proposed for multi-antenna systems, where differential space-time block code is employed. The proposed algorithm aims to calculate a posteriori probabilities of the information bits by means of forward and backward message passing of the BCJR approach. The proposed algorithm can exploit the soft information effectively with the aid of the bidirectional message passing mechanism. In addition, the proposed algorithm can be exploited in conjunction with channel decoding to obtain an effective iterative detection and decoding approach. In view of low implementation complexity, the application of the proposed scheme is instantiated with the ultra-wideband impulse radio (UWB-IR) systems. Simulations show that the proposed approaches improve detection performance for UWB-IR systems."}, "journals/itiis/TanGSL15": {"title": "Sum-Rate Analysis for 3D MIMO with ZF Receivers in Ricean/Lognormal Fading Channels.", "url": "https://doi.org/10.3837/tiis.2015.07.003", "year": "2015", "author": {"Fangqing Tan": "70/10505", "Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591"}, "abstract": ""}, "journals/itiis/WangGL15": {"title": "Soft-Input Soft-Output Multiple Symbol Detection for Ultra-Wideband Systems.", "url": "https://doi.org/10.3837/tiis.2015.07.016", "year": "2015", "author": {"Chanfei Wang": "154/3583", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591"}, "abstract": ""}, "journals/jsac/LvGY15": {"title": "Secrecy Transmit Beamforming for Heterogeneous Networks.", "url": "https://doi.org/10.1109/JSAC.2015.2416984", "year": "2015", "author": {"Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": " Abstract:In this paper, we pioneer the study of physical-layer security in heterogeneous networks (HetNets). We investigate secure communications in a two-tier downlink HetNet, which comprises one macrocell and several femtocells. Each cell has multiple users and an eavesdropper attempts to wiretap the intended macrocell user. First, we consider an orthogonal spectrum allocation strategy to eliminate co-channel interference, and propose the secrecy transmit beamforming only operating in the macrocell (STB-OM) as a partial solution for secure communication in HetNet. Next, we consider a secrecy-oriented non-orthogonal spectrum allocation strategy and propose two cooperative STBs which rely on the collaboration amongst the macrocell base station (MBS) and the adjacent femtocell base stations (FBSs). Our first cooperative STB is the STB sequentially operating in the macrocell and femtocells (STB-SMF), where the cooperative FBSs individually design their STB matrices and then feed their performance metrics to the MBS for guiding the STB in the macrocell. Aiming to improve the performance of STB-SMF, we further propose the STB jointly designed in the macrocell and femtocells (STB-JMF), where all cooperative FBSs feed channel state information to the MBS for designing the joint STB. Unlike conventional STBs conceived for broadcasting or interference channels, the three proposed STB schemes all entail relatively sophisticated optimizations due to QoS constraints of the legitimate users. To efficiently use these STB schemes, the original optimization problems are reformulated and convex optimization techniques, such as second-order cone programming and semidefinite programming, are invoked to obtain the optimal solutions. Numerical results demonstrate that the proposed STB schemes are highly effective in improving the secrecy rate performance of HetNet."}, "journals/spl/LiuGZL15": {"title": "Low-Complexity Joint Antenna Tilting and User Scheduling for Large-Scale ZF Relaying.", "url": "https://doi.org/10.1109/LSP.2014.2360521", "year": "2015", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Cong Zhang 0003": "18/2908-3", "Tiejun Lv": "77/4591"}, "abstract": " Abstract:In this letter, we jointly design relay antenna tilting with user scheduling so as to enhance the sum rate performance of a two-hop relay system, where the relay is equipped with a large-scale antenna array and performs zero-forcing processing. Building the fundamental of the joint design, a tight and tractable sum rate approximation is first derived by employing random matrix theory. Then the relay antenna downtilt and the number of active user pairs are jointly optimized to maximize the approximate sum rate. It is noted that the proposed scheme is independent of instantaneous channel state information. Therefore, it enjoys very low implementation complexity while improving the system performance."}, "journals/twc/GaoYRLL15": {"title": "Distributed User Scheduling for MIMO-Y Channel.", "url": "https://doi.org/10.1109/TWC.2015.2464806", "year": "2015", "author": {"Hui Gao 0001": "46/5223-1", "Chau Yuen": "01/753", "Yuan Ren 0003": "69/4334-3", "Tiejun Lv": "77/4591", "Wei Long": "33/1429"}, "abstract": " Abstract:In this paper, distributed user scheduling schemes are proposed for the multi-user MIMO-Y channel, where three N\nT\n-antenna users (N\nT\n = 2N, 3N) are selected from three clusters to exchange information via an NR-antenna amplify-and-forward (AF) relay (N\nR\n = 3N), and N â‰¥ 1 represents the number of data stream(s) of each unicast transmission within the MIMO-Y channel. The proposed schemes effectively harvest multi-user diversity (MuD) without the need of global channel state information (CSI) or centralized computations. In particular, a novel reference signal space (RSS) is proposed to enable the distributed scheduling for both cluster-wise (CS) and group-wise (GS) patterns. The minimum user-antenna (Min-UA) transmission with N\nT\n = 2N is first considered. Next, we consider an equal number of relay and user antenna (ER-UA) transmission with N\nT\n = 3N, with the aim of reducing CSI overhead as compared to Min-UA. For ER-UA transmission, the achievable MuD orders of the proposed distributed scheduling schemes are analytically derived, which proves the superiority and optimality of the proposed RSS-based distributed scheduling. These results reveal some fundamental behaviors of MuD and the performance-complexity tradeoff of user scheduling schemes in the MIMO-Y channel."}, "journals/corr/LvGY15": {"title": "Secrecy Transmit Beamforming for Heterogeneous Networks.", "url": "http://arxiv.org/abs/1503.01056", "year": "2015", "author": {"Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239"}, "abstract": "\n      Abstract:  In this paper, we pioneer the study of physical-layer security in\nheterogeneous networks (HetNets). We investigate secure communications in a\ntwo-tier downlink HetNet, which comprises one macrocell and several femtocells.\nEach cell has multiple users and an eavesdropper attempts to wiretap the\nintended macrocell user. Firstly, we consider an orthogonal spectrum allocation\nstrategy to eliminate co-channel interference, and propose the secrecy transmit\nbeamforming only operating in the macrocell (STB-OM) as a partial solution for\nsecure communication in HetNet. Next, we consider a secrecy-oriented\nnon-orthogonal spectrum allocation strategy and propose two cooperative STBs\nwhich rely on the collaboration amongst the macrocell base station (MBS) and\nthe adjacent femtocell base stations (FBSs). Our first cooperative STB is the\nSTB sequentially operating in the macrocell and femtocells (STB-SMF), where the\ncooperative FBSs individually design their STB matrices and then feed their\nperformance metrics to the MBS for guiding the STB in the macrocell. Aiming to\nimprove the performance of STB-SMF, we further propose the STB jointly designed\nin the macrocell and femtocells (STB-JMF), where all cooperative FBSs feed\nchannel state information to the MBS for designing the joint STB. Unlike\nconventional STBs conceived for broadcasting or interference channels, the\nthree proposed STB schemes all entail relatively sophisticated optimizations\ndue to QoS constraints of the legitimate users. In order to efficiently use\nthese STB schemes, the original optimization problems are reformulated and\nconvex optimization techniques, such as second-order cone programming and\nsemidefinite programming, are invoked to obtain the optimal solutions.\nNumerical results demonstrate that the proposed STB schemes are highly\neffective in improving the secrecy rate performance of HetNet.\n\n    "}, "journals/corr/WangLGZ15": {"title": "Joint Noncoherent Detection and Channel Decoding for UWB Impulse Radio by Belief Propagation.", "url": "http://arxiv.org/abs/1504.01100", "year": "2015", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shengli Zhang": "41/4882"}, "abstract": "\n      Abstract:  This paper proposes a belief propagation (BP) message passing algorithm based\njoint multiple symbol differential detection (MSDD) and channel decoding scheme\nfor noncoherent differential ultra-wideband impulse radio (UWB-IR) systems.\nMSDD is an effective means to improve the performance of noncoherent\ndifferential UWB-IR systems. To optimize the overall detection and decoding\nperformance, in this paper, we propose a novel soft-in soft-out (SISO) MSDD\nscheme and its integration with SISO channel decoding for noncoherent\ndifferential UWB-IR. we first propose a new auto-correlation receiver (AcR)\narchitecture to sample the received UWB-IR signal. The proposed AcR can exploit\nthe dependencies (imposed by the differential modulation) among data symbols\nthroughout the whole packet. The signal probabilistic model has a hidden Markov\nchain structure. We use a factor graph to represent this hidden Markov chain.\nThen, we apply BP message passing algorithm on the factor graph to develop a\nSISO MSDD scheme, which has better performance than the previous MSDD scheme\nand is easy to be integrated with SISO channel decoding to form a joint MSDD\nand channel decoding scheme. Simulation results indicate the performance\nadvantages of our MSDD scheme and joint MSDD and channel decoding scheme.\n\n    "}, "journals/corr/LiuGYL15": {"title": "Low-Complexity Downlink User Selection for Massive MIMO Systems.", "url": "http://arxiv.org/abs/1504.02990", "year": "2015", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239", "Tiejun Lv": "77/4591"}, "abstract": "\n      Abstract:  In this paper we propose a pair of low-complexity user selection schemes with\nzero-forcing precoding for multiuser massive MIMO downlink systems, in which\nthe base station is equipped with a large-scale antenna array. First, we derive\napproximations of the ergodic sum rates of the systems invoking the\nconventional random user selection (RUS) and the location-dependant user\nselection (LUS). Then, the optimal number of simultaneously served user\nequipments (UEs), $K^*$, is investigated to maximize the sum rate\napproximations. Upon exploiting $K^*$, we develop two user selection schemes,\nnamely $K^*$-RUS and $K^*$-LUS, where $K^*$ UEs are selected either randomly or\nbased on their locations. Both of the proposed schemes are independent of the\ninstantaneous channel state information of small-scale fading, therefore\nenjoying the same extremely-low computational complexity as that of the\nconventional RUS scheme. Moreover, both of our proposed schemes achieve\nsignificant sum rate improvement over the conventional RUS. In addition, it is\nworth noting that like the conventional RUS, the $K^*$-RUS achieves good\nfairness among UEs.\n\n    "}, "journals/corr/CaoGLYH15": {"title": "Phase Rotation Aided Relay Selection in Two-Way Decode-and-Forward Relay Networks.", "url": "http://arxiv.org/abs/1506.06271", "year": "2015", "author": {"Ruohan Cao": "36/10736", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Shaoshi Yang": "03/10239", "Shanguo Huang": "53/9389"}, "abstract": "\n      Abstract:  This paper proposes a relay selection scheme that aims to improve the\nend-to-end symbol error rate (SER) performance of a two-way relay network\n(TWRN). The TWRN consists of two single-antenna sources and multiple relays\nemploying decode-and-forward (DF) protocol. It is shown that the SER\nperformance is determined by the minimum decision distance (DD) observed in the\nTWRN. However, the minimum DD is likely to be made arbitrarily small by channel\nfading. To tackle this problem, a phase rotation (PR) aided relay selection\n(RS) scheme is proposed to enlarge the minium DD, which in turn improves the\nSER performance. The proposed PR based scheme rotates the phases of the\ntransmitted symbols of one source and of the selected relay according to the\nchannel state information, aiming for increasing all DDs to be above a desired\nbound. The lower bound is further optimized by using a MaxMin-RS criterion\nassociated with the channel gains. It is demonstrated that the PR aided\nMaxMin-RS approach achieves full diversity gain and an improved array gain.\nFurthermore, compared with the existing DF based schemes, the proposed scheme\nallows more flexible relay antenna configurations.\n\n    "}, "journals/corr/LvGLYH15": {"title": "Space-Time Hierarchical-Graph Based Cooperative Localization in Wireless Sensor Networks.", "url": "http://arxiv.org/abs/1509.02534", "year": "2015", "author": {"Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Xiaopeng Li": "45/1827", "Shaoshi Yang": "03/10239", "Lajos Hanzo": "92/5955"}, "abstract": "\n      Abstract:  It has been shown that cooperative localization is capable of improving both\nthe positioning accuracy and coverage in scenarios where the global positioning\nsystem (GPS) has a poor performance. However, due to its potentially excessive\ncomputational complexity, at the time of writing the application of cooperative\nlocalization remains limited in practice. In this paper, we address the\nefficient cooperative positioning problem in wireless sensor networks. A\nspace-time hierarchical-graph based scheme exhibiting fast convergence is\nproposed for localizing the agent nodes. In contrast to conventional methods,\nagent nodes are divided into different layers with the aid of the space-time\nhierarchical-model and their positions are estimated gradually. In particular,\nan information propagation rule is conceived upon considering the quality of\npositional information. According to the rule, the information always\npropagates from the upper layers to a certain lower layer and the message\npassing process is further optimized at each layer. Hence, the potential error\npropagation can be mitigated. Additionally, both position estimation and\nposition broadcasting are carried out by the sensor nodes. Furthermore, a\nsensor activation mechanism is conceived, which is capable of significantly\nreducing both the energy consumption and the network traffic overhead incurred\nby the localization process. The analytical and numerical results provided\ndemonstrate the superiority of our space-time hierarchical-graph based\ncooperative localization scheme over the benchmarking schemes considered.\n\n    "}, "journals/icl/GaoLFYY14": {"title": "Limited Feedback-Based Interference Alignment for Interfering Multi-Access Channels.", "url": "https://doi.org/10.1109/LCOMM.2014.021214.132762", "year": "2014", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Di Fang": "142/2761", "Shaoshi Yang": "03/10239", "Chau Yuen": "01/753"}, "abstract": " Abstract:A limited feedback-based interference alignment (IA) scheme is proposed for the interfering multi-access channel (IMAC). By employing a novel performance-oriented quantization strategy, the proposed scheme is able to achieve the minimum overall residual inter-cell interference (ICI) with the optimized transceivers under limited feedback. Consequently, the scheme outperforms the existing counterparts in terms of system throughput. In addition, the proposed scheme can be implemented with flexible antenna configurations."}, "journals/itiis/LongGLY14": {"title": "Degrees of Freedom of Y Channel with Single-Antenna Users: Transmission Scheme and Beamforming Optimization.", "url": "https://doi.org/10.3837/tiis.2014.12.004", "year": "2014", "author": {"Wei Long": "33/1429", "Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Chau Yuen": "01/753"}, "abstract": ""}, "journals/jstsp/HuLGZY14": {"title": "An ESPRIT-Based Approach for 2-D Localization of Incoherently Distributed Sources in Massive MIMO Systems.", "url": "https://doi.org/10.1109/JSTSP.2014.2313409", "year": "2014", "author": {"Anzhong Hu": "137/0253", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Zhang Zhang": "94/2468", "Shaoshi Yang": "03/10239"}, "abstract": " Abstract:In this paper, an approach of estimating signal parameters via rotational invariance technique (ESPRIT) is proposed for two-dimensional (2-D) localization of incoherently distributed (ID) sources in large-scale/massive multiple-input multiple-output (MIMO) systems. The traditional ESPRIT-based methods are valid only for one-dimensional (1-D) localization of the ID sources. By contrast, in the proposed approach the signal subspace is constructed for estimating the nominal azimuth and elevation direction-of-arrivals and the angular spreads. The proposed estimator enjoys closed-form expressions and hence it bypasses the searching over the entire feasible field. Therefore, it imposes significantly lower computational complexity than the conventional 2-D estimation approaches. Our analysis shows that the estimation performance of the proposed approach improves when the large-scale/massive MIMO systems are employed. The approximate CramÃ©r-Rao bound of the proposed estimator for the 2-D localization is also derived. Numerical results demonstrate that albeit the proposed estimation method is comparable with the traditional 2-D estimators in terms of performance, it benefits from a remarkably lower computational complexity."}, "journals/corr/GaoLFYY14": {"title": "Limited Feedback-Based Interference Alignment for Interfering Multi-Access Channels.", "url": "http://arxiv.org/abs/1402.0391", "year": "2014", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Di Fang": "142/2761", "Shaoshi Yang": "03/10239", "Chau Yuen": "01/753"}, "abstract": "\n      Abstract:  A limited feedback-based interference alignment (IA) scheme is proposed for\nthe interfering multi-access channel (IMAC). By employing a novel\nperformance-oriented quantization strategy, the proposed scheme is able to\nachieve the minimum overall residual inter-cell interference (ICI) with the\noptimized transceivers under limited feedback. Consequently, the scheme\noutperforms the existing counterparts in terms of system throughput. In\naddition, the proposed scheme can be implemented with flexible antenna\nconfigurations.\n\n    "}, "journals/corr/LiuGLL14": {"title": "A Novel Scheme for Downlink Opportunistic Interference Alignment.", "url": "http://arxiv.org/abs/1403.3978", "year": "2014", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Wei Long": "33/1429", "Tiejun Lv": "77/4591"}, "abstract": "\n      Abstract:  In this paper we propose a downlink codebook-based opportunistic interference\nalignment (OIA) in a three-cell MIMO system. A codebook composed of multiple\ntransmit vector sets is utilized to improve the multiuser selection diversity.\nThe sum rate increases as the size of the codebook grows. In addition, during\nthe user selection, effective channel gain and alignment metric are combined to\ngenerate a novel criterion, which improves the system performance, especially\nat low SNR. Furthermore, a threshold-based feedback approach is introduced to\nreduce the feedback load in the proposed scheme. Both the analytical results\nand simulations show that the proposed scheme provides significant improvement\nin terms of sum rates with no feedback load growth and slight increase of\ncomplexity.\n\n    "}, "journals/corr/LiuGHL14": {"title": "Low-Complexity Transmission Mode Selection in MU-MIMO Systems.", "url": "http://arxiv.org/abs/1403.4374", "year": "2014", "author": {"Haijing Liu": "33/9282", "Hui Gao 0001": "46/5223-1", "Anzhong Hu": "137/0253", "Tiejun Lv": "77/4591"}, "abstract": "\n      Abstract:  We propose a low-complexity transmission strategy in multi-user\nmultiple-input multiple-output downlink systems. The adaptive strategy adjusts\nthe precoding methods, denoted as the transmission mode, to improve the system\nsum rates while maintaining the number of simultaneously served users. Three\nlinear precoding transmission modes are discussed, i.e., the block\ndiagonalization zero-forcing, the cooperative zero-forcing (CZF), and the\ncooperative matched-filter (CMF). Considering both the number of data streams\nand the multiple-antenna configuration of users, we modify the common CZF and\nCMF modes by allocating data streams. Then, the transmission mode is selected\nbetween the modified ones according to the asymptotic sum rate analyses. As\ninstantaneous channel state information is not needed for the mode selection,\nthe computational complexity is significantly reduced. Numerical simulations\nconfirm our analyses and demonstrate that the proposed scheme achieves\nsubstantial performance gains with very low computational complexity.\n\n    "}, "journals/corr/HuLGZY14": {"title": "An ESPRIT-Based Approach for 2-D Localization of Incoherently Distributed Sources in Massive MIMO Systems.", "url": "http://arxiv.org/abs/1403.5352", "year": "2014", "author": {"Anzhong Hu": "137/0253", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Zhang Zhang": "94/2468", "Shaoshi Yang": "03/10239"}, "abstract": "\n      Abstract:  In this paper, an approach of estimating signal parameters via rotational\ninvariance technique (ESPRIT) is proposed for two-dimensional (2-D)\nlocalization of incoherently distributed (ID) sources in large-scale/massive\nmultiple-input multiple-output (MIMO) systems. The traditional ESPRIT-based\nmethods are valid only for one-dimensional (1-D) localization of the ID\nsources. By contrast, in the proposed approach the signal subspace is\nconstructed for estimating the nominal azimuth and elevation\ndirection-of-arrivals and the angular spreads. The proposed estimator enjoys\nclosed-form expressions and hence it bypasses the searching over the entire\nfeasible field. Therefore, it imposes significantly lower computational\ncomplexity than the conventional 2-D estimation approaches. Our analysis shows\nthat the estimation performance of the proposed approach improves when the\nlarge-scale/massive MIMO systems are employed. The approximate CramÃ©r-Rao\nbound of the proposed estimator for the 2-D localization is also derived.\nNumerical results demonstrate that albeit the proposed estimation method is\ncomparable with the traditional 2-D estimators in terms of performance, it\nbenefits from a remarkably lower computational complexity.\n\n    "}, "journals/corr/GaoYRL14": {"title": "Distributed User Scheduling for MIMO-Y Channel.", "url": "http://arxiv.org/abs/1408.4238", "year": "2014", "author": {"Hui Gao 0001": "46/5223-1", "Chau Yuen": "01/753", "Yuan Ren 0003": "69/4334-3", "Tiejun Lv": "77/4591"}, "abstract": "\n      Abstract:  In this paper, distributed user scheduling schemes are proposed for the\nmulti-user MIMO-Y channel, where three N_{T}N_{T}-antenna users (N_{T}=2N,\\,3NN_{T}=2N,\\,3N)\nare selected from three clusters to exchange information via an N_{R}N_{R}-antenna\namplify-and-forward (AF) relay (N_{R}=3NN_{R}=3N), and N\\geq1N\\geq1 represents the number\nof data stream(s) of each unicast transmission within the MIMO-Y channel. The\nproposed schemes effectively harvest multi-user diversity (MuD) without the\nneed of global channel state information (CSI) or centralized computations. In\nparticular, a novel reference signal space (RSS) is proposed to enable the\ndistributed scheduling for both cluster-wise (CS) and group-wise (GS) patterns.\nThe minimum user-antenna (Min-UA) transmission with N_{T}=2NN_{T}=2N is first\nconsidered. Next, we consider an equal number of relay and user antenna (ER-UA)\ntransmission with {N_{T}=3N}{N_{T}=3N}, with the aim of reducing CSI overhead as\ncompared to Min-UA. For ER-UA transmission, the achievable MuD orders of the\nproposed distributed scheduling schemes are analytically derived, which proves\nthe superiority and optimality of the proposed RSS-based distributed\nscheduling. These results reveal some fundamental behaviors of MuD and the\nperformance-complexity tradeoff of user scheduling schemes in the MIMO-Y\nchannel.\n\n    "}, "journals/chinaf/LvWG13": {"title": "Decision-feedback multiple symbol detection for differential space-time block coded UWB systems.", "url": "https://doi.org/10.1007/s11432-012-4650-3", "year": "2013", "author": {"Tiejun Lv": "77/4591", "Taotao Wang": "26/8604", "Hui Gao 0001": "46/5223-1"}, "abstract": "The symbol-by-symbol differential detection scheme, originally employed to detect differential space-time block coded (DSTBC) ultra-wideband (UWB) signal in previous work, suffers from a performance degradation compared with coherent detection. In this paper, a noncoherent multiple symbol detection (MSD) scheme is proposed to enhance the performance of DSTBC-UWB system. After the signal model of DSTBC-UWB is analyzed, the optimal maximum likelihood (ML) MSD is derived and then a suboptimal ML-MSD is obtained by channel approximating. However, exhaustive search based MSD is impractical in DSTBC-UWB systems since its complexity increases exponentially with observation window size. To decrease the computational complexity, the decision-feedback (DF) scheme is introduced to MSD. The resultant DF-MSD yields reasonable complexity and solid performance improvement."}, "journals/tvt/WangL0L13": {"title": "BER Analysis of Decision-Feedback Multiple-Symbol Detection in Noncoherent MIMO Ultrawideband Systems.", "url": "https://doi.org/10.1109/TVT.2013.2266922", "year": "2013", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": " Abstract:In this paper, we investigate noncoherent multiple-input-multiple-output (MIMO) ultrawideband (UWB) systems where the signal is encoded by differential space-time block code (DSTBC). DSTBC enables noncoherent MIMO UWB systems to achieve diversity gain. However, the traditional noncoherent symbol-by-symbol differential detection (DD) for DSTBC-UWB suffers from performance degradation compared with coherent detection. We introduce a noncoherent multiple-symbol detection (MSD) scheme to enhance the performance of DSTBC-UWB systems. Although the MSD scheme can boost the performance more as the observation window size becomes larger, the complexity of the exhaustive search for MSD also exponentially increases in terms of the window size. To decrease the computational complexity, the concept of decision feedback (DF) is introduced to the MSD for DSTBC-UWB in this paper. The resultant DF-MSD yields reasonable complexity and solid performance improvement. We provide the bit-error-rate analysis for the proposed DF-MSD. Both theoretical analysis and simulation results validate the proposed scheme."}, "journals/twc/CaoLGYC13": {"title": "Achieving Full Diversity in Multi-Antenna Two-Way Relay Networks via Symbol-Based Physical-Layer Network Coding.", "url": "https://doi.org/10.1109/TWC.2013.061413.121223", "year": "2013", "author": {"Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Shaoshi Yang": "03/10239", "John M. Cioffi": "40/1964"}, "abstract": " Abstract:This paper considers physical-layer network coding (PNC) with M-ary phase-shift keying (MPSK) modulation in two-way relay channel (TWRC). A low complexity detection technique, termed symbol-based PNC (SPNC), is proposed for the relay. In particular, attributing to the outer product operation imposed on the superposed MPSK signals at the relay, SPNC obtains the network-coded symbol (NCS) straightforwardly without having to detect individual symbols separately. Unlike the optimal multi-user detector (MUD) which searches over the combinations of all users' modulation constellations, SPNC searches over only one modulation constellation, thus simplifies the NCS detection. Despite the reduced complexity, SPNC achieves full diversity in multi-antenna relay as the optimal MUD does. Specifically, antenna selection based SPNC (AS-SPNC) scheme and signal combining based SPNC (SC-SPNC) scheme are proposed. Our analysis of these two schemes not only confirms their full diversity performance, but also implies when SPNC is applied in multi-antenna relay, TWRC can be viewed as an effective single-input multiple-output (SIMO) system, in which AS-PNC and SC-PNC are equivalent to the general AS scheme and the maximal-ratio combining (MRC) scheme. Moreover, an asymptotic analysis of symbol error rate (SER) is provided for SC-PNC considering the case that the number of relay antennas is sufficiently large."}, "journals/corr/WangLGL13": {"title": "BER Analysis of Decision-Feedback Multiple Symbol Detection in Noncoherent MIMO Ultra-Wideband Systems.", "url": "http://arxiv.org/abs/1306.0968", "year": "2013", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334"}, "abstract": "\n      Abstract:  In this paper, we investigate noncoherent multiple-input multiple-output\n(MIMO) ultra-wideband (UWB) systems where the signal is encoded by differential\nspace-time block code (DSTBC). DSTBC enables noncoherent MIMO UWB systems to\nachieve diversity gain. However, the traditional noncoherent symbol-by-symbol\ndifferential detection (DD) for DSTBC-UWB suffers from performance degradation\ncompared with the coherent detection. We introduce a noncoherent multiple\nsymbol detection (MSD) scheme to enhance the performance of DSTBC-UWB system.\nAlthough the MSD scheme can boost the performance more as the observation\nwindow size gets to larger, the complexity of the exhaustive search for MSD\nalso exponentially increases in terms of the window size. To decrease the\ncomputational complexity, the concept of decision-feedback (DF) is introduced\nto MSD for DSTBC-UWB in this paper. The resultant DF-MSD yields reasonable\ncomplexity and also solid performance improvement. We provide the bit error\nrate (BER) analysis for the proposed DF-MSD. Both theoretical analysis and\nsimulation results validate the proposed scheme.\n\n    "}, "journals/ieicet/CaoLGLS12": {"title": "A Specific Physical-Layer Network Coding for MPSK Modulation in Multi-Antenna Relay Networks.", "url": "https://doi.org/10.1587/transcom.E95.B.3768", "year": "2012", "author": {"Ruohan Cao": "36/10736", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1", "Yueming Lu": "24/334", "Yongmei Sun": "92/2153"}, "abstract": ""}, "journals/tvt/GaoSLYL12": {"title": "IFI and ISI Premitigation for Block-Code-Modulated Noncoherent UWB Impulse Radio: A Code Optimization Approach.", "url": "https://doi.org/10.1109/TVT.2012.2187938", "year": "2012", "author": {"Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591", "Shaoshi Yang": "03/10239", "Yueming Lu": "24/334"}, "abstract": " Abstract:Codeword matching and signal aggregation (CMSA) is a recently proposed low-complexity noncoherent receiver for block-code-modulated ultrawideband impulse radio (UWB-IR) systems. As the frame/symbol duration is shortened to boost data rate, interframe interference (IFI) or intersymbol interference (ISI) occurs and degrades the detection performance of CMSA. In this paper, an effective IFI/ISI premitigation scheme is proposed for CMSA through a code optimization approach. By employing a tailored interference model that highlights the codeword properties, the system performance in the presence of moderate IFI/ISI is evaluated, and the average collected channel gain is introduced as the metric for code optimization. With the primary focus on binary modulation, the following two IFI/ISI-robust code properties are generalized: 1) shifted orthogonality and 2) shifted repetition. Based on these properties, the optimal code is constructed. It is observed that, when the optimal code occurs, the leaked signal energy or the interference can partially be used to enhance the detection performance of CMSA in the presence of IFI/ISI. Unlike most of the existing IFI/ISI mitigation schemes for noncoherent UWB-IR, which mainly focus on signal processing after the nonlinear detector, the optimized code is exploited to aggregate the leaked signal energy, along with the linear predetection operation already involved in the CMSA receiver. Both analysis and simulation show that a distinct performance improvement is achieved."}, "journals/twc/GaoLZYY12": {"title": "Zero-Forcing Based MIMO Two-Way Relay with Relay Antenna Selection: Transmission Scheme and Diversity Analysis.", "url": "https://doi.org/10.1109/TWC.2012.102612.112281", "year": "2012", "author": {"Hui Gao 0001": "46/5223-1", "Tiejun Lv": "77/4591", "Shengli Zhang": "41/4882", "Chau Yuen": "01/753", "Shaoshi Yang": "03/10239"}, "abstract": " Abstract:Combining of physical-layer network coding (PNC) and multiple-input multiple-output (MIMO) can significantly improve the performance of the wireless two-way relay network (TWRN). This paper proposes novel Max-Min optimization based relay antenna selection (RAS) schemes for zero-forcing (ZF) based MIMO-PNC transmission. RAS relaxes ZF's constraints on the number of antennas and extends the applications of ZF based MIMO-PNC to more practical scenarios, where the dedicated relay has more antennas than the end node. Moreover, RAS also brings diversity advantages to TWRN and the achievable diversity gains of the proposed schemes are theoretically analyzed. In particular, an equivalence relation is carefully built for the diversity gains obtained by 1) RAS for ZF based MIMO-PNC and 2) transmit antenna selection (TAS) for MIMO broadcasting (BC) with ZF receivers. This equivalence transforms the original problem to a more tractable form which eventually allows explicit analytical results. It is interesting to see that Max-Min RAS keeps the network diversity gain of ZF based MIMO-PNC to be the same as the diversity gain of the point-to-point link within the TWRN. This insight extends the understanding on the behaviors of ZF transceivers with antenna selection (AS) to relatively complicated MIMO-TWRN/BC scenarios."}, "journals/icl/WangLG11": {"title": "Sphere Decoding Based Multiple Symbol Detection for Differential Space-Time Block Coded Ultra-Wideband Systems.", "url": "https://doi.org/10.1109/LCOMM.2010.011011.101877", "year": "2011", "author": {"Taotao Wang": "26/8604", "Tiejun Lv": "77/4591", "Hui Gao 0001": "46/5223-1"}, "abstract": " Abstract:In this letter, a sphere decoding (SD) based noncoherent multiple symbol detection (MSD) scheme is proposed for differential space-time block coded (DSTBC) ultra-wideband (UWB) impulse radio systems. Exhaustive search based maximum likelihood (ML) MSD is impractical in DSTBC-UWB systems since its complexity exponentially increases with observation window size. To decrease the computational complexity, the original MSD metric is transformed into another equivalent form which can be implemented by SD for DSTBC-UWB systems."}, "journals/ieicet/GaoSLCW11": {"title": "Achieving Diversity for Physical-Layer Network Coding Based Two-Way Multiple-Antenna Relay: A Two-Phase Diversity Scheme.", "url": "https://doi.org/10.1587/transcom.E94.B.3382", "year": "2011", "author": {"Hui Gao 0001": "46/5223-1", "Xin Su 0001": "54/3643-1", "Tiejun Lv": "77/4591", "Ruohan Cao": "36/10736", "Taotao Wang": "26/8604"}, "abstract": ""}}}