{"id": "181/6486", "name": "Jiapeng Xiu", "Article": {"conf/ccis/PengYLXZ18": {"title": "An Improved PSO Algorithm for Battery Parameters Identification Optimization Based on Thevenin Battery Model.", "url": "https://doi.org/10.1109/CCIS.2018.8691341", "year": "2018", "author": {"Wei Peng": "16/5560", "Zhengqiu Yang": "31/7774", "Chen Liu 0011": "10/2639-11", "Jiapeng Xiu": "181/6486", "Zheng Zhang": "181/2621"}, "abstract": " Abstract:Battery parameters identification is crucial for accurate prediction of battery life in electric vehicles. In order to optimize battery parameter identification, an improved PSO (particle swarm optimization) algorithm was proposed based on the use of Thevenin battery model to abstract the problem into an optimization problem. The experimental results show that the computational accuracy of the improved PSO algorithm is higher than that of the genetic algorithm and the original PSO algorithm, and the battery parameters calculated by the improved PSO algorithm are also more accurate."}, "conf/ccis/QiYLX18": {"title": "Improvement and Parallel Implementation of EKF Battery Algorithm Based on the Spark Streaming.", "url": "https://doi.org/10.1109/CCIS.2018.8691137", "year": "2018", "author": {"Zitong Qi": "239/3462", "Zhengqiu Yang": "31/7774", "Chen Liu 0011": "10/2639-11", "Jiapeng Xiu": "181/6486"}, "abstract": " Abstract:Battery management system (BMS) is a system for the power balance control of power systems. This system relies on the real-time grasp of important parameters such as SOC (State of Charge), polarization resistance and OCV by EKF (extended Kalman filter) battery algorithm. It is of great significance for drivers to grasp the follow-up mileage reasonably and to control the power of BMS. With the generation of massive data, the traditional EKF battery algorithm will encounter the bottleneck of time and space when running on a single machine and cannot meet the real-time requirements of streaming big data processing. In view of the above problems, the research on EKF battery algorithm under large-scale data sets is carried out. Based on the Spark Streaming real-time streaming data processing framework, the EKF battery algorithm is improved by setting batches and performing stateful operations, and the distributed calculation of this algorithm and the dynamic allocation of computing resources are realized. The intermediate results generated during the operation are all stored in memory, thus effectively reducing the I/O consumption of data and improving the efficiency of the algorithm. The experimental results show that the optimized algorithm is superior to the traditional EKF battery algorithm in large-scale streaming data."}, "conf/cyberc/LiangX18": {"title": "Prediction of Mobile APP Advertising Conversion Rate Based on Machine Learning.", "url": "https://doi.org/10.1109/CyberC.2018.00058", "year": "2018", "author": {"Juan Liang": "167/7616", "Jiapeng Xiu": "181/6486"}, "abstract": " Abstract:With the rapid development of smart phones, mobile advertising has taken up more than half of the advertising market and has great potential in the future. At present, there are many mature researches on the conversion rate of search advertising, but few studies have been done on the conversion rate of mobile APP advertising. This paper studies the preliminary data of Tencent's first social advertising algorithm competition and provides a method for prediction of mobile APP advertising conversion rate based on machine learning."}, "conf/swarm/WangXYL18": {"title": "A Deep Learning Model for Predicting Movie Box Office Based on Deep Belief Network.", "url": "https://doi.org/10.1007/978-3-319-93818-9_51", "year": "2018", "author": {"Wei Wang": "35/7092", "Jiapeng Xiu": "181/6486", "Zhengqiu Yang": "31/7774", "Chen Liu 0011": "10/2639-11"}, "abstract": "For the limitation that Chinese movie box office forecasting accuracy is not high in the long-term prediction research, based on the research of the Chinese movie market, this paper proposes a long-term prediction model for movie box office based on the deep belief network. The new model improved the movie box office influence model of Barry, screened out the effective box office impact factor, normalized the quantitative factor and formed a measurement system which is suitable for the Chinese movie market. Based on this measurement system, the characteristics of the data set in the original space are transferred to the space with semantic features and a hierarchical feature representation by deep learning, thus the accuracy of box office prediction was improved. Experimental evaluation results show that, in view of the 439 movie data, the DBN prediction model of movie box office has better prediction performance, and has good application value in the field of film box office.\nKeywordsDeep learningMovie box office predictionDeep belief network"}, "conf/ccis/LiuYXL16": {"title": "Research on an anti-crawling mechanism and key algorithm based on sliding time window.", "url": "https://doi.org/10.1109/CCIS.2016.7790257", "year": "2016", "author": {"Yi Liu": "97/4626", "Zhengqiu Yang": "31/7774", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:Inadequate crawling behavior of the crawler will have a very serious impact on the site, so anti crawling mechanism is an important function for the website. Most of the existing anti crawling methods are non real time detection, and the recognition accuracy is low. By analyzing the characteristics of Crawler, a real-time crawler detection method based on sliding time window is proposed, which improves the accuracy and efficiency of detection of non compliance with the rules of Crawler."}, "conf/ccis/DiXLQ16": {"title": "Research on movie-box prediction model and algorithm based on neural network.", "url": "https://doi.org/10.1109/CCIS.2016.7790258", "year": "2016", "author": {"Zexi Di": "192/1008", "Jiapeng Xiu": "181/6486", "Jinze Lin": "192/1031", "Yunzhe Qian": "192/0999"}, "abstract": " Abstract:The paper presents an effective method to predict the movie box-office by Neural network algorithm. The core idea is to use past performance of the similar movie to predict a coming movie. Based on the analysis on Chinese film market, we extracted the elements of a movie like actors, director, screenplay, film genre, technical specs, etc. Some elements were then processed in different quantitative ways and made available for modeling. We extract some new generated indicators as the factors of the neural networks. By using the recent three-year movie data, we built the prediction model using SPSS software platform and carried out detailed evaluation about the model."}, "conf/ccis/ZhaoXBY16": {"title": "An improved item-based movie recommendation algorithm.", "url": "https://doi.org/10.1109/CCIS.2016.7790269", "year": "2016", "author": {"Dongping Zhao": "68/1572", "Jiapeng Xiu": "181/6486", "Yu Bai": "03/6325", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:To date, with the rapid development of information society, it has great significance to video websites that using the existing relationship between users and items to analyze users' behavior and find the correlation of information, which can mine users' preferences deeply and provide the optimal recommendations to users. This paper explores an improved item-based movie recommendation algorithm based on a large number of movie recommendation algorithms, which increases cinematic genres' effect on computing ItemSimilarity. We then provide MAE (Mean Absolute Error) and RMSE (Root Mean Square Error) to demonstrate that our proposed algorithm is more accurate than the original one."}, "conf/ccis/XiuHYL16": {"title": "Research on a multi-objective constrained optimization evolutionary algorithm.", "url": "https://doi.org/10.1109/CCIS.2016.7790270", "year": "2016", "author": {"Jiapeng Xiu": "181/6486", "Qun He": "06/5635", "Zhengqiu Yang": "31/7774", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:To overcome the defects of partial multi-objective constrained optimization evolutionary algorithms especially in getting local optimal solutions, poor diversity and robustness, a hybrid algorithm which is named NCCMOEA (Non-dominated Clonal Constrained Multi-objective Optimization Evolutionary Algorithm) is proposed in this paper. This new algorithm combines the Pareto constrained-dominance, improved stochastic ranking algorithm and clone method in immune multi-objective optimization algorithm. Experiments show that compared with the other effective algorithms, this algorithm NCCMOEA is more excellent in diversity and robustness and avoid getting local optimal solutions obviously."}, "conf/ccis/WangXLY16": {"title": "A decision model of identifying user travel pattern based on the intelligent terminal sensor data.", "url": "https://doi.org/10.1109/CCIS.2016.7790308", "year": "2016", "author": {"Shuai Wang": "42/1503", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:The identification of user travel pattern has important research value for intelligent transportation. Intelligent terminal can supply GPS, acceleration sensors, pressure sensors data which can provide data base for the identification of user travel patterns. This paper research on a user travel pattern decision model based on the sensor data. The decision algorithm adopts decision tree algorithm based on ID3. Experiments data shows that this decision model is effective in identifying the pattern of user's travel."}, "conf/icnidc/YuXLY16": {"title": "A depth cascade face detection algorithm based on adaboost.", "url": "https://doi.org/10.1109/ICNIDC.2016.7974544", "year": "2016", "author": {"Wenxiang Yu": "223/1349", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:In this paper, a face detection algorithm based on AdaBoost algorithm combined with Haar classifier depth cascade about OpenCV is proposed. In order to solve the problem that the training depth of AdaBoost algorithm is not enough and the Haar classifier is not accurate because of the lack of depth cascade classification. Before the face feature extraction, AdaBoost algorithm is used to train the face samples to train the strong classifier. Then using OpenCV Haar classifier to depth classification for these strong classifier, it equal to cascade the AdaBoost algorithm, using high efficiency characteristic matrix and integral image method to accelerate the extraction rate of image feature values of the Haar-like."}, "conf/icnidc/WangYXL16": {"title": "Automatic calculation model of large scale soil loss model based on csle model.", "url": "https://doi.org/10.1109/ICNIDC.2016.7974562", "year": "2016", "author": {"Kai Wang": "78/2022", "Zhengqiu Yang": "31/7774", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:Based on the model of Chinese soil loss equation (CSLE), this paper puts forward a model to calculate the large scale data automatically. At present, the domestic use of this model to calculate the soil loss modulus methods are mostly used in the existing calculation tools, manual calculation of a basin or county soil erosion modulus. However, the data collected from the first national water resources survey about soil and water conservation work in our country, has not automatic calculation model to be applied. In this paper, we mainly study how to use the CSLE model to calculate the large range data by using the automatic method, and put forward the automatic calculation model."}, "conf/iscit/LiYXL16": {"title": "Research on an intelligent semantic-based information extraction framework.", "url": "https://doi.org/10.1109/ISCIT.2016.7751719", "year": "2016", "author": {"Shuangyang Li": "194/0845", "Zhengqiu Yang": "31/7774", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:The research in the field of web information extraction technology has made some progress in the past few years, but the extraction performance of the system still needs a lot of improvement. To solve this problem, a new intelligent framework for web information extraction is proposed in this paper. The framework provides a mechanism for automatic generation of Web information extraction rules, and associate instances with user's customized semantic extraction requirement intelligently. The framework takes full use of the structured, hierarchical features of web design templates, which can convert the web into an XML document by crawling, purifying and processing, then the public extraction rules can be extracted based on XPath positioning information. In addition, the experimental results show that this method can extract the customized the web information accurately, quickly and efficiently."}, "conf/iscit/ZhongLXY16": {"title": "Research on intelligent dynamic loading mechanism of mobile applications.", "url": "https://doi.org/10.1109/ISCIT.2016.7751720", "year": "2016", "author": {"Junjie Zhong": "194/0882", "Chen Liu 0011": "10/2639-11", "Jiapeng Xiu": "181/6486", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:With the in-depth development of the mobile terminal system, the extendibility of application has become a basic demand. Mobile terminal system urgently needs a mechanism which can load the APP module in the running state dynamically. This paper presents an intelligent dynamic loading mechanism and discusses the realization of the mechanism. Experiments show that this mechanism has the advantages of small volume, running smoothly, stable performance, etc."}, "conf/ccis/YangLX14": {"title": "Study on HCPV power forecasting model based on grey neural network and Markov chain.", "url": "https://doi.org/10.1109/CCIS.2014.7175760", "year": "2014", "author": {"Zhengqiu Yang": "31/7774", "Zeping Li": "181/6434", "Jiapeng Xiu": "181/6486"}, "abstract": " Abstract:The accurate power output forecasting is advantageous to improving the reliability of power system. This paper presents a new power forecasting model based on grey neural network and Markov chain. In grey neural network, it gains the power at the corresponding time as the forecasting result. As getting the relative prediction residual errors of the forecasting sample data with grey neural network, residual errors is corrected by the Markov chain method to improving the forecasting accuracy. Finally the prediction model is applied in forecasting the power of a HCPV power station. The results of the experiment show that this forecasting model is an efficient model."}, "conf/ccis/XiuZY14": {"title": "Prediction of solar power generation based on the principal components analysis and the BP neural network.", "url": "https://doi.org/10.1109/CCIS.2014.7175761", "year": "2014", "author": {"Jiapeng Xiu": "181/6486", "Chenchen Zhu": "50/6994", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:The power generation of solar power station has close relationship with the weather and environmental factors such as temperature, humidity, irradiation, etc. so prediction of power generation is very important for the intelligent power control. BP neural network is an effective tool to predict task, but too many parameters will cause the BP network converging difficultly. This article uses the principal components analysis method to reduce the input parameters of BP network. Through training by Matlab, a prediction model based on BP network is built up and the prediction effect is ideal."}, "conf/ccis/YangCX14": {"title": "Power generation forecasting model for photovoltaic array based on generic algorithm and BP neural network.", "url": "https://doi.org/10.1109/CCIS.2014.7175764", "year": "2014", "author": {"Zhengqiu Yang": "31/7774", "Yapei Cao": "181/6430", "Jiapeng Xiu": "181/6486"}, "abstract": " Abstract:High concentration photovoltaic is a new type of solar power generation mode, which has better photoelectric conversion rate but is more vulnerable to weather factors. Therefore, accurate and efficient forecasting methods have important significance of increasing the security and stability of the solar power station. This paper focuses on the short-term forecasting method which aims at forecasting power generation in five minutes. This paper uses BP neural network(BP-NN) as the basic forecasting model and applies generic algorithm(GA) to optimize the weights and thresholds of BP-NN. The experimental results show that, the prediction effect of this method is ideal."}, "conf/ccis/YanXLY14": {"title": "A high concentrated photovoltaic output power predictive model based on Fuzzy Clustering and RBF neural network.", "url": "https://doi.org/10.1109/CCIS.2014.7175765", "year": "2014", "author": {"Cheng Yan": "48/7967", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:It is significant to make a short-term power output forecast for the solar photovoltaic power station. On the one hand it helps guarantee power grid security, on the other hand it can increase the efficiency of power generation. This paper designs a high concentrated photovoltaic output power prediction model based on the Fuzzy Clustering and Radial Basis Function (RBF) neural network, uses the meteorological data which affect output power to classify the sample collection, selects the most similar two days' data and daily current average radiation exposure as the RBF neural network inputs. The output value of the neural network is the unit's prediction output power after an hour. This paper uses the data from a high concentrated photovoltaic power station in northwest China to train and validate the model, the predicting outcomes show the proposed model has good accuracy."}, "conf/ccis/LiuFYX14": {"title": "A distributed video share system based on Hadoop.", "url": "https://doi.org/10.1109/CCIS.2014.7175803", "year": "2014", "author": {"Chen Liu 0011": "10/2639-11", "Kun Fan": "01/3073", "Zengqiu Yang": "181/6480", "Jiapeng Xiu": "181/6486"}, "abstract": " Abstract:The paper present a framework for video playing and video storage based on Hadoop. Our framework consist of 3 layers. CDN for receiving clinets' requests; CCN for connecting clients and sending data; Hadoop cluster for data storage. This kind of structure helps to provide high availablility services, which could support high concurrent access and play smooth streaming media in mobile terminals."}, "conf/ccis/YangLXL12": {"title": "An optimized load algorithm of parallel data warehouse based on the cloud computing platform.", "url": "https://doi.org/10.1109/CCIS.2012.6664438", "year": "2012", "author": {"Zhengqiu Yang": "31/7774", "Tong Li": "29/3826", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:The parallel database system (PDS) owns high performance and high availability and is suitable for mass data storing and processing. However, data loading performance is a bottleneck in PDS. To improve the data loading performance, this paper proposes an optimized load algorithm based on cloud platform which can promote the speed of load process. The paper gives the algorithm description, elaborates the algorithm implementation process through an example, and discusses the correctness of the algorithm at last."}, "conf/ccis/LiuYXY12": {"title": "The interest community mining method of social network based on the weak association rules.", "url": "https://doi.org/10.1109/CCIS.2012.6664439", "year": "2012", "author": {"Chen Liu 0011": "10/2639-11", "Shan Yang": "72/8479", "Jiapeng Xiu": "181/6486", "Zhengqiu Yang": "31/7774"}, "abstract": " Abstract:The development of Internet and the appearance of the Web2.0 have dramatically changed the communication habits of the people. The network communications based on social relationships and interests are more and more popular. It has great significance for dissemination and utilization of information to research the community structure formed by the user group who uses these communication modes. In this paper, we use a method based on the improvement of the association rules to divide the interest community on the community structure. The experimental results show that the algorithm has high accuracy and can provide the technical foundation for the better use of the social network."}, "conf/ccis/YangLXL12a": {"title": "Study on cloud resource allocation strategy based on particle swarm ant colony optimization algorithm.", "url": "https://doi.org/10.1109/CCIS.2012.6664453", "year": "2012", "author": {"Zhengqiu Yang": "31/7774", "Meiling Liu": "33/3934", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:Cloud computing environment for the efficient resources allocation is an important issue in the field of cloud computing. The resources in Cloud computing application platform are distributed widely and with great diversity. User demands of real-time dynamic change are very difficult to predict accurately. The heuristic ant colony algorithm could be used to solve this kind of problems, but the algorithm has slow convergence speed and parameter selection problems. Aiming at this problem, this paper proposes an optimized ant colony algorithm based on particle swarm to solve cloud computing environment resources allocation problem."}, "conf/ccis/YangHXL12": {"title": "SocialRank: Social network influence ranking method.", "url": "https://doi.org/10.1109/CCIS.2012.6664243", "year": "2012", "author": {"Zhengqiu Yang": "31/7774", "Xiaozhe Huang": "193/2145", "Jiapeng Xiu": "181/6486", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:The influence of an individual in the social network is a both subjective and objective matter, which depends on the quality of his web pages and the altitudes of the others. But there is still much that can be said objectively about the relative influence of every individual in the social network. This paper describes SocialRank, a method for measuring the influence of an individual objectively and mechanically using his attributes and the relations between him and the others. We give the compartments of SocialRank to basic attributes and PageRank. We show how accurately SocialRank access relative influence."}, "conf/ccis/XiuXYL12": {"title": "Ontology-based production model of satellite remote sensing data parameter products.", "url": "https://doi.org/10.1109/CCIS.2012.6664325", "year": "2012", "author": {"Jiapeng Xiu": "181/6486", "Xiaobo Xu": "75/5840", "Zhengqiu Yang": "31/7774", "Chen Liu 0011": "10/2639-11"}, "abstract": " Abstract:Based on the research of the 863 program “Generation and Applications of Global Products of Essential Land Variable”, the paper proposes an ontology-based production model of parameter products of satellite remote sensing data, which describes the design of satellite ontology, remote sensing data ontology and parameter products ontology. And based on the ontology model, production system architecture of land surface parameter products is designed, and the function of every module is expounded. The system running process is showed in the paper based on some land surface parameter products. The ontology base designed in this paper is the foundation of remote sensing data cataloguing and production instance creating, which is of great significance."}, "journals/access/ChenZHZLWXY21": {"title": "A Novel Method of Developing Driving Cycle for Electric Vehicles to Evaluate the Private Driving Habits.", "url": "https://doi.org/10.1109/ACCESS.2021.3049411", "year": "2021", "author": {"Fei Chen": "81/4345", "Sida Zhou": "237/9948", "Yang Hua": "34/9988", "Xinan Zhou": "64/5930", "Xinhua Liu 0003": "56/5614-3", "Ningning Wu": "07/6538", "Jiapeng Xiu": "181/6486", "Shichun Yang": "157/3799"}, "abstract": " Abstract:As one of important implications on electric vehicles, driving cycles are recognized as essential components for evaluating the comprehensive performances and they have drawn much attention for research. Currently, driving cycles are constructed specifiedly in international standards based on local traffic conditions. However, without consideration of the private driving habits, unproper cycles lead to the imprecision on predicting the remaining useful life or estimating states. Herein, a novel methodology based on Markov chain and Monte Carlo method is developed to extract the personal driving characteristics as the elements of divided kinematic fragments. Principal component analysis is adopted to address the high-dimensional parameter vector, and cluster is used to classify the kinematic fragments. The statistics analysis demonstrates that the processed database exhibits great consistency with our developed driving cycle compared against original database, where temperature, state-of-charge and consistency are utilized to describe the personal patterns. Moreover, by using the operational driving data, the developed driving cycle is comparable against other driving cycles, which exhibits good performance. Overall, the presented driving cycle of electric vehicle can be considered as an effective way in evaluating the private driving habits, predicting the battery states and other related applications. The method may be promoted for future better energy management on electric vehicles owing to the promotion of connected and autonomous vehicles."}, "journals/ijgi/LiXYL20": {"title": "Dual Path Attention Net for Remote Sensing Semantic Image Segmentation.", "url": "https://doi.org/10.3390/ijgi9100571", "year": "2020", "author": {"Jinglun Li": "194/4754", "Jiapeng Xiu": "181/6486", "Zhengqiu Yang": "31/7774", "Chen Liu 0011": "10/2639-11"}, "abstract": ""}}}