{"id": "139/7655", "name": "Jingling Zhao", "Article": {"conf/imis/YangZC21": {"title": "PtPeach: Improved Design and Implementation of Peach Fuzzing Test for File Format.", "url": "https://doi.org/10.1007/978-3-030-79728-7_8", "year": "2021", "author": {"Hua Yang": "11/4973", "Jingling Zhao": "139/7655", "Baojiang Cui": "22/1154"}, "abstract": "The existing open-source framework of Peach fuzzing test is based on mutation or model generation, which cannot obtain the execution information inside the input program, which makes many invalid byte mutations during fuzzing. This paper proposes a new feedback mechanism and mutation mechanism. Based on the Peach framework, the PtPeach guidance test cases generation link is improved. The key fields can be located with the help of the information changes during program execution during mutation so that the keyword section in the file can be fuzzed, which will greatly shorten the generation time of fuzzing test cases and speed up fuzzing for vulnerability mining speed. Experiments show that in the same time, we fuzzed the AcroRd32.dll in the Adobe library, and finally improved Peach's ability to perform fuzzing to find potential vulnerabilities."}, "conf/aina/NiYJZH20": {"title": "Periodic Mining of Traffic Information in Industrial Control Networks.", "url": "https://doi.org/10.1007/978-3-030-44041-1_16", "year": "2020", "author": {"Jiahui Ni": "261/8563", "Wenqing Yin": "115/5993", "Yong Jiang": "74/1552", "Jingling Zhao": "139/7655", "Yiming Hu": "68/5169"}, "abstract": "With the increasing demand for security in industrial control systems, many researchers are studying industrial control systems for anomaly detection. Most of them use machine learning method to analyze and predict the traffic, but it is not enough to study the periodic characteristics of the industrial control system. This paper analyzes and studies the characteristics of the protocol field by extracting the unique protocol Modbus in the industrial control system. In this paper, the periodic characteristics of industrial control data are mined from the aspects of symbol sequence. We simulate traffic and test the proposed method which shows that it can effectively detect the periodicity of different sequences in the industrial control system and provide an auxiliary method for anomaly detection.KeywordsIndustrial control system(ICS)TrafficPeriodic sequenceModbus protocol"}, "conf/aina/ZhaoYN20": {"title": "A Universal Defense System Based on Backtrace Canary for ELF Against Vulnerabilities.", "url": "https://doi.org/10.1007/978-3-030-44041-1_40", "year": "2020", "author": {"Jingling Zhao": "139/7655", "Congxiang Yu": "240/3211", "Yunze Ni": "177/1437"}, "abstract": "With the development of vulnerability exploitation technology, attackers can usually bypass various mitigations provided by the operating system through the combination of multiple vulnerabilities and finally obtain the permission of the server. We analyzed the principles of program function calls and proposed a vulnerability mitigation named Backtrace Canary which is based on the Backtrace Control Flow Graph. We have also implemented a universal vulnerability defense system based on it. Experiments show that the vulnerability defense system is very practical."}, "conf/gecon/ZhangZSLW20": {"title": "A Blockchain Consensus for Message Queue Based on Byzantine Fault Tolerance.", "url": "https://doi.org/10.1007/978-3-030-63058-4_1", "year": "2020", "author": {"Jiahui Zhang": "131/4074", "Jingling Zhao": "139/7655", "Xuyan Song": "220/7944", "Yiping Liu": "04/1329", "Qian Wu": "61/591"}, "abstract": "Blockchain technology is developing rapidly, and many companies that develop and apply blockchain technology have gradually risen. Most companies choose to use the consortium blockchain. Because the consortium blockchain is for small-scale groups or institutions, identity authentication is required to join the consortium blockchains. Therefore, security can be guaranteed to a certain extent. Blockchain is often considered as a distributed accounting system. An important mechanism to ensure the stable operation of this accounting system is to ensure consistency among the distributed ledgers. The consensus mechanism in the blockchain is the algorithm that accomplishes this function. To improve throughput, many consortium blockchains use message queues as the consensus algorithm. However, the message queue consensus cannot tolerate malicious nodes. Aiming at this problem, this paper designs and implements a consensus for message queue based on Byzantine fault tolerance, which improves and combines message queue and PBFT. Moreover, it is verified through experiments that the consensus algorithm can reach the general level of TPS. The system can still operate normally when malicious nodes appear within the tolerable range, which has certain robustness and efficiency.KeywordsBlockchainByzantine fault toleranceConsensusConsortium blockchainMessage queue"}, "conf/icmss/LiaoZL19": {"title": "Prediction of Mobile App Session Time.", "url": "https://doi.org/10.1145/3312662.3312695", "year": "2019", "author": {"Zhen Liao": "39/4131", "Jingling Zhao": "139/7655", "Yan Li": "87/660"}, "abstract": "\n\t\tWith the rapid development of the mobile terminal applications, the research of mobile app advertising pricing model has attracted more attention than ever. Many researches draw a conclusion that the more advertisement exposure time, the more benefits they will get from the mobile applications. However, the current advertisement auction is priced and sold before actual viewing. In other words, the existing advertising pricing model doesn't involve the influence factor of the advertisement exposure time. Understanding the application usage patterns can help the advertisers to adjust the engagement of their ads. Therefore, this paper adopts a prediction model of the mobile application session time that combines the Back Propagation Neural Network and Genetic Algorithm. Finally, based on the experimental results and performance analysis, the error is in the acceptable scope.\n\t"}, "conf/imis/ZhaoBN19": {"title": "Improved SM4 Encryption Algorithm Based on Mixed Congruence Method.", "url": "https://doi.org/10.1007/978-3-030-22263-5_23", "year": "2019", "author": {"Jingling Zhao": "139/7655", "Qingyang Bao": "243/4340", "Yunze Ni": "177/1437"}, "abstract": "With the increasing popularity of Android mobile terminals, the data stored in mobile terminals has become the object of attack by attackers. How to carry out effective privacy protection becomes an important issue that we need to consider. Among all privacy protection methods, it is a good strategy to encrypt data using encryption algorithms. This paper mainly studies the SM4 symmetric encryption algorithm proposed by the China National Cryptography Authority. In order to solve the crackability of the SM4 encryption algorithm, a mixed congruence method is used to generate a pseudo-random sequence, and the encrypted content is grouped and rearranged to improve its anti-cracking capability. The improved SM4 encryption algorithm is used to protect the data. Not only does the improved algorithm improve the security of the original algorithm, but also meets the need for encryption speed on Android mobile terminals."}, "conf/cisis/ZhaoSMC18": {"title": "Fuzzing Test Method Based on Constraint-Conditions Priority for LTE-EPC Protocol.", "url": "https://doi.org/10.1007/978-3-319-93659-8_41", "year": "2018", "author": {"Jingling Zhao": "139/7655", "Zhan Su": "45/7565", "Jinxin Ma": "117/5485", "Baojiang Cui": "22/1154"}, "abstract": "\nThrough the analysis of LTE EPC protocol, This paper research the LTE protocol format and tries to find an effective method for security detection. This paper uses fuzzing test techniques to detect security issues in the LTE core network. In order to improve the efficiency of the fuzzing test, this paper proposes a new algorithm based on constraint-condition priority. Finally, this paper tested new algorithm based on OAI LTE core network system and chose a LTE protocol named DIAMETER. The newly proposed algorithm finds a problem with the DIAMETER protocol. By statistical data packet effective rate, it can be proved that the fuzzing test method based on constraint condition priority is effectiveKeywordsLTEFuzzing testOpenairinterfaceSecurityConstraint-conditions"}, "conf/icccn/ZhaoZLC18": {"title": "Malware Detection Using Machine Learning Based on the Combination of Dynamic and Static Features.", "url": "https://doi.org/10.1109/ICCCN.2018.8487459", "year": "2018", "author": {"Jingling Zhao": "139/7655", "Suoxing Zhang": "227/7281", "Bohan Liu": "32/3191", "Baojiang Cui": "22/1154"}, "abstract": " Abstract:As millions of new malware samples emerge every day, traditional malware detection techniques are no longer adequate. Static analysis methods, such as file signature, fail to detect unknown programs. Dynamic analysis methods have low efficiency and high false positive rate. We need a detection technique that can adapt to the rapidly changing malware ecosystem. The paper presented a new malware detection method using machine learning based on the combination of dynamic and static features. The characteristic of this experiment involved in many fields of knowledge, including binary program instrumentation, static analysis, assembly instruction analysis, machine learning, etc. Finally, we achieved a good result over a substantial number of malwares."}, "conf/imis/ZhaoWMC18": {"title": "Classifying Malicious URLs Using Gated Recurrent Neural Networks.", "url": "https://doi.org/10.1007/978-3-319-93554-6_36", "year": "2018", "author": {"Jingling Zhao": "139/7655", "Nan Wang": "84/864", "Qian Ma": "49/3103", "Zishuai Cheng": "215/7279"}, "abstract": "\nThe past decade has witnessed a rapidly developing Internet, which consequently brings about devastating web attacks of various types. The popularity of automated web attack tools also pushes the need for better methods to proactively detect the huge amounts of evolutionary web attacks. In this work, large quantities of URLs were used for detecting web attacks using machine learning models. Based on the dataset and feature selection methods of [1], multi-classification of six types of URLs was explored using the random forest method, which was later compared against the gated recurrent neural networks. Even without the need of manual feature creation, the gated recurrent neural networks consistently outperformed the random forest method with well-selected features. Therefore, we determine it is an efficient and adaptive proactive detection system, which is more advanced in the ever-changing cyberspace environment.\nKeywordsMalicious URLsRandom Forest MethodProactive DetectionHeuristic-based FeatureCloud Network EnvironmentThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/cse/ZhaoYJL17": {"title": "A High-Speed Network Data Acquisition System Based on Big Data Platform.", "url": "https://doi.org/10.1109/CSE-EUC.2017.128", "year": "2017", "author": {"Jingling Zhao": "139/7655", "Congxian Yin": "202/6307", "Xiaohui Jin": "202/6211", "Weiliang Liu": "77/6507"}, "abstract": " Abstract:This paper designs a high-speed network data acquisition system based on big data platform with good expansibility and high real-time, aiming at the need of enterprises or organizations to acquire high-speed network data efficiently in network intrusion detection. Taking into account the storage capacity and computing power requirements of high-speed network traffic capture and processing, the whole system is divided into two parts. The front-end adopts high-performance network traffic distributor based on hardware, and uses it to divide the high-speed network traffic into multiple low-speed branch traffic. The back-end data acquisition and processing system is implemented by clustering of normal PC, and the software system is optimized by introducing big data technology. The use of distributed storage and computing improve data processing performance. The system acquires the complete network data through distribution, capture, cache, layered protocol analysis, session reassembly, application layer data extraction and so on, which can provide reference for intrusion detection."}, "conf/icmss/ZhaoWXY17": {"title": "Personalized LBSN Recommendation System.", "url": "https://doi.org/10.1145/3034950.3034995", "year": "2017", "author": {"Jingling Zhao": "139/7655", "Tianyi Wang": "88/8398", "Xiaojun Xu": "47/8617", "Yu Yang": "16/4505"}, "abstract": "\n\t\tTo explore deep value of user comments in LBSN, this article through to Foursquare check-in with geography information analysis and review data using AFINN dictionary user comments emotions tend to get user implicit rating for this product. Using the score as the foundation, proposed and implemented an integrated collaborative filtering recommendation algorithm based on user modeling based on geographic location, recommended results for users such as user friend recommended recommend he might be interested in. Finally, the system performed well in MAE measurement and solve the data sparse problem.\n\t"}, "conf/ictce/XuLZ17": {"title": "An energy aware and load balancing routing protocol for mobile ad hoc networks.", "url": "https://doi.org/10.1145/3145777.3145779", "year": "2017", "author": {"Xiaojun Xu": "47/8617", "Qing Liao 0003": "09/8600-3", "Jingling Zhao": "139/7655"}, "abstract": "\n\t\tIn this paper, we propose an energy aware and load balancing routing protocol (EALB) for mobile ad hoc networks (MANETs). The proposed protocol takes the residual energy, the current load and the subsequent load changes of the node into account to select the best route. In the route discovery phase, energy levels were defined, and the node execute RREQ forwarding judgment according to its energy level, as far as possible to avoid the low residual energy nodes. In the route reply phase, EALB collects all possible routes by the delay reply mechanism, and selects the best route by the corresponding cost function which consists of energy cost and load cost. The simulations are carried out by NS2, the results show that EALB outperforms BBU-AODV in terms of average end-to-end delay, packet delivery rate and network lifetime.\n\t"}, "conf/imis/ZhaoHLC17": {"title": "Software Abnormal Behavior Detection Based on Hidden Markov Model.", "url": "https://doi.org/10.1007/978-3-319-61542-4_94", "year": "2017", "author": {"Jingling Zhao": "139/7655", "Guoxiao Huang": "202/3728", "Tianyu Liu": "134/1099", "Baojiang Cui": "22/1154"}, "abstract": "\nIn order to ensure the normal operation and security of the software, this paper presents an abnormal behavior state recognition system based on Hidden Markov model, using the local regularity of the trace of the system call to extract the intrinsic sequence pattern, and construct the normal behavior model through the HMM algorithm. This system is capable of establishing the system call model during normal operation and judge whether the software is running normally by the matching between the actual system call and the normal model. Experiments show that, compared with only using system call sequence information of classical hidden Markov method, the method of training time is only 10% of the traditional method, and can obtain lower false positive rate and false negative rate.\nKeywordsHidden Markov ModelsAbnormal Behavior DetectionSystem Call SequencesNormal Behavior ModelCal SystemsThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/bwcca/ZhaoHH16": {"title": "C++ Memory Check tool based on Dynamic Binary Instrumentation Platform.", "url": "https://doi.org/10.1007/978-3-319-49106-6_1", "year": "2016", "author": {"Jingling Zhao": "139/7655", "Lei He": "75/5673", "Bing He": "64/2272"}, "abstract": "In software development, to detect the presence of defects in the software as soon as possible, would greatly reduce the extent of losses arising. In this paper, focus on the memory-use error in C++ program, designed and implemented a memory check tools named ShadowCheck, based on dynamic binary instrumentation platform, which is platform-cross, efficiency and accuracy. In this paper, introduced dynamic binary instrumentation platform and the memory layout of Linux first, then explained how the ShadowCheck works, at last, summarized the efficiency and accuracy of ShadowCheck.KeywordsBasic BlockBuffer OverflowMemory LeakNational Engineer LaboratoryMemory LayoutThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/imis/ZhaoQZC16": {"title": "Dynamic Taint Tracking of Web Application Based on Static Code Analysis.", "url": "https://doi.org/10.1109/IMIS.2016.46", "year": "2016", "author": {"Jingling Zhao": "139/7655", "Junxin Qi": "177/1443", "Liang Zhou": "81/4761", "Baojiang Cui": "22/1154"}, "abstract": " Abstract:With the continuous development of J2EE technology, frequent attacks using security vulnerabilities in web applications have caused enormous economic loss to the users. Dynamic taint tracking is an important part to analyze the program dynamically. In this paper, we put forward a new dynamic solution in the Java virtual machine, warning external attacks and recording specific taint propagation path. This scheme combines static analysis techniques to collect reachable \"source-derivation-sink\" taint flow and reduce the runtime overhead. With the help of AOP (aspect-oriented programming) technology, we could only insert monitor codes to interested taint paths to improve the efficiency of instrumentation. Finally, we implemented this dynamic taint tracking approach to explore SQL injection and XSS vulnerabilities in web applications based on the Java Servlet Specification and proved practicality."}, "conf/iswcs/LinLDWZ16": {"title": "COFFEE-CUP: A cost-efficient routing strategy for delay tolerant networks using time-varying community partitioning.", "url": "https://doi.org/10.1109/ISWCS.2016.7600914", "year": "2016", "author": {"Guoping Lin": "69/7776", "Qing Liao 0003": "09/8600-3", "Can Deng": "187/9795", "Tianyi Wang": "88/8398", "Jingling Zhao": "139/7655"}, "abstract": " Abstract:Delay Tolerant Networks are a special kind of ad hoc networks that consist of a number of mobile devices. In DTNs, network topology frequently changes and source-to-destination communication paths can hardly be sustained. However, some social features have been observed in DTNs by analyzing the real mobile trajectories of DTNs. To utilize these social features to facilitate data routing, we present a community-based routing protocol that efficiently detects the community structure by using proposed time-varying community partitioning algorithm. For intracommunity routing, according to the remaining time-to-live of the message, the minimum number of message copies necessary to achieve a given delivery probability is calculated, which is the number of message copies utilized to spray in the current community. To facilitate intercommunity routing, we choose the gateway node that connects the next community frequently as relay. The evaluation of our strategy is conducted by extensive traced-driven simulations. The results of simulations confirm the effectiveness of our routing strategy."}, "conf/bwcca/ZhaoXFC15": {"title": "An AST-based Code Plagiarism Detection Algorithm.", "url": "https://doi.org/10.1109/BWCCA.2015.52", "year": "2015", "author": {"Jingling Zhao": "139/7655", "Kunfeng Xia": "137/0635", "Yilun Fu": "169/2045", "Baojiang Cui": "22/1154"}, "abstract": " Abstract:In modern software engineering, software plagiarism is widespread and uncurbed, developing plagiarism detection methods is imperative. Popular technologies of software plagiarism detection are mostly based on text, token and syntax tree. Among these plagiarism detection technologies, tree-based plagiarism detection technology can effectively detect the code which cannot be detected by the other two kinds of technologies. In this paper, we propose a more effective plagiarism detection algorithm based on abstract syntax tree (AST) by computing the hash values of the syntax tree nodes, and comparing them. In order to implement the algorithm more effectively, special measurement is taken to reduce the error rate when calculating the hash values of operations, especially the arithmetic operations like subtraction and division. Results of the test showed that the measurement is reliable and necessary. It performs well in the code comparison field, and is helpful in the area of protecting source code's copyright."}, "conf/imis/ZhaoG15": {"title": "A New Framework of Security Vulnerabilities Detection in PHP Web Application.", "url": "https://doi.org/10.1109/IMIS.2015.42", "year": "2015", "author": {"Jingling Zhao": "139/7655", "Rulin Gong": "169/1942"}, "abstract": " Abstract:Nowadays, Web applications provide us most of the Internet services, but also give birth to more and more new types of Internet applications. While, according to the developers' programming techniques and safety awareness, there are many kinds of Web application security flaws and vulnerabilities hiding in the program. So it is very important to improve their reliability and security. Usually people use code review based on static or dynamic analysis to detect security vulnerabilities, but each method has shortcomings that can't overcome easily which can result in a big number of false positives and omission. To address this issue, this paper proposed a new framework of detecting security vulnerabilities of PHP web application. In this framework, we combine dynamic and static analysis to make full use of the advantages of the two, greatly improve the efficiency of detection. An implementation based on this framework has also been completed and it will also be presented in the paper."}, "conf/vtc/ShanLHJZ15": {"title": "A QoE-Driven Cross-Layer Resource Allocation Scheme for High Traffic Services over Open Wireless Network Downlink.", "url": "https://doi.org/10.1109/VTCFall.2015.7390811", "year": "2015", "author": {"Liya Shan": "175/2651", "Qing Liao 0003": "09/8600-3", "Qinyue Hu": "175/2360", "Shantao Jiang": "175/2565", "Jingling Zhao": "139/7655"}, "abstract": " Abstract:In this paper, a Quality of Experience (QoE)-driven cross-layer resource allocation scheme for high traffic services over Open Wireless Network (OWN) downlink is proposed. And the main novelty of this paper is that it solves the resource allocation problem about the users in overlap region of adjacent cells through central controller without the communication between different cells. Also, we have adopted the QoE assessment models for BestEffort and video services to abstract its' Mean Opinion Score (MOS) value. And we use the cross- layer architecture which considers the parameters in application layer, media access control layer and physical layer jointly. Then, we build the mathematical model of the resource allocation problem. Based on the Binary Constrained Particle Swarm Optimization (B_CPSO) algorithm, the optimization results can be found. In addition, Simulation results show that the proposed scheme have better performance than the other schemes in terms of maximizing average users' MOS value for the whole system as well as maintaining fairness among users."}, "conf/3pgcic/ChengHZLC14": {"title": "A Security Enhanced IEEE1588 Protocol for Deep-Space Environment.", "url": "https://doi.org/10.1109/3PGCIC.2014.30", "year": "2014", "author": {"Zijing Cheng": "145/6322", "Lei He": "75/5673", "Jingling Zhao": "139/7655", "Kai Lin": "94/207", "Baojiang Cui": "22/1154"}, "abstract": " Abstract:With the continuous development of the space technology, increasing communication between spacecrafts. To ensure the spacecrafts keep a uniform time standard, time synchronization protocol plays an crucial role. Taking account the characteristics of deep-space: poor link quality, limited node computing power, and the GNSS service is unstable, through the improving of IEEE1588 protocol, a autonomous time synchronization protocol for the space environment is presented, which security arrangement is relatively sound, does not depend on the GNSS service -- Security Enhanced IEEE1588 for Space (SEIEEE1588)."}, "conf/3pgcic/ZhaoZC14": {"title": "Sentence Similarity Based on Semantic Vector Model.", "url": "https://doi.org/10.1109/3PGCIC.2014.101", "year": "2014", "author": {"Jingling Zhao": "139/7655", "Huiyun Zhang": "29/7838", "Baojiang Cui": "22/1154"}, "abstract": " Abstract:Sentence similarity measures play an increasingly important role in text-related research and applications in areas such as text mining, Web page retrieval, and dialogue systems. Existing methods for computing sentence similarity have been adopted from approaches used for long text documents. These methods process sentences in a very high-dimensional space and are consequently inefficient, require human input, and are not adaptable to some application domains. This paper focuses directly on computing the similarity between very short texts of sentence length. It presents an algorithm that takes account of semantic information, structure information and word order information implied in the sentences. The semantic similarity of two sentences is calculated using information from a structured lexical database, How-net. The use of a lexical database enables our method to model human common sense knowledge. The proposed method can be used in a variety of applications that involve text knowledge representation and discovery. Experiments on two sets of selected sentence pairs demonstrate that the proposed method provides a similarity measure that shows higher accuracy than other methods."}, "conf/3pgcic/ZhaoCLCS13": {"title": "RFSM-Fuzzing a Smart Fuzzing Algorithm Based on Regression FSM.", "url": "https://doi.org/10.1109/3PGCIC.2013.65", "year": "2013", "author": {"Jingling Zhao": "139/7655", "Shilei Chen": "139/7636", "Shurui Liang": "47/9712", "Baojiang Cui": "22/1154", "Xiaolong Song": "66/4855"}, "abstract": " Abstract:Wireless communication protocol is the core of wireless sensor networks. The wireless sensor networks transfer data wirelessly and are usually deployed in wild, moreover, the energy, computing power and storage capacity of its nodes are all limited, such characteristics make wireless communication protocols more vulnerable to be attacked. In order to ensure the security of the protocol, it's necessary to use effective testing techniques for defect detection. As the test subject here, ZigBee protocol is widely used in low-rate wireless sensor networks. In this paper, a test algorithm called RFSM-Fuzzing (Regression Finite State Machine Fuzzing) is proposed which can automate test the robustness of wireless communication protocols and mine the potential vulnerabilities. The algorithm combines the advantages of conformance testing and intelligent Fuzz testing, so that it has high coverage and effectiveness. In this paper, Z-Stack Fuzzer is designed and through the application of RFSM-Fuzzing algorithm, testing of some test cases of MAC-layer of the ZigBee Protocol is realized. At last, the test results are obtained and the effectiveness of the algorithm is proved."}, "conf/icct/ZhaoSL13": {"title": "Implementation of K-Means based on improved storm model.", "url": "https://doi.org/10.1109/ICCT.2013.6820470", "year": "2013", "author": {"Jingling Zhao": "139/7655", "Zhaohua Sun": "196/9586", "Qing Liao 0001": "09/8600-1"}, "abstract": " Abstract:In recent years, big data processing has been a trend. Hadoop and some other cloud computing technologies make batch processing possible to process big data. Storm is like a real-time Hadoop. Storm model is easy, but it's difficult to deal with complex Topology due to the increasing inter-dependences between components. This paper proposes a novel method which simplifies the Storm Topology programming model by combining Spring with Storm. It provide a modular approach and a unified configuration model to build topologies and easy to use API for using Storm. Meanwhile, this paper propose a system to process data and realize the K-Means clustering algorithm in Storm. The practice results is shown and analyzed to prove the effectiveness of the system and model, at the same time it proves that Storm can improve the clustering algorithm processing speed."}, "conf/ccis/WangZL12": {"title": "A cross-platform context-aware application developing framework for mobile terminals.", "url": "https://doi.org/10.1109/CCIS.2012.6664589", "year": "2012", "author": {"Pingyi Wang": "193/2073", "Jingling Zhao": "139/7655", "Qing Liao 0001": "09/8600-1"}, "abstract": " Abstract:The increasing number of mobile terminals facilitates the development of context-aware applications. However, developing a context aware application is still a complex work, which involves mechanisms of context acquisition and context processing. In order to release the developer's burden, many context aware frameworks emerged. But none of them yet has sufficient consideration of mobile environment characteristics. Besides, restricted to the mobile platform, the developed application could not achieve cross-platform deployment. A cross-platform context-aware application developing framework for mobile terminals is proposed in this paper. This framework could shield system differences, centralize context acquisition, context modeling, context storing, context interpretation and context aggregation for many context aware applications on the same terminal. Applying the framework, data of same sensor would not be duplicated processed by many context aware applications. Context aware application would be built faster. And mobile terminal resources would be used more efficiently."}, "journals/iot/WangZC19": {"title": "Fuzzing method based on field filter and packet repair for GTPv2 protocol.", "url": "https://doi.org/10.1016/j.iot.2019.100104", "year": "2019", "author": {"Guobin Wang": "133/6800", "Jingling Zhao": "139/7655", "Baojiang Cui": "22/1154"}, "abstract": "4G communication technology plays an important role in the information transmission of the Internet of Things (IoT). Focusing on the security of 4G is of great significance to the security of IoT. Since the GTPv2 protocol is a very important protocol in the 4G core network, this paper mainly fuzzed the GTPv2 protocol. Aiming at the shortcomings of traditional protocol fuzzing technology, such as time-consuming and low coverage, this paper proposes a novel fuzzing technique based on field filter and packet repair to address those problems. By analyzing the test results, we found that the application of the new algorithm made the fuzzing technology greatly improved in terms of time consumption and coverage and found additional security vulnerabilities. The new algorithm proposed in this paper can also be used for most other protocols in IoT."}, "journals/ijwgs/ZhaoCCC17": {"title": "Malware algorithm classification method based on big data analysis.", "url": "https://doi.org/10.1504/IJWGS.2017.10002666", "year": "2017", "author": {"Jingling Zhao": "139/7655", "Shilei Chen": "139/7636", "Mengchen Cao": "177/1400", "Baojiang Cui": "22/1154"}, "abstract": ""}, "journals/tcci/LiaoWLZQ15": {"title": "Improved Recommendation System Using Friend Relationship in SNS.", "url": "https://doi.org/10.1007/978-3-662-49017-4_2", "year": "2015", "author": {"Qing Liao 0003": "09/8600-3", "Bin Wang": "13/1898", "Yanxiang Ling": "158/3387", "Jingling Zhao": "139/7655", "Xinyue Qiu": "172/8409"}, "abstract": "With the rapid development of the Internet, SNS services and 3G commercial mobile applications there have been tremendous opportunities although the development of SNS is very short in China, and the social web game is in the early stage of development. Because of massive users, the potential commercial value of Chinese SNS is still a great mining space. However, a relatively large defects is the precipitation and accumulation on content. The dynamic of friends will affect our own decisions largely, it is favorable for the activity of SNS to increase the number of friends. We have improved the existing models, and conduct experiments to validate it and compare it with previous methods.\nKeywordsSNSContextMatrix decomposition modelRecommendation"}}}