{"id": "98/476-3", "name": "Kun Xie 0003", "Article": {"conf/wpmc/CuiCYXX17": {"title": "Authentication mechanism for network applications in SDN environments.", "url": "https://doi.org/10.1109/WPMC.2017.8301788", "year": "2017", "author": {"Hongyan Cui": "25/8839", "Zunming Chen": "215/9219", "Longfei Yu": "74/6558", "Kun Xie 0003": "98/476-3", "Zong-Guo Xia": "136/7001"}, "abstract": " Abstract:Software-defined Networking, a new networking paradigm, provides network programming for third parties by separating control plane from data forwarding plane and opening network capabilities. SDN brings great flexibility and openness to the network, but the original design phase of SDN had not considered designing characteristics regarding security. For this reason, there are many potential vulnerabilities in SDN Environments. One of the most critical security threats arise from the vulnerability of trusting relationship due to the lack of authentication mechanism between the network application and the controller. A specific concern is whether an application can be trusted or not. This paper discusses the authentication mechanism of the network application. At the same time, it implements the application authentication system which addresses the key challenges: how to safely resolve conflicts between untrusted network applications and requests. The paper undergoes system testing in testbed constructed Floodlight architecture. The test results show that the system works well to effectively defend against unauthorized access and provide log history, which verifies the effectiveness of the proposed method to secure the northbound interface by introducing the application authentication system."}, "journals/cn/YanMLHMX22": {"title": "A flexible and lightweight privacy-preserving handshake protocol based on DTLShps for IoT.", "url": "https://doi.org/10.1016/j.comnet.2022.109169", "year": "2022", "author": {"Lei Yan": "68/5281", "Maode Ma": "74/1079", "Dandan Li": "16/3614", "Xiaohong Huang": "67/4573", "Yan Ma": "31/1970", "Kun Xie 0003": "98/476-3"}, "abstract": "Anonymous authentication is widely studied for preserving the privacy of IoT devices. Although attribute-based signature (ABS) schemes can show identity attributes flexibly, letting the private key be generated by someone else is not safe. The computational overhead of traditional anonymous credential schemes based on zero-knowledge proofs (ZKP) is heavy for resource-constrained IoT devices. DTLShps, a lightweight handshake protocol based on software-defined networking (SDN), brings a new thought to verify certificates for resource-constrained IoT devices without anonymous functions. In this article, a lightweight privacy-preserving handshake protocol is designed based on DTLShps to flexibly present attributes of anonymous certificates for resource-constrained IoT devices. An authorization code is designed to represent the authorization status of each identity attribute defined in the X.509 standard. The IoT device cooperating with the CA can flexibly show arbitrary identity attributes to its peer by the authorization code. Only one signing operation of the elliptic curve digital signature algorithm (ECDSA) is needed to grant the authorization on the IoT device with the cooperation of the controller. The security of the proposed scheme is validated by the BAN logic and the tool Scyther. The performance evaluation shows that the computational delay on the IoT device and overall handshake delay is effectively reduced compared with the existing anonymous certificate schemes."}, "journals/cn/HuangZ021": {"title": "Intelligent traffic control for QoS optimization in hybrid SDNs.", "url": "https://doi.org/10.1016/j.comnet.2021.107877", "year": "2021", "author": {"Xiaohong Huang": "67/4573", "Man Zeng": "289/2874", "Kun Xie 0003": "98/476-3"}, "abstract": "Software Defined Networking (SDN) provides a flexible way to control traffic in networks and it is seen a rapid increase among network operators in adoption of SDN. However, due to some policy and economic issues, the coexistence of SDN-enabled devices and legacy devices will continue for a long time. This hybrid scenery comes with many challenges that do not exist in pure SDN. How to find an efficient and suitable routing policy in a hybrid SDN is essential for promoting the development of SDN. In this paper, we propose a near-optimal traffic control method for QoS optimization in a hybrid SDN. First, an SDN migration sequence is explored to maximize controllable traffic to improve the effects of optimization. Then, a Deep Reinforcement Learning (DRL) algorithm is used to address the multi-splittable routing problem in the hybrid SDN. The flow split ratio strategy is implemented by setting the OpenFlow group bucket constraints. Finally, we evaluate the proposed method with open-source traffic datasets. The simulation results show that the method of this paper can achieve a significant improvement in optimizing network QoS performance such as delay, jitter, and link utilization."}, "journals/corr/abs-2110-07964": {"title": "Federated Route Leak Detection in Inter-domain Routing with Privacy Guarantee.", "url": "https://arxiv.org/abs/2110.07964", "year": "2021", "author": {"Man Zeng": "289/2874", "Dandan Li": "16/3614", "Pei Zhang 0003": "78/5323-3", "Kun Xie 0003": "98/476-3", "Xiaohong Huang": "67/4573"}, "abstract": "\n      Abstract:  In the inter-domain network, a route leak occurs when a routing announcement\nis propagated outside of its intended scope, which is a violation of the agreed\nrouting policy. The route leaks can disrupt the internet traffic and cause\nlarge outages. The accurately detection of route leaks requires the share of AS\nbusiness relationship information of ASes. However, the business relationship\ninformation between ASes is confidential due to economic issues. Thus, ASes are\nusually unwilling to revealing this information to the other ASes, especially\ntheir competitors. Recent advancements in federated learning make it possible\nto share data while maintaining privacy. Motivated by this, in this paper we\nstudy the route leak problem by considering the privacy of business\nrelationships between ASes, and propose a method for route leak detection with\nprivacy guarantee by using blockchain-based federated learning framework, in\nwhich ASes can train a global detection model without revealing their business\nrelationships directly. Moreover, the proposed method provides a\nself-validation scheme by labeling AS triples with local routing policies,\nwhich mitigates route leaks' lack of ground truth. We evaluate the proposed\nmethod under a variety of datasets including unbalanced and balanced datasets.\nThe different deployment strategies of the proposed method under different\ntopologies are also examined. The results show that the proposed method has a\nbetter performance in detecting route leaks than a single AS detection\nregardless of whether using balanced or unbalanced datasets. In the analysis of\nthe deployment, the results show that ASes with more peers have more possible\nroute leaks and can contribute more on the detection of route leaks with the\nproposed method.\n\n    "}, "journals/access/ZhangXKHWS19": {"title": "A Practical Traffic Control Scheme With Load Balancing Based on PCE Architecture.", "url": "https://doi.org/10.1109/ACCESS.2019.2902610", "year": "2019", "author": {"Pei Zhang 0003": "78/5323-3", "Kun Xie 0003": "98/476-3", "Caixia Kou": "237/7859", "Xiaohong Huang": "67/4573", "Aijun Wang": "90/8840", "Qiong Sun": "40/6866"}, "abstract": " Abstract:The path computation element (PCE) is used for the path computation for traffic engineering systems such as multi-protocol label switching (MPLS) and Generalized MPLS networks. It offers a good architecture for the centralized traffic routing and control. The classic routing policy aims to select one “best” path for the traffic, which may cause network congestion in the best link. How to adjust traffic to alleviate or avoid congestion is an important issue for operating networks. In this paper, according to the topology and the traffic model of China Telecom's network, we propose a practical traffic control scheme with load balancing based on the PCE architecture. The objective of the traffic control scheme is twofold. First, an adaptive end-to-end path selection algorithm is proposed to select high-quality main and backup paths with the consideration of cost and path utilization. Second, a global routing optimization algorithm is proposed to adjust the path for the traffic, which considers the congestion feedback, the adjustment cost, and the expectation of load balance. The results show that our proposed scheme is able to efficiently alleviate or avoid congestion problem and achieve good performance in terms of the balance of link utilization and minimum computation time."}, "journals/access/ZhangGHZX19": {"title": "Bandwidth Allocation With Utility Maximization in the Hybrid Segment Routing Network.", "url": "https://doi.org/10.1109/ACCESS.2019.2924672", "year": "2019", "author": {"Pei Zhang 0003": "78/5323-3", "YiRou Gang": "244/8508", "Xiaohong Huang": "67/4573", "Sheng Zeng": "40/1797", "Kun Xie 0003": "98/476-3"}, "abstract": " Abstract:Segment routing (SR) is a new network paradigm to optimize network performance. Through leveraging source routing, SR is able to achieve more fine-grained control of data flow in the SR domain. However, it is difficult to introduce large-scale full SR network into existing traditional network due to the economic constraints and immature operation technology. Thus, incrementally deploying SR nodes into an existing network is preferred, which forms the hybrid IP/SR scenario. In the hybrid network, with SR enabled devices, the routing path of flow can be dynamically adjusted. Network utility is an important factor to reflect the user's satisfaction with the allocated bandwidth. In this paper, we propose a bandwidth allocation algorithm to maximize network utility in hybrid IP/SR network and thus improve customer's satisfaction. The simulation results show that the bandwidth allocation algorithm proposed is able to improve the utility of network significantly, and the utility of network will increase with the number of SR nodes deployed in the network."}, "journals/access/XieHHM18": {"title": "Distributed Power Saving for Large-Scale Software-Defined Data Center Networks.", "url": "https://doi.org/10.1109/ACCESS.2018.2791630", "year": "2018", "author": {"Kun Xie 0003": "98/476-3", "Xiaohong Huang": "67/4573", "Shuai Hao 0001": "73/5618-1", "Maode Ma": "74/1079"}, "abstract": " Abstract:Energy efficiency in data center networks (DCNs) is critical to the operations of modern large-scale data centers. One effective way is to make the size of DCNs elastic along with flow demands by centralized routing and scheduling, i.e., turning off idle network components to reduce the power consumption. As such, software-defined networking (SDN) is widely used for achieving such elasticity conveniently. Meanwhile, the scale and structure of modern DCNs get much larger and more complex. Central control and global computing become impractical due to the heavy time and space complexity. Therefore, distributed power control is necessary for large-scale SDN-DCNs, and yet there are few research achievements in this area. In this paper, we present an extensible energy-efficient mechanism, which: 1) leverages distributed flow routing for both intraand inter-domain elephant flows and 2) extendedly considers distributed energy efficiency for control plane. A local power-saving function is operated within each domain of control plane, and a distributed energy-efficient routing algorithm is computed to optimize the effectiveness for the inter-domain flows. The simulation results demonstrate that this distributed mechanism applies to large-scale DCNs and achieves an effective power saving."}, "journals/fgcs/HuangXLYM18": {"title": "Improving Quality of Experience in multimedia Internet of Things leveraging machine learning on big data.", "url": "https://doi.org/10.1016/j.future.2018.02.046", "year": "2018", "author": {"Xiaohong Huang": "67/4573", "Kun Xie 0003": "98/476-3", "Supeng Leng": "98/4623", "Tingting Yuan": "132/1328", "Maode Ma": "74/1079"}, "abstract": "With rapid evolution of the Internet of Things (IoT) applications on multimedia, there is an urgent need to enhance the satisfaction level of Multimedia IoT (MIoT) network users. An important and unsolved problem is automatic optimization of Quality of Experience (QoE) through collecting/managing/processing various data from MIoT network. In this paper, we propose an MIoT QoE optimization mechanism leveraging data fusion technology, called QoE optimization via Data Fusion (QoEDF). QoEDF consists of two steps. Firstly, a multimodal data fusion approach is proposed to build a QoE mapping between the uncontrollable user data with the controllable network-related system data. Secondly, an automatic QoE optimization model is built taking fused results, which is different from the traditional way. QoEDF is able to adjust network-related system data automatically so as to achieve optimized user satisfaction. Simulation results show that QoEDF will lead to significant improvements in QoE level as well as be adaptable to dynamic network changes."}, "journals/access/XieHHMZH16": {"title": "E", "url": "https://doi.org/10.1109/ACCESS.2016.2617871", "year": "2016", "author": {"Kun Xie 0003": "98/476-3", "Xiaohong Huang": "67/4573", "Shuai Hao 0001": "73/5618-1", "Maode Ma": "74/1079", "Pei Zhang 0003": "78/5323-3", "Dingyuan Hu": "189/9882"}, "abstract": " Abstract:Energy consumed by network constitutes a significant portion of the total power budget in modern data centers. Thus, it is critical to understand the energy consumption and improve the power efficiency of data center networks (DCNs). In doing so, one straightforward and effective way is to make the size of DCNs elastic along with traffic demands, i.e., turning off unnecessary network components to reduce the energy consumption. Today, software defined networking (SDN), as one of the most promising solutions for data center management, provides a paradigm to elastically control the resources of DCNs. However, to the best of our knowledge, the features of SDN have not been fully leveraged to improve the power saving, especially for large-scale multi-controller DCNs. To address this problem, we propose E\n3\nMC, a mechanism to improve DCN's energy efficiency via the elastic multi-controller SDN. In E\n3\nMC, the energy optimizations for both forwarding and control plane are considered by utilizing SDN's fine-grained routing and dynamic control mapping. In particular, the flow network theory and the bin-packing heuristic are used to deal with the forwarding plane and control plane, respectively. Our simulation results show that E\n3\nMC can achieve more efficient power management, especially in highly structured topologies such as Fat-Tree and BCube, by saving up to 50% of network energy, at an acceptable level of computation cost."}}}