{"id": "03/4227", "name": "Lanlan Rui", "Article": {"conf/icait/HeYZGR22": {"title": "Network Traffic Prediction Method Based on Multi-Channel Spatial-Temporal Graph Convolutional Networks.", "url": "https://doi.org/10.1109/ICAIT56197.2022.9862813", "year": "2022", "author": {"Yechen He": "320/2372", "Yang Yang 0006": "48/450-6", "Binnan Zhao": "328/4281", "Zhipeng Gao": "25/2165", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:Recent years, the use of network traffic is increasing year by year, so network traffic forecasting has ushered in new challenges. Network traffic forecasting enables network operators to adjust usage demands in real-time, thereby rationally allocating network resources. Based on the characteristics of high nonlinearity and dynamic spatial-temporal correlation of network traffic data, a graph neural network and temporal extracting modules need to be used to extract temporal and spatial features separately. Existing works usually have some common problems: (1) the use of single-channel input data makes the data feature extraction relatively single. (2) construct graphs only through spatial relationships, lacking consideration of non-spatial relationships. Therefore, we propose a new graph convolutional neural network approach: Multi-Channel Spatial-Temporal Graph Convolutional Networks. Specifically, we do time slicing in the data pre-processing stage, to slice the data with different time dimensions to construct the adjacency matrix. To construct the graph from different angles, functional adjacency matrix and temporal adjacency matrix are introduced. The model demonstrates good performance on the real-world network traffic dataset Telecom Italia."}, "conf/services/RuiCWGQW22": {"title": "Multiservice Reliability Evaluation Algorithm Considering Network Congestion and Regional Failure Based on Petri Net.", "url": "https://doi.org/10.1109/SERVICES55459.2022.00042", "year": "2022", "author": {"Lanlan Rui": "03/4227", "Xushan Chen": "162/6745", "Xiaomei Wang": "32/6877", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:[J1C2 Presentation Abstract at IEEE SERVICES 2022 for IEEE Transactions on Services Computing DOI 10.1109/TSC.2019.2955486]"}, "conf/wcnc/GaoDYRZ22": {"title": "FedSeC: a Robust Differential Private Federated Learning Framework in Heterogeneous Networks.", "url": "https://doi.org/10.1109/WCNC51071.2022.9771929", "year": "2022", "author": {"Zhipeng Gao": "25/2165", "Yingwen Duan": "320/8413", "Yang Yang 0006": "48/450-6", "Lanlan Rui": "03/4227", "Chen Zhao": "81/3"}, "abstract": " Abstract:Federated learning (FL) is considered to be a promising paradigm to solve data privacy disclosure in large-scale machine learning. To further enhance the privacy protection of federated learning, prior works incorporate the differentially private data perturbation into the federated system. But it is not feasible given the impairment of the model from noise, as adding Gaussian noise to achieve differential privacy (DP) deteriorates the accuracy of the model. In particular, the assumption that the sophisticated system is homogeneous is not realistic for real scenarios. Heterogeneous networks exacerbate noise disruptions. In this paper, we present FedSeC, a novel differential private federated learning (DP-FL) framework which operates with robust convergence and high-accuracy while achieving adequate privacy protection. FedSeC improves upon naive combinations of federated learning and differential privacy approaches with an updates-based optimization of relative-staleness and semi-synchronous approach for fast convergence in heterogeneous networks. Moreover, we propose a valid client selection scheme to trade-off fair resource allocation and discriminatory incentives. Through extensive experimental validation of our method in three different heterogeneities, we show that FedSeC outperforms the previous state-of-the-art method."}, "conf/bmsb/SongRCQ21": {"title": "A Computational Offloading Method Based on Resource Joint Optimization.", "url": "https://doi.org/10.1109/BMSB53066.2021.9547192", "year": "2021", "author": {"Dai Song": "303/1730", "Lanlan Rui": "03/4227", "Shiyou Chen": "233/0862", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the advent of 5G era and the continuous development of mobile Internet, various mobile terminal tasks are gradually diversified and intensive. Ordinary mobile devices can not meet the large-scale data processing scenarios and need more computing and storage resources to deal with complex tasks. Cloud data centre has strong computing resources and storage capacity. The mobile edge network can be formed by migrating the computing resources of cloud data centre to the network edge side. By comprehensively considering the parameters of task type, task size, communication environment, server resources and server power, the resources are jointly allocated and the reasonable offloading decision is made. The computing tasks are offloaded to the edge server, so as to achieve the effect of saving energy, reducing delay and improving efficiency. This paper mainly uses clustering algorithm and KM algorithm to develop the offloading algorithm. Firstly, the terminal tasks are classified by clustering algorithm and the appropriate terminal tasks are selected to match with the edge server. Secondly, the KM algorithm is used for bipartite graph matching to find the appropriate edge server for each terminal task to offload, then the overall offloading cost is minimized. Finally, the experimental results verify the effectiveness of the proposed method in terms of offloading cost and iteration cost."}, "conf/bmsb/YanRCQ21": {"title": "Data Collection Scheme Based on Route Planning Algorithm with Maximization of Resource Utility.", "url": "https://doi.org/10.1109/BMSB53066.2021.9547098", "year": "2021", "author": {"Zhibo Yan": "258/5957", "Lanlan Rui": "03/4227", "Shiyou Chen": "233/0862", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:In the vehicle edge network environment, it is usually necessary for vechicles to travel to specific locations to collect certain information. For example, when a large-scale natural disaster occurs, the disaster information located at each disaster site is essential for disaster reduction and relief, and it can also help rescuing troops quickly and accurately collect and analyze disaster information. In this process, the vechicle network needs to perform flexible allocation and scheduling of task locations for each vehicle based on multiple factors such as terminal capabilities, link quality, and geographic location. As a result, to maximize the usability of resources in terms of data collecting procedure, a smart route planning algorithm that considers multiple factors is established for each vechicle, in which linear regression method is proposed for the estimation of the traffic condition. Upon applying the techniques, the data collecting route with the best use of resources and highest benefit gain can be generated."}, "conf/hpcc/LiWCRYG21": {"title": "Distributed pseudonym mechanism based on Consortium Blockchain.", "url": "https://doi.org/10.1109/HPCC-DSS-SmartCity-DependSys53884.2021.00084", "year": "2021", "author": {"Baohui Li": "145/9884", "Miaomiao Wang": "67/3317", "Shiyou Chen": "233/0862", "Lanlan Rui": "03/4227", "Yang Yang 0006": "48/450-6", "Zhipeng Gao": "25/2165"}, "abstract": " Abstract:Crowd sensing is a way to obtain multiple sensing data onto users or mobile devices and is widely used in industrial Internet, smart city, smart medical, etc. However, when users upload sensing data involving sensitive information such as a user identity and location, there will be risks of data privacy leakage and user tracking. For the problem of this scenario, we propose a blockchain-based pseudonym generation mechanism, which uses pseudonyms to realize user anonymity and user identity authentication. The average speed of pseudonym generation and authentication in the simulation experiment is about 0.1s, the experimental results verify the availability and effectiveness of the distributed pseudonym mechanism."}, "conf/icc/LinGXWM0RGW21": {"title": "A Model Training Mechanism based on Onchain and Offchain Collaboration for Edge Computing.", "url": "https://doi.org/10.1109/ICC42927.2021.9500604", "year": "2021", "author": {"Yijing Lin": "275/1523", "Zhipeng Gao": "25/2165", "Kaile Xiao": "194/4868", "Qian Wang": "75/5723", "Zijia Mo": "240/6361", "Yang Yang 0006": "48/450-6", "Lanlan Rui": "03/4227", "Haisheng Guo": "299/0189", "Dezheng Wang": "198/7365"}, "abstract": " Abstract:Blockchain as a new decentralized chain structure can be used in edge computing to solve the security issue caused by edge nodes in model training. However, large amounts of data exchanges in the process of model training of edge computing reduce the performance of blockchain, and meanwhile, the block needed to be saved in the edge node challenges storage capacity of the edge node. Therefore, in the paper we propose a safe and efficient model training mechanism based on onchain and offchain collaboration. In the mechanism, edge nodes train models locally, store the model parameters in offchain and only return identifiers for model aggregation. By the method, the storage pressure of the edge node is reduced and the efficiency of executing consensus algorithms are increased. Moreover, in the mechanism we design a reputation evaluation model based on confidence factors to avoid the uploading of random and wrong data of edge nodes. Evaluation results show that our schemes can reduce the average delay and resources consumption, increase transaction throughput and maintain security compared with a state-of-the-art scheme."}, "conf/im/DaiRC021": {"title": "A Distributed Congestion Control Routing Protocol Based on Traffic Classification in LEO Satellite Networks.", "url": "https://ieeexplore.ieee.org/document/9464043", "year": "2021", "author": {"Shiyue Dai": "296/0874", "Lanlan Rui": "03/4227", "Shiyou Chen": "233/0862", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the explosive growth of communication traffic and the non-uniform distribution of users in low earth orbit (LEO) satellite networks, the problem of link congestion becomes more serious, which result in the emergence of congestion control protocols. Load balance, congestion prediction and faster calculation are the basic requirements of the congestion control routing protocol, and lower overhead and higher users' satisfaction are the further goals. We propose a distributed congestion control routing protocol based on traffic classification in LEO satellite networks (DCCR) which uses a low-overhead distributed scheme to compute the routing and uses a traffic classification strategy to optimize the performance of the distributed scheme in congestion control. We divide the traffic into three types and design routing strategies for each type of traffic according to the occupancy level of the satellite, to improve users' satisfaction while balance the load. In the part of the simulation experiment, we compared the performance of DCCR with some existing congestion control algorithms and verified the advantages of the proposed protocol in reducing delay and balancing load."}, "conf/trustcom/GaoZLR0ZM21": {"title": "Select-Storage: A New Oracle Design Pattern on Blockchain.", "url": "https://doi.org/10.1109/TrustCom53373.2021.00159", "year": "2021", "author": {"Zhipeng Gao": "25/2165", "Zijian Zhuang": "315/6081", "Yijing Lin": "275/1523", "Lanlan Rui": "03/4227", "Yang Yang 0006": "48/450-6", "Chen Zhao": "81/3", "Zijia Mo": "240/6361"}, "abstract": ""}, "conf/noms/ZhangHRHWQ20": {"title": "A Service Migration Method Based on Dynamic Awareness in Mobile Edge Computing.", "url": "https://doi.org/10.1109/NOMS47738.2020.9110389", "year": "2020", "author": {"Menglei Zhang": "156/2390", "Haoqiu Huang": "168/7949", "Lanlan Rui": "03/4227", "Guo Hui": "56/842", "Ying Wang 0002": "94/3104-2", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Cloud computing technologies can not satisfy the requirements of applications on the mobile terminals because of their disadvantages in delay, link load and energy. So Mobile Edge Computing (MEC) is proposed as a kind of novel computing technology. As an important research direction of MEC, service migration methods still have limitations that they cannot learn migration paths and be adaptive in dynamic situation and user movement. In this paper, we propose a novel service migration policy method based on reinforcement learning. We firstly investigate user movement, four different edge network situations and traditional migration policies. Then we formulate the system requirements by Satisfiability Modulo Theory (SMT) logic to acquire the migration policy space. We further propose a dynamic-awareness deep Q-learning algorithm to select paths from the policy space iteratively and conduct dynamic awareness to adjust learning rate adaptively. Meanwhile, the optimal convergence of our algorithm is proved theoretically. Finally, the experimental results highlight the effectiveness as migration successful rate, service interruption time and load balance of our method compared to the other solutions."}, "conf/apnoms/HanZLYRW19": {"title": "A QoS-based Opportunistic Routing Mechanism in Social Internet of Vehicle.", "url": "https://doi.org/10.23919/APNOMS.2019.8892928", "year": "2019", "author": {"Yi Han": "27/4390", "Yao Zhang": "57/3892", "Huilin Liu": "89/5904", "Hecun Yuan": "252/8591", "Lanlan Rui": "03/4227", "Ying Wang 0002": "94/3104-2"}, "abstract": " Abstract:With the development of Internet of Vehicles, vehicles establish the social relationships with other vehicles and road side units for exchanging information, which is called Social Internet of Vehicles (SIoV). Making use of the relationships, we propose a QoS-based opportunistic routing mechanism to guarantee the QoS requirement and route reliable of information transmission in this paper. First, we establish a mathematical model for QoS evaluation considering the transmission correct ratio and delay, which can accurately estimate the QoS of road section. Then, we propose the QoS-based opportunistic routing mechanism, which aims to form a reliable and robust route path. Finally, the obtained simulation results validate the accuracy and correctness of our approach."}, "conf/apnoms/LiWZWLR19": {"title": "An Improved Genetic Algorithm for the Scheduling of Virtual Network Functions.", "url": "https://doi.org/10.23919/APNOMS.2019.8892907", "year": "2019", "author": {"Qi Li": "181/2688", "Xing Wang": "02/3674", "Tao Zhao": "62/6776", "Ying Wang 0002": "94/3104-2", "Zifan Li": "125/3616", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:The scheduling of Virtual Network Functions (VN-Fs) is an important problem for Network Function Virtualization (NFV) resource allocation. In this paper, we investigate how to manage the Network Functions (NFs) efficiently to enhance the utilization of network resources. In the system model, we take into account the VNF transmission delay and processing delay at the same time. Our objective is to minimize the total end-to-end delay for all network services. To reduce the complexity of this issue, we propose a novel algorithm based on genetic algorithms by improving the method of crossover and mutation. The simulation results show that the proposed algorithm can reduce the total end-to-end delay at most 16.74%."}, "conf/apnoms/YuanLLHRW19": {"title": "The Design and Simulation of Service Recovery Strategy Based on Recovery Node in Clustering Network.", "url": "https://doi.org/10.23919/APNOMS.2019.8893100", "year": "2019", "author": {"Hecun Yuan": "252/8591", "Biyao Li": "222/7726", "Huilin Liu": "89/5904", "Yi Han": "27/4390", "Lanlan Rui": "03/4227", "Ying Wang 0002": "94/3104-2"}, "abstract": " Abstract:In order to ensure users enjoying the services continuously and steadily, we need an efficient service recovery strategy to quickly recover the failed links and reconstruct the device set. In this paper, we introduce a service recovery strategy based on recovery node which can save and maintain service data flexibly. First, we give the definition of recovery node and the selection mechanism for it. Then we describe our recovery strategy in detail. At last, we make a simulation by NS-3. The effectiveness of the proposed methods is demonstrated by simulation results."}, "conf/globecom/GaoXWH0R19": {"title": "Multi-Source Feedback Based Light-Weight Trust Mechanism for Edge Computing.", "url": "https://doi.org/10.1109/GLOBECOM38437.2019.9014281", "year": "2019", "author": {"Zhipeng Gao": "25/2165", "Chenxi Xia": "223/3542", "Qian Wang": "75/5723", "Junmeng Huang": "252/1018", "Yang Yang 0006": "48/450-6", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:To alleviate the security concerns caused by the openness of the edge computing network and meet the time-sensitive requirements of the edge devices' collaborative tasks, an effective trust evaluation mechanism is needed urgently to resist multi-attacks from various malicious devices. In this work, a light- weight trust mechanism based on multi-source feedback is proposed for edge computing. First, we design a light-weight data-processing algorithm executed in edge brokers and edge devices, which could reduce the data transmission pressure in communication networks effectively and work efficiently in large-scale edge networks. Then, a comprehensive evaluation method is designed for edge brokers based on the Dempster Shafer theory and multi-source feedback mechanism, which makes our mechanism more reliable and pluralistic when resisting various multi-attacks at the same time. At last, we originally develop a neural network in the centralized cloud to update edge brokers' hyper-parameters and weights of the key factors by auditing trust evaluation results uploaded from the edge network according to deep Q-learning algorithm, which are usually weighted manually and subjectively in traditional schemes. The experimental results show the proposed trust mechanism outperforms existing methods in reliability and calculation efficiency when resisting various malicious attacks."}, "conf/icnp/GaoXJWH0R19": {"title": "A Light-weight Trust Mechanism for Cloud-Edge Collaboration Framework.", "url": "https://doi.org/10.1109/ICNP.2019.8888037", "year": "2019", "author": {"Zhipeng Gao": "25/2165", "Chenxi Xia": "223/3542", "Zhuojun Jin": "252/1063", "Qian Wang 0015": "75/5723-15", "Junmeng Huang": "252/1018", "Yang Yang 0006": "48/450-6", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:With the development of the edge computing and cloud computing technology, the cloud-edge collaboration framework is proposed as a new effective computing architecture and applied in many fields. However, due to the openness of the edge networks, the security of cloud-edge framework is an unavoidable problem and most recent trust mechanism could not resist mixed malicious attacks at the same time. In this work, a light-weight and reliable trust mechanism based on the improved LightGBM algorithm is originally proposed to evaluate the credibility of edge devices. First, we design a light-weight trust mechanism for edge devices to process raw interaction data and extract trust features, which reduces the amount of data transmission and the pressure on the communication networks. In addition, an evaluation algorithm based on the entropy weight method (EWM) and punishment factors is designed for edge brokers to distinguish the malicious devices from the normal ones, which performs great against mixed malicious attacks. At last, we propose an improved LightGBM algorithm developed in the centralized cloud to learn other researchers' evaluation methods and check the evaluation uploaded from edge brokers, which could make the punishment factors of edge networks weighted adaptively with the change of edge networks. The experimental results show the proposed trust mechanism outperforms existing methods in the accuracy and discriminating speed under mixed malicious attacks."}, "conf/iwcmc/LiRQGY19": {"title": "Design of a service caching and task offloading mechanism in smart grid edge network.", "url": "https://doi.org/10.1109/IWCMC.2019.8766672", "year": "2019", "author": {"Mengyu Li": "47/1793", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Shaoyong Guo": "150/6843", "Xiuzhi Yu": "245/4869"}, "abstract": " Abstract:Smart Grid Communication System (SGCS) needs to meet the QoS requirements of various applications in terms of latency, bandwidth and reliability. However, cloud computing owns significant latency and cannot meet the need of real-time applications, edge computing is gradually applied in SGCS. In this paper, LBPC (edge-based load-balancing algorithm based on popularity and centrality) is proposed based on edge network and achieves the deployment of computing units at the edge nodes. In the aspect of service caching, LBPC measures the popularity of requests and the centrality of nodes, and it also takes the latency needs and the cache cost into consideration. In the aspect of task offloading, LBPC calculates the cost at different neighbor nodes and chooses the best one to finish the calculation when the current node is in high-load condition. Compared with some related works, experimental results show that LBPC can effectively reduce communication latency and balance the network load."}, "conf/iwcmc/LiRQH19": {"title": "Content Caching Strategy for Edge and Cloud Cooperation Computing.", "url": "https://doi.org/10.1109/IWCMC.2019.8766451", "year": "2019", "author": {"Biyao Li": "222/7726", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Haoqiu Huang": "168/7949"}, "abstract": " Abstract:With the wide application of the Internet of Things, the number of network edge devices is increasing rapidly, resulting in huge network traffic that brings huge challenges to the current network. Aiming at the problem of heavy network load, researchers proposed some caching strategies. However, current strategies have some limitations. These existing caching strategies are usually global within the whole network. Most of them are to reduce the network delay and allow users to obtain content more quickly and easily. This paper proposes a network caching strategy based on edge and cloud coordination (ECC).The strategy divides the caching network into two parts (core and edge) to discuss different caching strategies. By choosing reasonable caching strategies in the core network and the edge network to implement different caching goals for different areas. Besides, the paper sets up PN nodes for coordinating and optimizing the cache resources between the edge and the core. Experimental results show that ECC has significant advantages in Server Load Reduction Ratio, Average Hop Reduction Ratio and Cache Redundancy compared with existing methods."}, "conf/iwcmc/TanR0QGY19": {"title": "Differentiated Service Mechanism According to Vehicle Environment in Vehicular Edge Network.", "url": "https://doi.org/10.1109/IWCMC.2019.8766603", "year": "2019", "author": {"Zuoyan Tan": "245/4855", "Lanlan Rui": "03/4227", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Shaoyong Guo": "150/6843", "Xiuzhi Yu": "245/4869"}, "abstract": " Abstract:With the rapid development of communication technologies such as 5G, vehicular information and applications are exploding. Mobile edge computing (MEC) as a new technology can transfer the information more quickly and accurately. Providing differentiated services for the information can affect the performance of the applications. In this study, based on 802.11p EDCA protocol, we propose a new differentiated service scheme called DD-EDCA (Differentiating Density Enhanced Distributed Channel Access). Firstly, we use MEC Server to estimate the road density. Secondly, different solutions have been designed according to different vehicle density environment requirements. For example, the displacement trend is considered at a low density, and the multi-hop broadcast information is pre-processed at a high density. And the schemes for dynamically adjusting EDCA parameters are designed. Simulation results show that our method reduces latency and packet loss rate, and improves the throughput."}, "conf/iwcmc/ZhuRQH19": {"title": "Double-layer Satellite Communication Network Routing Algorithm Based on priority and failure probability.", "url": "https://doi.org/10.1109/IWCMC.2019.8766688", "year": "2019", "author": {"Yu Zhu": "38/5267", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Haoqiu Huang": "168/7949"}, "abstract": " Abstract:Due to the limited network resources and onboard processing capacity of the LEO/MEO double-layer satellite communication network, calculating the routing table in advance leads to heavy communication load, and rerouting results in large delay loss. Hence, this paper proposes a Priority- and-Failure-Probability-based Routing (PFPR) algorithm for LEO/MEO double-layer satellite communication networks. We combine virtual node and virtual topology strategies to eliminate satellite mobility, considers service classification and link failure probability to better fulfill the QoS requirements of different services. In addition, we introduce network virtualization technology. By using the method of common mapping of disjoint primary and backup links, it solves the delay problem of rerouting. The simulation results show that the PFPR algorithm proposed can reduce packet dropout rate, and service delay, and improve service throughput for different services, especially delay-sensitive services."}, "conf/noms/WangRGQ18": {"title": "Load-aware potential-based routing for the edge communication of smart grid with content-centric network.", "url": "https://doi.org/10.1109/NOMS.2018.8406187", "year": "2018", "author": {"Xiaotong Wang": "11/649", "Lanlan Rui": "03/4227", "Hui Guo": "70/2221", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the development of Internet of Things, there are more and more devices and applications at the edge of the smart grid. To enhance the quality of service, further processing of the smart grid to achieve load balancing is regarded as a critical step. The most interesting element in smart grid communications is data itself regardless of the data source. The emergency of Content-Centric network (CCN) just meets the demands and addresses the problems. First we model the smart grid with Content-Centric Network, and concentrate on the edge communication. Then we propose a load-aware potential-based routing (LAPBR) algorithm and evaluate its performances. The simulations results demonstrate the stability and robustness of LAPBR."}, "conf/noms/ZhangRGQl18": {"title": "A QoS guarantee mechanism based on multi-priority bionic competition model in vehicular edge etwork.", "url": "https://doi.org/10.1109/NOMS.2018.8406182", "year": "2018", "author": {"Yao Zhang": "57/3892", "Lanlan Rui": "03/4227", "Hui Guo": "70/2221", "Xuesong Qiu 0001": "13/342", "Linwei": "223/7102"}, "abstract": " Abstract:With the development of the Internet of Things, more and more devices can access the network through wireless access. And the wireless access of vehicles, which constitutes an edge network, can provide real-time road information and significant traffic state. Thus, it has gradually got the public attention. In order to offer the better quality of service (QoS) in the vehicular network, we propose a multi-priority bionic competition mechanism to implement service differentiation and resource allocation. Firstly, we deduce a context metric (CM) through fuzzy inference, which relates the urgency degree of a vehicle to its environment. Vehicle traffic is re-prioritized into four access categories (ACs) combined with the CM and transmission data types. Then, we propose the bionic competition model based on 802.11e EDCA protocol. This model considers the competition in the same level ACs and the competition among different level ACs, allocates different transmission rate and bandwidth for different ACs, which greatly improve the network throughput and bandwidth utilization. Finally, the simulation results show that our method improves the throughput, reduces the mean delay and packet loss rate."}, "conf/noms/ZhangRLQGL18": {"title": "Multi-constrained maximally disjoint routing mechanism.", "url": "https://doi.org/10.1109/NOMS.2018.8406148", "year": "2018", "author": {"Xin Zhang": "76/1584", "Lanlan Rui": "03/4227", "Jiawen Li": "78/11207", "Xuesong Qiu 0001": "13/342", "Shaoyong Guo": "150/6843", "Wei Lin": "99/2649"}, "abstract": " Abstract:In the smart grid, to improve the quality of service and to reduce the risk of network much further is the main research direction. How to choose a highly reliable, stable and low-risk routing is the most critical part of the smart grid. The factors considered by most existing algorithms do not sufficiently consider redundancy, so that optimization is not sufficient. Therefore, based on service path pressure and the special factors of the power communication network, this paper proposes a kind of multi-constrained maximally disjoint routing mechanism and states the superiority of this algorithm via experiment which is simulated on the power communication network of a certain province."}, "conf/noms/ZhenRQL018": {"title": "A backup algorithm for power communication network based on fault cascade in the network virtualization environment.", "url": "https://doi.org/10.1109/NOMS.2018.8406198", "year": "2018", "author": {"Xia Zhen": "222/7743", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Biyao Li": "222/7726", "Peng Yu 0001": "50/2599-1"}, "abstract": " Abstract:This paper studies the multi-layer structure of coupled power network based on the problem of fault cascade and unreasonable network design in the network virtualization environment (NV). Based on the complex network theory, we propose a network optimization algorithm: PNGA (Primary Nodes Group Algorithm). The objective of PNGA is promoting the robustness of the entire network. In the simulation experiment, this paper analyzes the network modeling and topological characteristics of a three-tier power grid in NV. We use the degree sorting algorithm as the control group which is widely used in power grid. Under different attack strategies, we investigate the performance of different algorithms and the state of fault generation. The results of the simulation we performed in this paper have shown that PNGA is superior to the rest of the algorithm in suppressing faults."}, "conf/noms/ZhouRQXL18": {"title": "Evaluation of the node importance in power grid communication network and analysis of node risk.", "url": "https://doi.org/10.1109/NOMS.2018.8406214", "year": "2018", "author": {"Meng Zhou": "28/1374", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Zhen Xia": "79/4134", "Biyao Li": "222/7726"}, "abstract": " Abstract:To make an accurate evaluation of node importance in the power grid communication network, we propose an algorithm based on the communication topology layer and the power grid layer to evaluate the importance of the nodes. On the basis of the node contraction algorithm [7], the cut point is assigned a higher weight to reflect the difference between the key nodes and the non-key nodes. Simultaneously, combined with the characteristics of the power grid, the power factor, power service and node failure probability are added to evaluate node importance of power grid communication network objectively. Compared with the node contraction algorithm, the results show that the algorithm in this paper can better distinguish the importance of nodes, and has great reference value for the evaluation of node importance in the power grid communication network. Finally, the algorithm is applied to node risk analysis. By optimizing power service routing, average node risk of entire network can reduce significantly. Therefore, the reliability of network is improved."}, "conf/apnoms/WangRQLX17": {"title": "Regional fault tolerant recovery mechanism for multilayer networks.", "url": "https://doi.org/10.1109/APNOMS.2017.8094177", "year": "2017", "author": {"Xiaomei Wang": "32/6877", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Ying Li": "22/1805", "Si-Ya Xu": "189/8212"}, "abstract": " Abstract:With the multi-rate transmission and variable bandwidth switching technology, the Elastic Optical Networks (EONs) have many advantages to satisfy current network traffic. Compared with the traditional optical network, the EONs improve the spectrum utilization and increase the network capacity. So the EONs gradually become the key point of next generation optical transport networks. Obviously, the restoration mechanism in EONs has become thefocus of network operators' attention. This paper presents a dynamic restoration scheme based on software defined network (SDN) framework and an improved regional fault-tolerant routing and spectrum allocation algorithm (RSA). Using the SDN framework, we can greatly reduce recovery time and avoid configuration contentions. On this basis, we introduce the improved regional fault-tolerant RSA algorithm. The proposed RSA algorithm can decrease restoration blocking probability and relief effects caused by regional failures. The performance of the proposed dynamic restoration is evaluated in terms of restoration blocking probability and recovery time under different network loads, and compared against other schemes."}, "conf/cits/KongRHW17": {"title": "Link congestion and lifetime based in-network caching scheme in Information Centric Networking.", "url": "https://doi.org/10.1109/CITS.2017.8035289", "year": "2017", "author": {"Jiahui Kong": "223/3916", "Lanlan Rui": "03/4227", "Haoqiu Huang": "168/7949", "Xiaomei Wang": "32/6877"}, "abstract": " Abstract:Ubiquitous in-network caching is one of the important aspects of the Information-Centric Networking (ICN), which has been a hot topic of ICN research. Many works have tried to propose better caching schemes to solve the drawbacks of the default en-route scheme, but most of them are insufficient to improve performance of entire network for just considering single layer optimization factor. Also considering that the network exists to serve its users, user-centric performance metrics, in particular the download delay, are equally important as the common metrics such as cache hit rate in performance evaluation. And approaches designed with congestion-sensitive download delay in mind can obtain better performance and user experience. In this paper, we propose and evaluate a novel Link Congestion and lifetime Based In-Networking Caching Schemes (LCLCS), which takes fully account of link congestion, Betweenness centrality and content popularity, aiming to observably optimize network delay and maintain acceptable cache rate. Through simulation, we can prove that network latency and hop reduction rate of our policy are significantly better than existing policies at least 51.5%, while the cache hit ratio is relatively improved by at least 19.1% under network congestion."}, "conf/im/GuoRSHQ17": {"title": "A New ICN routing selecting algorithm based on Link Expiration Time of VANET under the highway environment.", "url": "https://doi.org/10.23919/INM.2017.7987349", "year": "2017", "author": {"Hui Guo": "70/2221", "Lanlan Rui": "03/4227", "Ruichang Shi": "189/8247", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Combining VANET with ICN (Information Centric Network), this paper proposes a new FIB (Forwarding Information Base) selecting algorithm-ECRMLET (Efficient Content Routing Model Based on Link Expiration Time). To build stable routings and reduce network traffic, our ECRMLET has the following designs: 1) we modify the structure of PIT (Pending Interest Table) by adding two domains: receive time and tolerance time; 2) we introduce the algorithm of LET (Link Expiration Time) to help with the content routing selection in FIB; 3) ECRMLET also gets the link availability probability to be auxiliary information for our algorithm."}, "conf/apnoms/ShiRHQGZ16": {"title": "A Shapley value-based forwarding strategy in Information-Centric Networking.", "url": "https://doi.org/10.1109/APNOMS.2016.7737266", "year": "2016", "author": {"Ruichang Shi": "189/8247", "Lanlan Rui": "03/4227", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342", "Hui Guo": "70/2221", "Pan Zhang": "29/1005"}, "abstract": " Abstract:Information Centric Networking (ICN) is a new kind of network architecture centered on content data. The ICN improves the efficiency of data transmission by the longest matching routing mechanism based on the content name prefix of the request interest packets, however, the multipath forwarding performance also resulted in the redundancy of the network content. The existing ICN forwarding strategy does not take into account the selection problem of routings when a content hit multiple Faces. This paper proposes a routing forwarding strategy based on Shapley value. We add a forwarding value table, which is used to calculate the number of content routing and the number of face to forwarding. The table stores the request delay of content routing and the busy degree of the next hop nodes. The content routing number and forwarding nodes of the next hop forwarding are decided by the alliance game. Simulations show that our strategy can improve the cache hit ratio, reduce server load and reduce the average request delay compared with full forwarding strategy, it improves the network performance in total."}, "conf/apnoms/ZhangRQS16": {"title": "A new fusion structure model for real-time urban traffic state estimation by multisource traffic data fusion.", "url": "https://doi.org/10.1109/APNOMS.2016.7737227", "year": "2016", "author": {"Pan Zhang": "29/1005", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Ruichang Shi": "189/8247"}, "abstract": " Abstract:In order to meet the requirements of traffic data fusion for real-time urban traffic state estimation, a new kind of fusion structure model is proposed. This fusion model consists of both spatial fusion and temporal fusion. First we use the power average operator as spatial fusion method. Then we propose a temporal correlation based data compression (TCDC) algorithm, based on segment linear regression (SLR) algorithm. Extensive simulation results demonstrate the effectiveness and correctness of TCDC algorithm, as well as TCDC's advantage over SLR on overall performance."}, "conf/ccis/FanSR16": {"title": "A mining algorithm for frequent closed pattern on data stream based on sub-structure compressed in prefix-tree.", "url": "https://doi.org/10.1109/CCIS.2016.7790298", "year": "2016", "author": {"Muhan Fan": "192/1064", "Sujie Shao": "151/6228", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:The knowledge embedded in data stream has the property of decaying with time, so people are more interested in the new data stream. This paper proposes a method for mining the frequent closed patterns in a sliding window to capture information timely and accurately when new data stream arrives. Data stream is divided into several basic windows. All possible frequent closed patterns are mined in each basic window and be stored in Closed Pattern-tree in the form of node compression to save space; As the data in sliding window updates, Closed Pattern-tree can be incrementally updated and the infrequent or unclosed patterns will be deleted from the tree. The experimental results of the simulation show that the method for mining the frequent closed patterns in a sliding window is efficient in time and space."}, "conf/apnoms/ZhangRGQX15": {"title": "Location selection with user behavior analysis for telecom operator's service halls.", "url": "https://doi.org/10.1109/APNOMS.2015.7275419", "year": "2015", "author": {"Jie Zhang": "84/6889", "Lanlan Rui": "03/4227", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342", "Ao Xiong": "119/8978"}, "abstract": " Abstract:In this paper, we propose a planning mechanism based on telecom user behavior to choose locations of telecom operator's service halls. Telecom service hall network consists of service requirements nodes (RNs) and telecom service hall sites (TSs). Telecom service hall location selection problem mainly focuses on choosing locations of TSs from RNs. With analysis of base station data, we formulate a method based on telecom user distribution model to group users and to find RNs. Then, we propose a theoretical model to obtain telecom operator's greatest economic income with constraints of service satisfaction perceived by telecom users. Finally, a mechanism combined with improved genetic algorithm is put forward to solve it. Our results, supported by extensive experiments using MATLAB, confirm the feasibility and flexibility of our proposed planning mechanism."}, "conf/apnoms/CaiRLHQ15": {"title": "Group mobility based clustering algorithm for mobile ad hoc networks.", "url": "https://doi.org/10.1109/APNOMS.2015.7275358", "year": "2015", "author": {"Mengqing Cai": "168/7934", "Lanlan Rui": "03/4227", "Danmei Liu": "168/8016", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Recent research activities have recognized the essentiality of node mobility for the creation of stable, scalable and adaptive clusters with good performance in mobile ad hoc networks (MANETs). In this paper, we propose a distributed clustering algorithm based on the group mobility and a revised group mobility metric which is derived from the instantaneous speed and direction of nodes. Our dynamic, distributed clustering approach use Gauss Markov group mobility model for mobility prediction that enables each node to anticipate its mobility relative to its neighbors. In particular, it is suitable for reflecting group mobility pattern where group partitions and mergence are prevalent behaviors of mobile groups. We also take the residual energy of nodes and the number of neighbor nodes into consideration. The proposed clustering scheme aims to form stable clusters by reducing the clustering iterations even in a highly dynamic environment. Simulation results show that the performance of the proposed framework is superior to two well-known clustering approaches, the MOBIC and DGMA, in terms of average number of clusterhead changes."}, "conf/icaci/0006LGQR15": {"title": "Data clustering-based fault detection in WSNs.", "url": "https://doi.org/10.1109/ICACI.2015.7184725", "year": "2015", "author": {"Yang Yang 0006": "48/450-6", "Qian Liu": "33/85", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:Sensors easily become faulty and unreliable subject to limited battery and insecurity. Data Fault is one of traditional faults in the wireless sensor networks. Data fault mainly uses distributed method through exchanging neighbors' measurements and voting for decision. But the detection accuracy performance is easily influenced by unbalanced fault distribution. Based on this, we propose the k-means clustering-based fault detection algorithm (k-CFD), which uses clustering view to replace tendency values for fault decision, in addition, and adopts ant colony optimization algorithm to promote the results of k-means mechanism. The simulation results demonstrate the efficiency and superiority of k-CFD mechanisms."}, "conf/im/ZhangR15": {"title": "A cooperative file downloading scheme with genetic algorithm.", "url": "https://doi.org/10.1109/INM.2015.7140410", "year": "2015", "author": {"Xing Zhang": "52/5264", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:Existing cooperative file downloading schemes have some blindness on the selection of collaborative nodes. In this paper we present a cooperative file downloading scheme with genetic algorithm to resolve the collaborative nodes selection problem, especially in the case that we cannot have a prior knowledge about the data rate and position of the mobile nodes. A simple and efficient extended on-demand proxy discovery algorithm will be used to find the potential cooperative nodes. Character of the genetic algorithm (GA) makes it suitable for the selection of cooperative nodes. After this, client uses multiple parallel paths for file downloading. The simulation results show that the cooperative file downloading scheme with genetic algorithm can successfully select collaborative nodes with better performance and effectively reduce file download latency."}, "conf/iscc/HuangRZNXZQ15": {"title": "Incentive mechanism for cooperative content discovery in mobile wireless networks: A repeated cooperative game-theoretic approach.", "url": "https://doi.org/10.1109/ISCC.2015.7405600", "year": "2015", "author": {"Haoqiu Huang": "168/7949", "Lanlan Rui": "03/4227", "Weiwei Zheng": "176/0935", "Danmei Niu": "68/10365", "Yinglin Xiong": "156/3708", "Pan Zhang": "29/1005", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:In this paper we introduce a new collaboration paradigm to achieve content discovery with infrastructure fixed on many autonomous geographical regions in mobile wireless networks. In this paradigm, mobile users, physically located in the regions, send a request to the infrastructure and obtain contents using their mobile devices. To achieve the paradigm, we design an incentive mechanism with a repeated cooperative game-theoretic approach. This approach stimulates mobile users that are selfish and often reluctant to consume their energy for providing any information or services to make their own contents available to someone else. Additionally, we discuss game ingredients in our approach, including the assessed value, the battery charge level and the signal strength level. We find all Nash equilibria in our approach and obtain the ratio of temporal discounting. The results via our simulations show that our approach can effectively motivate mobile users to share their contents in terms of the ratio."}, "conf/apnoms/JiangRGQL14": {"title": "Reliability-oriented clustering algorithm for service search in ubiquitous stub environments.", "url": "https://doi.org/10.1109/APNOMS.2014.6996532", "year": "2014", "author": {"Feng Jiang": "75/1693", "Lanlan Rui": "03/4227", "Yaoyong Guo": "156/3649", "Xuesong Qiu 0001": "13/342", "Wei Li": "64/6025"}, "abstract": " Abstract:Service search has been introduced to exploit heterogeneous resources of distributed devices on the purpose of supplying ubiquitous services in ubiquitous stub environments, especially in MANETs. However, due to the characteristics of infrastructure-less, devices' limited resources, and dynamic topology caused by the mobility of devices, service search faces great risk of failure. Usually, clusters are the main way of organizing the devices in MANETs. Therefore, an effective clustering algorithm is necessary to ensure the reliability of service search. A maximized reliability clustering algorithm (MRCA) is proposed. We present predicted battery supporting time, CPU computing power, connecting degree and predicted velocity of devices, select the best devices as cluster heads. We combine the four factors together using FAHP algorithm. The simulations show that the MRCA can prolong cluster headers and members' valid time, reduce the consumed energy in the cluster's life cycle. This proves that MRCA can improve the reliability of cluster."}, "conf/apnoms/MaoRGQ14": {"title": "Synergy-aware selection mechanism for high quality and sustainability of ubiquitous services.", "url": "https://doi.org/10.1109/APNOMS.2014.6996542", "year": "2014", "author": {"Xiyue Mao": "156/3754", "Lanlan Rui": "03/4227", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:In ubiquitous stub environments, it is a critical challenge to select an optimal set of devices to accomplish a graph-based ubiquitous service and execute it continuously. The mobility of devices, the diverse access technologies and underlying path quality have a great influence on the user experience. Thus, we put forward a hierarchical model and a novel selection function considering the synergetic effect between devices. Then we elaborate a Synergy-aware Selection Mechanism (SSM) which includes three modules: service launch, device selection and service maintenance. We design a distributed core algorithm to integrate the devices and a dynamic updating weight method. The simulation results show that Synergy-aware Selection Mechanism can select a set of executive devices to ensure the service quality, continuity and smoothness. It improves the performance in the perceived experience and the number of service reelections."}, "conf/apnoms/RuiXXQ14": {"title": "BP neural network-based web service selection algorithm in the smart distribution grid.", "url": "https://doi.org/10.1109/APNOMS.2014.6996111", "year": "2014", "author": {"Lanlan Rui": "03/4227", "Yinglin Xiong": "156/3708", "Ke Xiao": "69/3751", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:A good web selection algorithm can provide the most suitable service for users. However, known for its slow convergence rate and proneness of oscillation in its learning process, the traditional error back propagation neural network algorithm cannot be applied in the service selection scenarios of actual smart distribution grid. In order to meet the requirements of telecommunication technology for smart distribution grid and improve the quality of telecommunication service, this paper proposes an improved error back propagation algorithm, in which the learning factor can be self-adjusted with every iteration. The simulation results show an optimization of the training speed and an oscillation reduction in the learning process with the new algorithm, thus obvious optimizing the web services selection in smart distribution grid."}, "conf/cnsm/MuRGQ14": {"title": "Generalized Lagrange based Resource Negotiation Mechanism in MANETs.", "url": "https://doi.org/10.1109/CNSM.2014.7014162", "year": "2014", "author": {"Nan Mu": "137/4182", "Lanlan Rui": "03/4227", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the integration of mobile devices into ubiquitous environments, a wide range of services can be provided by exploiting the resources on heterogeneous devices, especially in MANETs. Because resources on mobile devices are shared out, it is essential to arrange highly-limited resources effectively and reasonably while considering utilities of multi-users and the network. To achieve this goal, abstract Buyer Agent and Seller Agent as well as the concept of resource market are introduced in the Resource Pricing Model. Then a novel Generalized Lagrange based Resource Negotiation Mechanism is proposed including the solution to the problem model using Generalized Lagrange Multiplier technique and the process of multi-round resource negotiation. At last, the experimental results demonstrate that the proposed mechanism is capable of optimizing the response time, maximizing the system utility and balancing the agent utility under the constraints of budget, deadline and energy resource."}, "conf/vtc/NiuRGQ14": {"title": "A Novel Recovery Strategy for Service Interruption in Ubiquitous Stub Environment.", "url": "https://doi.org/10.1109/VTCSpring.2014.7022787", "year": "2014", "author": {"Danmei Niu": "68/10365", "Lanlan Rui": "03/4227", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:In ubiquitous stub environment, several mobile devices can work cooperatively to provide efficient and reliable service. But device movement or failure usually causes service interruption. How to recover the service path quickly and enhance the user experience greatly is an important problem. This paper presents a novel recovery strategy to resolve the problem. First of all, the strategy conducts the local service recovery process. If it fails, the strategy will use the global service recovery process. Several key factors affecting recovery process are adopted in the strategy. Compared with other similar strategies in simulation experiment, the failure rate and service time of this strategy is lower than the others. So this novel strategy has a better performance."}, "conf/apnoms/MuRGQ13": {"title": "Theil-Equilibrium based Cooperation Mechanism for multi-services in ubiquitous stub enironments.", "url": "https://ieeexplore.ieee.org/document/6665245/", "year": "2013", "author": {"Nan Mu": "137/4182", "Lanlan Rui": "03/4227", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the development of ubiquitous networks, the personalization of ubiquitous services demand different kinds of heterogeneous devices to cooperate with each other. However, limited network resources and device capabilities will cause allocation conflict of multi-services utilities for multi-users' requests in ubiquitous stub environments. Thus, when users request simultaneously, how to make an effective device cooperation scheme to guarantee and equilibrate each user's experience becomes a tough problem. In this paper, Equilibrium Index and Theil Utility function are firstly imported to establish the model of Multi-services Equilibrium Device Cooperation. Then a Theil-Equilibrium based Cooperation Mechanism for multi-services is proposed, including dimensionless processing and a cooperation approach focused on Theil-Utility Heuristic algorithm. At last, simulation results show this mechanism performs well in supporting ubiquitous services."}, "conf/icct/ZhuGRM13": {"title": "Economics based resource allocation mechanism for Personal Network Federation.", "url": "https://doi.org/10.1109/ICCT.2013.6820433", "year": "2013", "author": {"Kai Zhu": "75/4078", "Shaoyong Guo": "150/6843", "Lanlan Rui": "03/4227", "Luoming Meng": "52/382"}, "abstract": " Abstract:The resource allocation problem which aims to solve resources sharing and coordination among heterogeneous devices has become a key issue in Personal Network Federation (PNF). In this paper, Economics based Personal Network Federation (EPNF) market is introduced to meet this case by modelling each resource provider and requestor as Resource Seller Agent (RSA) and Resource Buyer Agent (RBA). Later, we design an EPNF model based on multi-object optimization theory. The Pareto based Solution Set (PSS) is then defined with its properties analyzed which can transfer the EPNF model into a resource allocation competition scenario between multi-agents. Afterwards, Interference Hormone (IH) is imported into Ant Colony Optimization (ACO) Algorithm for resource allocation. At last, the result shows that EPNF mechanism offers great help in increasing the utility function for each requestor and can avoid allocation deadlock and allocation conflicts effectively."}, "conf/iscc/WangRQLJ13": {"title": "A self-adaptive recovery strategy for service composition in ubiquitous stub environments.", "url": "https://doi.org/10.1109/ISCC.2013.6755062", "year": "2013", "author": {"Lijun Wang": "96/6702", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Wenjing Li 0001": "08/6548-1", "Kangming Jiang": "93/11447"}, "abstract": " Abstract:Service composition has been introduced to exploit heterogeneous resources of distributed nodes for purpose of supplying ubiquitous services in ubiquitous stub environments, especially in MANETs. However, due to the characteristics of infrastructure-less, the limited resources of the nodes and dynamic topology caused by the mobility of nodes, service composition faces great risk of failure. Therefore, service recovery handling failure is crucial to guarantee composite service's successful execution. In this paper, we propose a novel recovery selection function which incorporates device effective rate, individual capability and cooperative capability. Then we elaborate an original heuristic thought-based backup recovery algorithm: Dynamic Local Backup Recovery Algorithm (DLBRA). Finally, simulation results demonstrate that the proposed strategy ensures high performance, effectively guarantees the sustainability and significantly reduces the response time of the composite service."}, "conf/cnsm/GuoRQM12": {"title": "An effective cooperation mechanism among multi-devices in ubiquitous network.", "url": "https://ieeexplore.ieee.org/document/6380014/", "year": "2012", "author": {"Shao-Yong Guo": "150/6843", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": " Abstract:The aim of MANET is to supply ubiquitous services through communications among a set of devices deployed in ubiquitous stub environment. Due to the dynamic characteristics of MANET and the limit of devices' capacity, it is a critical challenge to select an optimal set of device to supply high quality service constantly. In this paper, the Multi-Devices Cooperation problem is imported with ubiquitous service model and network model. And a dynamic multi-devices cooperation approach is proposed to support three processes of service requiring, multi-devices cooperation selecting and quality maintenance. At last, the simulation is implemented with OPNET and MATLAB and the result shows this approach is better applied to support ubiquitous services."}, "conf/apnoms/ChenQYR11": {"title": "Negotiation-based service self-management mechanism in the MANETs.", "url": "https://doi.org/10.1109/APNOMS.2011.6077020", "year": "2011", "author": {"Kan Chen": "33/2607", "Xuesong Qiu 0001": "13/342", "Yang Yang 0006": "48/450-6", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:Since there is no central management center in the MANETs, nodes need to self-manage service provided by other nodes. To pursue maximal utilities, they should be able to negotiate autonomously for services, e.g., packets transmission, information share. While some selfish mobile nodes in MANETs are unwilling to provide services for other users, it directly leads to serious decline in network performances. Hence an effective negotiation mechanism is required to stimulate them to cooperation. In this paper, we present a service-oriented negotiation model between selfish nodes in view of one-to-many application scenarios, driven by the basic intuition that negotiators tend to maximize their individual payoffs while ensuring that an agreement is reached. We develop the genetic algorithm to make the negotiation more adaptive in the MANETs. The simulation results show that the algorithm reduces energy consumption and communication traffic in deed."}, "conf/cnsm/WangRYC11": {"title": "Research on Home NodeB Gateway load balancing mechanism.", "url": "https://ieeexplore.ieee.org/document/6103999/", "year": "2011", "author": {"Xiaojie Wang": "99/7033", "Lanlan Rui": "03/4227", "Peng Yu 0001": "50/2599-1", "Xingyu Chen": "59/7651"}, "abstract": " Abstract:Home NodeB Gateway (HNB-GW) is a mobile operator's equipment through which Home NodeB (HNB) gets access to the core network. Without a Load Balancing (LB) mechanism, HNB-GWs' load distribution is determined by the random access of HNBs. HNB-GWs with too many HNBs may become overloaded easily. Once a HNB-GW is overloaded, other entering HNBs cannot be accepted and serviced due to the one-to-many relationship between HNB-GW and HNB in the traditional network architecture. To solve the problems above, this paper firstly brings a HNB-GW Pool concept to optimize the traditional architecture. Then in order to balance the load of HNB-GWs in the pool, this paper proposes two HNB-GW LB mechanisms, one is based on HNB-GW selection control and the other is based on periodic HNB migration. Through analysis in specific scenario, both mechanisms can effectively balance the load between HNB-GWs. LB mechanism based on HNB-GW selection control can select the best HNB-GW for a HNB when it needs to register, but its load adjust rate is relatively slow. LB mechanism based on periodic HNB migration is characterized by fast load adjust rate, but HNB migration may bring negative influence on the related HNBs, such as upper business interruption. Finally, a comprehensive solution which colligates the advantages of both mechanisms is brought forward."}, "conf/noms/YangQMR10": {"title": "A self-adaptive method of task allocation in clustering-based MANETs.", "url": "https://doi.org/10.1109/NOMS.2010.5488499", "year": "2010", "author": {"Yang Yang 0006": "48/450-6", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:In a clustering-based MANETs, task allocation has posed increasing research challenges because the needs of management and coordination are accentuated by complicated demands of cluster members. A self-adaptive method of task allocation is designed to facilitate self-planning and self-negotiation for nodes during tasks being distributed and executed. The method is composed of two parts: for one part, the cluster head works out an integrated schedule for tasks, including selecting different sets of execution nodes and defining their functions according to task types. Cooperative group towards synergetic task is formed by policies of filtering and voting. Assignment modes based on either polling or mobile agents are also involved, the latter adopts an improved Ant Colony Optimization (ACO) algorithm to plan a migration path. For another, if a cluster member fails to accomplish a task, it could negotiate as a tenderee with other nodes using a revised contract net protocol. In addition, we employ a stimulation mechanism of distributing virtual task experience in connection with QoS guarantees to offer compensation for nodes' energy consumption and extra load. Simulation results demonstrate performance benefits of our self-adaptive method can efficaciously alleviate load of the cluster head, balance loads of nodes in consideration of energy restriction, and prolong the lifecycle of the cluster."}, "conf/icnsc/MaR08": {"title": "An End-to-end QoS Frame in Multimedia Provision for Tight-coupled Interworking of IMS and WiMAX.", "url": "https://doi.org/10.1109/ICNSC.2008.4525390", "year": "2008", "author": {"Lin Ma": "74/3608", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:The 3rd generation partnership project (3GPP) selects IP multimedia subsystem (IMS) to provide multimedia services for various access networks. Work in this paper is to extend the supported access networks, such as 3GPP and wireless local area network, to worldwide interoperability for microwave access (WiMAX) on quality of service (QoS) Management. Basing on description of tight-coupled interworking network architecture of WiMAX and IMS, we put forward an end-to-end QoS management architecture called QMFA to perform QoS negotiation and policy control. The frame solves the problem of QoS connectivity and interoperability between WiMAX and IMS networks by introducing a new WiMAX bearer service management architecture (WBSMA), a Policy-based token mechanism called PQNST, and a method of mapping among WiMAX QoS, universal mobile telecommunication system (UMTS) QoS and IP QoS. At last, a simulation system is introduced to show how the frame works to guarantee the QoS management for multimedia service throughout the whole network. It proves the proposed frame can effectively reduce the jitter for real-time video-conference application."}, "journals/jnca/RuiYGLQM22": {"title": "Smart network maintenance in edge cloud computing environment: An allocation mechanism based on comprehensive reputation and regional prediction model.", "url": "https://doi.org/10.1016/j.jnca.2021.103298", "year": "2022", "author": {"Lanlan Rui": "03/4227", "Siqi Yang": "159/1399", "Zhipeng Gao": "25/2165", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": "With the rapid development of communication networks, there are more stringent requirements for its maintenance management. This paper uses edge cloud computing technology and wearable technology to improve the inconvenient information flow of on-site maintenance of communication networks. We propose an Emergent Task Allocation Mechanism based on Comprehensive Reputation and Regional Prediction Model (ETARR) in the edge cloud computing environment to solve emergency task allocation in smart network maintenance. Firstly, based on the basic reputation value, we add the work enthusiasm and work activity as the indicators to measure the work efficiency of the maintenance personnel. By using Long Short-Term Memory (LSTM) model to predict the historical reputation value sequence, the work enthusiasm of the maintenance personnel is quantified. Furthermore, based on the historical movement route of the maintenance personnel, the location of maintenance personnel is predicted by using the modified Workers Movement Patterns (WMP) model. Finally, combined with the reputation value requirements of the emergency task and the geographical location of the maintenance personnel, the maintenance emergency task is assigned. Simulation results show that the ETARR mechanism proposed in this paper reduces the cost of task allocation, improves the efficiency of the completion of the emergency task, and can be better applied to the emergency task scenario in the smart network maintenance environment."}, "journals/tsc/RuiCWGQW22": {"title": "Multiservice Reliability Evaluation Algorithm Considering Network Congestion and Regional Failure Based on Petri Net.", "url": "https://doi.org/10.1109/TSC.2019.2955486", "year": "2022", "author": {"Lanlan Rui": "03/4227", "Xushan Chen": "162/6745", "Xiaomei Wang": "32/6877", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:With the development of complex networks and with increasing service demands, service use is becoming more complex and the composition of services is becoming more complicated. In the XaaS (X as a Service) environment, users only care about the QoE of a service and do not care about the composition process of the service. Therefore, it is important to evaluate the reliability of the entire service. In this article, we use Petri Net as a basis for modeling the composition of services. In addition, we consider the problems of shared resources and common cause faults. Both of these problems can cause network congestion and regional failures. We use distance to assess the effects of regional faults and queuing theory to simulate the network congestion process. Moreover, in the simulation, we verify the impacts of regional failures and network congestion on service reliability. We choose the Tree-Based Search algorithm and the Semi-Markov Model as comparison algorithms. The results of our algorithm are related to service time. Our algorithm can timely reflect the impact of regional failure or network congestion, and it can feedback different evaluation results according to environmental changes. Therefore, our algorithm is more comprehensive and has better performance."}, "journals/corr/abs-2204-01964": {"title": "BcMON: Blockchain Middleware for Offline Networks.", "url": "https://doi.org/10.48550/arXiv.2204.01964", "year": "2022", "author": {"Yijing Lin": "275/1523", "Zhipeng Gao": "25/2165", "Qian Wang": "75/5723", "Lanlan Rui": "03/4227", "Yang Yang 0006": "48/450-6"}, "abstract": "\n      Abstract:  Blockchain is becoming a new generation of information infrastructures.\nHowever, the current blockchain solutions rely on a continuous connectivity\nnetwork to query and modify the state of the blockchain. The emerging satellite\ntechnology seems to be a good catalyst to forward offline transactions to the\nblockchain. However, this approach suffers expensive costs, difficult\ninteroperability, and limited computation problems. Therefore, we propose\nBcMON, the first blockchain middleware for offline networks. BcMON incorporates\nthree innovative designs: 1) it reduces the costs of offline transactions\naccessing the blockchain through Short Message Service (SMS), 2) it validates\nthe authenticity of offline cross-chain transactions by two-phase consensus, 3)\nit supports offline clients to perform complex queries and computations on the\nblockchains. The prototype of BcMON has been implemented to evaluate the\nperformance of the proposed middleware, which can show its stability,\nefficiency, and scalability.\n\n    "}, "journals/ijdsn/RuiWWXL21": {"title": "A dynamic service migration strategy based on mobility prediction in edge computing.", "url": "https://doi.org/10.1177/1550147721993403", "year": "2021", "author": {"Lanlan Rui": "03/4227", "Shuyun Wang": "78/5566", "Zhili Wang": "15/2643", "Ao Xiong": "119/8978", "Huiyong Liu": "122/0727"}, "abstract": ""}, "journals/jnca/RuiZGQWX21": {"title": "Service migration in multi-access edge computing: A joint state adaptation and reinforcement learning mechanism.", "url": "https://doi.org/10.1016/j.jnca.2021.103058", "year": "2021", "author": {"Lanlan Rui": "03/4227", "Menglei Zhang": "156/2390", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342", "Zhili Wang": "15/2643", "Ao Xiong": "119/8978"}, "abstract": "With the development of the internet of things (IoT), the concept of an edge network has been gradually expanding to other fields including internet of vehicles, mobile communication networks and smart grids. Because the resources of terminals are limited, the long-distance movements of users will increase the running costs of the services that are offloaded to edge servers, and even the services on terminals will stop running. Another problem is that resource shortages or hardware failures of these edge networks can affect the service migration policy. In this paper, a novel service migration method based on state adaptation and deep reinforcement learning is proposed to efficiently overcome network failures. Before migration, we define four edge network states to discuss the migration policy and adopt the two-dimensional movement around the edge servers to adapt to the applications scenarios of our work. Then, we use the satisfiability modulo theory (SMT) method to solve the candidate space of migration policies based on cost constraints, delay constraints and available resource capacity constraints to shorten the interruption time. Finally, the service migration problem can be transformed into the optimal destination server and low-cost migration path problem based on the Markov decision process by the deep Q-learning (DQN) algorithm. Moreover, we theoretically prove the rate of convergence in the learning rate function of our algorithm to improve the convergence rate. Our experimental results demonstrate that our proposed service migration mechanism can effectively shorten the delays from service interruptions, and better avoid the impact of edge network failure on the migration results and, thus, improve the users satisfaction."}, "journals/jnca/RuiZGQWX21a": {"title": "Corrigendum to \"Service migration in multi-access edge computing: A joint state adaptation and reinforcement learning mechanism\" [J. Netw. Comput. Appl. 183-184 (2021) 103058].", "url": "https://doi.org/10.1016/j.jnca.2021.103085", "year": "2021", "author": {"Lanlan Rui": "03/4227", "Menglei Zhang": "156/2390", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342", "Zhili Wang": "15/2643", "Ao Xiong": "119/8978"}, "abstract": ""}, "journals/tii/RuiZGQ21": {"title": "CLPM: A Cooperative Link Prediction Model for Industrial Internet of Things Using Partitioned Stacked Denoising Autoencoder.", "url": "https://doi.org/10.1109/TII.2020.2999318", "year": "2021", "author": {"Lanlan Rui": "03/4227", "Yu Zhu": "38/5267", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the development of Industry 4.0, an increasing number of industrial Internet of Things (IIoT) mobile devices (MD), which constantly transmit data at any time, are working on the production line. However, due to node movement, signal attenuation, or physical obstacles, data must rely on the transmission of relay nodes to finally reach the destination node. Based on this scenario, in this article, we propose a cooperative link prediction model (CLPM) using a stacked denoising autoencoder (SDAE) to predict links of the IIoT-based MDs at the next moment through historical link information. The layer structure of the SDAE model is partitioned so that the local MD and edge servers can cooperatively process the link prediction tasks. Experimental results show that our proposed CLPM outperforms others in terms of prediction performance and execution delay."}, "journals/tii/RuiCGQ21": {"title": "MLPRA: An MCDS and Link-Priority-Based Network Repair Algorithm for Smart Grid.", "url": "https://doi.org/10.1109/TII.2020.3012407", "year": "2021", "author": {"Lanlan Rui": "03/4227", "Xushan Chen": "162/6745", "Zhipeng Gao": "25/2165", "Xue-song Qiu 0001": "13/342"}, "abstract": " Abstract:The power system is an infrastructure for industrial manufacturing, and its availability is relevant to industrial systems. The smart grid combines communication systems with sensing devices to provide intelligent management tools for fault monitoring and processing of the power grid. Regional failures caused by natural disasters can have a large impact on the power system. To reduce the impact of disasters, an efficient network repair strategy is needed. This article focuses on the emergency repair strategy of a power communication network under disaster conditions and seeks to ensure the operation of the power system with fewer repairs. Combined with the analysis of cascading failures and regional failures, a communication network fast repair algorithm is proposed. The coupled network is constructed in the simulation part to verify the algorithm. The results show that with a limited number of node repairs, the algorithm can ensure the highest percentage of workable nodes."}, "journals/tnsm/RuiCGLQM21": {"title": "Petri Net-Based Reliability Assessment and Migration Optimization Strategy of SFC.", "url": "https://doi.org/10.1109/TNSM.2020.3045705", "year": "2021", "author": {"Lanlan Rui": "03/4227", "Xushan Chen": "162/6745", "Zhipeng Gao": "25/2165", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": " Abstract:With the development of information technology, the network consists of various proprietary hardware devices, and the use of these devices brings problems. To solve problems, network function virtualization is proposed, which decouples the software and hardware in the network, and deploys the existing network function devices to a common physical platform. However, network virtualization needs will inevitably face reliability problems during resource virtualization and service function chain deployment. This article proposes a service function chain reliability evaluation method and reliability optimization algorithm. The composition relationship and reliability influencing factors of service function chain were analyzed, including resource preemption, common cause failure, fault recovery and redundant backup. The service function chain was modeled as a Petri net model, and reliability evaluation results related to execution time were obtained. Based on the reliability assessment results, a VNF migration strategy is designed, with reliability as the optimization goal while considering costs. Simulation results show that, compared with the reliability optimization strategy based on backup, our algorithm costs less and reduces the impact of resource preemption on service reliability."}, "journals/fgcs/GuoRG20": {"title": "A zone-based content pre-caching strategy in vehicular edge networks.", "url": "https://doi.org/10.1016/j.future.2019.12.050", "year": "2020", "author": {"Hui Guo": "70/2221", "Lanlan Rui": "03/4227", "Zhipeng Gao": "25/2165"}, "abstract": "Content pre-caching is a kind of significant technology to lower response delay and improve network performance, especially for the delay-sensitive services in dynamic vehicular edge networks. Therefore, in this paper, we propose a zone-based content pre-caching strategy, which aims to implement an active content caching through two algorithms: pre-caching zone selecting algorithm- PCZS and pre-caching node selecting algorithm- PCNS. Firstly, we organize the edge servers (ESs) with a zone-based way at the edge, and assign a Manager node to collect the information of each zone; with the help of road topology and tables information recorded in Manager nodes, PCZS can predict the vehicle motion and zone sojourn time with a high accuracy, and further get a content pre-caching zone by comparing estimated request delay and zone sojourn time; then, PCNS checks whether the content has been cached in the CST of the zone selected by PCZS, if CST hits, the pre-caching process is over, otherwise, by combining ES centrality, load degree with content popularity, we perform PCNS to select a specific ES node to pre-cache the content; simulation results show that our strategy has a higher prediction accuracy and dynamic adaptability, it also outperforms in terms of average response delay and cache hit ratio."}, "journals/fgcs/XiaoGSQYR20": {"title": "EdgeABC: An architecture for task offloading and resource allocation in the Internet of Things.", "url": "https://doi.org/10.1016/j.future.2020.02.026", "year": "2020", "author": {"Kaile Xiao": "194/4868", "Zhipeng Gao": "25/2165", "Weisong Shi": "s/WeisongShi", "Xuesong Qiu 0001": "13/342", "Yang Yang 0006": "48/450-6", "Lanlan Rui": "03/4227"}, "abstract": "The evolving Internet of Things (IoT) faces considerable challenges in terms of sensitive delay requirements for tasks, reasonable allocation requirements of resources, and reliability requirements of resource transactions. In the paper, considering these problems, we propose an emerging IoT architecture EdgeABC introduced the blockchain to ensure the integrity of resource transaction data and the profits of service provider, and we also propose a Task Offloading and Resource Allocation (TO-RA) algorithm, where the TO-RA algorithm is implemented on the blockchain in the form of smart contracts. In other words, the architecture proposed optimizes the resource allocation in IoT based on the advantages of the blockchain. Specifically, we first propose a subtask-virtual machine mapping strategy to complete the Task Offloading (TO) and the first allocation of resources; then aiming at the possible load imbalance problem of the system, we propose a stack cache supplement mechanism to complete the Resource Allocation (RA) based on the TO strategy. Finally, simulation experiments verify that the fairness, user satisfaction, and system utility of the TO-RA algorithm are superior to traditional algorithms."}, "journals/spe/RuiQLWH20": {"title": "SEWMS: An edge-based smart wearable maintenance system in communication network.", "url": "https://doi.org/10.1002/spe.2775", "year": "2020", "author": {"Lanlan Rui": "03/4227", "Yabin Qin": "263/6851", "Biyao Li": "222/7726", "Ying Wang 0002": "94/3104-2", "Haoqiu Huang": "168/7949"}, "abstract": ""}, "journals/ett/RuiZZQ19": {"title": "Location-dependent sensing data collection and processing mechanism in vehicular network.", "url": "https://doi.org/10.1002/ett.3283", "year": "2019", "author": {"Lanlan Rui": "03/4227", "Yao Zhang": "57/3892", "Pan Zhang": "29/1005", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/fgcs/RuiWZWQ19": {"title": "A self-adaptive and fault-tolerant routing algorithm for wireless sensor networks in microgrids.", "url": "https://doi.org/10.1016/j.future.2019.04.024", "year": "2019", "author": {"Lanlan Rui": "03/4227", "Xiaotong Wang": "11/649", "Yao Zhang": "57/3892", "Xiaomei Wang": "32/6877", "Xuesong Qiu 0001": "13/342"}, "abstract": "With the expanding development of power grids, a microgrid is proposed, which is located on the edge of the entire grid. The edges of wireless sensor networks (WSNs) in a MG are in edge computing environments. For initialization, we propose an edge-adaptive and fault-tolerant routing algorithm. The routing is constructed using particle swarm optimization and consists of the inter-cluster structure and the intra-cluster structure. To improve stability, we take the distance, energy and traffic into account. The cluster head nodes are adaptive and adjust their communication ranges according to the network conditions and the current load. In addition, we also consider the failure of sensors. The sensors can address accidental malfunctions autonomously and quickly. Finally, we evaluate the performance of the algorithm through the simulation. The algorithm proposed in this paper shows better performance than other existing algorithms."}, "journals/iotj/RuiYGQ19": {"title": "Computation Offloading in a Mobile Edge Communication Network: A Joint Transmission Delay and Energy Consumption Dynamic Awareness Mechanism.", "url": "https://doi.org/10.1109/JIOT.2019.2939874", "year": "2019", "author": {"Lanlan Rui": "03/4227", "Yingtai Yang": "255/2198", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Various problems arise in the maintenance of communication networks. For example, on-site maintenance personnel have insufficient work experience. Devices used for maintenance work have limited computing resources and battery life. Moreover, most maintenance systems still use the centralized single processing mode of traditional cloud computing, which increases the data center computing pressure and slows the data flow. To overcome these problems, we propose a communication network edge maintenance system based on smart wearable technology and introduce computation offloading technology for mobile edge computing (MEC). Before offloading, we propose a multimerged computing sorting segmentation (MCSS) algorithm to divide a part of the task to offload. When making an offloading decision, we access a suitable MEC service node for each user with the lowest transmission cost and establish a related model. We use an improved Kuhn-Munkras (KM) algorithm that considers fairness among users to solve this model. After that, we propose a dynamic energy-efficiency awareness strategy. When tasks are processed locally, we optimize the CPU clock frequency. When tasks are offloaded, we adaptively allocate the transmission power. Finally, we conduct a simulation experiment. The results demonstrate that the proposed scheme can reduce the transmission cost and improve the performance, thereby increasing the level of on-site maintenance work."}, "journals/access/RuiWQ18": {"title": "Analysis of Cascade Fault Optimization Based on Regional Fault and Traffic Reallocation in Complex Networks.", "url": "https://doi.org/10.1109/ACCESS.2018.2829979", "year": "2018", "author": {"Lanlan Rui": "03/4227", "Xiaomei Wang": "32/6877", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the development of complex networks and demand for information services, more and more businesses are turning to complex networks for their hosting needs. Due to the growing service, attention must be paid to the problem of complex network cascade failures. A cascade failure is a large-scale failure caused by several small-scale failures. This phenomenon initially attracted attention in the power grid field. Currently, complex network cascade failures also deserve attention. In this paper, we focus on mitigating the impact of cascade failures. First, we propose a model to simulate the cascade fault propagation process based on a virus propagation model. We introduce an SDN control plane to the communication network to monitor the overall network. We consider regional failures and optimize traffic redistribution strategies to reduce the impact of cascade failure. Finally, we compare several simulation results based on proposed fault propagation models. The mechanism, we proposed, shows better performance in the remaining available nodes and the remaining network traffic."}, "journals/adhoc/RuiGHSQ18": {"title": "MUPF: Multiple unicast path forwarding in content-centric VANETs.", "url": "https://doi.org/10.1016/j.adhoc.2018.06.012", "year": "2018", "author": {"Lanlan Rui": "03/4227", "Hui Guo": "70/2221", "Haoqiu Huang": "168/7949", "Ruichang Shi": "189/8247", "Xuesong Qiu 0001": "13/342"}, "abstract": "Vehicular ad-hoc networks (VANETs) with traditional TCP/IP architecture cannot manage mobile nodes effectively. Inspired by information-centric networking (ICN), content-centric VANETs have emerged as a promising architecture to address the challenges of traditional IP-based communications in VANETs. However, several issues need to be solved with regard to this architecture. Among them, inflexible routing schemata based on IP addresses, inefficient traffic caused by network broadcast, and volatility in the network environment cause low network performance in VANETs. By focusing on the content routing of the VANETs, we propose a multiple unicast path-forwarding scheme, MUPF, in which we aim to build multiple stable unicast forwarding paths in content-centric VANETs. The main design concepts of MUPF are as follows: (1) By introducing the idea of ICN, we avoid using the fixed-communication host-to-host method employed in IP; MUPF applies a content-centric routing process to request for and reply to packets. (2) We have evaluated the often-occurring broadcast in VANETs, which is thought to have a bad impact on network performance; hence, MUPF uses multiple unicast forwarding paths to deliver the packets instead of a simple broadcast. (3) Considering the highly volatile feature of VANETs, wherein the links are easily broken when the nodes leave, combined with the nodes motion parameters and link quality metrics, MUPF can choose some more reliable nodes as next hops to improve the time tolerance of each routing path. In terms of average response time, the performance improvement achieved by MUPF is 10%, 1520%, and 60% compared to CCVN, V-NDN, and TCP/IP, respectively. In terms of the cache-hit ratio, MUPF achieves an improvement of 8% and 13.8% over CCVN and V-NDN, respectively; it also decreases network traffic significantly."}, "journals/itiis/RuiZHQ18": {"title": "A New Traffic Congestion Detection and Quantification Method Based on Comprehensive Fuzzy Assessment in VANET.", "url": "https://doi.org/10.3837/tiis.2018.01.003", "year": "2018", "author": {"Lanlan Rui": "03/4227", "Yao Zhang": "57/3892", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/mta/RuiYH18": {"title": "A producer mobility support scheme for real-time multimedia delivery in named data networking.", "url": "https://doi.org/10.1007/s11042-017-5601-1", "year": "2018", "author": {"Lanlan Rui": "03/4227", "Suijia Yang": "206/3644", "Haoqiu Huang": "168/7949"}, "abstract": "Named Data Networking (NDN) is a network architecture for the Future Internet, and can cooperate with the Internet of Things (IoT) to tackle problems existing in the current IP/TCP network architecture. Its consumer-driven paradigm and generic cache could optimize content distribution performance. However, there are still some problems to be dealt with, including mobility support of the producer. This paper proposes a producer mobility support scheme in NDN specifically for real-time multimedia delivery scenarios to reduce handover delay and to improve consumer experience with bounded overhead. Complementary components are designed based on forwarding information bases and packets in the original NDN. In particular, we categorize scenarios into two types according to cache state, and handle them with different strategies. Results of numerical analysis show that our scheme outperforms the original NDN and some typical solutions on delay with bounded overhead."}, "journals/chinaf/HuangRZNQ17": {"title": "General, practical, and accurate models for the performance analysis of cache cascades.", "url": "https://doi.org/10.1007/s11432-016-0178-2", "year": "2017", "author": {"Haoqiu Huang": "168/7949", "Lanlan Rui": "03/4227", "Weiwei Zheng": "176/0935", "Danmei Niu": "68/10365", "Xuesong Qiu 0001": "13/342"}, "abstract": ", , Melazzi, LCE, LCP, LCD, , , , , "}, "journals/ejwcn/RuiGSHQ17": {"title": "ICN routing selecting scheme based on link quality for the urban vehicles' communication.", "url": "https://doi.org/10.1186/s13638-017-0991-3", "year": "2017", "author": {"Lanlan Rui": "03/4227", "Hui Guo": "70/2221", "Ruichang Shi": "189/8247", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/ijdsn/RuiYH17": {"title": "A proactive multi-level cache selection scheme to enhance consumer mobility support in Named Data Networking.", "url": "https://doi.org/10.1177/1550147717700897", "year": "2017", "author": {"Lanlan Rui": "03/4227", "Suijia Yang": "206/3644", "Haoqiu Huang": "168/7949"}, "abstract": ""}, "journals/mta/NiuRHQ17": {"title": "A service recovery method based on trust evaluation in mobile social network.", "url": "https://doi.org/10.1007/s11042-016-3963-4", "year": "2017", "author": {"Danmei Niu": "68/10365", "Lanlan Rui": "03/4227", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342"}, "abstract": "Mobile social network makes users create and share multimedia contents freely and conveniently. However, some nodes in mobile social network have malicious behavior, such as discarding or tampering packet. These factors will cause service interruptions in the process of providing multimedia contents for the user. When the service interruption happens, how to choose the more reliable backup device, reduce interruption number, increase the packet transmission efficiency and improve users experience of sharing multimedia contents is the object of this paper. We propose a service recovery method based on trust evaluation which adopts Dempster-Shafer (D-S) evidence theory. The service requester calculates the direct trust degree and the recommended trust degree of the backup devices, then uses the evidence combination rule to calculate the comprehensive trust degree. The backup device with the highest trust value will be seclected to recover the service. The simulation results show that this method effectively improves the packet delivery ratio, reduces the service execution time and provides users with more stable multimedia contents."}, "journals/ieicet/HuangRZNQS16": {"title": "General, Practical and Accurate Models for the Performance Analysis of Multi-Cache Systems.", "url": "https://doi.org/10.1587/transcom.2016CNP0012", "year": "2016", "author": {"Haoqiu Huang": "168/7949", "Lanlan Rui": "03/4227", "Weiwei Zheng": "176/0935", "Danmei Niu": "68/10365", "Xuesong Qiu 0001": "13/342", "Sujie Shao": "151/6228"}, "abstract": ""}, "journals/ijdsn/RuiZHQ16": {"title": "A location-dependent task assignment mechanism in vehicular crowdsensing.", "url": "https://doi.org/10.1177/1550147716669627", "year": "2016", "author": {"Lanlan Rui": "03/4227", "Pan Zhang": "29/1005", "Haoqiu Huang": "168/7949", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/cj/NiuRZQ15": {"title": "A Composition and Recovery Strategy for Mobile Social Network Service in Disaster.", "url": "https://doi.org/10.1093/comjnl/bxu044", "year": "2015", "author": {"Danmei Niu": "68/10365", "Lanlan Rui": "03/4227", "Cheng Zhong": "07/1405", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/ejwcn/YangLGQRL15": {"title": "A data dissemination mechanism for motorway environment in VANETs.", "url": "https://doi.org/10.1186/s13638-015-0310-9", "year": "2015", "author": {"Yang Yang 0006": "48/450-6", "Qian Liu": "33/85", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342", "Lanlan Rui": "03/4227", "Xin Li": "09/1365"}, "abstract": ""}, "journals/ahswn/GuoRQM14": {"title": "Service-Oriented Synergy Mechanism Among Multi-Devices in Ubiquitous Network.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-23-number-1-2-2014/ahswn-23-1-2-p-137-157/", "year": "2014", "author": {"Shao-Yong Guo": "150/6843", "Lanlan Rui": "03/4227", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": ""}, "journals/sensors/HuangQR11": {"title": "Simple Random Sampling-Based Probe Station Selection for Fault Detection in Wireless Sensor Networks.", "url": "https://doi.org/10.3390/s110303117", "year": "2011", "author": {"Rimao Huang": "57/10696", "Xuesong Qiu 0001": "13/342", "Lanlan Rui": "03/4227"}, "abstract": ""}}}