{"id": "76/847-1", "name": "Lei Feng 0001", "Article": {"conf/bmsb/XuZFW22": {"title": "MARL-Based Joint Computation Offloading and Aerial Base Stations Deployment in MEC Systems.", "url": "https://doi.org/10.1109/BMSB55706.2022.9828711", "year": "2022", "author": {"Zhiqiang Xu": "72/51", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Zihao Wu": "185/2651"}, "abstract": " Abstract:Due to mobility and flexibility, aerial base station (AeBS) endowed with computation capacity is a promising paradigm that can bring a better quality of service (QoS) for users, especially in some situations where there is a lack of infrastructure or hotspots occur with massive users using computation-intensive multimedia services. To deploy multiple AeBSs in proper locations which would facilitate the utilization of both communication and computing resources, this paper treats each AeBS as an agent and use a multi-step multi-agent reinforcement learning network to jointly optimize task processing delay, energy consumption, and throughput by adjusting the deployment position and offloading strategy of each AeBS. The agents can be trained offline and updated online quickly according to changes in the environment, and the optimal deployment and offloading strategy can be solved quickly. Simulation results show that our algorithm can achieve nearly optimal value in a very short time."}, "conf/bmsb/YangZFL22": {"title": "Resource Reservation for Graph-structured Multimedia Services in Computing Power Network.", "url": "https://doi.org/10.1109/BMSB55706.2022.9828609", "year": "2022", "author": {"Shuo Yang": "78/1102", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Computation-intensive multimedia services have developed greatly in the computing network environment where cloud, edge, and user terminals coexist. In face of high concurrent services requests and different demands of computing resources for a variety of multimedia services, how to efficiently coordinate the computing capabilities of edge nodes and cloud nodes on a large scale, reasonably decide the resource reservation scope for graph-structured multimedia services in order to avoid resource conflicts between competing services forms a new challenge. This paper proposes CORA, a resource reservation method for concurrent multimedia services, which considers the interaction of function modules within each graph-structured multimedia service and the resource competition among the multiple concurrent services. The simulation results show that our method can obtain reasonable sets of computing nodes for resource reservation, which can meet the demand for computing resources of concurrent services and avoid the conflict of resource selection between multiple services."}, "conf/iwcmc/XiangWLDW0WZF22": {"title": "Decomposition of power system inspection services for 5G cloud-edge-end collaboration.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9824935", "year": "2022", "author": {"Hui Xiang": "17/2938", "Yucheng Wang": "66/4822", "Yuxiang Lv": "119/1793", "Yawen Dong": "205/7759", "Hongyan Wang": "14/6555", "Yang Yang 0006": "48/450-6", "Liangkang Wei": "277/2863", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1"}, "abstract": " Abstract:With the development of the smart power grid, the requirements for intelligent, vivid, and real-time power system inspection services are getting higher. 5G, artificial intelligence, edge computing, big data, virtual reality, and other information technologies bring breakthroughs for power system inspection services evolution, but in the meanwhile, making the services more complex and draining large amounts of computing resources. In the 5G networks with collaborative computing enabled in cloud-edge-end nodes, how to reasonably decompose a complex power system inspection service into multiple task clusters becomes a prerequisite for the efficient distributed deployment of the service and its rapid execution. This paper proposes an approach for the decomposition of intelligent power system inspection services. It considers the computing resource requirements of the functional components in a power system inspection service as well as the interactions between them, perceives the computing capabilities of heterogeneous nodes, such as cloud, edge, and collaborative end terminal in 5G networks, and decomposes the service into multiple task clusters which retain the original logical structure. Simulation results show that the approach can produce suitable results, which can reduce the expected service execution time and improve the utilization of network resources."}, "conf/iwcmc/HuangFZL0X22": {"title": "5G URLLC Local Deployment Architecture for Industrial TSN Services.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9825113", "year": "2022", "author": {"Jiayu Huang": "197/8235", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Huiyong Liu": "122/0727", "Peng Yu 0001": "50/2599-1", "Kunyi Xie": "299/4380"}, "abstract": " Abstract:In the industrial scenario, the requirements for network quality and data security of industrial Time Sensitive Network (TSN) services are becoming more and more stringent. 5G technology has the characteristics of wide bandwidth, low latency, and massive connections. Mobile Edge Computing (MEC) can improve the utilization of resources and the security of data, while future reducing the transmission delay. However, for industrial TSN services, a new network deployment architecture is still needed to provide reliable, flexible, and secure services for the industrial Internet. This paper proposes a local deployment architecture and adopts a deployment optimization scheme of Distributed Unit/ Centralized Unit/ User Plane Function/ TSN Translator (DU/CU/UPF/TT) convergence integration, highly integrated network elements, build DU/CU/UPF/TT compact integrated equipment, realize the idea of the separation of control plane and user plane, and realize efficient data forwarding. Meanwhile, some technologies such as Multiple-transmission/Reception Point (Multi-TRP) and New Radio Dual Connectivity (NR-DC) are used to meet the requirements of the low latency of industrial TSN services, and ensure data security and improve network quality."}, "conf/service/WangZLWZFL22": {"title": "Multi-Granularity Decomposition based Task Scheduling for Migration Cost Minimization.", "url": "https://doi.org/10.1109/ICSS55994.2022.00026", "year": "2022", "author": {"Ziliang Wang": "60/6743", "Tingting Zhang": "82/5445", "Ying Li": "22/1805", "Sheng Wang": "85/1868", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:With the development of mobile communication, network technology, and the continuous emergence of intelligent network applications, users' demand for network computing power has increased explosively, which promoted the formation of a multi-level computing power system composed of the end devices, mobile network edge cloud, and center clouds. The terminal and edge computing power resources are limited. The cloud computing power is rich, but the delay is high, so the computing power at all levels needs effective cooperation to meet the quality of service requirements of various ubiquitous computing services. In this trend, cloud computing and edge computing begin to evolve into networked collaborative computing. In this paper, a task scheduling heuristic algorithm based on task cost minimization is proposed for network computing services with a large amount of communication and computation and high delay cost. This method divides the computing tasks of network applications into multiple granularities and schedules the divided sub-tasks, which can improve the utilization of the distributed computing resources and enhance the collaborative scheduling capability of computing and network resources."}, "conf/apnoms/LiuFLY21": {"title": "Radio Resource Allocation for RIS-aided D2D Communication Based on Greedy Hypergraph-with-weight Coloring.", "url": "https://doi.org/10.23919/APNOMS52696.2021.9562507", "year": "2021", "author": {"Tang Liu": "95/8349", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Zhixiang Yang": "148/0993"}, "abstract": " Abstract:Device-to-Device (D2D) is a very promising technology which can significantly improved the spectral efficiency, while the communication distance is often limited by resource constraints. The reconfigurable intelligent surface (RIS) can optimize the passive phase shift of each element to enhance the signal strength at D2D devices and expand the communication coverage. Regardless of the above advantages, the RIS-aided D2D communication will introduce severe interference to user equipments (UE) or D2D device itself with irrational resource allocation schemes. In this paper, based on hypergraph-with-weight model, a RIS-aided D2D communication network is constructed where the weight of each hyperedge represents the interference severity. Moreover, A greedy coloring algorithm is proposed to solve the complex resource allocation problem in a simple and effective manner. Simulation results show that the proposed greedy coloring algorithm can greatly reduce interference and improve network capacity."}, "conf/apnoms/XieYFLS21": {"title": "Joint Power Control and Passive Beamforming in Intelligent Reflecting Surface Assisted Multi-Cell Uplink Communications.", "url": "https://doi.org/10.23919/APNOMS52696.2021.9562678", "year": "2021", "author": {"Kunyi Xie": "299/4380", "Yang Yang 0006": "48/450-6", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Jing Shen": "76/4282"}, "abstract": " Abstract:Intelligent reflecting surface (IRS) is advanced as an effective technology to meet the high requirements of frequency spectrum and energy efficiency (EE) in future wireless communication systems, which can dynamically adjust its reflecting elements to control the incident signal and change the signal transmission path, thus improve the channel transmission environment. The prior works on IRS mostly considered the uplink scenarios with single cell, which however, did not address the issue of co-channel interference between different cells. This paper investigates an uplink wireless communication system with single IRS serving multiple cells with multiple users (UEs). The transmit power of users and the phase shifts of IRS are jointly optimized for maximizing the system throughput. The resulting non-convex optimization problem is solved by a heuristic algorithm, in which we exploit a non-cooperative game algorithm to solve the co-channel interference dilemma. Presented simulation results illustrate that the proposed scheme achieves a better performance in both system throughput and EE than other baseline algorithms."}, "conf/bmsb/LiZZFLY21": {"title": "Resource Allocation for Componentized Multimedia Service in Ubiquitous Computing Power Environment.", "url": "https://doi.org/10.1109/BMSB53066.2021.9547193", "year": "2021", "author": {"Jingchun Li": "162/6631", "Fanqin Zhou": "137/4178", "Guoyi Zhang": "43/5655", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1"}, "abstract": " Abstract:With the rapid development of multimedia broadcasting and communication technology, multimedia services in the form of componentized network applications deployed in the ubiquitous computing environments comprised of cloud-edge-end 3 tiers of nodes are coming true. However, the existing works usually assume the application is non-partitioned or the computing environment with multiple resources is strictly hierarchical. In this work, we characterize interconnected function components in a multimedia service with a weighted directed acyclic graph (DAG), which then be accommodated with operation resources, like computing and link bandwidth, from the nodes in the ubiquitous computing environment comprised of center/edge cloud nodes and mobile devices. To solve the resource scheduling problem, which is NP-hard, we propose a reinforcement learning-based method to minimize the execution time of the service. The simulation results show that the proposed approach outperforms other baselines on saving execution time and reduce resource occupation at the same time."}, "conf/bmsb/WangZFL21": {"title": "Multi-Granularity Decomposition for Componentized Multimedia Applications based on Graph Clustering.", "url": "https://doi.org/10.1109/BMSB53066.2021.9547105", "year": "2021", "author": {"Ziliang Wang": "60/6743", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:With the number of smart terminals increasing sharply, the emerging smart network applications, like virtual/augmenting reality games, interactive video streaming, appear explosive growth, draining not only communication but also computing and storage resources from the links and computing nodes near the network edges. Therefore, the high-load mobile network edge becomes the bottleneck curbing the network service provision capabilities. One promising way to deal with this issue is to utilize mobile terminal resources by offloading the caching, transmission, or computing tasks to other available terminals nearby. Recent technology developments, such as device-to-device (D2D) direction communication, computing dense chips, are making terminals more powerful to enable the solution. However, current network applications (or tasks, in the computing context) are getting too large to be fully served by a single network terminal. But, luckily, future network applications are developing towards a componentized architecture to enable beneficial features, like rapid iteration, high flexibility. Motivated by these factors, we propose to decompose a network application into small subtasks to enable cooperation among multiple nodes, so that terminals can take part in complex tasks. Thus, resources in network terminals can be fully utilized, relieving the load pressure at the network edge. The paper then focuses on the multi-granularity decomposition method for componentized network applications which produces a series of sets of decomposed subtasks in multiple granularities to meet diversified resource provision conditions at network edge scenarios, while the expected overall execution cost is reduced."}, "conf/camad/ChenYFZLL21": {"title": "A Cell Outage Compensation Mechanism Based on IPSO for 5G Ultra-dense Small Cell Networks.", "url": "https://doi.org/10.1109/CAMAD52502.2021.9617771", "year": "2021", "author": {"Cheng Chen": "10/217", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Wei Lin": "99/2649"}, "abstract": " Abstract:To cope with the increment of mobile communication in 5G networks, Internet Service Providers are planning to adopt base stations with less power and smaller coverage in a more intensive manner. We call such networks multi-tier heterogeneous small cell networks, which put forward more stringent requirements on network security and stability. Self-Organizing Network (SON) is expected to be a potential solution. However, the issue of cell outage compensation (COC) is important for SON. This paper proposes a cell outage compensation mechanism based on an improved particle swarm algorithm (IPSO). Specifically, the neighboring base stations of the failed base station are selected as the compensation base stations according to the topology structure, and then the problem model is constructed to maximize the transmission rate. This model considers the priority of the quality of service (QoS) for different users. It adopts IPSO based on adaptive weights to comprehensively adjust the downtilt, horizontal azimuth, and user power allocation of the base station to ensure the transmission rate. The simulation results show the algorithm converges fast, can quickly approach the target value, and can effectively guarantee the quality of service for users."}, "conf/camad/WeiZFYLZYW21": {"title": "Task Decomposition of Network Services for Deploying in Heterogeneous Network Computing Nodes.", "url": "https://doi.org/10.1109/CAMAD52502.2021.9617805", "year": "2021", "author": {"Liangkang Wei": "277/2863", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Mingyu Zhao": "22/6361", "Xueqiang Yan": "143/6573", "Jianjun Wu": "45/5247"}, "abstract": " Abstract:With the development of computing and network technology, some emerging network services, such as augmenting reality games, smart surveillance, get increasingly complex and call for extensive computing resources. Componentized software architectures are designed to expedite the software development, while they also grant new dimensions to deploy the functional components of a network service in different computing nodes to improve the utilization of computing resources distributed in the network. When a service has a complex structure, how to get its components into different groups, i.e. task decomposition, considering both the computing resource conditions close to end-user and the execution time requirement, is a prerequisite for efficient task allocation and processing. This paper proposes a task decomposition model for componentized network services. The model considers the communication interaction between task elements and full utilization of computing resources in heterogeneous nodes, like cloud, edge, and the mobile terminal, as well as execution time requirement, to decompose a service into subtasks that retain its original componentized structure. Its solutions can simplify service deployment. The paper also proposes an improved genetic algorithm for the solution. The simulation results show that the proposed approach can get suitable decomposition results of diverse granularity in a short time and can reduce the expected task execution time and realize the use of network resources effectively."}, "conf/cnsm/ZhaoZLG0Y21": {"title": "3D Deployment and User Association of CoMP-assisted Multiple Aerial Base Stations for Wireless Network Capacity Enhancement.", "url": "https://doi.org/10.23919/CNSM52442.2021.9615555", "year": "2021", "author": {"Yikun Zhao": "255/9668", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Yuan Gao": "76/2452", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1"}, "abstract": " Abstract:Deploying aerial base stations (AeBSs) has been regarded as an effective solution to wireless network capacity enhancement in specific areas with excessive traffic burden but insufficient capacity. Since the traffic distributions in wireless networks tend to be ever-changing, the deployed AeBS need to adjust its position to rapidly and continuously adapt to the drifting capacity enhancement demands, which is difficult to handle with traditional optimization methods due to high computational complexity and poor scalability. In this paper, we design a multi-agent deep reinforcement learning-based 3D AeBS deployment algorithm with the goal of maximizing the system throughput, which is able to make decisions in dynamic environments and conducts in a distributed manner. Additionally, in order to address the interference issue between multiple AeBSs, we adopt the Coordinated Multiple Points Transmission (CoMP) in the air-to-ground communication and propose a clustering algorithm to form groups of AeBSs for cooperative communication based on the network interference characteristics. Simulation results demonstrate that the proposed approach has significant throughput gains over conventional schemes without CoMP, and that the proposed multi-agent deep Q network (MADQN) is more efficient than centralized DQN in deriving the solution."}, "conf/cnsm/Liu0Z0021": {"title": "Intelligent and Energy-efficient Distributed Resource Allocation for 5G Cloud Radio Access Networks.", "url": "https://doi.org/10.23919/CNSM52442.2021.9615594", "year": "2021", "author": {"Zhengyuan Liu": "229/9236", "Peng Yu 0001": "50/2599-1", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:With the development of 5G, the distribution of base stations tends to be dense. Compared with the traditional network architecture, Cloud Radio Access Networks(C-RAN) architecture can satisfy the current requirements of high bandwidth, low latency and low energy consumption. Currently most energy-saving scheme for C-RAN is complex with time cost computing, which may not be suitable for large-scale region. For the problem of energy-efficient resource allocation for dense distribution of Remote Radio Heads(RRHs) in C-RAN, we use K-means clustering algorithm to simplify the network topology and reduce the complexity under a distributed manner. Aiming at the problem of network resource allocation in C-RAN, we use A3C algorithm to allocate network transmission power, and compare the total energy consumption, system energy efficiency and Signal to Interference plus Noise Ratio(SINR) value of terminal devices through simulation experiments. The experimental results show that in the same network environment, A3C algorithm has the highest energy efficiency, and can keep the SINR value of terminal devices in a reasonable range, which proves the effectiveness of A3C algorithm."}, "conf/comcomap/Ding000Z21": {"title": "Optimal Deployment Methods of Multi-UAVs for Capacity Enhancement under Weak Coverage.", "url": "https://doi.org/10.1109/ComComAp53641.2021.9653105", "year": "2021", "author": {"Yahui Ding": "188/4206", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178"}, "abstract": " Abstract:With the development of 5G technology and Internet of things (IOT), the application scenarios of IOT are becoming more and more diverse, just as the integration of Unmanned Aerial Vehicles Base Station (UAV-BS) to serve ground nodes is a trend in the disaster scenario, how to reduce energy consumption while providing services for users is a key research topic. So in this paper, we have made research on the deployment of UAV-BS and Milimeter-Wave UAV (mmW-UAV) based on the post disaster rescue to resume ground communication, we have deployed the UAV-BS to detect and find the ground users firstly, so we can get the general understanding of the disaster area. After ensuring the distribution of users, we have deployed the UAV-BS and mm W - UAV to cover all users to resume communication service with the goal of optimizing the energy efficiency, finally we have compared the move track and energy consumed of the intelligent algorithms, the result shown that the algorithms can provide the service for users in less energy,"}, "conf/bmsb/GaoZSFL0C20": {"title": "Resource Allocation for Network Slices with Delay-Sensitive Multimedia Services.", "url": "https://doi.org/10.1109/BMSB49480.2020.9379507", "year": "2020", "author": {"Jing Gao": "67/4834", "Fanqin Zhou": "137/4178", "Gang Sun": "11/383", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Xiaolu Chen": "30/3918"}, "abstract": " Abstract:For ubiquitous delivery, multimedia services have resorted to 5G networks in which network slicing is an indispensable part to fulfill the end-to-end performance guarantee for delay-sensitive multimedia services. Coexisting with other 5G services with dynamic varying traffics makes resource allocation a challenging issue for performance guarantee. This paper formulates a resource allocation model to construct the relationship between network slice instances and substrate networks, and a delay optimal resource allocation problem considering backhaul capacity and bandwidth constraints is proposed. Numerical results reveal that the proposed scheme guarantees the delay performance of the delay-sensitive multimedia slices with the variation of traffic."}, "conf/bmsb/LiFLZO20": {"title": "Network Slicing Cache Deployment And Resource Allocation Strategy For Maximizing Network Revenue in 5GC-RANs.", "url": "https://doi.org/10.1109/BMSB49480.2020.9379692", "year": "2020", "author": {"Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Yingxin Lin": "255/6619", "Qiang Zhao": "00/2166", "Qinghai Ou": "120/7211"}, "abstract": " Abstract:Cloud Radio Access Network (C-RAN) and network slicing is now regarded as a promising paradigm for multimedia networks, which aims at decreasing end-to-end delay and improving the quality of services. This article innovatively formulates a network slicing cache deployment and resource allocation strategy for 5GC-RANs, which aims at maximizing the network revenue of the system. Based on the generalized Benders Decomposition Algorithm, the network revenue maximization problem is decomposed into two subproblem. One is the cache deployment problem and the other is the resource allocation problem. The numerical results demonstrates that our proposed algorithm can ensure the fairness of resource allocation and improve the overall network revenue efficiently."}, "conf/bmsb/ZhaoZSF00C20": {"title": "Coverage Analysis of Cooperative mmWave Cellular Communication for Multimedia Services.", "url": "https://doi.org/10.1109/BMSB49480.2020.9379831", "year": "2020", "author": {"Yikun Zhao": "255/9668", "Fanqin Zhou": "137/4178", "Gang Sun": "11/383", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Xiaolu Chen": "30/3918"}, "abstract": " Abstract:With the advance of big multimedia era, millimeterwave (mmWave) communication in cellular networks has become an essential technology to address the bandwidth challenges in multimedia delivery. However, since base stations (BSs) is densely deployed in the mmWave network, the interference from strong line-of-sight base stations increases the possibility of communication outage. To tackle this problem, base station cooperation is envisioned as an important method to mitigate the interference, thus ameliorating the network performance. This paper mainly evaluates the coverage of cooperative mmWave base stations based on stochastic geometry, specially in two cases: 1) base stations with orientation-fixed directional antennae, 2) base stations with flexibly-adjustable directional antennae. Numeric results illustrate coverage performance gap between the two cases and show the interchangeability of the two cases under certain conditions."}, "conf/infocom/FengQYLQ20": {"title": "IRS Assisted Multiple User Detection for Uplink URLLC Non-Orthogonal Multiple Access.", "url": "https://doi.org/10.1109/INFOCOMWKSHPS50562.2020.9162705", "year": "2020", "author": {"Lei Feng 0001": "76/847-1", "Xiaoyu Que": "268/8984", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Intelligent reflecting surface (IRS) has been recognized as a cost-effective technology to enhance spectrum and energy efficiency in the next generation (5G) wireless communication networks, which is expected to support stable transmission for ultra reliable and low latency communications (URLLC). This paper focuses on the usage of IRS in uplink URLLC system and proposes a compressive sensing based IRS assisted multiple user detection method to deal with the sparsity and relativity characteristic of user signal in URLLC system. Simulation results demonstrate that our proposed algorithm achieves better performance than that of other MUD algorithms with similar computational complexity in terms of reliability and low latency."}, "conf/iwcmc/YuYQWZFLQ20": {"title": "SLA-driven Creditable and Negotiable Resource optimized Allocation Scheme in Cloud.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148413", "year": "2020", "author": {"Peng Yu 0001": "50/2599-1", "Yong Yan": "70/374", "Haotian Qiu": "271/5632", "Ying Wang 0002": "94/3104-2", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xue-song Qiu 0001": "13/342"}, "abstract": " Abstract:The cloud computing market is dynamic, distributed, and lacks central authorization. In this environment, cloud resource providers are vulnerable to deception and cloud resources may be abused. How to implement efficient and feasible trusted negotiations with users to expand Benefits is an urgent issue. Based on SLA (Service Level Agreement), this paper proposes a trusted negotiation method to optimize cloud resource allocation from the perspective of cloud resource providers. In a nutshell, it firstly quantifies each indicator based on the total amount of cloud resources requested by the user and the corresponding price, the user's comprehensive credit, and the total amount of resources corresponding to each SLA level, then filters the users who meet the requirements. Next knapsack algorithm and the greedy algorithm based on dynamic programming are used to predict the allocation of cloud resources respectively. Finally, the allocated users are negotiated to reach a transaction. This article takes the resource allocation price, negotiated price, and negotiated success rate as the evaluation index. The simulation results show that compared with the greedy algorithm, the algorithm in this paper has higher resource allocation price, negotiated price and negotiated success rate under different numbers of users, and can effectively realize the optimal allocation of cloud resources."}, "conf/iwcmc/MaX0GX00Q20": {"title": "Co-Allocation of Service Routing in SDN-driven 5G IP+Optical Smart Grid Communication Networks based on Deep Reinforcement Learning.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148496", "year": "2020", "author": {"Qingliu Ma": "271/5785", "Ao Xiong": "119/8978", "Peng Yu 0001": "50/2599-1", "Shaoyong Guo": "150/6843", "Ningzhe Xing": "151/7899", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:In the face of rapidly emerging and explosion IP services, 5G IP+optical communication network architecture will become an important mode of communication for smart grid communication network. Under the control of SDN, management and maintenance of IP+optical networks can be realized effectively. In order to improve the collaborative ability and resource utilization of 5G IP+optical networks, this paper combines the characteristics of IP services. Firstly, risk equilibrium index is designed according to the bearing characteristics of IP network and optical network. Then, combined with network delay, bandwidth, website level difference and similarity of primary and alternate routes, a reasonable primary and alternate routes allocation model is designed. Finally, a co-allocation algorithm of service routing in 5G IP+optical networks based on deep reinforcement learning is proposed. The simulation results and comparative analysis show that the method not only fully utilize the resources of IP+optical networks, but also guarantee the average service delay and reduce the network risk. Otherwise, this method effectively improves the convergence speed, which provides demonstration and theoretical guidance for the construction of the future power communication network."}, "conf/iwcmc/Jin0GFZTLQS20": {"title": "Cyber-Physical Risk Driven Routing Planning with Deep Reinforcement-Learning in Smart Grid Communication Networks.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148342", "year": "2020", "author": {"Zhuojun Jin": "252/1063", "Peng Yu 0001": "50/2599-1", "Shao-Yong Guo": "150/6843", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Minxing Tao": "271/5806", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Lei Shi 0008": "29/563-8"}, "abstract": " Abstract:In modern grid systems which is a typical cyber-physical System (CPS), information space and physical space are closely related. Once the communication link is interrupted, it will make a great damage to the power system. If the service path is too concentrated, the risk will be greatly increased. In order to solve this problem, this paper constructs a route planning algorithm that combines node load pressure, link load balance and service delay risk. At present, the existing intelligent algorithms are easy to fall into the local optimal value, so we chooses the deep reinforcement learning algorithm (DRL). Firstly, we build a risk assessment model. The node risk assessment index is established by using the node load pressure, and then the link risk assessment index is established by using the average service communication delay and link balance degree. The route planning problem is then solved by a route planning algorithm based on DRL. Finally, experiments are carried out in a simulation scenario of a power grid system. The results show that our method can find a lower risk path than the original Dijkstra algorithm and the Constraint-Dijkstra algorithm."}, "conf/iwcmc/RanYFLOC20": {"title": "Optimizing Global Channel Matching for Multi-Hop Uplink NOMA-Assisted Cellular IoT with Cooperative Relay.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148113", "year": "2020", "author": {"Diya Ran": "271/5470", "Zhixiang Yang": "148/0993", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Qinghai Ou": "120/7211", "Mohamed Cheriet": "69/4317"}, "abstract": " Abstract:Due to the limited energy in massive machine type communication (mMTC), improving energy efficiency is necessary for cellular IoT transmission. This paper considered the edge IoT devices to access relay nodes and used NOMA scheme to transmit information to improve system energy efficiency and reliability. Firstly, we proposed a multi-hop uplink NOMA assisted IoT transmission model with rely cooperation. The transmission model uses NOMA technology and needs to control the power. Secondly, for the channel matching problem, traditional algorithm models such as KM and Hungarian algorithms are only applicable to two-hop system. The paper proposed a multi-hop channel allocation model to improve transmission reliability. Then we used an intelligent optimization algorithm to solve optimization problem. This paper improved the GSO algorithm and proposed the GCM algorithm. GCM can solve the problem of local optimization of traditional GSO algorithm. Finally, in the simulation part, we compared the GCM algorithm with GSO, ACO and random matching. The GCM algorithm has higher reliability, which is 8% and 12% higher than GSO and ACO. It is clear that energy efficiency achieved by GCM is 10% and 18% than GSO and ACO, respectively."}, "conf/bmsb/LiY0Z0Q19": {"title": "A Distributed Energy-Efficient Resource Allocation Mechanism for Multimedia Broadband Services in 5G Ultra-dense Networks.", "url": "https://doi.org/10.1109/BMSB47279.2019.8971878", "year": "2019", "author": {"Yijing Li": "00/10621", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Traffic-intensive Multimedia Broadband Services (MBS) lead to the explosive mobile traffic growth in 5G network, and Ultra-dense Networks (UDNs) is a potential solution for it. However, the densification of large numbers of Small-cell Base Stations (SBSs) in UDN faces huge energy consumption challenge. Therefore in this paper, we propose a distributed energy-efficient resource allocation mechanism for 5G UDN meeting MBS users' QoS. First, we use K-means++ algorithm to cluster the BSs, reducing the complexity of resource allocation. Then, we propose a BS-sleeping algorithm in each cluster to reduce the overall network energy consumption. Finally, we adopt an iterative transmit power optimization method in each cluster to further improve the Energy Efficiency (EE) of UDN. Simulation results show that the proposed approach can effectively reduce the energy consumption and can improve the EE of UDN by nearly 23% while guaranteeing the QoS of MBS User Equipments (UEs)."}, "conf/bmsb/LiYZFZ0Q19": {"title": "Hotspot Localization and Prediction for Broadband Multimedia Services in 5G Networks.", "url": "https://doi.org/10.1109/BMSB47279.2019.8971848", "year": "2019", "author": {"Hao Li": "17/5705", "Peng Yu 0001": "50/2599-1", "Xiang Zhang": "91/4353", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Due to the generation of hotspots and the rapid change of hotspot location, 5G wireless network must have higher flexibility. How to accurately predict the future traffic load is a prominent problem. In this paper, we use Gaussian Random Field (GRF)-based to fit the distribution of spatial traffic density and then locate the hotspots for broadband multimedia services. At the same time, the Long Short-Term Memory (LSTM) model is trained to predict the next moment traffic value by using the actual traffic data collected from base stations. Finally, the model is used to predict the future traffic data of base stations and locate the hotspots. Through analysis and evaluation, numerical results show that the method can effectively locate hotspots."}, "conf/bmsb/ZhangYFZL19": {"title": "A DRL-based resource allocation framework for multimedia multicast in 5G cellular networks.", "url": "https://doi.org/10.1109/BMSB47279.2019.8971943", "year": "2019", "author": {"Xiang Zhang": "91/4353", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Cloud Radio Access Network (C-RAN) is a key enabling network architecture for the next generation (5G) wireless communications and has advantages of providing multimedia service on the basis of properly resource allocation. However, the resource allocation strategy still needs to be further improved in order to allocate resource where unicast or multicast multimedia services are requested simultaneously. Aiming at minimizing power consumption and meeting quality of service (QoS) requirement of users, this paper proposes a deep reinforcement learning based unicast-multicast resource allocation framework (DRL-CRAF) for it with high energy efficiency. Specifically, we define the state space, action space and reward function for the DRL agent, and formally formulate the resource allocation problem in a multimedia service scenario as a convex optimization problem. We evaluate the performance of the proposed framework by comparing it with three widely-used baselines via simulation. Simulation results show that the proposed method can not only meet the requirements of both unicast and multicast users but also effectively reduce 10% transmission energy consumption compared to full connectivity method."}, "conf/bmsb/ZhaoFGYZ19": {"title": "Joint Caching Allocation and Delay Control for Network Slices Carrying Multimedia Services in 5G Core Network.", "url": "https://doi.org/10.1109/BMSB47279.2019.8971899", "year": "2019", "author": {"Qiang Zhao": "00/2166", "Lei Feng 0001": "76/847-1", "Shaoyong Guo": "150/6843", "Peng Yu 0001": "50/2599-1", "Fanqin Zhou": "137/4178"}, "abstract": " Abstract:As one of the most important technologies, network slicing (NS) has received extensive attention and research efforts in recent years. The infrastructure providers (InP) can divide the physical network into multiple logical networks by NS, and the service provider (SP) can rent these NS instances from the InP to meet their own requirements. Since most multimedia services are usually QoS-aware, such as virtual reality (VR), mobile high-definition video and so on, caching resource can be allocated to different NS instances on demand to reduce the transmission delay and improving the quality of experience (QoE) of end-users. Due to the limited amount of caching resource, the issue about how to efficiently allocate caching resource to increase network revenues and save expenses becomes very critical for InPs. To achieve this goal, this paper proposes a delay-constrained caching resource allocation scheme based on Benders decomposition algorithm. It can maximize the revenues of InPs while meeting the service requirement of each network slice. Finally, extensive numerical simulations are executed to verify the performance of the proposed scheme."}, "conf/icc/Ning0ZY00Q19": {"title": "Interference Control Based on Stackelberg Game for D2D Underlaying 5G mmWave Small Cell Networks.", "url": "https://doi.org/10.1109/ICC.2019.8761950", "year": "2019", "author": {"Jiayi Ning": "222/7734", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Mengjun Yin": "152/1083", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:To satisfy ultra-high data volume and traffic density transmission requirements, millimeter wave (mmWave) and device-to-device (D2D) communication technology will be widely used in 5G mobile communication networks. In scenarios where mmWave small cell and D2D transmission coexist, D2D links mostly reuse frequency resources of the small cell to obtain higher spectral efficiency. However, this will make D2D impose great interference to mmWave small cell. This paper designs a Stackelberg game based interference control scheme with full frequency reuse in the context of D2D underlaying mmWave small cell network. The scheme aims to optimize the transmit power of D2D links, alleviate the interference caused by D2D communication to the mmWave small cell and take full advantage of the bandwidth of the millimeter band. Simulation results show that the proposed scheme converges rapidly, keeps signal to interference plus noise ratio (SINR) in a high range and achieves excellent throughput performance."}, "conf/im/Yang0FZ0Q19": {"title": "A Deep Reinforcement Learning based Mechanism for Cell Outage Compensation in 5G UDN.", "url": "https://ieeexplore.ieee.org/document/8717820", "year": "2019", "author": {"Xiao Yang": "57/3385", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Ultra Dense Networks (UDN) have become one of the key technologies for 5G wireless communications, which can meet the requirements of high-traffic, high-density wireless terminal access. Compared with LTE, there are a large number of heterogeneous cells in UDN. If a failure occurs and can't be alleviated its effect in time, it will lead to a significant drop in network performance. Therefore, the cell outage compensation (COC) problem in the UDN is very important. Although deep reinforcement learning (DRL) has been applied to many scenarios related to the self-organizing network (SON), there are fewer applications for cell outage compensation. In this paper, aiming at the cell outage scenario in the UDN with the goal of maximizing the sum of the throughput of all users while meeting service quality demands of each mobile user, and present a framework based on DRL to solve it. Specifically, we first allocate compensation users to adjacent BSs by using the K-means clustering algorithm, then apply a deep neural network (DNN) to approximate action-value function. The simulation results show that the algorithm converges quickly and tends to be stable, and reach 99.53% of the maximum throughput. It verifies the efficiency of the DRL-based framework and its effectiveness in meeting the requirement of user rates and handling cell interrupt compensation."}, "conf/im/Wu00Z0Q19": {"title": "3D Aerial Base Station Position Planning based on Deep Q-Network for Capacity Enhancement.", "url": "https://ieeexplore.ieee.org/document/8717805", "year": "2019", "author": {"Jiahui Wu": "34/7232", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:When the existing traditional terrestrial base station is insufficient to meet the sudden traffic demand or is not available, deploying the aerial base station(aerial-BS) is a fast and effective solution for achieving network capacity enhancement. How to plan the best 3D location of the aerial-BS according to the user's business needs and service scenarios is a key issue to be solved. At present, the conventional optimization algorithms that solve this problem have high time complexity and it is difficult to utilize experience. However, applying the deep reinforcement learning model can quickly get an optimal solution by historical experience feedback training. Therefore, it is suitable for solving the optimal 3D location planning problem of the aerial-BS. In this paper, firstly, aiming at the maximum spectral efficiency of the system, considering the effects of line-of-sight and non-line-of-sight path loss, a mathematical optimization model for the location planning of the aerial-BS is proposed. For this model, the model definition and training process of deep Q-Network are constructed, and through the large-scale pre-learning experience of different user layouts in the training process to gain experience, improve the timeliness of the training process. The simulation results show that the proposed method can achieve the spectral efficiency of more than 91% of the theoretical maximum spectral efficiency, which has lower time complexity than traditional genetic algorithms (such as hill climbing algorithm and simulated annealing algorithm)."}, "conf/iwcmc/GuoWSYY0019": {"title": "A Deep Reinforcement Learning based Mechanism for Cell Outage Compensation in Massive IoT Environments.", "url": "https://doi.org/10.1109/IWCMC.2019.8766654", "year": "2019", "author": {"Jianli Guo": "37/1737", "Zhihao Wang": "52/253", "Xiujuan Shi": "203/5961", "Xiao Yang": "57/3385", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:As one of the key technologies of 5G, massive IoT environments provide the ubiquitous IoT services. Compared with 4G, its structure is more complex, and it has a large number of deployed nodes. If a failure occurs and can't be alleviated its effect in time, it will lead to a significant drop in network performance. Therefore, the cell outage compensation (COC) problem in massive IoT environments is very important. Although deep reinforcement learning (DRL) has been applied to many scenarios related to the self-organizing network (SON), there are fewer applications for cell outage compensation. In this paper, aiming at the cell outage scenario in massive IoT environments with the goal of maximizing the connectivity of base stations while meeting service quality demands of each compensation user, we present a framework based on DRL to solve it. Specifically, we first allocate compensation users to adjacent BSs by using the K-means clustering algorithm, then use DQN to find the antenna downtilt and the power allocated to compensation users. The simulation result shows that the algorithm converges quickly and tends to be stable, and reach 95% of the maximum target value. It verifies the efficiency of the DRL-based framework and its effectiveness in meeting user requirements and handling cell outage compensation."}, "conf/iwcmc/YangZFYLO19": {"title": "Dynamic Spectrum Allocation with Priority for Different Services in Cognitive-Radio-based Neighborhood Area Network for Smart Grid.", "url": "https://doi.org/10.1109/IWCMC.2019.8766586", "year": "2019", "author": {"Kepeng Yang": "245/4771", "Yueqi Zi": "245/4642", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Qinghai Ou": "120/7211"}, "abstract": " Abstract:As an effective way of utilizing spectrum resources, the application of cognitive radio technology in smart grid has been widely studied, especially in the wireless Neighborhood Area Networks(NAN). The traditional static allocation method does not consider the dynamic changes of the spectrum environment, and cannot effectively utilize the spectrum resources. This paper proposes a dynamic spectrum allocation method in the NAN scenario, to ensure that spectrum resources can be fully allocated and utilized under the constraints of the different requirements for quality of services (QOS). Firstly, a service arrival model is established considering the uncertainty of the arrival of the primary user (PU), so that the number of reserved channels can be dynamically determined based on this arrival probability model. Secondly, we propose a novel dynamic spectrum allocation method using spectrum reservation to improve the reliability of some services by sacrificing the real time of other services. Finally, the optimal number of leased channels can be determined by the stationary distribution in Markov model we proposed, in which we use blocking rate and dropping as the indicators. Numerical results show that the proposed dynamic spectrum allocation method is superior to comparison method, and some meaningful conclusions are drawn after the observation of our experiments and simulations."}, "conf/iwcmc/GuoHSWYFL19": {"title": "3D Aerial Vehicle Base Station (UAV-BS) Position Planning based on Deep Q-Learning for Capacity Enhancement of Users With Different QoS Requirements.", "url": "https://doi.org/10.1109/IWCMC.2019.8766625", "year": "2019", "author": {"Jianli Guo": "37/1737", "Yonghua Huo": "189/8253", "Xiujuan Shi": "203/5961", "Jiahui Wu": "34/7232", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:With the development of modern network, the demand of users has increased dramatically, and more data and services are required. This has caused tremendous pressure on the Macro-cellular network of infrastructure. Air access has become a new solution for the development of communications. Unmanned aerial vehicle (UAV) is used as an air node to improve coverage and capacity. Based on deep Q-Network (DQN) algorithm and considering the different quality of service requirements of different users, this paper proposes an optimal 3D location planning algorithm. The results show that the use of multiple UAVs can not only provide capacity enhancement, but also meet the different QoS requirements of different users. The average spectral efficiency of the system is increased by 15.5%, and user coverage to meet QoS requirements increased by 25.5%."}, "conf/iwcmc/YuLZLYFLQ19": {"title": "Data Mining and Statistical Analysis on Smart City Services Based on 5G Network.", "url": "https://doi.org/10.1109/IWCMC.2019.8766454", "year": "2019", "author": {"Lei Yu": "01/2775", "Qiang Lv": "62/6355", "Yonghao Zhang": "77/9742", "Hao Li": "17/5705", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Mobile edge computing in 5G network is emerging as a very promising computation architecture by pushing computation and storage closer to end users with both strategically deployed and opportunistic processing and storage resources. Baidu cloud provides network services which can be deployed in 5G network recently. The network services such as weather forecast service and city road map service are typical applications for smart city. We analysis Baidu website data in this paper by our data mining method and related software. Clustering, outlier detection, prediction, and statistical methods are used to evaluate these smart city services, and the analysis result give suggestions to improve design and development of our 5G services (API website)."}, "conf/smartcloud/LinFLZO19": {"title": "Stochastic Joint Bandwidth and Computational Allocation for Multi-Users and Multi-Edge-Servers in 5G D-RANs.", "url": "https://doi.org/10.1109/SmartCloud.2019.00021", "year": "2019", "author": {"Yingxin Lin": "255/6619", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Fanqin Zhou": "137/4178", "Qinghai Ou": "120/7211"}, "abstract": " Abstract:Mobile-edge computing (MEC) is now regarded as a promising paradigm for cellular networks, which aims at decreasing end-to-end delay and improving the quality of services. This article innovatively envisions a MEC offloading model for multi-users and collaborative MEC servers for 5G DRANs, where the tasks can be exchanged feasibly between MEC base stations. Firstly, we formulate the joint computational and radio resource management problem to minimize the power consumption of collaborative MEC servers and terminals, which takes into account the constraint of the task buffer stability. And then, an online Lyapunov optimization method is proposed to solve it to get a trade-off between the average weighted power consumption and the execution delay for all tasks distributed in MEC-enabled 5G D-RANs. The numerical results demonstrate that the proposed method has lower power consumption compared with the non-collaborative case. The reason is that the tasks are more reasonably allocated to each collaborative MEC servers with the acceptable execution delay. The control parameter V and collaboration impact factors in the online algorithm are also proved to be efficient and practical to balance the power consumption and execution delay for MEC-enabled 5G D-RANs."}, "conf/globecom/ChaiFZZYL18": {"title": "Energy-Efficient Resource Allocation Based on Hypergraph 3D Matching for D2D-Assisted mMTC Networks.", "url": "https://doi.org/10.1109/GLOCOM.2018.8647400", "year": "2018", "author": {"Jinlong Chai": "236/2897", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Pan Zhao 0002": "61/3903-2", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Energy efficiency is essential for massive machine-type communication (mMTC), because of the limited energy in internet of things (IoT) devices. We consider a two-hop amplify-and-forward (AF) relay communication, and allow IoT devices with inferior channel conditions to connect relays by using device-to-device (D2D) technology. This paper proposes to jointly optimize relay selection, channel allocation and power control, so that the total energy efficiency is maximized while guaranteeing the signal to interference plus noise ratio (SINR) requirements of relays and BSs. The formulated joint optimization problem involves a nonlinear fractional programming (NFP) problem and a user-relay-channel matching problem which is NP-hard. Therefore, we propose a two-stage approach composed of the Dinkelbach method and a hypergraph-based 3D matching (HGM). Simulation results show that the total energy efficiency under the HGM is 8.41% and 59.85% higher than the iterative Hungarian method (IHM) and the minimum zero surface prioritized allocation (MZPA), respectively."}, "conf/icc/CaoRZ0F0XQ18": {"title": "Capacity Enhancement for mmWave Multi-Beam Satellite-Terrestrial Backhaul via Beam Sharing.", "url": "https://doi.org/10.1109/ICC.2018.8423030", "year": "2018", "author": {"Qiang Cao": "77/6336", "Humphrey Rutagemwa": "51/1481", "Fanqin Zhou": "137/4178", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Ao Xiong": "119/8978", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:The satellite is a primary means for providing emergency communication backhaul in disaster areas, where large bandwidth is demanded to support communication services in a wide affected area. Millimeter-wave (mmWave) communication with sufficient spectral resources promises significant enhancement to satellite-terrestrial link capacity. However, the alignment delay and mutual interference caused by directional communications with narrow beams severely limit the capacity of mmWave communication. To this end, we optimize the beamwidth to reduce the impact of beam alignment overhead on capacity. Then, considering the multi-user interference between beams, we propose a transmission scheduling scheme based on beam sharing, namely users with strong mutual interference when served simultaneously by independent beams, share the same beam. A heuristic algorithm is proposed to derive the groups of users sharing beams, and their beamwidth. Simulation results show that the proposed scheme achieves considerable capacity enhancement compared to the one-to-one beam occupation scheme (OB) and fixed beam scheme (FB), thus improving the spectrum efficiency of mmWave satellite-terrestrial communication."}, "conf/noms/ChengFZLYQW18": {"title": "Uplink resource allocation for trade-off between throughput and fairness in C-RAN-based neighborhood area network.", "url": "https://doi.org/10.1109/NOMS.2018.8406296", "year": "2018", "author": {"Xiao Cheng": "73/1713", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1", "Xuesong Qiu 0001": "13/342", "Lei Wei": "99/4916"}, "abstract": " Abstract:Wireless-based neighborhood area network (NAN) plays an increasingly important role in smart grid (SG) since the rapidly emerging smart services and rising number of terminals in grid put forward higher demand for NAN. Considering the differential business demands in NAN, we focus on the wirelessly uplink resource allocation, which allows a trade-off between network throughput and service fairness. For more flexible and coordinated allocation, this paper introduces the cloud-radio access network infrastructure into NAN with orthogonal frequency division multiplexing passive optical network (OFDM-PON) as the fronthaul link, and proposes a corresponding uplink resource allocation method that balances the network throughput and allocation fairness. By utilizing a hybrid intelligent optimization algorithm, composed by adaptive genetic algorithm and binary particle swarm optimization, the optimal throughput-fairness trade-off solution can be obtained with a good convergence ability. Simulation results demonstrate the advantages of our proposed method in both improving network throughput and achieving the trade-off between throughput and fairness."}, "conf/noms/DongYLF0CS18": {"title": "A service routing reconstruction approach in cyber-physical power system based on risk balance.", "url": "https://doi.org/10.1109/NOMS.2018.8406294", "year": "2018", "author": {"Ouzhou Dong": "222/7767", "Peng Yu 0001": "50/2599-1", "Huiyong Liu": "122/0727", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Fang Chen": "52/488", "Lei Shi 0008": "29/563-8"}, "abstract": " Abstract:In cyber-physical power system (CPPS), the communication transmission links carry key services. However, some existing routing approaches cause service routes to be too centralized in the links, which leads to increase the risk of service and network. In order to reduce the risk impact of communication transmission links interruption on the service, this paper proposes a service routing reconstruction approach based on risk balance. Firstly, we analyze the risk transmission of cross-space in CPPS. Then this paper establishes a risk assessment model by characterizing the node risks with the station load pressure, expressing the link risks with the service average communication delay and the service risk balance degree. Further, the improved genetic algorithm is adopted to solve the service routing reconstruction. Finally, based on part of power grid topology from a Chinese province, the simulation results show that the proposed approach can find a route allocation scheme with lower risk value than the original Dijkstra algorithm and genetic algorithm using \"roulette wheel\" selection strategy, as well as ensuring the stable operation of the power system."}, "conf/noms/LiuX0FLQW18": {"title": "Energy-saving management mechanism based on hybrid energy supplies in multi-operator shared LTE networks.", "url": "https://doi.org/10.1109/NOMS.2018.8406216", "year": "2018", "author": {"Lu Liu": "31/2088", "Ao Xiong": "119/8978", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Mingxiong Wang": "189/8210"}, "abstract": " Abstract:Recently, a new opportunity for on-grid energy saving is enabled by the green network infrastructure sharing. This paper mainly investigates the collaboration between multiple operators to improve the energy utilization in this scenario. Then, an energy-saving management mechanism is proposed to reduce energy consumption and optimize energy utilization. We decompose the problem into two sub problems for base station sleeping and green energy allocation. And the BS sleeping algorithm and the green energy centralized allocation algorithm are respectively proposed to solve them. Comparing with other mechanisms, simulation results show that the proposed energy-saving management mechanism can effectively reduce 65% on-grid energy consumption while guaranteeing the quality of service (QoS) to the user equipment device (UE)."}, "conf/noms/ZhaoFC0YQW18": {"title": "Spectrum allocation with differential pricing and admission in cognitive-radio-based neighborhood area network for smart grid.", "url": "https://doi.org/10.1109/NOMS.2018.8406178", "year": "2018", "author": {"Xueyao Zhao": "222/7807", "Lei Feng 0001": "76/847-1", "Xiao Cheng": "73/1713", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1", "Xuesong Qiu 0001": "13/342", "Lei Wei": "99/4916"}, "abstract": " Abstract:Cognitive-radio-based smart grid networks have been studied recently as an efficient way to overcome radio spectrum shortages, especially in wireless Neighborhood Area Network (NAN). In this paper, we propose the optimal spectrum allocation strategy of cognitive radio NAN Gateway (NGW), which also acts as a spectrum collector by radio sensing and leasing from the providers for a fee. Since the service terminals in grid are heterogeneous based on different QoS requirements and willingness to pay, this paper uses differential pricing and admission control for different terminals to improve the benefits of NGW. The decision-making process for spectrum collection and allocation is modeled as a 4-stage Stackelberg gaming, where the optimal decision of radio sensing, spectrum leasing, admission control and differential pricing are deducted through a reverse derivation. A novel corresponding algorithm is also given to solve these optimal solutions efficiently. The numerical results verify the theoretical work sufficiently, meanwhile some obvious meaningful conclusions are drawn from the observation of numerical experiments."}, "conf/cnsm/GuoZF0017": {"title": "User association for load balancing in cellular network with hybrid cognitive radio relays.", "url": "https://doi.org/10.23919/CNSM.2017.8256007", "year": "2017", "author": {"Hongfu Guo": "132/6132", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Hybrid cognitive radio (CR) relays serve cellular users in a two-hop fashion, which jointly utilize both licensed and unlicensed radio spectrums to significantly increase the system capacity. User equipments (UEs) need to be actively associated with the macro-cell BS or CR relays having a more lightly loaded spectrum if the quality of services (QoS) can be guaranteed. To this end, this paper investigates optimal user association for load balancing problem in cellular network with hybrid cognitive radio relays. Firstly, we propose a multi-objective user association optimization model to balance the loads among different tiers while reducing the total resource occupancy. Then, this multiobjective problem is converted into a single one by the linear weighing-sum method and a genetic algorithm is introduced to solve it. The numerical simulation results show that our proposed scheme can obtain more balanced resources occupation, better throughput performance, and lower blocking rate compared with the heuristic and max-power strategies."}, "conf/cse/ZhuangFYL17": {"title": "Uplink Resource Scheduling for Power Wireless Private Network Based on NB-IoT and LTE Hybrid Transmission.", "url": "https://doi.org/10.1109/CSE-EUC.2017.199", "year": "2017", "author": {"Zhijun Zhuang": "204/8258", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Due to the lack of spectrum resource of power wireless private network, it is difficult to guarantee the transmission for the services in the distribution network. In order to enhance the network resource utilization, this paper puts forward a method for the uplink resource scheduling of power wireless private network based on NB-IoT and LTE hybrid transmission. Firstly, through the cognizing for uplink interference among multi-cells, a novel NB-IoT and LTE hybrid transmission strategy is established. Afterwards, an uplink resource scheduling model is designed for the multi-services in distribution network. The target of this model is to sufficiently utilizing the uplink Resources Blocks (RBs) by making use of the in-band deployment mode of NB-IoT for LTE private power network. Finally, an improved artificial fish swarm algorithm is proposed for resolving this problem. The simulation result shows the novel strategy can take full advantage of the small-scale uplink scheduling of NB-IoT so that the overall resource utilization of the network can be improved efficiently. In addition, the proposed improved artificial fish swarm algorithm is also verified to have a better convergence performance."}, "conf/globecom/ZhangZF00RR17": {"title": "Capacity Enhancement for Next Generation Mobile Networks Using mmWave Aerial Base Station.", "url": "https://doi.org/10.1109/GLOCOM.2017.8254734", "year": "2017", "author": {"Tao Zhang": "15/4777", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Bo Rong": "68/3369", "Humphrey Rutagemwa": "51/1481"}, "abstract": " Abstract:The increasing traffic puts high demands on capacity for the next generation mobile networks. The millimeter-Wave (mmWave) communication system offers new opportunities to meet this requirement due to the tremendous amount of avail- able spectrum. However, the massive non-line-of-sight (NLOS) transmissions and the site constraints in urban environment are severely challenging the conventional way of deploying terrestrial low power nodes (LPNs). To address these problems, we introduce the mmWave aerial base station (mAeBS) in next generation mobile networks, which can be quickly and flexibly deployed to enhance the capacity in data traffic bursting areas. To maximize the enhancing effects, an ergodic capacity analytical model of mAeBS is proposed, considering both user distribution and environment conditions. Then an mAeBS 3D placement method based on the model is given. Simulation results show that the proposed method can achieve considerable capacity enhancement and supplement regional coverage as well."}, "conf/im/ZhangFYGLQ17": {"title": "A handover statistics based approach for Cell Outage Detection in self-organized Heterogeneous Networks.", "url": "https://doi.org/10.23919/INM.2017.7987346", "year": "2017", "author": {"Tao Zhang": "15/4777", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Shaoyong Guo": "150/6843", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Recently, densified small cell deployment with overlay coverage through Heterogeneous Networks (HetNets) has emerged as a viable solution for 5G mobile networks. Cell Outage Detection (COD) which is the essential functionality in Self-Organizing Network (SON) is designed to autonomously deal with unexpected faults. Typical methods for detecting cell outage are usually based on Manual Drive Tests (MDT). However, it is difficult to detect small cell outage by MDT measurements in HetNets, because the User Equipment (UE) served by these small cells can switch to the macro cell and keep the Reference Signal Received Power (RSRP) and Signal to Interference plus Noise Ratio (SINR) values normal. To resolve this issue, we propose a COD architecture based on the handover statistics. Our model concentrates on cell outage detection in a two-tier heterogeneous network. We process sequential handover statistics spatially and temporally in conjunction with data mining methods. Also, an improved LOF algorithm (M-LOF) is proposed to enhance the detection performance based on handover statistics. To evaluate the system performance, a set of tests has been carried out using some reasonable assumptions and network simulator we designed. The results of simulation show that our system is more effective to detect cell outage in comparison to the architecture using MDT measurements."}, "conf/smartgridcomm/SunF00QM17": {"title": "A Game-based Admission Control in smart grid neighborhood area network Supporting Multi-services.", "url": "https://doi.org/10.1109/SmartGridComm.2017.8340666", "year": "2017", "author": {"Jialu Sun": "179/1695", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": " Abstract:Wireless-based Neighborhood Area Network (NAN) plays an important role in Smart Grid Communication Network (SGCN) with its wide coverage, flexible deployment and low cost. As the increasing demand for large amount data transmitting and massive devices accessing, wireless NAN is facing with the congestion problem. In this paper, we propose a Game Theory-based Admission Control Scheme for Supporting Multi-services to prevent NAN congestion. Firstly, a multi-sources NAN traffic model based on self-similarity are established so that the guaranteed bandwidth for different type of services can be obtained. Secondly, we propose a dynamic spectrum resources allocation model to obtain optimal bandwidth assignment among multi-services which is solved by the non-cooperative gaming. Finally, through using the optimally allocated bandwidth as the threshold, we develop a novel admission control scheme orienting the multi-services access in NAN. Numerical results show that the proposed admission control scheme is superior to others in the utilization of spectrum resources and throughput, which is more appropriate for wireless NAN."}, "conf/vtc/SunF00QM17": {"title": "Preventing Congestion by Selective Admission Control in LTE-Based Public Safety Network.", "url": "https://doi.org/10.1109/VTCSpring.2017.8108510", "year": "2017", "author": {"Jialu Sun": "179/1695", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": " Abstract:LTE-based Public Safety Network (PSN) is a wireless communication network which can provide efficient and reliable communication in disasters or emergencies for disaster relief and public protection. Therefore, ensuring that network congestion will not happen in PSN during an emergency is becoming increasingly important. LTE-based PSN is easy to be congested because part of spectrum resources is compressed to guarantee priority requirements of public safety users. In this paper, we develop a new method namely Selective Admission Control (SAC) mechanism to manage the radio bearers access to the commercial radio for Public Safety (PS) in LTE-based PSN. In the case of emergency, we select the traffic bearer with minimum estimated load increment accessing to the LTE-based PSN. The channel quality of new bearers should be taken into account, which means that in congestion, users who arrive earlier with poor channel quality will be rejected to reserve sufficient resources for users who arrive later with good channel quality. The simulation results show that the SAC mechanism can improve throughput by 36% and lower the rejection rate by 73% at most than reference method based on non-selective access control model, as a result effectively avoiding the network congestion and improving the utilization of spectrum resources for public safety communication."}, "conf/vtc/Zhao0F0Q17": {"title": "Gain-Aware Joint Uplink-Downlink Resource Allocation for Device-to-Device Communications.", "url": "https://doi.org/10.1109/VTCSpring.2017.8108531", "year": "2017", "author": {"Pan Zhao 0002": "61/3903-2", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:This paper proposes a novel Gain-Aware Uplink-Downlink(GAUD) jointly resource allocation scheme to maximize the Device-to-Device(D2D) throughput while guaranteeing Quality of Service (QoS) of cellular users. We formulate the global optimization problem as a mixed integer nonlinear programming problem and decompose it into three sub-problems. Firstly, a method of jointly uplink and downlink reuse mode selection is proposed. Based on the throughout gain, each D2D pair is appropriately assigned by either downlink or uplink frequency resource to reuse. Then a heuristic scheduling is designed for fairness channel allocation in order to form D2D users as much as possible. At last, the Lagrangian dual algorithm is developed to solve the optimal power allocation. The simulation results show that our proposed jointly downlink-uplink resource reusing scheme can make the system throughput increased by about 35% and 50% higher than the scheme based on Only Downlink and Only Uplink resource reusing."}, "conf/apnoms/LiFYYL16": {"title": "Performance analysis of indoor-outdoor wireless caching relay system.", "url": "https://doi.org/10.1109/APNOMS.2016.7737273", "year": "2016", "author": {"Ying Li": "22/1805", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Yang Yang 0006": "48/450-6", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:This paper proposes a novel indoor-outdoor caching relay system (CRS) and develops the corresponding caching mechanism, which can improve the utilization of wireless resources. It operates in two phases periodically. In Phase I, spectrum resources of the established links between MBS and user equipment (UE) are extracted to support data caching. In Phase II, caching relay system can directly serve indoor users and the fronthaul resources are released to serve other users. Simulations verify that compared with the conventional relay system (RS) the proposed CRS can improve the system throughput by at most 142% in the reusable data caching cases, only at the cost of temporarily suppressing the traffic rate to establish caching links."}, "conf/cnsm/ZhaoYJFL16": {"title": "A routing optimization method based on risk prediction for communication services in smart grid.", "url": "https://doi.org/10.1109/CNSM.2016.7818451", "year": "2016", "author": {"Puyuan Zhao": "193/6428", "Peng Yu 0001": "50/2599-1", "Chenchen Ji": "193/6434", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:As power communication network is more and more important in smart grid, to decrease the failure risk of power system caused by the interruption of communication service, this paper propose a novel routing optimization method based on risk predication for communication services. Firstly, we analyze the probability of failure of communication link and node which is induced by external factors, like winds and snows, equipment failures, and etc. Then based on importance of services, links and nodes, we calculate the risk of failure of communication link and node. Further, we propose three service risk indicators and corresponding improved Dijkstra algorithms to optimize service routing, thus to decrease the network failure probability. Finally, based on part of power grid topology structure from a Chinese province, the simulation results show that the service risk o and the risk of the whole network are also reduced."}, "conf/iscit/LiYYFQ16": {"title": "Automated cell outage compensation mechanism based on downtilt adjustments in cellular networks.", "url": "https://doi.org/10.1109/ISCIT.2016.7751580", "year": "2016", "author": {"Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1", "Mengjun Yin": "152/1083", "Lei Feng 0001": "76/847-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:To solve abnormal coverage problems in cellular networks caused by some internal or external failures without power control, an automated Cell Outage Compensation (COC) scheme based on antenna downtilt adjustment of Base Stations (BSs) is proposed. We firstly give the self-organized processes for COC, then use an algorithm named Autonomic Downtilt Adjustment Particle Swarm Algorithm (ADAPSA) to resolve it. In the algorithm, we construct coverage compensation as a multi-objective non-linear optimization problem, and then use a particle swarm algorithm to resolve it. Simulations are done under LTE networks with directional antennas in each eNodeB. Results show that coverage of the outage area can be compensated effectively and the regional service quality can be maintained meanwhile."}, "conf/iscit/LiZFYL16": {"title": "Energy efficient device-to-device clustering method in wireless communication network.", "url": "https://doi.org/10.1109/ISCIT.2016.7751590", "year": "2016", "author": {"Ying Li": "22/1805", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:This paper focuses on D2D clustering communication method in the uplink and downlink aiming at saving energy of Mobile Terminals (MTs). The method contains MTs clustering method and cluster head selection methods. The MTs clustering method is based on the distance information of MTs. The cluster head selection method is based on the energy consumption or the residual energy of MTs. And Quality of Service (QoS) is also taken into consideration and evaluated in the simulation. Simulation results verify that compared with non-collaborative case, the proposed methods can save energy by approximately 70% and 48% in the uplink and downlink respectively. Additionally, compared with cluster head selection method based on energy consumption, the method based on MTs residual energy can significantly decrease the number of MTs out of charge during the initial and middle period of the D2D clustering communication."}, "conf/wpmc/ZhaoFYLQ16": {"title": "Resource allocation for energy-efficient device-to-device multicast communication.", "url": "https://ieeexplore.ieee.org/document/7954533", "year": "2016", "author": {"Pan Zhao 0002": "61/3903-2", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Device to Device (D2D) multicast communication is an effective method for local transmission. In this paper, a joint power and resource allocations scheme is proposed to maximize the number of accessed D2D groups while minimizing the total terminal transmission power for D2D underlay multicast communication. Since the derived optimization is a mixed integer nonlinear programming problem with high computational complexity, we divide it into two sub-problems. Then the proposed scheme is composed of two phases. In Phase 1, power allocation scheme for each D2D group and each cellular user (CU) is solved with geometric programming method. In Phase 11, a minimum weighted bipartite graph matching method is applied to produce optimal resource allocation scheme for admitted users and D2D groups. Simulation shows our scheme obtains more users and less energy consumption."}, "conf/im/ZhouFYL15": {"title": "A load balancing method in downlink LTE network based on load vector minimization.", "url": "https://doi.org/10.1109/INM.2015.7140332", "year": "2015", "author": {"Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Load balancing is one of the key target of LTE Self-Optimization Network (SON). In this paper, we propose a load balancing method for LTE downlink network, namely Load Vector Minimization based Load Balancing (LVMLB) method. Load Vector (LV) is a vector whose elements are the load values of cells and sorted in descending order. The order of LVs is defined by the lexicographical order. The smaller the LV is, the higher the balance degree of cells load will be. As the LV has a lower bound with total load fixed, the balance degree of cells load would reach a local optimal. On this basis, we design the LVMLB algorithm, trying to get the optimal solutions to load balancing problems, the proof of being optimal will also be given in this paper. Simulation scenarios are set in a square part of Macro-Pico mixed HetNets. Simulation results show that LVMLB outperforms the Cell Region Expansion (or Bias) scheme, increasing the capacities of Macro and Pico tiers at the same time, and improving balance degree of cells load, only sacrificing a little QoS performance."}, "conf/im/XiangLFZY15": {"title": "Topology-aware based energy-saving mechanism in wireless cellular networks.", "url": "https://doi.org/10.1109/INM.2015.7140334", "year": "2015", "author": {"Nan Xiang": "59/9555", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Peng Yu 0001": "50/2599-1"}, "abstract": " Abstract:Reducing the energy consumption (EC) of base station (BS) is one of the major concerns in wireless cellular networks. Additionally, turning off some underutilized BSs during off-peak period and performing effective compensation without delay are the most efficient way to save energy. However, large-scale energy conservation yet remains to be investigated at macro level. In this paper, to solve the problem that long convergence time and poor convergence precision in the large-scale network, we propose a BS topology-aware based energy-saving (ES) model, whose core is cell adjacency graph (CAG) with vertexes and links representing eNodeBs (eNBs) and their neighboring relationship. In addition, we introduce new metrics, predicted energy efficiency (PEE) and quality of compensation (QoC), as the weights of nodes and links respectively. Consequently, the model transforms the ES problem into average weights maximization in CAG. In view of the model presented, centralized and hybrid algorithms are put forward to solve the problem. Compared with classic distributed algorithm, simulation results claim that our hybrid approach achieves the maximization of ES with guaranteed QoC while our centralized approach maximize the PEE."}, "conf/wcnc/ZhouFYL15": {"title": "Energy-efficiency driven load balancing strategy in LTE-WiFi interworking heterogeneous networks.", "url": "https://doi.org/10.1109/WCNCW.2015.7122567", "year": "2015", "author": {"Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Green communication has been a hot issue with the energy consumption of ICT industry continuously growing. To achieve the goal of energy saving, base station sleep schemes are extensively investigated; however, they are hard to implement in actual commercial network for the risk of losing of users. So in this paper, we try another way to improve the energy efficiency of LTE network by interworking with low energy consuming WiFi networks. Firstly the characteristics of the resource assignment in LTE and WiFi network are analyzed. The energy efficiency of eNodeBs and the degree of user satisfaction are defined as the optimization objections of the load balancing between LTE and WiFi networks. Then it introduces the edge users' handover requirements needed to be satisfied during the load balancing process. Following these conditions, the detailed load balancing algorithm is designed based on the adjustment of signal quality offset. The final simulation experiment verifies that the proposed load balancing algorithm can effectively balance the resources utilization in the LTE and WiFi interworking networks and the energy efficiency of eNodeBs can be improved by 13.11% compared with the case before load balancing with guaranteed user satisfaction."}, "conf/apnoms/WenLFYY14": {"title": "An energy-saving mechanism for mobile terminals based on LTE-A uplink CoMP.", "url": "https://doi.org/10.1109/APNOMS.2014.6996554", "year": "2014", "author": {"Bin Wen": "30/3", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Yang Yang 0006": "48/450-6"}, "abstract": " Abstract:The current power consumption of intelligent terminals are over burden for their battery capacities, which directly restrict the hours used. In order to realize the energy saving of terminals in the LTE-A system, this paper puts forward the concept of virtual cells and a related uplink energy saving mechanism. Virtual Cell's resources and the outage probability of terminals are proposed by this mechanism as constraint conditions. The first step is sectioning off energy saving area in virtual cell. Secondly, we use the uplink CoMP (Coordinated Multiple Points Transmission/Reception) technology to provide diversity gain for the terminals of energy saving area. The third step depends on uplink power control which could adjust the mobile terminals' transmission power for energy saving. The simulation results show that the energy consumption of total terminals will decrease nearly 50% in the virtual cell while its capacity is lower than the 50% of maximum."}, "conf/wpmc/FengYXLQ14": {"title": "Load-balancing based on Base-Station CoMP with guaranteed call blocking rate.", "url": "https://doi.org/10.1109/WPMC.2014.7014829", "year": "2014", "author": {"Lei Feng 0001": "76/847-1", "Mengjun Yin": "152/1083", "Nan Xiang": "59/9555", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:As a major part of wireless network optimization, load balancing can make the BS's resource utilization more reasonable. This paper proposes a load-balancing strategy based on Coordinated Multiple Points (CoMP) transmission/reception among the Base Stations (BS). To use universally, different patterns of load-balancing based on CoMP are modeled and discussed. We define call blocking rate as the QoS metric to be guaranteed during load balancing process. The capacity of load-balancing and call blocking rate with different load-balancing patterns based on CoMP are evaluated and analyzed in an area with a moderate dense distribution of high-loaded BSs. The analysis on the numerical results give the proper load balancing pattern based on CoMP with guaranteed call blocking rate."}, "conf/apnoms/ZhouFYL13": {"title": "A ripple form RSRP based algorithm for load balancing in downlink LTE self-optimizing network.", "url": "https://ieeexplore.ieee.org/document/6665230/", "year": "2013", "author": {"Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:In this paper we present an autonomous load balancing algorithm for downlink LTE network, the ripple form reference signal received power based load balancing algorithm (RF-RSRPBLBA), which mainly requires the reference signal received power (RSRP) and cell load information. In RF-RSRPBLBA, overloaded cells distribute their surplus load in a greedy manner. As a general character of greedy algorithm, its solution is not necessarily the optimum one. However, simulation results show that RF-RSRPBLBA performs better than handover offset based load balancing algorithm (HOOBLBA), a typical greedy algorithm for load balancing from use case suggested by EU FP7 SOCRATES project [1], when handling certain types of hotspots. Under normal conditions both performance close."}, "conf/im/fengLQ13": {"title": "A novel self-organized optimization for wireless network nodes CAC mechanism.", "url": "https://ieeexplore.ieee.org/document/6573094/", "year": "2013", "author": {"Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the purpose of promoting the network access capacity, it starts with the self-similarity of the wireless network service and then analyzes the relationship among the hurst parameters, the service bandwidth and QoS indicators mathematically. On the basis of the analysis conclusion, a novel self-optimized call admission control mechanism is proposed in order to reduce the bandwidth utilization. And the novel mechanism is achieved and simulated. The results of simulation give the performance comparisons between the novel and traditional CAC in terms of call rejection probability and bandwidth utilization of the aggregated traffic."}, "journals/cn/GaoFYZWQLZ22": {"title": "Resource consumption and security-aware multi-tenant service function chain deployment based on hypergraph matching.", "url": "https://doi.org/10.1016/j.comnet.2022.109298", "year": "2022", "author": {"Jing Gao": "67/4834", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Fanqin Zhou": "137/4178", "Zihao Wu": "185/2651", "Xuesong Qiu 0001": "13/342", "Jingchun Li": "162/6631", "Yifei Zhu": "174/2169"}, "abstract": "Network function virtualization (NFV) technology enables cloud service providers (CSPs) to deploy their service function chains (SFCs) into the common shared physical infrastructures to operate the network or cloud service. However, designing a suitable placement scheme for multi-tenant SFCs to balance resource consumption with performance and security is a tricky issue. In this paper, we first proposed security constraints based on physical isolation and formulated the problem of reasonably placing multi-tenant SFCs subject to multiple constraints to minimize resource consumption. The proposed problem is more intractable than previous works because of the extra introduced security constraints. To solve it, a new non-uniform weighted hypergraph construction approach is proposed by defining hyperedge weights to represent the resource consumption on one SFC. A hypergraph matching algorithm is proposed to find the maximum weight subset of hypergraphs whose vertices do not intersect to give a high degree of physical isolation by dealing with the conflict graphs. Simulation results show that the proposed hypergraph matching algorithm outperforms the comparison schemes in terms of the resource consumption while satisfying the security requirements."}, "journals/iotj/ZhouFYLQM22": {"title": "DRL-Based Low-Latency Content Delivery for 6G Massive Vehicular IoT.", "url": "https://doi.org/10.1109/JIOT.2021.3064874", "year": "2022", "author": {"Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xiaoyu Que": "268/8984", "Luoming Meng": "52/382"}, "abstract": " Abstract:Vehicle-to-everything communication is an indispensable component of 6G networks that could help to facilitate future transportation systems. However, massive vehicles and unstable vehicle-to-vehicle (V2V) links may become bottlenecks for the low-latency delivery of contents, such as safety-critical emergency messages and multimedia. Instead of resolving the problem in a centralized way, we propose a massive vehicular Internet-of-Things system and investigate the approach that would enable each vehicle to decide the transmission mode from three modes, i.e., vehicle-to-network, vehicle-to-infrastructure and V2V sidelinks, and wireless resources. Specifically, a multiagent deep reinforcement learning (RL) framework is formulated by combining the multiagent RL approach, WoLF-PHC, with the techniques from deep \n QQ \n-learning (DQN) to gain the formulated framework with the capability of capturing the effects of interaction between learning agents and states of complex environment. The framework is set to maximize the throughput of vehicles while maintaining the latency and reliability constraints of the vehicle communication links. However, it could be easily extended to other objectives. The simulation results demonstrate that the proposed approach outperforms the compared ones in total traffic capacity and satisfaction rate of the vehicles in communication."}, "journals/jwe/WangZFLZWL22": {"title": "Multi-granularity Decomposition of Componentized Network Applications Based on Weighted Graph Clustering.", "url": "https://doi.org/10.13052/jwe1540-9589.21312", "year": "2022", "author": {"Ziliang Wang": "60/6743", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Tingting Zhang": "82/5445", "Sheng Wang": "85/1868", "Ying Li": "22/1805"}, "abstract": ""}, "journals/network/FengYGQLY22": {"title": "Two-Layered Blockchain Architecture for Federated Learning Over the Mobile Edge Network.", "url": "https://doi.org/10.1109/MNET.011.2000339", "year": "2022", "author": {"Lei Feng 0001": "76/847-1", "Zhixiang Yang": "148/0993", "Shaoyong Guo": "150/6843", "Xuesong Qiu 0001": "13/342", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1"}, "abstract": " Abstract:Federated learning (FL) is seen as a road toward privacy-preserving distributed artificial intelligence while keeping raw training data on local devices. By leveraging blockchain, this article puts forward a blockchain and FL fusioned framework to manage the security and trust issues when applying FL over mobile edge networks. First, a two-layered architecture is proposed that consists of two types of blockchains: local model update chain (LMUC) assisted by device-to-device (D2D) communication and global model update chain (GMUC) supporting task sharding. The D2D-assisted LMUC is designed to chronologically and efficiently record all of the local model training results, which can help to form long-term reputations of local devices. The GMUC is proposed to provide both security and efficiency by preventing mobile edge computing nodes from malfunctioning and dividing them into logically isolated FL task-specific chains. Then a reputation-learning-based incentive mechanism is introduced to make participating local devices more trustful with a reward implemented by a smart contract. Finally, a case study is given to show that the proposed framework performs well in terms of FL learning accuracy and blockchain time delay."}, "journals/tc/FengZGQLY22": {"title": "BAFL: A Blockchain-Based Asynchronous Federated Learning Framework.", "url": "https://doi.org/10.1109/TC.2021.3072033", "year": "2022", "author": {"Lei Feng 0001": "76/847-1", "Yiqi Zhao": "225/8737", "Shaoyong Guo": "150/6843", "Xuesong Qiu 0001": "13/342", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1"}, "abstract": " Abstract:As an emerging distributed machine learning (ML) method, federated learning (FL) can protect data privacy through collaborative learning of artificial intelligence (AI) models across a large number of devices. However, inefficiency and vulnerability to poisoning attacks have slowed FL performance. Therefore, a blockchain-based asynchronous federated learning (BAFL) framework is proposed to ensure the security and efficiency required by FL. The blockchain ensures that the model data cannot be tampered with while asynchronous learning speeds up global aggregation. A novel entropy weight method is used to evaluate the participating rank and proportion of the local model trained in BAFL of the devices. The energy consumption and local model update efficiency are balanced by adjusting the local training and communication delay and optimizing the block generation rate. The extensive evaluation results show that the proposed BAFL framework has higher efficiency and higher performance for preventing poisoning attacks than other distributed ML methods."}, "journals/tii/ZhouFKYLW22": {"title": "Multiagent RL Aided Task Offloading and Resource Management in Wi-Fi 6 and 5G Coexisting Industrial Wireless Environment.", "url": "https://doi.org/10.1109/TII.2021.3106973", "year": "2022", "author": {"Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Michel Kadoch": "36/2183", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Zhili Wang": "15/2643"}, "abstract": " Abstract:With the emergence of industrial Internet of Things (IIoT), intensive computation workload will be imposed to industrial end units (IEUs). By leveraging mobile edge computing (MEC), the local computational tasks can be offloaded to servers deployed in mobile edge networks with low latency. This article proposes the intelligent cost-and-energy-effective task offloading in the 5G and Wi-Fi 6 coexisting heterogeneous IIoT networks. The novel joint task scheduling and resource allocation approach comprises the following two parts: a Lyapunov optimization-based component to decide local task scheduling and computing power and an online multiagent reinforcement learning component together with a game theory-based algorithm to select offloading link and decide transmit power, respectively. Simulation results demonstrate the proposed approach holds obvious advantage over the compared intuition and cost optimal approaches in the efficiency of making comprehensive decision that improves energy efficiency and cost while controlling task delay in the multi-IEU and multiaccess-node MEC systems."}, "journals/tvt/YangFQZL22": {"title": "Energy- and Quality-Aware Task Offloading for WebVR Service in Terminal-Aided Mobile Edge Network.", "url": "https://doi.org/10.1109/TVT.2022.3173709", "year": "2022", "author": {"Yang Yang": "48/450", "Lei Feng 0001": "76/847-1", "Xiaoyu Que": "268/8984", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Web virtual reality (WebVR) is gaining increasing attention as interactive VR experiences become more prevalent. The high energy consumption and strict quality requirements are still significant challenges for its application in the mobile edge network. In this context, content caching and task offloading are promising solutions to save the energy of WebVR. This paper proposes a hybrid decentralized offloading architecture in which the MEC server and multiple terminals jointly participate in the caching and processing of WebVR tasks. In this framework, the graph convolutional network and unsupervised clustering algorithm are jointly applied to process the WebVR service feature graph to achieve FoV-level content caching. Moreover, WebVR users with idle computing resources assist neighboring users with performing tasks. On this basis, we propose a distributed low-bound-based alternative direction method of multiplier (LADMM) algorithm to optimize the offloading mode and the allocation of tasks and computing power resources to minimize system energy consumption. The proposed offloading mode can lower energy consumption while maintaining a good balance between delay performance and resource utilization."}, "journals/wc/ZhouLYFYZYW22": {"title": "Intelligence-Endogenous Networks: Innovative Network Paradigm for 6G.", "url": "https://doi.org/10.1109/MWC.004.00320", "year": "2022", "author": {"Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Yang Yang 0006": "48/450-6", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Mingyu Zhao": "22/6361", "Xueqiang Yan": "143/6573", "Jianjun Wu": "45/5247"}, "abstract": " Abstract:Feature applications envisioned in the 6G era, represented by holographic communication, full-sensing communication, intelligent transportation, and intelligent manufacturing in terms of virtual and physical integration, immersion, contextualization, and personalization, have placed high demands on the intelligentization of 6G networks. The current network operating mechanism based on rule-based algorithms is limited by rigid preset rules. It is difficult to adapt dynamically to constantly changing user needs and network environments. In order to enable the network to effectively accumulate and independently utilize the operating experience and realize the independent iterative evolution of network operation, management, and control capabilities, this article proposes the concept of the intelligence-endogenous network (IEN). The IEN aims to introduce knowledge graph and artificial intelligence technologies into networks to characterize, construct, learn, and apply the network's multidimensional subjective and objective knowledge. Based on the learned knowledge, an IEN can realize stereo perception, decision deduction, and dynamic adjustment, so the network can change as it needs for whatever new services we want. The article introduces the basic concepts, goals, and meanings of the IEN, together with its key principles and technologies, and illustrates how it innovatively responds to the current network's multifaceted challenges with an intuitive use case."}, "journals/ejwcn/QiLYFZ21": {"title": "Deep learning-based BackCom multiple beamforming for 6G UAV IoT networks.", "url": "https://doi.org/10.1186/s13638-021-01932-4", "year": "2021", "author": {"Fei Qi 0002": "59/985-2", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178"}, "abstract": ""}, "journals/ejwcn/QiLYFZ21a": {"title": "Shape adaptive IRS based SAG IoT network.", "url": "https://doi.org/10.1186/s13638-021-02069-0", "year": "2021", "author": {"Fei Qi 0002": "59/985-2", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178"}, "abstract": ""}, "journals/tgcn/FengCZL21": {"title": "Energy-Efficient Joint Optimization of Channel Assignment, Power Allocation, and Relay Selection Based on Hypergraph for Uplink mMTC Networks.", "url": "https://doi.org/10.1109/TGCN.2020.3043019", "year": "2021", "author": {"Lei Feng 0001": "76/847-1", "Jinlong Chai": "236/2897", "Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Energy efficiency (EE) is essential for uplink communication in massive machine-type communication (mMTC) since Internet of Things (IoT) devices are always energy-limited. This article refers to a relay-assisted uplink mMTC system that uses the non-orthogonal multiple access (NOMA) and orthogonal multiple access (OMA) hybrid resource allocation strategy that aims to enhance EE and access rate. In this way, some two-hop uplink relays based on amplifying and forwarding (AF) are deployed to connect the base station (BS) and IoT device groups. Each relayed group contains several adjacent IoT devices with poor channel conditions and uses the NOMA scheme. Firstly, a clustering algorithm named A-CFSFDP is proposed to efficiently and quickly divide IoT devices into different NOMA groups. Secondly, this article presents a hypergraph-based joint EE optimization model of the channel assignment, power allocation, and relay selection. The 3D channel matching among the NOMA IoT devices group, relay IoT devices, and ordinary OMA IoT devices is formulated as a mixed integer programming (MIP) problem. The acquirement of feasible EE weights in the problem is treated as an oligopolistic competition of power and modeled and solved as a Cournot game. Then, the largest independent set and the hypergraph-based method (HGM) algorithm solves the MIP problem. The numerical results show: 1) the designed A-CFSFDP clustering algorithm can more accurately distinguish NOMA-group halos and NOMA-group cores compared to the CFSFDP one; 2) the total EE achieved by the proposed hypergraph-based 3D channel matching is higher than the iterative Hungarian method (IHM) and minimum zero-surface preferred allocation (MZPA) method, respectively; and 3) the computational complexity of the HGM algorithm is also lower than that of the IHM and MZPA method by determining the largest independent set."}, "journals/tgcn/FengZLQYHQ21": {"title": "Energy-Efficient Offloading for Mission-Critical IoT Services Using EVT-Embedded Intelligent Learning.", "url": "https://doi.org/10.1109/TGCN.2021.3072140", "year": "2021", "author": {"Lei Feng 0001": "76/847-1", "Yu Zhou": "36/2728", "Tang Liu": "95/8349", "Xiaoyu Que": "268/8984", "Peng Yu 0001": "50/2599-1", "Tao Hong 0004": "25/432-4", "Xue-Song Qiu 0001": "13/342"}, "abstract": " Abstract:Mobile edge computing (MEC) is a promising technique to alleviate the energy limitation of Internet of Things (IoT) devices, as it can offload local computing tasks to the edge server through a cellular network. By leveraging extreme value theory (EVT), this work proposes a priority-differentiated offloading strategy that takes into account the stringent quality of service (QoS) requirements of mission-critical services and green resource allocation. Particularly, Lyapunov optimization is first introduced to derive an upper-bound queue minimization problem with the consideration of energy consumption and task priority. The peaks-over-thresholds (POT) model is then applied to evaluate the stationery status and cooperate with Wolf-PHC learning to optimize resource allocation. Finally, simulation results verify that the proposed offloading policy performs well in terms of its energy-saving capability while satisfying different demands of mission-critical IoT services."}, "journals/wcl/YangFZQL21": {"title": "Analytical Performance Analysis of Intelligent Reflecting Surface Aided Ambient Backscatter Communication Network.", "url": "https://doi.org/10.1109/LWC.2021.3113806", "year": "2021", "author": {"Zhixiang Yang": "148/0993", "Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Xue-song Qiu 0001": "13/342", "Wenjing Li 0001": "08/6548-1"}, "abstract": " Abstract:Intelligent reflecting surface (IRS) and ambient backscatter technologies have great potential for accelerating the promotion of ultra-low-power applications due to their reflecting environmental radio frequency (RF) signals. This letter introduces a novel model that integrates IRS, backscatter and wireless powered technologies, in which the device-to-device (D2D) terminals communicate in a self-sustainable manner. Then, the analytical expressions of system performance, including coverage probability and average throughput, are derived. The system performance is finally optimized by adjusting the IRS phase shifts and working mode of D2D transmitter, and experimentally tested and verified."}, "journals/access/FengLLZGZ20": {"title": "Joint Computation Offloading and URLLC Resource Allocation for Collaborative MEC Assisted Cellular-V2X Networks.", "url": "https://doi.org/10.1109/ACCESS.2020.2970750", "year": "2020", "author": {"Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Yingxin Lin": "255/6619", "Liang Zhu": "85/20", "Shaoyong Guo": "150/6843", "Zerui Zhen": "258/7956"}, "abstract": "Topic: Communication and Fog/Edge Computing Towards Intelligent Connected Vehicles (ICVs)"}, "journals/access/FengZLZYK20": {"title": "Dynamic Resource Allocation With RAN Slicing and Scheduling for uRLLC and eMBB Hybrid Services.", "url": "https://doi.org/10.1109/ACCESS.2020.2974812", "year": "2020", "author": {"Lei Feng 0001": "76/847-1", "Yueqi Zi": "245/4642", "Wenjing Li 0001": "08/6548-1", "Fanqin Zhou": "137/4178", "Peng Yu 0001": "50/2599-1", "Michel Kadoch": "36/2183"}, "abstract": " Abstract:To cope with the limited radio and power resources, designing energy- and cost-efficient resource allocation strategy with RAN slicing and scheduling is important in ensuring the extreme QoS of differentiated Internet of things (IoT) services. In this regard, we focus on guaranteeing the latency and reliability of sporadic uRLLC uplink traffic while improving the quality of continuous eMBB services (e.g., quality of the video) together in this paper. Firstly, a dynamic optimization model considering power consumption and service quality is used to construct the cost function in both time domain and frequency bandwidth for heterogeneous services, subject to the latency constraint. Secondly, given its complexity, a novel two-timescale algorithm with employing Lyapunov optimization is designed, including two sub-algorithms: long-timescale bandwidth allocation and short-timescale service control. In further, the theoretical optimality is analyzed according to the relationships between control parameters and service performances. The utility of our approach and its hard latency guarantee are also illustrated through simulation results under tolerable power consumption."}, "journals/ejwcn/YangFZOL20": {"title": "Resource allocation for virtual reality content sharing based on 5G D2D multicast communication.", "url": "https://doi.org/10.1186/s13638-020-01690-9", "year": "2020", "author": {"Yang Yang 0006": "48/450-6", "Lei Feng 0001": "76/847-1", "Cheng Zhang": "82/6384", "Qinghai Ou": "120/7211", "Wenjing Li 0001": "08/6548-1"}, "abstract": ""}, "journals/information/ChengSRZFS20": {"title": "Ordered Electric Vehicles Charging Scheduling Algorithm Based on Bidding in Residential Area.", "url": "https://doi.org/10.3390/info11010049", "year": "2020", "author": {"Xiao Cheng": "73/1713", "Jinma Sheng": "258/7791", "Xiuting Rong": "258/7930", "Hui Zhang": "181/2846", "Lei Feng 0001": "76/847-1", "Sujie Shao": "151/6228"}, "abstract": ""}, "journals/monet/0001YZL00020": {"title": "Deep Reinforcement Learning Aided Cell Outage Compensation Framework in 5G Cloud Radio Access Networks.", "url": "https://doi.org/10.1007/s11036-020-01574-8", "year": "2020", "author": {"Peng Yu 0001": "50/2599-1", "Xiao Yang": "57/3385", "Fanqin Zhou": "137/4178", "Hao Li": "17/5705", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": "As one of the key technologies of 5G, Cloud Radio Access Networks (C-RAN) with cloud BBUs (Base Band Units) pool architecture and distributed RRHs (Remote Radio Heads) can provide the ubiquitous services. When failure occurs at RRH, it cant be alleviated in time and will lead to a significant drop in network performance. Therefore, the cell outage compensation (COC) problem for RRH in 5G C-RAN is very important. Although deep reinforcement learning (DRL) has been applied to many scenarios related to the self-organizing network (SON), there are fewer applications for cell outage compensation. And most intelligent algorithms are hard to obtain globally optimized solutions. In this paper, aiming at the cell outage scenario in C-RAN with the goal of maximizing the energy efficiency, connectivity of RRH while meeting service quality demands of each compensation user, a framework based on DRL is presented to solve it. Firstly, compensation users are allocated to adjacent RRHs by using the K-means clustering algorithm. Secondly, DQN is used to find the antenna downtilt and the power allocated to compensation users. Comparing to different genetic algorithms, simulation result shows that the proposed framework converges quickly and tends to be stable, and reaches 95% of the maximum target value. It verifies the efficiency of the DRL-based framework and its effectiveness in meeting user requirements and handling cell outage compensation."}, "journals/sensors/YinLFYQ20": {"title": "Emergency Communications Based on Throughput-Aware D2D Multicasting in 5G Public Safety Networks.", "url": "https://doi.org/10.3390/s20071901", "year": "2020", "author": {"Mengjun Yin": "152/1083", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/tbc/FengYYQZ20": {"title": "Smart Mode Selection Using Online Reinforcement Learning for VR Broadband Broadcasting in D2D Assisted 5G HetNets.", "url": "https://doi.org/10.1109/TBC.2020.2977577", "year": "2020", "author": {"Lei Feng 0001": "76/847-1", "Zhixiang Yang": "148/0993", "Yang Yang 0006": "48/450-6", "Xiaoyu Que": "268/8984", "Kai Zhang": "55/957"}, "abstract": " Abstract:As an emerging broadband service pattern in the 5G era, VR broadcasting needs a considerable amount of bandwidth and strict quality of service (QoS) control. The traditional eMBMS or enTV transmission mode in HetNets consisting of macro cells and small cells cannot bring about a good trade-off between broadband performance and resource utilization for VR broadcasting service. D2D multicasting applied to VR broadcasting can improve the performance of edge users and resource utilization. Motivated by the rapid development of AI techniques, this paper proposes a novel hybrid transmission mode selection based on online reinforcement learning to address this problem. Each VR broadband user can be associated by one of the three modes: macrocell broadcasting, mmWave small cell unicasting and D2D multicasting. This paper first models this intelligent mode decision process as a problem to pursue the optimal system throughput. Then, an online machine learning-based method is proposed to solve this problem, which consists of a fast D2D clustering module based on unsupervised learning and a smart mode selection module based on reinforcement learning. The simulation results verify that the WoLF-PHC and Nash Q-learning perform better than other algorithms in large-scale scenarios and small-scale scenarios, respectively. The proposed intelligent transmission mode selection can also achieve larger VR throughput than traditional broadcasting strategies with a good balance between broadband performance and resource utilization."}, "journals/wc/ZhouYFQWMKGY20": {"title": "Automatic Network Slicing for IoT in Smart City.", "url": "https://doi.org/10.1109/MWC.001.2000069", "year": "2020", "author": {"Fanqin Zhou": "137/4178", "Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Xuesong Qiu 0001": "13/342", "Zhili Wang": "15/2643", "Luoming Meng": "52/382", "Michel Kadoch": "36/2183", "Liang Gong": "28/7849", "Xianjiong Yao": "269/8539"}, "abstract": " Abstract:Internet of things (IoT) in smart city consists of a diversity of public utility and vertical industry services with extremely different performance requirements. As a key technology of 5G networks, network slicing (NS) is featured to provide distinct virtual networks and differentiated QoS guarantees in a shared infrastructure. Therefore, it becomes necessary to employ intelligent NS management for IoT in smart city. This work proposes a machine learning (ML) driven automatic NS framework which can intelligently scale slice according to network state. The resource preservation and slicing implementation scheme is given to trade off robustness and resource efficiency. Finally, the present study provides preliminary results via simulation and experimentation to justify the effectiveness and efficiency of the presented design."}, "journals/ett/ZhuWFZZYL19": {"title": "Energy-efficient joint power control and resource allocation for cluster-based NB-IoT cellular networks.", "url": "https://doi.org/10.1002/ett.3266", "year": "2019", "author": {"Shuqiong Zhu": "242/7421", "Wenquan Wu": "10/10021", "Lei Feng 0001": "76/847-1", "Pan Zhao 0002": "61/3903-2", "Fanqin Zhou": "137/4178", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": ""}, "journals/cm/FengZZYYLQ18": {"title": "Resource Allocation for 5G D2D Multicast Content Sharing in Social-Aware Cellular Networks.", "url": "https://doi.org/10.1109/MCOM.2018.1700667", "year": "2018", "author": {"Lei Feng 0001": "76/847-1", "Pan Zhao 0002": "61/3903-2", "Fanqin Zhou": "137/4178", "Mengjun Yin": "152/1083", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:As the traffic of local content sharing grows rapidly, device-to-device multicast (D2MD) is introduced into 5G cellular networks, enabling traffic offloading from base stations to device direct transmissions and improved energy and spectrum efficiency. In the content sharing context, the social attributes of mobile users have special concerns to generate effective D2MD groups and D2MD links, and due to reuse of licensed cellular spectrum, the interference between D2MD groups and cellular users should be carefully mitigated. This article presents a D2MD scheme for content sharing in cellular networks by taking into account social and physical attributes in D2MD cluster formation, and jointly optimizing power and channel allocation among D2MD clusters. Simulation results validate the significant throughput gain for D2MD-based content sharing in 5G cellular networks."}, "journals/ijdsn/Zhao000Q18": {"title": "Joint power allocation and subcarrier assignment for device to device in 5G time division duplex networks.", "url": "https://doi.org/10.1177/1550147718811094", "year": "2018", "author": {"Pan Zhao 0002": "61/3903-2", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/mta/FengZYL18": {"title": "Benders Decomposition-based video bandwidth allocation in mobile media cloud network.", "url": "https://doi.org/10.1007/s11042-016-4299-9", "year": "2018", "author": {"Lei Feng 0001": "76/847-1", "Fanqin Zhou": "137/4178", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": "Due to the fast growth of wireless multimedia applications, mobile media cloud network is getting more and more popular. In the architecture of mobile media cloud network, the wireless access points are placed on edge of the cloud to provide media services for the mobile users. The video bandwidth allocation managed by a centralized media cloud directly affect the users experiences. In this paper, the problem of the video bandwidth allocation in the mobile media cloud access network is explored. Firstly, this paper formulates the problems in bandwidth allocation in the form of quadratic programming in order to maximize the system revenue on the basis of video bitrates capacity between the user and the Mobile Access Edge Point (MAEP). The optimization model could more vividly explicate the trade-off between the expected bitrates capacity and the allocation fairness of User Equipment (UE). Then this paper subdivides the problem into major and minor ones and proposes an algorithm based on Benders Decomposition to deal with it. The optimality of the solution is proved by both theoretical and experimental investigations. The error tolerance is analyzed as the algorithm disavows the trade-off between the convergence time and the system performance. The experiments show that the average computing time and confidence interval of the proposed algorithm are lower than Simplex algorithm by 68% and 94% and Barrier algorithm by 46% and 75% respectively at most. Finally, some conclusions are derived from evaluations on the system performance against various network topologies and different values for parameters of the proposed algorithms."}, "journals/wc/YuLZFYGGQ18": {"title": "Capacity Enhancement for 5G Networks Using MmWave Aerial Base Stations: Self-Organizing Architecture and Approach.", "url": "https://doi.org/10.1109/MWC.2018.1700393", "year": "2018", "author": {"Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Mengjun Yin": "152/1083", "Shaoyong Guo": "150/6843", "Zhipeng Gao": "25/2165", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:In 5G networks, an mAeBS can overcome on-ground constraints and enable rapid and flexible deployment, providing an ideal solution for CE in hotspot areas. However, how to control multiple mAeBSs for efficient CE is a challenging issue, and we refer to it as mACE. To tame the trivial management practices involved in mACE, we resort to the SON methodology and propose a self-organizing architecture. A closed-loop management process is correspondingly designed for it, which consists of four phases: analyzing, planning, devaluating, and executing. Thereafter, solutions to the key technical issues, including hotspot identification and mAeBS deployment, are investigated. The effects of the overall mACE approach are intuitively illustrated in a small-scale example case. A few more challenging issues related to mACE are also identified for future research."}, "journals/wicomm/YuZZLFQ18": {"title": "Self-Organized Cell Outage Detection Architecture and Approach for 5G H-CRAN.", "url": "https://doi.org/10.1155/2018/6201386", "year": "2018", "author": {"Peng Yu 0001": "50/2599-1", "Fanqin Zhou": "137/4178", "Tao Zhang": "15/4777", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/access/ZhaoFYLQ17": {"title": "A Social-Aware Resource Allocation for 5G Device-to-Device Multicast Communication.", "url": "https://doi.org/10.1109/ACCESS.2017.2731805", "year": "2017", "author": {"Pan Zhao 0002": "61/3903-2", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:With the ever-increasing demands for popular content sharing among humans, device-to-device (D2D) multicast communication, as a promising technology to support wireless services within a local area, is introduced in a 5G cellular network. However, the existing resource allocation approaches for D2D multicast communication usually consider only physical domain constraints but neglect social domain factors, which would result in ineffective D2D links between users unwilling to share interests. Different from existing works, the D2D multicast scheme proposed in this paper will produce effective D2D multicast links by sufficiently utilizing both the physical and social properties of mobile users, with the goal to maximize the throughput of the overall social-aware network and guarantee fairly allocation of the channel between different D2D multicast clusters. The scheme mainly consists of two parts, the formation of D2D multicast clusters and joint optimization of power and channel allocation. In the formation of D2D multicast clusters, members and head in each cluster are selected by taking into account both social attributes and physical factors, such as community, ties, and geographical closeness. In the joint optimization, a two-step scheme is designed to first calculate the optimal power allocation by geometric proximity and then select suitable cellular channels for each D2D multicast cluster utilizing an extended one-to-many bipartite graphs matching algorithm. Simulation results demonstrate that, compared with heuristic algorithm and stochastic algorithm, the proposed scheme can increase the throughput of the overall social-aware network by about 5% and 50%, respectively."}, "journals/access/YinLFYQ17": {"title": "Multi-Cell Cooperative Outage Compensation in Cloud-RANs Based 5G Public Safety Network.", "url": "https://doi.org/10.1109/ACCESS.2017.2734925", "year": "2017", "author": {"Mengjun Yin": "152/1083", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Xuesong Qiu 0001": "13/342"}, "abstract": "Topic: Mission Critical Public-Safety Communications: Architectures, Enabling Technologies, and Future Applications"}, "journals/iet-com/ZhouLFYM17": {"title": "Generalised benders decomposition-based load optimisation in cellular and public WLAN interworking network.", "url": "https://doi.org/10.1049/iet-com.2016.0241", "year": "2017", "author": {"Fanqin Zhou": "137/4178", "Wenjing Li 0001": "08/6548-1", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Luoming Meng": "52/382"}, "abstract": ""}, "journals/mis/YuFLQ16": {"title": "Energy-Saving Management Mechanism Based on Hybrid Energy Supplies for LTE Heterogeneous Networks.", "url": "https://doi.org/10.1155/2016/3121538", "year": "2016", "author": {"Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/mis/ZhouFYLM16": {"title": "Utility Maximization for Load Optimization in Cellular/WLAN Interworking Network Based on Generalized Benders Decomposition.", "url": "https://doi.org/10.1155/2016/6929575", "year": "2016", "author": {"Fanqin Zhou": "137/4178", "Lei Feng 0001": "76/847-1", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1", "Luoming Meng": "52/382"}, "abstract": ""}, "journals/mis/FengLYQ16": {"title": "An Enhanced OFDM Resource Allocation Algorithm in C-RAN Based 5G Public Safety Network.", "url": "https://doi.org/10.1155/2016/9586287", "year": "2016", "author": {"Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Peng Yu 0001": "50/2599-1", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/sensors/FengGSYL16": {"title": "A Fault Tolerance Mechanism for On-Road Sensor Networks.", "url": "https://doi.org/10.3390/s16122059", "year": "2016", "author": {"Lei Feng 0001": "76/847-1", "Shaoyong Guo": "150/6843", "Jialu Sun": "179/1695", "Peng Yu 0001": "50/2599-1", "Wenjing Li 0001": "08/6548-1"}, "abstract": ""}, "journals/itiis/YuFLLQ15": {"title": "Low-Complexity Energy Efficient Base Station Cooperation Mechanism in LTE Networks.", "url": "https://doi.org/10.3837/tiis.2015.10.009", "year": "2015", "author": {"Peng Yu 0001": "50/2599-1", "Lei Feng 0001": "76/847-1", "Zifan Li": "125/3616", "Wenjing Li 0001": "08/6548-1", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/itiis/FengLYQ14": {"title": "Modeling and Analysis of Load-Balancing Based on Base-Station CoMP with Guaranteed QoS.", "url": "https://doi.org/10.3837/tiis.2014.09.002", "year": "2014", "author": {"Lei Feng 0001": "76/847-1", "Wenjing Li 0001": "08/6548-1", "Mengjun Yin": "152/1083", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}}}