{"id": "188/8007", "name": "Lejian Zhang", "Article": {"conf/mm/XuS00GZL21": {"title": "DLA-Net for FG-SBIR: Dynamic Local Aligned Network for Fine-Grained Sketch-Based Image Retrieval.", "url": "https://doi.org/10.1145/3474085.3475705", "year": "2021", "author": {"Jiaqing Xu": "57/3028", "Haifeng Sun 0001": "00/11044-1", "Qi Qi 0001": "80/6406-1", "Jingyu Wang 0001": "37/2749-1", "Ce Ge": "215/0142", "Lejian Zhang": "188/8007", "Jianxin Liao": "60/4951"}, "abstract": "\n\t\tFine-grained sketch-based image retrieval is considered as an ideal alternative to keyword-based image retrieval and image search by image due to the rich and easily accessible characteristics of sketches. Previous works always follow a paradigm that first extracting image global feature with convolution neural network and then optimizing the model with triplet loss. Many efforts on narrowing the domain gap and extracting discriminating features are made by these works. However, they ignored that the global feature is not good at capturing fine-grained details. In this paper, we emphasize the local features are more discriminating than global feature in FG-SBIR and explore an effective way to utilize local features. Specifically, Local Aligned Network (LA-Net) is proposed first, which solves FG-SBIR by directly aligning the mid-level local features. Experiment manifests it can beat all previous baselines and is easy to implement. LA-Net is hoped to be a new strong baseline for FG-SBIR. Next, Dynamic Local Aligned Network (DLA-Net) is proposed to enhance LA-Net. The question of spatial misalignment caused by the abstraction of the sketch is not considered by LA-Net. To solve this question, a dynamic alignment mechanism is introduced into LA-Net. This new mechanism makes the sketch interact with the photo and dynamically decide where to align according to the different photos. The Experiment indicates DLA-Net successfully addresses the question of spatial misalignment. It gains a significant performance boost over LA-Net and outperforms the state-of-the-art in FG-SBIR. To the best of our knowledge, DLA-Net is the first model that beats humans on all datasets---QMUL FG-SBIR, QMUL Handbag, and Sketchy.\n\t"}, "conf/smartgift/Zhao0ZS18": {"title": "Optimizing Sliding Performance in iOS.", "url": "https://doi.org/10.1007/978-3-319-94965-9_12", "year": "2018", "author": {"Qin Zhao": "23/3463", "Qi Qi 0001": "80/6406-1", "Lejian Zhang": "188/8007", "Qiwei Shen": "188/7986"}, "abstract": "How to improve iOS sliding performance has always been the focus of iOS application optimization. This paper analyzes the principle of AutoLayout and Frame view layout, the opportunity of network loading, CPU and GPU performance consumption during sliding process. First, we provide the appropriate solution to avoid using AutoLayout, and adjust the time of network loading by preloading to reduce the waiting time dynamically. Pre-cache and asynchronous rendering to reduce the main thread CPU consumption is implemented to reduce the main thread CPU consumption, and at the same time, GPU consumption is reduced by asynchronous rendering. Finally, verify the feasibility and effectiveness of the optimization scheme by experiments. It is verified that the percentage of the main thread CPU consumption decreases by 17.2% and FPS increases from 37 Hz to 60 Hz.KeywordsSliding performanceAutoLayoutPre-cacheAsynchronousFPS"}, "conf/nana/HeLZWQ16": {"title": "ECCN: An Elastic Customized Cloud Network Platform.", "url": "https://doi.org/10.1109/NaNA.2016.62", "year": "2016", "author": {"Yuze He": "188/7944", "Wei Li": "64/6025", "Lejian Zhang": "188/8007", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1"}, "abstract": " Abstract:A network testbed with high flexibility plays an important role in testing and evaluating new network technology. Both researchers and engineers always need a network testbed which can customize network experiment on demand. Some of the existing cloud computing platforms lack network customization while some network experimental platform can not provide convenient virtual machine management functions. In this paper, we propose a preliminary implementation of the elastic customized cloud network (ECCN) platform based on Openstack project which provides cloud computing management and supports the Openflow protocol. This testbed can meet the needs of a rapid customized deployment of network resources like virtual machines, load balancers and routers in data center. Simultaneously, it provides the capability to generate and manage the customized network topology and an experimental environment where traditional network can interwork with Software Defined Network (SDN). Experiment results show that the ECCN testbed can help users deploy their own network experiment rapidly and easily with a friendly operation, as well as a flexible network design based on the highly customized experiment. In addition, ECCN guarantees the network isolation between different users based on reuse and sharing of the physical resources."}, "journals/remotesensing/DuanXYHZXY21": {"title": "Reconstruction of the Radar Reflectivity of Convective Storms Based on Deep Learning and Himawari-8 Observations.", "url": "https://doi.org/10.3390/rs13163330", "year": "2021", "author": {"Mingshan Duan": "300/6537", "Jiangjiang Xia": "300/6335", "Zhongwei Yan": "300/6679", "Lei Han": "75/2307", "Lejian Zhang": "188/8007", "Hanmeng Xia": "300/6803", "Shuang Yu": "25/6555"}, "abstract": ""}, "journals/remotesensing/HeSYZ19": {"title": "A Radar Radial Velocity Dealiasing Algorithm for Radar Data Assimilation and its Evaluation with Observations from Multiple Radar Networks.", "url": "https://doi.org/10.3390/rs11202457", "year": "2019", "author": {"Guangxin He": "253/4635", "Juanzhen Sun": "171/0238", "Zhuming Ying": "253/4554", "Lejian Zhang": "188/8007"}, "abstract": ""}}}