{"id": "63/3087", "name": "Lirong Qiu", "Article": {"conf/dsc/LiaoWXWQS21": {"title": "Adversarial Residual Variational Graph Autoencoder with Batch Normalization.", "url": "https://doi.org/10.1109/DSC53577.2021.00013", "year": "2021", "author": {"Qisheng Liao": "308/3477", "Xu Wu": "42/989", "Xiaqing Xie": "179/0891", "Jingchen Wu": "149/8482", "Lirong Qiu": "63/3087", "Lijuan Sun": "39/478"}, "abstract": " Abstract:The variational graph autoencoder (VGAE), a framework for unsupervised learning on graph-structured data, has captured more attention recently in graph embedding area. However, it has been faced up with the challenge of KL vanishing, which will converge to local optimum and make the graph embedding unavailable for downstream tasks like link prediction. This paper proposes a novel variational graph autoencoder framework to achieve more effective graph embedding. Firstly, we introduce batch normalization to make sure the KL distribution consistent with the whole dataset by keeping its expectation positive, thus avoiding posteriori collapse. In addition, we invite residual connection and adversarial network to simultaneously embed the topology information and content information into graph representation stably, enhancing the expressive ability of latent vector. Finally, link prediction experiments on three citation datasets demonstrate that the AUC scores of our algorithm are higher than 92% and the average accuracies are higher than 93%, which is competitive comparing with the state-of-the-art variational graph autoencoders."}, "conf/dsc/GaoWWXQS21": {"title": "Sensitive Image Information Recognition Model of Network Community based on Content Text.", "url": "https://doi.org/10.1109/DSC53577.2021.00014", "year": "2021", "author": {"Li Gao": "18/4703", "Xu Wu": "42/989", "Jingchen Wu": "149/8482", "Xiaqing Xie": "179/0891", "Lirong Qiu": "63/3087", "Lijuan Sun": "39/478"}, "abstract": " Abstract:With the advent of the multimedia era and the age of picture-reading, the recognition effect of sensitive content of image data has become the key to maintain the information security of network communities. At present, the image classification and recognition technology for sensitive images in network communities cannot obtain the semantic content of images, and it is difficult to combine the image information with the knowledge in network communities, resulting in low recognition accuracy and poor interpretability, and it is difficult to trace the transmission and fermentation of image information in network communities. To solve this problem, this paper proposes a sensitive image information recognition model of network community based on content text by using image caption technology. Through the text description of the image content of the network community, and the integration of a large number of network community text knowledge, the model can finally identify the images containing sensitive content more accurately and more understandable, and the transmission of image information on the network can be traced through the content text. In this paper, MSCOCO(Microsoft Common Objects in Context) dataset and sensitive image self-made dataset of network community are used as the training set. The experimental results show that the method presented in this paper is significantly better than the model based on image classification task in terms of accuracy and traceability of image sensitive information recognition results, which proves the feasibility and effectiveness of sensitive image information recognition in network communities based on content text."}, "conf/dsc/HeWWXQS21": {"title": "Insider Threat Detection Based on User Historical Behavior and Attention Mechanism.", "url": "https://doi.org/10.1109/DSC53577.2021.00089", "year": "2021", "author": {"Weiyu He": "318/8616", "Xu Wu": "42/989", "Jingchen Wu": "149/8482", "Xiaqing Xie": "179/0891", "Lirong Qiu": "63/3087", "Lijuan Sun": "39/478"}, "abstract": " Abstract:Insider threat makes enterprises or organizations suffer from the loss of property and the negative influence of reputation. User behavior analysis is the mainstream method of insider threat detection, but due to the lack of fine-grained detection and the inability to effectively capture the behavior patterns of individual users, the accuracy and precision of detection are insufficient. To solve this problem, this paper designs an insider threat detection method based on user historical behavior and attention mechanism, including using Long Short Term Memory (LSTM) to extract user behavior sequence information, using Attention-based on user history behavior (ABUHB) learns the differences between different user behaviors, uses Bidirectional-LSTM (Bi-LSTM) to learn the evolution of different user behavior patterns, and finally realizes fine-grained user abnormal behavior detection. To evaluate the effectiveness of this method, experiments are conducted on the CMU-CERT Insider Threat Dataset. The experimental results show that the effectiveness of this method is 3.1% to 6.3% higher than that of other comparative model methods, and it can detect insider threats in different user behaviors with fine granularity."}, "conf/dsc/ChenWXWQS21": {"title": "Graph Neural Network Based User Group Comments Interaction Behavior Prediction on Microblog Websites.", "url": "https://doi.org/10.1109/DSC53577.2021.00090", "year": "2021", "author": {"Yisen Chen": "318/8708", "Xu Wu": "42/989", "Xiaqing Xie": "179/0891", "Jingchen Wu": "149/8482", "Lirong Qiu": "63/3087", "Lijuan Sun": "39/478"}, "abstract": " Abstract:The interactive behavior of comments within the user group on microblog website is bidirectional and dynamic, reflecting the level of familiarity among users. Predicting the future comment interaction behavior within the user group is of great significance for commercial recommendation and crime fighting. Related research groups regard it as a temporal link prediction problem, assume the evolution is smooth or there is no evolution at all. Meanwhile, the feature in those studies is too unitary, leading to low link prediction performance. In this paper, we propose a method called User Group Comment Interaction Behaviour Prediction (UGCIBP), which combines structure extraction layer and evolution extraction layer to do dynamic graph representation learning to acheive the modeling of user group historical comment interaction graphs, and build the features of communication weight, interest similarity, and common degree of activity between users on microblog website. Then, we combine dynamic graph representation learning and the constructed features to do link prediction, finally, the purpose of predicting comment interaction is acheived. Experiments are conducted on the public datasets Enron and Twitter datasets to evaluate the method. The results show that the AUC scores of this method are 4.74% and 9.95% higher than existing methods, respectively, which proves the effectiveness of the UGCIBP method."}, "conf/cse/LiQ17": {"title": "A Sentiment Analysis Method of Short Texts in Microblog.", "url": "https://doi.org/10.1109/CSE-EUC.2017.153", "year": "2017", "author": {"Jie Li": "17/2703", "Lirong Qiu": "63/3087"}, "abstract": " Abstract:Traditional approaches to analysis the sentiment of short text don't consider the relationship between emotion words and modifiers and simply accumulate the sentiment of the sentence to obtain the sentiment of short text. In this paper, we show how to mitigate the problems through sentiment structure and the sentiment calculation rules. The sentiment structure is obtained from the dependency parsing with the relationship migration and modified distance, which makes a good contribution to understanding the sentiment of short text. The sentiment of short text is accumulated according to the different influence of relationships between the modifier and the emotion word and the contribution of each sentence to the sentiment calculation of short text. Experiment results validate the effective of the approach."}, "conf/cse/QiuYM17": {"title": "Chinese-Uyghur-English Semantic Search Based on the Knowledge Graphs.", "url": "https://doi.org/10.1109/CSE-EUC.2017.177", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Na Yang": "12/1608", "Maierdan Maolimamuti": "204/8278"}, "abstract": " Abstract:Semantic search is becoming a more independent search engine, which is capable of analyzing independently, understanding the essential needs and providing accurate answers. In this work, the basis of analyzing the content framework puts forward the theory on the basis of knowledge graph. In the semantic web, search engines use a knowledge graph to identify the query involved in the entity and its attributes, giving a precise answer by efficient web search. Based on the semantic web, we proposed the K-means algorithm that applied to construct knowledge graph, will be sorted in knowledge bases by classifying similarity word, building Uygur's knowledge graph architecture, and then, take the built knowledge graph to show the semantic searching."}, "conf/cse/QiuYZ17": {"title": "The Design and Implementation of Chinese-Uighur-English Online Dictionary Based on Knowledge Graph.", "url": "https://doi.org/10.1109/CSE-EUC.2017.178", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Huan Yang": "86/4843", "Rong Zhou": "z/RongZhou"}, "abstract": " Abstract:Designing Chinese-Uighur-English online dictionary is very important for the development of ethnic scientific research and education, which is the basis for the work of Uighur semantic study. Online dictionary with a huge thesaurus can be implemented by knowledge graph, existing works have not addressed in much detail. In order to design the thesaurus of the online dictionary, this paper is based on the word-formation characteristics of Uighur vocabulary to create the Uighur knowledge graph, and proposes K-means clustering algorithm for the classification of Uighur vocabulary."}, "conf/cse/QiuZ17": {"title": "Review of Development and Construction of Uyghur Knowledge Graph.", "url": "https://doi.org/10.1109/CSE-EUC.2017.181", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Huili Zhang": "47/3405"}, "abstract": " Abstract:Knowledge graph technology belongs to the field of artificial intelligence. It is widely used in semantic search and intelligent question answering. Construction of Uyghur's knowledge graph has the great value of Uyghur information processing and Uyghur application software development. Firstly, this paper describes the definition and structure of the knowledge graph, then it reviews the related research and construction process of the Uyghur's knowledge graph, and analyses the characteristics of word formation of Uighur entities in depth, focuses on the related concepts and methods of knowledge extraction, knowledge fusion, and knowledge update, Introduced the Uyghur semantic disambiguation technology in detail, Finally, looking forward to the future works."}, "conf/aina/XuQ15": {"title": "Technology Research of Tibetan Hot Topics Extraction.", "url": "https://doi.org/10.1109/WAINA.2015.17", "year": "2015", "author": {"Guixian Xu": "67/7648", "Lirong Qiu": "63/3087"}, "abstract": " Abstract:With the increase of a large numbers of Tibetan information, Tibetan text processing has become popular and important. Tibetan hot topics extraction has become one of the Tibetan information analysis tools. This paper describes a method of the hot topics extraction from Tibetan text. First, construction of the dataset is described. Second, Tibetan word segmentation is presented. Third, the feature selection and the text representation are conducted. The classical TFIDF is used to calculate the weights of features. At last, statistical-based method is utilized to extract the hot topics. The experiment shows it can extract the topics effectively and the results can reflect the characteristics of hot topic category. It is helpful and meaningful for text classification, information retrieval as well as construction of high-quality corpus."}, "conf/bwcca/ZhangQ15": {"title": "A Semantic Orientation Distinction Method for Opinion Mining in Tibetan Language.", "url": "https://doi.org/10.1109/BWCCA.2015.71", "year": "2015", "author": {"Zhen Zhang": "19/5112", "Lirong Qiu": "63/3087"}, "abstract": " Abstract:Opinion mining of social network is shown significant and indispensable status in hot topic, public-opinion poll, knowledge acquiring and recommended goods fields, which is the fundamental work for natural language processing. This paper proposes a systematic approach to determine sentiment orientation of the subjective Tibetan sentences by combining the sentiment dictionary and the statistical method, and considers different context environment to improve the algorithm adaptability. We test our approach on a bilingual corpus crawled from bilingual website and perform manual evaluation extracted from Tibetan corpora and the experimental results demonstrate good performance on Tibetan language."}, "conf/bwcca/YuanQ14": {"title": "Rule-Based Business Data Processing in Service Coordination Systems.", "url": "https://doi.org/10.1109/BWCCA.2014.82", "year": "2014", "author": {"Jie Yuan": "10/1593", "Lirong Qiu": "63/3087"}, "abstract": " Abstract:How to make software developers focus on building the basic infrastructure and enabling environment and the business users themselves configure the resources to fulfill their certain requirements is critical. To support rapid service coordination system, the method of redesigning and redeploying is needed. Business events are changes of state in enterprises or business correlated cases under the condition that the expected changes fail to appear. In this paper, we propose a rule-based business data processing method with event management in service coordination systems."}, "conf/bwcca/QiuY14": {"title": "Construction of Semantic Associative Network Based on Topic Maps.", "url": "https://doi.org/10.1109/BWCCA.2014.84", "year": "2014", "author": {"Lirong Qiu": "63/3087", "Jie Yuan": "10/1593"}, "abstract": " Abstract:It is extremely important that the semantic relation between the information resources for organizing and hunting for information. Many semantic connections are lost between online information resources and off-line information resources. Topic map is a discipline-specific form of concept map, which is generally a representation of concepts about the information and relationship rather than of knowledge itself. In this paper, we use the semantic relationship between information resources based on topic maps to connect the digital information resources into a World-Wide-Web of semantic links."}, "conf/isctcs/JiangQL14": {"title": "A Tibetan Word Sense Disambiguation Method Based on HowNet and Chinese-Tibetan Parallel Corpora.", "url": "https://doi.org/10.1007/978-3-662-47401-3_20", "year": "2014", "author": {"Xinmin Jiang": "136/3745", "Lirong Qiu": "63/3087", "Yeqing Li": "122/3142"}, "abstract": "In natural language, it is a common phenomenon that words are ambiguous. How to make computer understand its right meaning in the specific context environment is the driving force for research on word sense disambiguation. Making use of Tibetan-Chinese bilingual corpora and HowNet semantic knowledge base, this paper puts forward a word sense disambiguation method that can select a right Chinese interpretation for Tibetan words with multiple Chinese translation in the specific context. Study of word sense disambiguation method proposed in this paper will have a positive role in promoting the study of Tibetan-Chinese machine translation and cross-language information retrieval.KeywordsTibetan language information processingWord sense disambiguationParallel corporaHowNet"}, "conf/ialp/JiangQ13": {"title": "A Tibetan Ontology Concept Acquisition Method Based on HowNet and Chinese-Tibetan Dictionary.", "url": "https://doi.org/10.1109/IALP.2013.57", "year": "2013", "author": {"Xinmin Jiang": "136/3745", "Lirong Qiu": "63/3087"}, "abstract": " Abstract:This paper proposes a novel approach for acquiring ontology concepts in Tibetan based on HowNet and dictionaries. Central to this approach is realizing the mapping between Tibetan words and the ontology concepts in HowNet through the information of Chinese-Tibetan, Tibetan-English dictionaries. The method introduced in the article aims to establish an ontology and to achieve Tibetan semantic ontology concepts on the level of concept classification based on HowNet concept similarity calculation. Using the proposed method, we achieve good performance on semantic ontology concepts acquisition automatically."}, "conf/aici/QiuWZQ11": {"title": "Extracting Hyponymy Patterns in Tibetan Language to Enrich Minority Languages Knowledge Base.", "url": "https://doi.org/10.1007/978-3-642-23896-3_64", "year": "2011", "author": {"Lirong Qiu": "63/3087", "Yu Weng": "03/7269", "Xiaobing Zhao": "65/3208", "Xiaoyu Qiu": "21/10243"}, "abstract": "Semantic ontology is a formal, explicit specification of a shared conceptualization. The construction of semantic ontology knowledge base is the vital process in language processing, which is applied in information retrieval, information extraction and automatic translation. Hyponymy pattern is a basic semantic relationship between concepts, which is used to concepts acquisition to enrich ontology automatically. In this paper, the construction idea of multilingual ontology with unified criteria and interface are introduced, and hyponymy pattern is represented as a pair of a meaning frame defining the necessary information extraction in Tibetan language. The research of hyponymy relationship pattern can assist concept enrichment in ontology, which can reduce the cost during the ontology engineering process.Keywordsknowledge basesemantic ontologyconcepts acquisitionhyponymy relation"}, "conf/emeit/QiuWZY11": {"title": "Enrichment of semantic ontology in Tibetan language by extracting concepts with hyponymy patterns.", "url": "https://doi.org/10.1109/EMEIT.2011.6024065", "year": "2011", "author": {"Lirong Qiu": "63/3087", "Yu Weng": "03/7269", "Xiaobing Zhao": "65/3208", "Guosheng Yang": "53/3019"}, "abstract": " Abstract:Semantic ontology is driving the evolution of knowledge engineering on the basis of shared knowledge. The acquisition of hyponymy is a basic and vital problem in ontology building, which provides the basic supports for further enrichment. In this paper, we propose an iterative verification method of enriching ontology concepts by the representation and acquisition of hyponymy patterns in Tibetan language. The hyponymy patterns are defined in Tibetan language, which is represented as a pair of a meaning frame defining the necessary information extraction. Then we put forward a method to acquire the concepts by the hyponymy from the pattern-match sentences."}, "conf/wism/QiuWZQ11": {"title": "Extracting Hyponymy Patterns in Tibetan Language to Enrich Minority Languages Knowledge Base.", "url": "https://doi.org/10.1007/978-3-642-23982-3_13", "year": "2011", "author": {"Lirong Qiu": "63/3087", "Yu Weng": "03/7269", "Xiaobing Zhao": "65/3208", "Xiaoyu Qiu": "21/10243"}, "abstract": "Semantic ontology is a formal, explicit specification of a shared conceptualization. The construction of semantic ontology knowledge base is the vital process in language processing, which is applied in information retrieval, information extraction and automatic translation. Hyponymy pattern is a basic semantic relationship between concepts, which is used to concepts acquisition to enrich ontology automatically. In this paper, the construction idea of multilingual ontology with unified criteria and interface are introduced, and hyponymy pattern is represented as a pair of a meaning frame defining the necessary information extraction in Tibetan language. The research of hyponymy relationship pattern can assist concept enrichment in ontology, which can reduce the cost during the ontology engineering process.Keywordsknowledge basesemantic ontologyconcepts acquisitionhyponymy relation"}, "conf/iscsct/QiuCZY08": {"title": "Promoting Adaptation of Semantic Web Service Composition Using Context Information.", "url": "https://doi.org/10.1109/ISCSCT.2008.325", "year": "2008", "author": {"Lirong Qiu": "63/3087", "Yongcun Cao": "82/4599", "Xiaobing Zhao": "65/3208", "Guosheng Yang": "53/3019"}, "abstract": " Abstract:In this paper, we propose a context-aware service composition framework to ascertain the efficiency and flexibility for the composition process, and thereby improving the adaptation. The major technical contributions of this paper are: (1) we propose an ontology-based context model, OWL-SC, captures the service-related, environment-related and user-related context and can be used in an unambiguous, machine interpretable form. (2) We propose an approach to use the context information and to derive implicit context. (3) We propose a hybrid method to generate the composition process and filtering the inappropriate services."}, "conf/dlog/ChangSQL07": {"title": "Dynamic Description Logic: Embracing Actions into Description Logic.", "url": "http://ceur-ws.org/Vol-250/paper_24.pdf", "year": "2007", "author": {"Liang Chang 0003": "72/6746-3", "Zhongzhi Shi": "52/1213", "Lirong Qiu": "63/3087", "Fen Lin": "62/1512"}, "abstract": ""}, "conf/apscc/QiuLWS06": {"title": "Semantic Web Services Composition Using AI Planning of Description Logics.", "url": "https://doi.org/10.1109/APSCC.2006.92", "year": "2006", "author": {"Lirong Qiu": "63/3087", "Fen Lin": "62/1512", "Changlin Wan": "15/158", "Zhongzhi Shi": "52/1213"}, "abstract": " Abstract:Web services composition techniques are gaining momentum as the opportunity to establish reusable and versatile inter-operability applications. The purpose of semantic Web services is to use semantic specification to automate the discovery, invocation, and composition Web services. Description logics is the formalized foundation of semantic Web services and provides well-defined semantics. And many researchers propose their composition approach based on planning techniques. We propose our service composition methods based on description logics and AI planning technologies. Our algorithm for services composition uses backward-chaining search method to find potential candidate services. And we propose a DAG-based method to generate the planning process and filtering the inappropriate services during the DAG generation process. We test our approach on a simple, yet realistic example, and the preliminary results demonstrate that our implementation provides a practical solution"}, "conf/gi/QiuS06": {"title": "Context-aware Services Composition based on AI Planning.", "url": "https://dl.gi.de/20.500.12116/23535", "year": "2006", "author": {"Lirong Qiu": "63/3087", "Zhongzhi Shi": "52/1213"}, "abstract": ""}, "conf/icebe/QiuSL06": {"title": "Context Optimization of AI planning for Services Composition.", "url": "https://doi.org/10.1109/ICEBE.2006.32", "year": "2006", "author": {"Lirong Qiu": "63/3087", "Zhongzhi Shi": "52/1213", "Fen Lin": "62/1512"}, "abstract": " Abstract:Web services composition techniques are gaining momentum as the opportunity to establish reusable and versatile inter-operability applications. Many researchers propose their composition approach based on planning techniques. We propose our context aware planning method which comprises global planning and local optimization based on context information. The major technical contributions of this paper are: (1) we propose an ontology-based framework for the context-aware composition of Web services. Context model, which are structured based on OWL-S, captures the service-related, environment-related, and user-related context and can be used in an unambiguous, machine interpretable form. (2) We propose context-aware plan architecture and thus is more scalability and flexibility for the planning process, and thereby improving the efficiency and precision. (3) We propose a hybrid approach to build a plan corresponding to a context-aware service composition, based on global planning and local optimization, considering both the usability and adoption. We test our approach on a simple, yet realistic example, and the preliminary results demonstrate that our implementation provides a practical solution"}, "conf/prima/LinQHYS06": {"title": "Description Logic Based Composition of Web Services.", "url": "https://doi.org/10.1007/11802372_21", "year": "2006", "author": {"Fen Lin": "62/1512", "Lirong Qiu": "63/3087", "He Huang": "75/4947", "Qing Yu": "92/3937", "Zhongzhi Shi": "52/1213"}, "abstract": "Automatic service composition may dramatically improve development efficiency of Web Service applications. This paper proposes an approach to automatically process semantic and dynamic service composition using Description Logics(DLs) and AI planning techniques. Services and service composition problems are formalized with DLs to provide well-defined semantics. Four relationships among services as well as two combined service expressions are defined, with which AI planning techniques can be used to reason about how to compose services to achieve user-defined goals. We present an algorithm for automatic service composition, which uses backward-chaining search of potential services, and automatically eliminates irrelevant services while selecting, thus guarantee the execution efficiency. We also make some performance optimization of the algorithm such as removing redundant services and reusing previously achieved goals. All the composition steps could be done dynamically and automatically. Finally, we present an example to show how the algorithm works.KeywordsSemantic Web Services(SWS)Web Services Composition (WSC)Description Logic(DL)"}, "conf/IEEEcit/HuangCQS05": {"title": "Service-Oriented Knowledge Management on Virtual Organizations.", "url": "https://doi.org/10.1109/CIT.2005.167", "year": "2005", "author": {"He Huang": "75/4947", "Yong Cheng": "34/6276", "Lirong Qiu": "63/3087", "Zhongzhi Shi": "52/1213"}, "abstract": " Abstract:WWW is a repository of information mainly oriented to human consumption. The lack of explicit and formal expression of data semantics makes the Web increasingly difficult to use and exploit. To remedy it, knowledge management sphere (KMSphere), taking advantages of semantic Web, Web services and virtual organizations, is proposed to explore important aspects of service-oriented and ontology-driven knowledge management on the grid. By building two kinds of mappings, ontologies construct a knowledge space on top of data repositories. KMSphere, based on OGSA, emphasizes how to organize, discover, utilize, and manage the knowledge resources in that space. This paper describes in detail the architecture of KMSphere."}, "conf/prima/HuangSHQL05": {"title": "An Interval-Based Knowledge Model and Query Language for Temporal Information.", "url": "https://doi.org/10.1007/978-3-642-03339-1_25", "year": "2005", "author": {"He Huang": "75/4947", "Zhongzhi Shi": "52/1213", "Xiaoxiao He": "22/9737", "Lirong Qiu": "63/3087", "Jiewen Luo": "78/4887"}, "abstract": "Time plays a crucial role in describing dynamic domain and resources on the Web. Most of current ontology languages, without notion of time or change, can only describe domain knowledge in a static sense. In order to bring structure to time-varying information, we propose an interval-based knowledge model (IKM), which is composed of a temporal knowledge schema, temporal integrity constraints and an interpretation structure. In the IKM, a group of expressive temporal constructs are provided to capture the temporal features of concepts, attributes and relationships; a group of rules are defined to enrich expressivity of the model; formal meaning is given to the model via an interpretation with model-theoretical semantics. A high-level query language is defined on the model, too.KeywordsDescription LogicQuery LanguageFormal SemanticIntegrity ConstraintTemporal ElementThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/webi/HuangSQC05": {"title": "Ontology-Driven Knowledge Management on the Grid.", "url": "https://doi.org/10.1109/WI.2005.109", "year": "2005", "author": {"He Huang": "75/4947", "Zhongzhi Shi": "52/1213", "Lirong Qiu": "63/3087", "Yong Cheng": "34/6276"}, "abstract": " Abstract:The combination of large data set size, geographic distribution of resources and users, and sophisticated applications on data and information needs robust infrastructures. In this paper, knowledge management sphere (KMSphere) is proposed and developed to explore important aspects of service-oriented and ontology-driven knowledge management on the grid. The main idea of KMSphere is to integrate ontologies with a service-oriented grid, build a knowledge space on top of databases, and then organize, utilize, and manage the knowledge resources in that space."}, "journals/mta/PuGQDW22": {"title": "An efficient hybrid approach based on PSO, ABC and k-means for cluster analysis.", "url": "https://doi.org/10.1007/s11042-021-11016-6", "year": "2022", "author": {"Qiumei Pu": "02/3844", "Jingkai Gan": "321/3597", "Lirong Qiu": "63/3087", "Jiaxin Duan": "311/2090", "Hui Wang": "39/721"}, "abstract": "Particle Swarm Optimization (PSO) algorithm is one of the typical example of Swarm Intelligence (SI) algorithm. This article addresses such problems of PSO algorithm as random initial position of each particle, unsmooth speed weight change, and poor search ability, and proposes an optimization algorithm—hybrid PSO (HPSO) algorithm to solve these problems. This algorithm makes comprehensive improvements to the PSO clustering algorithm by using the K-means clustering algorithm to generate initial clustering centers, adopting a negative exponential function model to update the weight of velocity when constructing the “position-velocity” model, and introducing the “search restriction” mechanism, and the “fly-back” mechanism and auxiliary search methods such as the single point crossover operator in the Artificial Bee Colony (ABC) algorithm. Furthermore, experimental results were analyzed and verified. The experiment compares HPSO algorithm with K-Means algorithm, PSO algorithm, and other two typical improved algorithms from the literature on six of the UCI standard clustering test data sets. The results indicate that HPSO algorithm has good performance in stability, clustering effectiveness, robustness and global search ability."}, "journals/access/LuHLQHW20": {"title": "High Precision Self-Mixing Interferometer Based on Reflective Phase Modulation Method.", "url": "https://doi.org/10.1109/ACCESS.2020.3036880", "year": "2020", "author": {"Liping Lu": "48/4470", "Lu Hu": "123/3689", "Zhen Li": "74/2397", "Lirong Qiu": "63/3087", "Wencai Huang": "279/2454", "Xiulin Wang": "207/6002"}, "abstract": " Abstract:In this paper, a novel self-mixing interferometer based on reflective phase modulation (RPM) method has been developed to perform micro-displacement reconstruction with nanometer accuracy. Broaden harmonic components spectrum of the self-mixing signal is produced by employing a high-frequency vibrating reflective mirror as the phase modulation device. Phase demodulation is implemented applying the orthogonal demodulation algorithm subject to the signal spectrum, in which orthogonal signal can be extracted from the harmonic components of the expanded Bessel function. The principle and signal processing approach are introduced in detail, and the simulation results indicate that the reconstruction error can be reduced as the number of reflections increases. A series of experiments at different vibration amplitudes show that the reconstructed errors are all less than 10 nm with modulation frequency of 1 kHz. And the minimum error of 3 nm has been achieved at the measured amplitude of 229 nm, which demonstrates the technical-superiority and high-performance of the method."}, "journals/access/YuQ19": {"title": "ULW-DMM: An Effective Topic Modeling Method for Microblog Short Text.", "url": "https://doi.org/10.1109/ACCESS.2018.2885987", "year": "2019", "author": {"Jia Yu 0011": "86/3457-11", "Lirong Qiu": "63/3087"}, "abstract": "Topic: Artificial Intelligence and Cognitive Computing for Communication and Network"}, "journals/access/SongZLQZ19": {"title": "An Improved U-Net Convolutional Networks for Seabed Mineral Image Segmentation.", "url": "https://doi.org/10.1109/ACCESS.2019.2923753", "year": "2019", "author": {"Wei Song": "62/1539", "Nan Zheng": "44/5519", "Xiangchun Liu": "244/4387", "Lirong Qiu": "63/3087", "Rui Zheng": "33/7132"}, "abstract": "Topic: Advanced Optical Imaging for Extreme Environments"}, "journals/access/CaiQKZ19": {"title": "CBIM-RSRW: An Community-Based Method for Influence Maximization in Social Network.", "url": "https://doi.org/10.1109/ACCESS.2019.2944350", "year": "2019", "author": {"Feng Cai": "99/2623", "Lirong Qiu": "63/3087", "Xinkai Kuai": "68/9614", "Hongshuai Zhao": "252/1672"}, "abstract": " Abstract:Influence maximization is an important problem, which seeks a small set of key users who spread the influence widely into the network. It finds applications in viral marketing, epidemic control, and assessing cascading failures within complex systems. The current studies treat nodes in social network with equal weights, and the influence possibility mainly decide by node degree. In this paper, we study the influence maximization problem in social networks and we improve the independent cascade model to realize the goal of different weights for different users, and the differentiation of influence probability. Meanwhile, We take advantage of the community structure to speed up the algorithm. Then, we propose a method called the reverse reachable index method based on random walk (RSRW) to select potential high-impact nodes from those communities. The experimental result on four actual data set shows that these improvements can greatly reduce the calculation time while ensuring the accuracy of the results."}, "journals/access/QiuLZ18": {"title": "Advanced Sentiment Classification of Tibetan Microblogs on Smart Campuses Based on Multi-Feature Fusion.", "url": "https://doi.org/10.1109/ACCESS.2018.2820163", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Qiao Lei": "29/10130", "Zhen Zhang": "19/5112"}, "abstract": " Abstract:Sentiment analysis is an important problem in natural language processing, which plays an important role in many fields, such as information forecasting, knowledge classification, and product review. Because Tibetan microblogs have their own unique form, particularly the heterogeneous features, such as the emoticons, the grammatical relations, and the speech, the existing sentiment analysis method has difficulty in analyzing the emotions that such microblogs express. In this paper, we propose a sentiment classification method for Tibetan microblogs based on multi-feature fusion. To better study the affection of affective features, this paper first determines the theme of Weibo texts and chooses smart campuses as theme of Weibo texts for analyzing the influence of each feature on the sentiment of the microblog. Then, these features are fused as a multi-feature, and the sentiment of the Tibetan microblog is classified according to the multifeature fusion. The experimental results demonstrated that the sentiment classification algorithm based on feature fusion improved the accuracy of microblog sentiment classification."}, "journals/access/QiuCLPZ18": {"title": "Tibetan Weibo User Group Division Based on User Behaviors for Analyzing Health Problems.", "url": "https://doi.org/10.1109/ACCESS.2018.2822767", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Feng Cai": "99/2623", "Jie Li": "17/2703", "Limei Peng": "131/7378", "Yin Zhang 0002": "91/3045-2"}, "abstract": "Topic: Mobile Multimedia for Healthcare"}, "journals/access/QiuCJZ18": {"title": "Query Intent Recognition Based on Multi-Class Features.", "url": "https://doi.org/10.1109/ACCESS.2018.2869585", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Yida Chen": "228/2383", "Haoran Jia": "225/1496", "Zhen Zhang": "19/5112"}, "abstract": " Abstract:In order to enhance the user search experience of the search engine, an intent recognition search based on natural language input is proposed. By using reality mining technology to obtain the potential consciousness information from the query expression, search engines can better predict the query results that meet users’ requirements. With the development of conventional machine learning and deep learning, it is possible to further improve the accuracy of prediction results. This paper adopts a similarity calculation method based on long short-term memory (LSTM) and a traditional machine learning method based on multi-feature extraction. It is found that entity features can significantly improve the accuracy of intention classification. Second, the accuracy of intention classification based on the feature sequence constructed by key entities is up to 94.16% in the field of manual labeling by using the BiLSTM classification model."}, "journals/cluster/QiuL18": {"title": "Sentiment analysis of short texts in microblog based on ependency parsing.", "url": "https://doi.org/10.1007/s10586-017-0995-0", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Jie Li": "17/2703"}, "abstract": "Traditional approaches to analyzing short text sentiment rarely consider the relationship between emotional words and modifiers. Most traditional methods simply accumulate the sentiment of the sentence to obtain the sentiment of short text. In this paper, we propose a method to mitigate the problems through sentiment structure and sentiment calculation rules. The sentiment structure is obtained from the dependency parsing process with the relationship migration and modified distance, which makes a solid contribution to analyzing the sentiment of short text. The sentiment of short text is accumulated according to the different influence of relationships between the clauses and the contribution of each sentence to the sentiment calculation of short text. Experiment result indicates the effective of the approach."}, "journals/complexity/QiuY18": {"title": "CLDA: An Effective Topic Model for Mining User Interest Preference under Big Data Background.", "url": "https://doi.org/10.1155/2018/2503816", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Jia Yu 0011": "86/3457-11"}, "abstract": ""}, "journals/complexity/QiuYLJ18": {"title": "Tibetan Weibo User Group Division Based on Semantic Information in the Era of Big Data.", "url": "https://doi.org/10.1155/2018/5809043", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Jia Yu 0011": "86/3457-11", "Jie Li": "17/2703", "Haoran Jia": "225/1496"}, "abstract": ""}, "journals/fgcs/QiuCX18": {"title": "Quantum digital signature for the access control of sensitive data in the big data era.", "url": "https://doi.org/10.1016/j.future.2018.03.053", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Feng Cai": "99/2623", "Guixian Xu": "67/7648"}, "abstract": "In our paper we focus on the application of quantum digital signature in the access control of sensitive data such as those data appears in areas like healthcare in order to protect users personal information. There are three parties in our protocol: the signer, the arbitrator and the receiver. Different from most existing protocols developed in arbitrated quantum signature, in which the arbitrator is either assumed to be honest or dishonest, in our protocol we assume the arbitrator is partially honest in the sense that the arbitrator is honest-but-curious. The quantum protocol we propose in this paper have various advantages over existing protocols of the same purpose. The technology we proposed can guarantee the unconditional secure, and it is implementable by the current technology, so the method we proposed can guarantee the security of user’ personal information in the big data era."}, "journals/soco/QiuS18": {"title": "Deontic STIT logic, from logical paradox to security policy.", "url": "https://doi.org/10.1007/s00500-017-2497-7", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Xin Sun 0001": "20/3535-1"}, "abstract": "A deontic STIT logic is studied in this paper with the possible application of specifying security policies for intrude detection in the pervasive computing environment. Compared to the existing deontic STIT logics, an advantage of our logic is that it is capable of solving the miners paradox, a logical paradox which recently grabs attentions of logicians, philosophers, linguistists and computer scientists. A complete and sound axiomatization of our logic is developed."}, "journals/soco/Qiu0X18": {"title": "Categorical quantum cryptography for access control in cloud computing.", "url": "https://doi.org/10.1007/s00500-017-2688-2", "year": "2018", "author": {"Lirong Qiu": "63/3087", "Xin Sun 0001": "20/3535-1", "Juan Xu 0004": "42/5953-4"}, "abstract": "Access control is a mechanism that is used to decide which agent has access to which resource with some specific operations. This paper is devoted to the investigation of quantum cryptography in access control. We develop three quantum protocols and use them for key distribution, identity authentication and digital certification, respectively. We analyze our protocols by the graphical language of categorical quantum mechanics. These protocols are unconditionally secure and implementable by the current technology."}, "journals/tcyb/ZhuangLJZQH18": {"title": "Semantic Feature Learning for Heterogeneous Multitask Classification via Non-Negative Matrix Factorization.", "url": "https://doi.org/10.1109/TCYB.2017.2732818", "year": "2018", "author": {"Fuzhen Zhuang": "48/5638", "Xuebing Li": "70/10084", "Xin Jin 0004": "68/3340-4", "Dapeng Zhang": "81/5909", "Lirong Qiu": "63/3087", "Qing He 0003": "14/3700-3"}, "abstract": " Abstract:Multitask learning (MTL) aims to learn multiple related tasks simultaneously instead of separately to improve the generalization performance of each task. Most existing MTL methods assumed that the multiple tasks to be learned have the same feature representation. However, this assumption may not hold for many real-world applications. In this paper, we study the problem of MTL with heterogeneous features for each task. To address this problem, we first construct an integrated graph of a set of bipartite graphs to build a connection among different tasks. We then propose a non-negative matrix factorization-based multitask method (MTNMF) to learn a common semantic feature space underlying different heterogeneous feature spaces of each task. Moreover, an improved version of MTNMF (IMTNMF) is proposed, in which we do not need to construct the correlation matrix between input features and class labels, avoiding the information loss. Finally, based on the common semantic features and original heterogeneous features, we model the heterogenous MTL problem as a multitask multiview learning (MTMVL) problem. In this way, a number of existing MTMVL methods can be applied to solve the problem effectively. Extensive experiments on three real-world problems demonstrate the effectiveness of our proposed methods, and the improved version IMTNMF can gain about 2% average accuracy improvement compared with MTNMF."}, "journals/cluster/QiuYPX17": {"title": "Knowledge entity learning and representation for ontology matching based on deep neural networks.", "url": "https://doi.org/10.1007/s10586-017-0844-1", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Jia Yu 0011": "86/3457-11", "Qiumei Pu": "02/3844", "Chuncheng Xiang": "165/3034"}, "abstract": "We study the task of ontology matching that is used mainly for solving the semantic heterogeneity problems, which concentrates on finding semantically related entities between different ontologies. Many previous works exploit the character-level or token-level information of the descriptions of an entity in ontology directly when applying the string-based matcher or token based matcher to find the corresponding entities. They ignored the higher level correlations between different descriptions of an entity. To address this problem, we propose a representation learning method based on deep neural networks which aim at learning the high level abstract representations of the input entity. Particularly, the representations of the entities are learned in an unsupervised way firstly, and then fine-tuned in a supervised manner with the training data. The experiment results show that our approaches can learn useful representations for entities from its descriptive information to better measure the similarity between entities."}, "journals/complexity/QiuZZP17": {"title": "Tibetan Microblog Emotional Analysis Based on Sequential Model in Online Social Platforms.", "url": "https://doi.org/10.1155/2017/5342601", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Huili Zhang": "47/3405", "Zhen Zhang": "19/5112", "Qiumei Pu": "02/3844"}, "abstract": ""}, "journals/complexity/QiuL17": {"title": "Covering the Monitoring Network: A Unified Framework to Protect E-Commerce Security.", "url": "https://doi.org/10.1155/2017/6254842", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Jie Li": "17/2703"}, "abstract": ""}, "journals/istr/Qiu0Z17": {"title": "Realizing correlated equilibrium by secure computation.", "url": "https://doi.org/10.1016/j.jisa.2017.01.008", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Xin Sun 0001": "20/3535-1", "Xishun Zhao": "52/3862"}, "abstract": "In this paper we propose a cryptographic protocol to realize correlated equilibrium without a mediator. Our protocol realizes correlated equilibria of multi-agent games. It is collusion free, unconditional secure and much simpler than other existing protocols."}, "journals/puc/QiuLPS17": {"title": "Implementing RSA for sensor nodes in smart cities.", "url": "https://doi.org/10.1007/s00779-017-1044-y", "year": "2017", "author": {"Lirong Qiu": "63/3087", "Zhe Liu 0001": "70/1220-1", "Geovandro C. C. F. Pereira": "68/9385", "Hwajeong Seo": "121/4554"}, "abstract": "In smart city construction, wireless sensor networks (WSNs) are normally deployed to collect and transmit real-time data. The nodes of the WSN are embedded facility that integrated sensors and data processing modules. For security and privacy concerns, cryptography methods are required for data protection. However, the Rivest-Shamir-Adleman (RSA) cryptosystem, known as the the most popular and deployed public key algorithm, is still hardly implemented on embedded devices because of the intense computation required from its inherent arithmetic operations. Even though, different methods have being proposed for more efficient RSA implementations such as utilizing the Chinese remainder theorem, various modular exponentiation methods, and optimized modular arithmetic methods. In this paper, we propose an efficient multiplication for long integers on the sensor nodes equipped with 16-bit microcontrollers. Combined with this efficient multiplication, we obtain a faster Montgomery multiplication. The combined optimized Montgomery multiplication, the Chinese remainder theorem, and the m-ary exponentiation method allowed for execution times of less than 44.6 × 106 clock cycles for RSA decryption, a new speed record for the RSA implementation on MSP430 microcontrollers."}, "journals/jdim/XuQY14": {"title": "Tibetan Text Clustering Based on Machine Learning.", "url": "http://dline.info/fpaper/jdim/v12i3/2.pdf", "year": "2014", "author": {"Guixian Xu": "67/7648", "Lirong Qiu": "63/3087", "Lu Yang": "58/2893"}, "abstract": ""}, "journals/jdim/XuQL14": {"title": "Study on Hot Topic Discovery from Chinese Texts.", "url": "http://dline.info/fpaper/jdim/v12i4/5.pdf", "year": "2014", "author": {"Guixian Xu": "67/7648", "Lirong Qiu": "63/3087", "Hongfang Liu": "92/2407"}, "abstract": ""}, "journals/soca/QiuCLS07": {"title": "Context optimization of AI planning for semantic Web services composition.", "url": "https://doi.org/10.1007/s11761-007-0010-3", "year": "2007", "author": {"Lirong Qiu": "63/3087", "Liang Chang 0003": "72/6746-3", "Fen Lin": "62/1512", "Zhongzhi Shi": "52/1213"}, "abstract": "Web services composition techniques are gaining momentum as the opportunity to establish reusable and versatile inter-operability applications. Many researchers propose their composition approach based on planning techniques. We propose our context aware planning method which comprises global planning and local optimization based on context information. The major technical contributions of this paper are: (1) We propose an ontology-based framework for the context-aware composition of Web services. Context model, which are structured based on OWL-S, captures the Service-related, Environment-related, and User-related context and can be used in an unambiguous, machine interpretable form. (2) We propose context-aware plan architecture and thus is more scalability and flexibility for the planning process, and thereby improving the efficiency and precision. (3) We propose a hybrid approach to build a plan corresponding to a context-aware service composition, based on global planning and local optimization, considering both the usability and adoption. We test our approach on a simple, yet realistic example, and the preliminary results demonstrate that our implementation provides a practical solution."}}}