{"id": "09/10696", "name": "Pengrui Duan", "Article": {"conf/mm/ChengLDL020": {"title": "PyAnomaly: A Pytorch-based Toolkit for Video Anomaly Detection.", "url": "https://doi.org/10.1145/3394171.3414540", "year": "2020", "author": {"Yuhao Cheng": "242/4245", "Wu Liu": "31/4112", "Pengrui Duan": "09/10696", "Jingen Liu": "10/5849", "Tao Mei 0001": "12/5444-1"}, "abstract": "\n\t\tVideo anomaly detection is an essential task in computer vision which attracts massive attention from academia and industry. The existing approaches are implemented in diverse deep learning frameworks and settings, making it difficult to reproduce the results published by the original authors. Undoubtedly, this phenomenon is detrimental to the development of Video Anomaly detection and community communication. In this paper, we present a PyTorch-based video anomaly detection toolbox, namely PyAnomaly that contains high modular and extensible components, comprehensive and impartial evaluation platforms, a friendly manageable system configuration, and the abundant engineering deployment functions. To make it easy-to-use and easy-to-extend, we implement the architecture by hooks and registers functionality. Remarkably, we have reproduced the comparable experimental results of six representative methods as those published by the original authors, and we will release these pre-trained models with more rich configurations. To our best knowledge, the PyAnomaly is the first open-source tool in video anomaly detection and is available at https://github.com/YuhaoCheng/PyAnomaly.\n\t"}, "conf/acmturc/SongDLM19": {"title": "CNDTSN: enhanced DTSN based on classified nodes.", "url": "https://doi.org/10.1145/3321408.3321598", "year": "2019", "author": {"Yecheng Song": "245/1398", "Pengrui Duan": "09/10696", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": "\n\t\tIn the time of Internet of Things, with the explosion of scalar data in wireless sensor network(WSN), single type of scalar data transmission can no longer fulfill the needs in various WSN situations. Due to the limitation of available resources on WSN devices, several transmit protocols are designed to effectively improve the channel utilization efficiency and reduce the end-to-end delay. When transmitting non-scalar data like pictures presented as arrays or matrixs, traditional protocol can barely handle this situation efficiently. In this paper, we propose CNDTSN, nodes in WSN are classified into two types, R nodes with strong storage capacity and s nodes mainly collecting the information. The result says that with cooperation, the effective throughput improves in the network and the overall delay is apparently decreased.\n\t"}, "conf/ccbr/WangZLXHLD19": {"title": "Iris Image Super Resolution Based on GANs with Adversarial Triplets.", "url": "https://doi.org/10.1007/978-3-030-31456-9_39", "year": "2019", "author": {"Xiao Wang": "49/67", "Hui Zhang 0061": "181/2846-61", "Jing Liu": "72/2590", "Lihu Xiao": "122/2639", "Zhaofeng He": "13/3992", "Liang Liu 0001": "10/6178-1", "Pengrui Duan": "09/10696"}, "abstract": "\nIris recognition is a safe and reliable biometric technology commonly used at present. However, due to the limitations of equipment and environment in a variety of application scenarios, the obtained iris image may be of low quality and not clear enough. In recent years, there are many attempts to apply neural networks to iris image enhancement. This paper is inspired by SRGAN, and introduces the adversarial idea into the triplet network, finally proposing a novel iris image super-resolution architecture. With triplet loss, the Network can keep reducing intra-class distance and expanding inter-class distance during iris image reconstruction. The experiments on CASIA’s several benchmark iris image datasets yield considerable results. This architecture makes a contribution to enhancing iris images for recognition.KeywordsBiometric technologyIris image super-resolutionGANsTriplet network"}, "conf/icpads/XiaZDWLM19": {"title": "Ground-Station Based Software-Defined LEO Satellite Networks.", "url": "https://doi.org/10.1109/ICPADS47876.2019.00102", "year": "2019", "author": {"Dan Xia": "27/6461", "Xiaolong Zheng 0002": "98/3341-2", "Pengrui Duan": "09/10696", "Chaoyu Wang": "239/4819", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Low Earth Orbit (LEO) satellite networks play an indispensable role in global communications. To cope with the dynamic nature of the LEO networks, a flexible management architecture that can provide low-latency configuration and routing services is desired. Recent advances of Software Defined Networks (SDN) inspire researches using geostationary satellites, GEO, as the controllers to build the SDN solutions for LEO satellite networks. However, GEO-based solutions inevitably face the bottleneck problem because all the routing requests have to be processed and forwarded by a limited number of GEO satellites. In this paper, we propose HTCA, a Hierarchical Terrestrial Controllers Architecture based on SDN that reuses the ground stations instead of dedicated GEO satellites to establish a more scalable control plane. But the limited coverage of a ground station brings about design challenges for consistent network management and seamless routing service. HTCA adopts an online network view integration method to support flexible and consistent management. A load-aware routing method is also designed for HTCA to provide seamless and low-latency routing service. The experiment results demonstrate that HTCA can achieve agile configuration and reduce the instruction update time by 86.87%, compared with the GEO-based solution."}, "conf/msn/LiD19": {"title": "AMRnet: A Real-Time Automatic Modulation Recognition Network for Wireless Communication System.", "url": "https://doi.org/10.1109/MSN48538.2019.00031", "year": "2019", "author": {"Xinyu Li": "88/2359", "Pengrui Duan": "09/10696"}, "abstract": " Abstract:In recent years, deep learning has brought new opportunities and challenges to the wireless communication field, owing to its expressive capacity and convenient optimization capability. In this paper, we propose a real-time Automatic Modulation Recognition Network (AMRnet) for signal transmission process, which can be easily applied to mobile and embedded wireless communication applications (e.g., The GNU Radio system based on USRP platform). Our proposed AMRnet consists of a series of convolutional neural networks based on the design theory of lightweight networks. More specifically, depthwise separable convolution structure is used to reduce computational complexity of the whole network. Residual block is included to improve the robustness for the simple backbone network. In addition, channel attention mechanism is added to lay more emphasis on the channel-wise information due to the unique data futures of the I/Q signal. We present numerous experiments on resource and accuracy tradeoffs and show strong performance compared to a number of state-of-the-art methods. This work will have a great impact on the future communication systems."}, "conf/cwsn/DuanMQ14": {"title": "Adaptive Payload Length Algorithm for Video Transmission Over Wireless Multi-hop Networks.", "url": "https://doi.org/10.1007/978-3-662-46981-1_41", "year": "2014", "author": {"Pengrui Duan": "09/10696", "Huadong Ma": "04/6217", "Le Qian": "160/0763"}, "abstract": "Video transmission over wireless multi-hop networks is challenging due to the varying nature of the wireless channel as well as the inherent difference between the video data traffic and the general data traffic. A single bit error in a packet may lead to the packet loss, which results in poor quality of the entire video frame. In this paper, we first analyze the effect of payload length on the overhead of bit error, video frame reassembly and network efficiency. Then, to improve the quality of video transmission, we propose an adaptive payload length algorithm based on the digital fountain codes while take transmission efficiency into account. The simulation environment is also designed to evaluate the performance of multi-hop video transmission, which is based on the ARM embedded system. Numerical simulations show that adaptive payload length algorithm can improve the quality of video transmission over wireless multi-hop networks.KeywordsVideo transmissionMulti-hopFountain codesPayload length"}, "conf/msn/YuanMD11": {"title": "On Exploiting Few Strangers for Data Forwarding in Delay Tolerant Networks.", "url": "https://doi.org/10.1109/MSN.2011.51", "year": "2011", "author": {"Peiyan Yuan": "72/906", "Huadong Ma": "04/6217", "Pengrui Duan": "09/10696"}, "abstract": " Abstract:Routing is one of the challenging tasks in Delay Tolerant Networks (DTNs), due to the lack of global knowledge and sporadic contacts between nodes. Most existing works take greedy mechanism to forward messages, i.e., only nodes which have higher quality metrics than current carriers can be selected as relays to final destinations. In this work, we explore the influence of strangers on routing performance under a more challenging scenario of pure darkness. We first present a method to identify the relationship between nodes (i.e., stranger or friend). Second, we explore the optimized number of strangers we can employ. Third, we propose a novel routing scheme which are called STRON in this paper by taking both the STRangers and their Optimized Number into account. We finally compare our routing scheme with the greedy mechanism through synthetical and trace-driven simulations, the results show that our routing strategy achieves a better performance, especially in terms of combined overhead/packet delivery ratio and the average number of hops per message."}, "journals/tits/RenZLMD22": {"title": "Global-Local Temporal Convolutional Network for Traffic Flow Prediction.", "url": "https://doi.org/10.1109/TITS.2020.3025076", "year": "2022", "author": {"Yajie Ren": "196/7201", "Dong Zhao 0001": "63/550-1", "Dan Luo": "03/142", "Huadong Ma": "04/6217", "Pengrui Duan": "09/10696"}, "abstract": " Abstract:Reliable traffic flow prediction is of great value in the field of transportation, which, for example, contributes to traffic control and public safety. The key of achieving better performance is to well capture the non-linear spatial-temporal dependency. The state-of-the-art works consider both aspects, but they ignore the effect of the global trend on local dynamics and fail to capture long-term dynamic dependencies. In this article, we propose a novel Global-Local Temporal Convolutional Network (GL-TCN) to break through these limitations. Specifically, a novel local temporal convolutional mechanism is proposed to capture the long-term local dynamics effectively. Meanwhile, the global and local flow patterns are integrated to handle the effect of the global flow trend on local dynamics. To the best of our knowledge, this is the first work to utilize the temporal convolutional network for traffic flow prediction. Experiments on two real-world datasets demonstrate the superior performance of our method over several state-of-the-art baselines."}, "journals/ijdsn/DuanLZ15": {"title": "A Cross Layer Video Transmission Scheme Combining Geographic Routing and Short-Length Luby Transform Codes.", "url": "https://doi.org/10.1155/2015/140212", "year": "2015", "author": {"Pengrui Duan": "09/10696", "Liang Liu 0001": "10/6178-1", "Zhao Zhang": "87/6853"}, "abstract": ""}, "journals/jcst/YuanMD13": {"title": "Impact of Strangers on Opportunistic Routing Performance.", "url": "https://doi.org/10.1007/s11390-013-1357-x", "year": "2013", "author": {"Peiyan Yuan": "72/906", "Hua-Dong Ma": "29/10531", "Peng-Rui Duan": "09/10696"}, "abstract": "Routing is one of the challenging tasks in Delay Tolerant Networks (DTNs), due to the lack of global knowledge and sporadic contacts between nodes. Most existing studies take a greedy scheme in data forwarding process, i.e., only nodes with higher utility values than current carriers can be selected as relays. They lack an in-depth investigation on the main features of the optimal paths in Epidemic. These features are vital to any forwarding scheme that tends to make a trade-off between packet delivery delay and cost. This is mainly because Epidemic provides an upper bound on cost and a lower bound on delivery delay. Therefore, a deep understanding of these features is useful to make informed forwarding decisions. In this paper, we try to explore these features by observing the roles of different social relationships in the optimal paths through a set of real datasets. These datasets provide evidence that strangers have two sides in data forwarding process, and that the importance of strangers shows a decreasing trend along the forwarding paths. Using this heuristic knowledge, we propose STRON, a distributed and lightweight forwarding scheme. The distributed feature makes it very suitable for opportunistic scenarios and the low communication and computation features make it easy to be integrated with state-of-the-art work. The trace-driven simulations obviously confirm its effectiveness, especially in terms of packet delivery delay and cost. Keywords stranger, forwarding mechanism, social relationship, Delay Tolerant Network"}}}