{"id": "06/43", "name": "Qibo Sun", "Article": {"conf/service/WangKSXW22": {"title": "Congestion Detection and Link Control via Feedback in RDMA Transmission.", "url": "https://doi.org/10.1109/ICSS55994.2022.00010", "year": "2022", "author": {"Tianshi Wang": "147/8926", "Hongwei Kan": "277/1885", "Qibo Sun": "06/43", "Shan Xiao": "130/1877", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:Researchers and practitioners are exploiting Remote Direct Memory Access (RDMA) technology to improve the efficiency of distributed machine learning and meet the demands of data-center applications. RDMA requires lossless network link to fully unleash its power. RDMA Over Converged Ethernet (RoCE) v2 focuses on congestion control, but fails to achieve efficient packet loss recovery; Improved RoCE NIC (IRN) addresses this issue based on RoCEv2, but does not use the Priority-based Flow Control (PFC) to maintain the advantage of RoCEv2 in detecting congestion. This paper proposes a method of congestion detection and link control via feedback in RDMA transmission, namely Feedback Data Flow Control (FDFC), that does not rely on PFC. FDFC detects and controls the link condition in real time to achieve the goals of precise detection, congestion control, and efficient packet loss recovering."}, "conf/edge/WangLXMZS21": {"title": "Tiansuan Constellation: An Open Research Platform.", "url": "https://doi.org/10.1109/EDGE53862.2021.00022", "year": "2021", "author": {"Shangguang Wang": "73/8637", "Qing Li": "181/2689", "Mengwei Xu": "143/0845", "Xiao Ma": "35/573", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43"}, "abstract": " Abstract:Satellite network is the first step towards interstellar voyages. It can provide global Internet connectivity everywhere on the earth, where most areas cannot access the Internet by the terrestrial infrastructure due to the geographic accessibility and high deployment cost. The space industry experiences a rise in large low-earth-orbit satellite constellations to achieve universal connectivity. The research community is also urgent to do some leading research to bridge the connectivity divide. Researchers now conduct their work by simulation, which is far from enough. However, experiments on real satellites are hindered by the exceptionally high bar of space technology, such as deployment cost and unknown risks. To solve the above challenges, we are eager to contribute to the universal connectivity and build an open research platform, Tiansuan constellation, to support experiments on real satellite networks. We discuss the potential research topics that would benefit from Tiansuan. We provide two case studies that have already been deployed in two experimental satellites of Tiansuan."}, "conf/icaiis/PangS21": {"title": "Network Slicing in LEO Satellite Network.", "url": "https://doi.org/10.1145/3469213.3470261", "year": "2021", "author": {"Jinkun Pang": "304/9519", "Qibo Sun": "06/43"}, "abstract": "\n\t\tTo solve the problems of LEO (Low Earth Orbit) satellite network, such as insufficient flexibility and low resource utilization, an architecture using network slicing technology is proposed. Then a prototype system based on the Docker platform and DTN (Delay Tolerant Network) is implemented, providing IMS (IP Multimedia Subsystem) network slice, Internet of Things network slice and web network slice. Tested by prototype system, the results show that each network slice can independently provide relevant service without affecting each other, and can be allocated network resources flexibly according to the performance requirements of the services. The architecture can effectively improve the flexibility of the core network of LEO satellite network.\n\t"}, "conf/blocksys/WuSZWL20": {"title": "Adaptive Edge Resource Allocation for Maximizing the Number of Tasks Completed on Time: A Deep Q-Learning Approach.", "url": "https://doi.org/10.1007/978-981-15-9213-3_28", "year": "2020", "author": {"Shanshan Wu": "12/2506", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Tao Lei": "91/8024"}, "abstract": "To relieve resource-limited mobile devices from computation-intensive tasks, reduce the transmission latency and mitigate the burden of the backhaul network for the centralized cloud-based network services, mobile edge computing (MEC) has been proposed to be a promising solution and draws increasing attention from both industry and academia. Traditional task offloading approaches focus on average-based metrics, and try to minimize the average service delay. The service delay of different tasks varies from each other, resulting in a low service reliability. To attack this challenge, this paper focuses on mobile users’ computation offloading problem in wireless cellular networks for purpose of maximizing the number of tasks completed on time. Since the environment states, including available local resources, channel conditions and remaining computation resource of the edge cloud, will vary from time to time, we use the model-free reinforcement learning (RL) framework to formulate and tackle the computation offloading problem. The agent learns through interactions with the environment to decide executing task locally on the mobile device or offloading the task to the edge cloud via the wireless link for each mobile device user. Considering high-dimensional state spaces, we use deep Q-learning (DQN) which combines reinforcement learning method Q-learning and deep neural network (DNN) to obtain the optimal approach. Simulation results show that the effectiveness of the proposed approach in comparison with baseline approaches in terms of the total number of the tasks completed on time.KeywordsMobile edge computingComputation offloadingDeep reinforcement learningDeep Q-learning"}, "conf/blocksys/ChenGSZ20": {"title": "Scheduling of Time Constrained Workflows in Mobile Edge Computing.", "url": "https://doi.org/10.1007/978-981-15-9213-3_29", "year": "2020", "author": {"Xican Chen": "134/8744", "Siyi Gao": "230/1937", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1"}, "abstract": "Mobile edge computing is an augmentation of cloud computing, and helps to reduce latency and network traffic. It has become a promising solution for real-time or data-intensive mobile applications. A large amount of mobile applications, such as smart city application, are workflow application. Therefore, workflow scheduling in edge computing environment become one of the key issues in the management of workflow execution. We need to allocate suitable edge resources to workflow task so that the workflow task can be completed within the time constraint specified by end user. We will address this issue in this paper. We formulate the time constrained workflow scheduling problem in mobile edge computing as an integer programming. A workflow scheduling algorithm for mobile edge computing is derived by extending Differential Evolution Algorithm. We conduct simulation experiments by comparing our algorithm with existing algorithms. The results show the effectiveness of our algorithm.KeywordsWorkflowMobile edge computingDeployment algorithmDifferential evolution"}, "conf/blocksys/GaoZCS19": {"title": "Redundant Virtual Machine Placement in Mobile Edge Computing.", "url": "https://doi.org/10.1007/978-981-15-2777-7_30", "year": "2019", "author": {"Siyi Gao": "230/1937", "Ao Zhou 0001": "123/6949-1", "Xican Chen": "134/8744", "Qibo Sun": "06/43"}, "abstract": "Mobile edge computing (MEC), as an extension of the cloud computing paradigm to edge networks, overcomes some obstacles of traditional mobile cloud computing by offering ultra-short latency and less core network traffic. The edge resources are virtualized to be shared among multiple mobile users. Consolidated server systems using server virtualization involves serious risks of hosting server failures. Redundant virtual machine placement can be an effective countermeasure. This problem has been well solved in cloud computing. However, it is a more nontrivial task to efficiently deploy virtual machines redundantly in MEC networks. To address this issue, a redundant virtual machine placement method in MEC is proposed. Firstly, this method estimates the minimum number of virtual machines required based on the performance requirements of the applications. Then, the redundant virtual machine placement problem is formulated as a combinatorial optimization formulation. Finally, a optimal placement strategy searching algorithm is proposed to determine the optimal location of the virtual machines. The strategy can preserve the minimum configuration in the event of failure of any k edge servers. The experiment results illustrates the effectiveness of our algorithm.KeywordsMobile edge computingVirtual machine placementFault-tolerantRedundant configurationCombinatorial optimization"}, "conf/blocksys/DuSGL19": {"title": "Optimal Computation Resource Allocation in Vehicular Edge Computing.", "url": "https://doi.org/10.1007/978-981-15-2777-7_34", "year": "2019", "author": {"Shiyu Du": "150/2351", "Qibo Sun": "06/43", "Jujuan Gu": "257/2698", "Yujiong Liu": "76/7666"}, "abstract": "\nVehicular edge computing is proposed as a new promising paradigm that provides cloud computation capabilities in close proximity to vehicles, which can augment the capabilities of vehicles. In this paper, we study the problem of computation resource allocation of edge servers for a vehicular edge computing system. We consider the constraint of limited computation resource of edge servers and vehicles can decide that vehicular applications are locally executed or offloaded to edge servers for execution to minimize the completion time of applications. We model the problem as a Stackelberg game and then prove the existence of Nash equilibrium of the game. Furthermore, we propose an algorithm to compute the Nash equilibrium effectively. Numerical simulation results demonstrate that our proposed algorithm can greatly reduce the average completion time for all applications and outperform the benchmark approaches.KeywordsLocal and Edge Equilibrium ComputingComputation resource allocationVehicular edge computingGame theoryNash equilibrium"}, "conf/icit/ChengSZ19": {"title": "Edge Assisted Object Detection for Mobile Application.", "url": "https://doi.org/10.1145/3377170.3377276", "year": "2019", "author": {"Wenbo Cheng": "238/3695", "Qibo Sun": "06/43", "Yasheng Zhang": "204/0277"}, "abstract": "\n\t\tObject detection for mobile devices is meaningful especially in the field of IoT. Limited by computing power and network transmission, it's challenging to get high accuracy in mobile object detection. To solve this question, this article designs a system that enables high accuracy object detection running at 30fps for 720p videos. The system employs the object tracking technique, uses the caching technique, decouples the rendering pipeline from the offloading pipeline, and uses dynamic RoI encoding technique to get high detection accuracy. The result of the experiment shows that it can get 88% detection success rate. And it can also increase the detection accuracy by 17.7% and decrease the bandwidth by 52.6%.\n\t"}, "conf/iov/TaoSLZW19": {"title": "Task Planning with Manual Intervention Using Improved JSHOP2 Planner.", "url": "https://doi.org/10.1007/978-3-030-38651-1_5", "year": "2019", "author": {"Liancheng Tao": "256/7580", "Qibo Sun": "06/43", "Jinglin Li": "45/10335", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637"}, "abstract": "In real-world task planning, such as automatic vehicles dispatch, often face the arrival of new tasks and uncertain factors in the process of task execution. As a typical implementation of Hierarchical Task Network (HTN) planning, JSHOP2 planner is suitable for complex task planning. Given the fact that JSHOP2 planner fails to get planning results in the global level when facing uncertain factors, an improved JSHOP2 planner is proposed to solve this problem. The improved JSHOP2 planner with manual intervention supplements the planning result and eliminates the impact of uncertain factors with the help of human experience. In addition, we conducted comparative experiments based on improved planner. The simulation results show the effectiveness and the ability to emergency response of improved planner.KeywordsHTN planningTask planningJSHOP2"}, "conf/iov/KeSLZW19": {"title": "Multi-task Planning with the Consideration of Task Priority.", "url": "https://doi.org/10.1007/978-3-030-38651-1_6", "year": "2019", "author": {"Renkang Ke": "256/7356", "Qibo Sun": "06/43", "Jinglin Li": "45/10335", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637"}, "abstract": "Hierarchical Task Network (HTN) is widely used for intelligent planning problems due to its simplicity and efficiency. As an intelligent planner based on HTN, JSHOP2 can complete task planning in order of precedence or randomly. In real-world tasks planning, such as automatic vehicles dispatch, has to deal with complicated auto planning problems where different tasks must be considered properly at the same time. But JSHOP2 ignores the priority of different tasks and thus fails to deal with multi-task planning problems with priorities. In this paper, we improve JSHOP2 planner by adding priorities to different task lists and task items, and adjusting the order of task execution according to priority. Furthermore, we conduct an experiment using a classic logistics problem, and get the results validate the effectiveness of our method.KeywordsHTN planningMulti-taskJSHOP2Task priority"}, "conf/iov/XiongSZ19": {"title": "Improve the House Price Prediction Accuracy with a Stacked Generalization Ensemble Model.", "url": "https://doi.org/10.1007/978-3-030-38651-1_32", "year": "2019", "author": {"Shilong Xiong": "231/7601", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1"}, "abstract": "House price prediction plays an important role in estate marketplace. Prediction future house price accurately can provide decision making support for home buyers. With the development of machine learning and AI technology, different machine learning models are proposed for house price prediction. However, the prediction accuracy is still not very high. Model ensembling is a very powerful technique to increase the accuracy of a variety of machine learning models. To address this issue, we propose a stacked generation model which consists of various regression models to predict house price. The experiment results show that the stacked model performs better than traditional machine learning models.KeywordsHouse price predictionMachine learningEnsemble learning"}, "conf/icws/ZhuZSWY18": {"title": "FMSR: A Fairness-Aware Mobile Service Recommendation Method.", "url": "https://doi.org/10.1109/ICWS.2018.00029", "year": "2018", "author": {"Qiliang Zhu": "42/591", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:With the development of mobile Internet, mobile service is emerging one after another, and the problem of information overload is becoming ever more serious. As an important tool to alleviate information overload, mobile service recommendation has attracted more and more attention. However, traditional recommendation algorithms always recommend popular services to users, which result into a rich-get-richer problem and become a barrier for the unpopular services to startup and growth. In order to promote the healthy development of the service ecosystem, it is necessary to guarantee the fairness of unpopular services. To address this problem, this paper proposes a fairness-aware mobile service recommendation method (FMSR), which gives a relatively fair recommendation opportunity for unpopular services. FMSR makes a tradeoff between recommendation accuracy and fairness, and can recommend popular services and unpopular services respectively. For unpopular services, we design a fair efficiency function and use combinatorial optimization techniques to achieve recommendations. For popular services, bias matrix factorization is utilized to implement recommendations. Experimental results based on real-world demonstrate that FMSR significantly improve the fairness of mobile service recommendation in the evolving mobile service ecosystem."}, "conf/iov/ChenSZW18": {"title": "Adaptive Multiple Task Assignments for UAVs Using Discrete Particle Swarm Optimization.", "url": "https://doi.org/10.1007/978-3-030-05081-8_16", "year": "2018", "author": {"Kun Chen": "11/3270", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637"}, "abstract": "The forest fire is an extremely dangerous natural disaster. The traditional fire-fighting equipment have great difficulty in performing firefighting in mountain terrain. Unmanned aerial vehicles (UAVs) are coming into a popular form in forest firefighting. In view of the suddenness of forest fires, the adaptive and dynamic firefighting task assignment for UAV is of great significance, and the current firefighting task assignment cannot address this issue. This paper proposed an adaptive and dynamic multiple task assignment method for UAVs. Firstly, the adaptive and dynamic firefighting task assignment is formulated as an optimization problem. Secondly, an assignment algorithm is proposed to solve the problem by extending the particle swarm optimization (PSO) algorithm. Finally, the experiment results verify the effectiveness of the proposed algorithm.KeywordsUAVForest firefightingTask assignmentParticle swarm optimization"}, "conf/iov/YuanSZGW18": {"title": "An Acceleration Method for Similar Time-Series Finding.", "url": "https://doi.org/10.1007/978-3-030-05081-8_21", "year": "2018", "author": {"Yuan Yuan": "64/5845", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Siyi Gao": "230/1937", "Shangguang Wang": "73/8637"}, "abstract": "Finding a time series subsequence that is similar to a specific time series is an important problem in trajectory data of vehicles analysis. The problem is made significantly harder for the massive and high-dimensional features of time series. The existing methods for finding the similar subsequences in time series have high time complexity and poor applicability to similar subsequence finding of different lengths. In this paper, we propose an acceleration method for similar time-series finding to address this issue. Firstly, our method defines and extracts the feature of the query sequence. Then, we use the feature as the key to search sequence with the same feature to form a candidate set. After that, in each sequence in candidate set, we filter the important points and add it into feature points list to hold the shape characteristics of original sequence better. Finally, Dynamic time warping (DTW) is used to find the similar time-series. Experiment results illustrate that the proposed method can improve the search efficiency and accuracy.KeywordsTime seriesSimilarity searchingDimensions reductionAcceleration method"}, "conf/sc2/SongSZWL18": {"title": "QoS-Aware Service Composition Using HTN Planner.", "url": "https://doi.org/10.1109/SC2.2018.00022", "year": "2018", "author": {"Yue Song": "11/1346", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Jinglin Li": "45/10335"}, "abstract": " Abstract:Hierarchical Task Network (HTN) planning is an AI planning technique, which can be employed to implement service composition. Current HTN-based service composition systems fail to solve the problem comprehensively for only considering functional properties and ignoring the constraints of QoS. In this paper, we address this issue and solve the problem by exploiting the HTN planner JSHOP2. We implement an automatic service composition system by extending JSHOP2 with the consideration of both functional and non-functional properties. Furthermore, we conduct experiments on the system. Experiments show the effectiveness of our system."}, "conf/sc2/XiaSZWXGL018": {"title": "Improving the Performance of Stock Trend Prediction by Applying GA to Feature Selection.", "url": "https://doi.org/10.1109/SC2.2018.00025", "year": "2018", "author": {"Tian Xia": "90/4765", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Shilong Xiong": "231/7601", "Siyi Gao": "230/1937", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4"}, "abstract": " Abstract:Predicting stock trend by using machining learning is a hot research issue today. However, due to the non linearity and instability of the stock data, it is still very difficult to predict the stock trend with high accuracy. In order to improve the accuracy, most researchers focus on the models selection and features construction. A variety of feature construction methods have been proposed. However, not all features constructed in those paper are equally useful. Further more, many features of significant importance may not be selected in prediction. In order to improve the accuracy of stock trend prediction, this paper will focus on the features selection problem. Most feature selection methods employed in the stock trend prediction are based on filtration methods. Wrapper methods are rarely used. Compared with filtration methods, wrapper methods have better stability and accuracy. In this paper, we propose a feature selection algorithm by extending genetic algorithm (GA). Experiments are conducted on real-world stock price data set. The experiment results show that our GA-based feature selection algorithm is better in both stability and performance."}, "conf/IEEEscc/LiWSZ17": {"title": "Temporal Influences-Aware Collaborative Filtering for QoS-Based Service Recommendation.", "url": "https://doi.org/10.1109/SCC.2017.67", "year": "2017", "author": {"Jinglin Li": "45/10335", "Jie Wang": "29/5259", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1"}, "abstract": " Abstract:As service computing becomes increasingly prevalent, the number of web services grows rapidly. It becomes very important to recommend suitable, personalized web services to users. Collaborative Filtering based on Quality of Service (QoS) has been widely used for service recommendation, and variety of factors such as location, environment are taken into account to improve the accuracy of recommendation. However, temporal influences, which is one of key factors affecting the QoS, are not fully considered by the investigators. In this paper, we propose a novel temporal influences-aware collaborative filtering method which designs an enhanced temporal influences-aware similarity measurement to predict QoS values. Finally, we conduct a series of experiments to evaluate the effectiveness of our method, and results show that our method outperforms other state-of-the-art methods."}, "conf/colcom/TangSL17": {"title": "Management Node Selection Based on Cloud Model in a Distributed Network.", "url": "https://doi.org/10.1007/978-3-030-00916-8_17", "year": "2017", "author": {"Hanyi Tang": "187/5767", "Qibo Sun": "06/43", "Jinglin Li": "45/10335"}, "abstract": "Network has become an indispensable part of people’s lives. However, network insecurity still has negative impact on the development of network. Trust evaluation is becoming the core of network security enhancement. In distributed network, the node with the highest trust value is often selected as the subnet management node. The traditional distributed trust evaluation frameworks cannot achieve the best effect because of the ignorance of trust value stability of each node. To address this problem, this paper proposes a management node selection method based on cloud model. This method employs the cloud model to analyze the stability of network nodes, and selects the optimal node based on the three numerical features of cloud model. The experiment results show the effectiveness of our method.KeywordsTrust evaluationNetwork securityCloud model"}, "conf/colcom/YuanSL17": {"title": "CNTE: A Node Centrality-Based Network Trust Evaluation Method.", "url": "https://doi.org/10.1007/978-3-030-00916-8_18", "year": "2017", "author": {"Xiang Yuan": "35/824", "Qibo Sun": "06/43", "Jinglin Li": "45/10335"}, "abstract": "Network trust evaluation is an important mechanism in improving network security. Network trust is determined by the node trust and the topology of the network. To improve the evaluation accuracy and efficiency, we propose a node centrality-based network trust evaluation method. Firstly, the node trust is calculated by employing the node behavior analysis. Secondly, node centrality in the network is calculated based on coefficient variation. Finally, the network trust is calculated based on the above-mentioned steps. Experiment results show that our proposed method can improve the evaluation accuracy.KeywordsNetwork trustTrust evaluationNode behaviorNode centrality"}, "conf/sc2/WuLSZ17": {"title": "Service Recommendation with Context-Aware User Reputation Evaluation.", "url": "https://doi.org/10.1109/SC2.2017.47", "year": "2017", "author": {"Zhiheng Wu": "154/0125", "Jinglin Li": "45/10335", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1"}, "abstract": " Abstract:There is a growing number of services in the age of information. Therefore, choosing a satisfactory service has become increasingly difficult. One way to solve this problem is to construct a recommendation system. Selecting a set of users called neighbor user set and then generating the recommended services through collaborative filtering is a commonly used method to implement a recommendation system. In the recommended process, the user reputation is always considered since we prone to trust the users with high reputation. However, the current recommendation System lacks detailed context information analysis in user reputation calculation. In this paper, we propose a context-aware reputation calculation method based on user ratings. We first propose a novel method to analysis the impact of different contexts on user ratings. Then, we apply the context information of target user to obtain neighbor user set. Finally, we generate services for target user based on his neighbor user set. Experiments show that our method has better accuracy than other traditional methods."}, "conf/IEEEscc/JiangZWSLY16": {"title": "Personalized Service Recommendation for Collaborative Tagging Systems with Social Relations and Temporal Influences.", "url": "https://doi.org/10.1109/SCC.2016.107", "year": "2016", "author": {"Zigui Jiang": "185/1448", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Rongheng Lin": "35/3624", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Personalized service recommendation becomes increasingly essential because of the growing number of services. To enhance the performance of personalized service recommendation in collaborative tagging systems, not only tag information but also time and social relations information should be considered. In this paper, we propose a hybrid method aiming at taking advantage of tag, time and users' social relations information for a preferable service recommendation. We first improve a simple tag-based recommendation method by a time-decay function. Then we develop a temporal social-based recommendation method which analyzes user familiarity and user preference similarity between friends. Based on these two steps we integrate them as a temporal tag-and social-based (TTS) recommendation algorithm. Experiment results indicate that our method outperforms general tag-based and social-based recommendation methods."}, "conf/IEEEscc/ZhangSWSY16": {"title": "Towards Video Quality of Experience and Selective Attention: A Subtitle-Based Measurement Study.", "url": "https://doi.org/10.1109/SCC.2016.127", "year": "2016", "author": {"Lingyan Zhang": "76/7457", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Sen Su": "63/2499", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Selective attention is the idea that visual attention is not granted equally to all regions of the visual field, but rather focuses on high-attention regions. In this paper, we propose that selectively improving the performance of video in regions that are given high attention by users can significantly improve the quality of experience (QoE) of video services. We investigate users' attention regions, and choose the subtitle region as a representative high-attention region to present a subtitle-based measurement study. This study concentrates on how and how much the subtitle region affects the QoE of video. First of all, we verify that changes in performance of the subtitle region can cause an illusion about users' judgment on video bitrate. Secondly, we present a logarithmic relationship between video bitrate and the QoE of video. Thirdly, we measure the improved QoE by improving the performance of the subtitle region. Finally, we demonstrate that selectively improving the performance of the subtitle region can significantly improve the QoE of video at little cost."}, "conf/cluster/XuZWSLY16": {"title": "Machine Status Prediction for Dynamic and Heterogenous Cloud Environment.", "url": "https://doi.org/10.1109/CLUSTER.2016.73", "year": "2016", "author": {"Jinliang Xu": "122/0237", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:The widespread utilization of cloud computing services has brought in the emergence of cloud service reliability as an important issue for both cloud providers and users. To enhance cloud service reliability and reduce the subsequent losses, the future status of virtual machines should be monitored in real time and predicted before they crash. However, most existing methods ignore the following two characteristics of actual cloud environment, and will result in bad performance of status prediction: 1. cloud environment is dynamically changing, 2. cloud environment consists of many heterogeneous physical and virtual machines. In this paper, we investigate the predictive power of collected data from cloud environment, and propose a simple yet general machine learning model StaP to predict multiple machine status. We introduce the motivation, the model development and optimization of the proposed StaP. The experimental results validated the effectiveness of the proposed StaP."}, "conf/colcom/DingS16": {"title": "LBDAG-DNE: Locality Balanced Subspace Learning for Image Recognition.", "url": "https://doi.org/10.1007/978-3-319-59288-6_18", "year": "2016", "author": {"Chuntao Ding": "150/4003", "Qibo Sun": "06/43"}, "abstract": "The cloud-computing environment makes it possible to select the best features when tuning parameters. Various dimensionality reduction algorithms can achieve the best features with the tuning of parameters. Double adjacency graphs-based discriminant neighborhood embedding (DAG-DNE) is a typical graph-based dimensionality reduction method, and has been successfully applied to image recognition. It involves the construction of two adjacency graphs, with the goal of learning the intrinsic structure of the data. However, it may impair the different degrees of importance of the intra-class information and inter-class information of the given data. In this paper, we develop an extension of DAG-DNE, called locality balanced double adjacency graphs-based discriminant neighborhood embedding (LBDAG-DNE) by considering the intra-class information and inter-class information of the given data differently. LBDAG-DNE can find a good projection matrix, which allows neighbors belonging to the same class to be compact while neighbors belonging to different classes become separable in the subspace. Experiments on two image databases illustrate the effectiveness of the proposed approach.\nKeywordsDAG-DNEIntrinsic structureImage recognitionDimensionality reduction"}, "conf/colcom/HuSL16": {"title": "QoS Prediction Based on Context-QoS Association Mining.", "url": "https://doi.org/10.1007/978-3-319-59288-6_29", "year": "2016", "author": {"Yang Hu": "43/4685", "Qibo Sun": "06/43", "Jinglin Li": "45/10335"}, "abstract": "\nBoth the functional properties and the non-functional properties (known as quality of service, QoS) should be considered when recommending services. In mobile environment, the services are referred to under different contexts. Context-aware collaborative filtering is often employed to predict the QoS of candidate services when a user submits a service request. Existing collaborative filtering based methods seldom analyze the actual impact of each context property on the QoS properties in context-similarity mining. To address the problem, we propose a QoS prediction method based on the context-QoS association mining in this paper. The method is composed of two steps. We firstly propose an algorithm to mine the association between the context and the QoS properties. Then, a QoS prediction approach is proposed by taking the association and the context similarity into consideration. To study the effectiveness of our approach, we experiment on real world dataset. Experimental results show that our proposed method can improve the accuracy of QoS prediction.\nKeywordsWeb servicesMobile serviceQoSContext"}, "conf/dasc/YangSZLYT16": {"title": "A Context-Aware Trust Prediction Method Based on Behavioral Data Analysis in Distributed Network Environments.", "url": "https://doi.org/10.1109/DASC-PICom-DataCom-CyberSciTec.2016.121", "year": "2016", "author": {"Guoyu Yang": "187/6083", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Jinglin Li": "45/10335", "Xiang Yuan": "35/824", "Hanyi Tang": "187/5767"}, "abstract": " Abstract:Trust model has been suggested as an effective security mechanism in distributed network environment. Considerable researches have been done on trust evaluation and trust prediction. Traditional methods take the historical behavior data into consideration to predict the trust value of the network entity. However, the context of the network entity is seldom taken into account. It is obvious that the trust of the same network entity could be different in different contexts. To improve the accuracy of trust prediction, we propose a context-aware trust prediction method in this paper. Firstly, behavioral data normalization is conducted to allow for a uniform measurement of behavior property value independent of units. Secondly, the context properties that have impact on the behavior properties are extracted by the correlation analysis. Thirdly, irrelevant historical records are filtered out based on the context similarity. Finally, we predict the trust value for the network entity based on the results of aforesaid steps. The simulation results show that the proposed method outperforms the existing method in prediction accuracy."}, "conf/edge/YangSZWL16": {"title": "Poster Abstract: Access Point Ranking for Cloudlet Placement in Edge Computing Environment.", "url": "https://doi.org/10.1109/SEC.2016.16", "year": "2016", "author": {"Guoyu Yang": "187/6083", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Jinglin Li": "45/10335"}, "abstract": " Abstract:This poster addresses the problem of access point ranking for cloudlet placement in edge computing environment. Access point ranking is an important step for cloudlets placement. Currently, there is no method that can rank the access point effectively for ignoring the connection features of the access points. To address the problem, we propose an adaptive and comprehensive access point ranking method by investigating the connection features of the access points. We introduce the system model and the technical detail of the proposed access point ranking method in this paper. The experimental results validate the effectiveness of our proposed access point ranking method."}, "conf/iccsa/ZhangSZL16": {"title": "A Novel Trust Update Mechanism Based on Sliding Window for Trust Management System.", "url": "https://doi.org/10.1007/978-3-319-42085-1_41", "year": "2016", "author": {"Juanjuan Zhang": "87/7874", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Jinglin Li": "45/10335"}, "abstract": "\nIn the dynamic distributed network environment, such as P2P, trust evaluation has become an important security mechanism. In order to support the network entities with different behavioral characteristics, the researchers have put a lot of effort into developing various trust management mechanisms. Due to the mobility of the network entities and the dynamic change of the context, there are many factors that can affect the final trust. Therefore, the node trust varies with time. However, most current researches lay more emphasis on building an effective and robust trust management system while ignoring the time-attenuation characteristics in trust updating. Therefore, the evaluation result is inaccuracy and makes the on-off attack possible. Considering the fast-fall and slow-rise time-attenuation characteristics, we propose a novel trust updating mechanism (NTUM) based on sliding window. Experimental results show that our trust update mechanism outperforms other compared mechanisms.\nKeywordsTrust evaluation, dynamic distributed network, sliding windowTime factorTrust update mechanism"}, "conf/iwqos/ZhangWSY16": {"title": "Tradeoff between executing time and revenue for runtime service composition.", "url": "https://doi.org/10.1109/IWQoS.2016.7590408", "year": "2016", "author": {"Jun-Na Zhang": "31/7794", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Given a service composition, it is challenging but important to have a runtime adaptation, due to the complicated execution environment and evolving feature of Web service. In this paper, we present a runtime adaptive service composition approach, taking execution time minimization and revenue maximization into consideration. Based on dynamic programming, we deduce the optimal policy. Through this policy, orchestrator selects one concrete service for per task on runtime. The experimental results show that the proposed approach outperforms previous approach."}, "conf/cluster/WeiWZZSSY15": {"title": "Minimizing Data Transmission Latency by Bipartite Graph in MapReduce.", "url": "https://doi.org/10.1109/CLUSTER.2015.93", "year": "2015", "author": {"Jie Wei": "35/3800", "Shangguang Wang": "73/8637", "Lingyan Zhang": "76/7457", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Ruisheng Shi": "118/4779", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Many factors affect the time cost of Cloud computing tasks. One of the most serious factors is data transmission latency, which reduces the efficiency of Cloud computing. Existing notable schemes ignore the communication cost among virtual machines (VMs) in the MapReduce environment. In this paper, we propose a VM placement approach to reduce data transmission latency with the communication cost among VMs. We first construct bipartite graph and classify VMs as two groups according to their transmission latency with data nodes. Then we propose two VM placement optimization algorithms to minimize the total data transmission latency (TDTL) and the maximum data transmission latency (MDTL) in the MapReduce environment. Finally, we place VMs for Reduce phase. The evaluation results show that our approach reduces the average data transmission latency by 26.3% compared with other approaches."}, "conf/cse/LiSW14": {"title": "Context-Based Web Service Reputation Measurement.", "url": "https://doi.org/10.1109/CSE.2014.277", "year": "2014", "author": {"Wei Li": "64/6025", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:Reputation of Web service plays an important role in selecting the best service from massive services. Traditional approaches of measuring Web service reputation are based on all the historical ratings. Although these approaches are effective in the same context environment, they fail in obtaining accurate reputation measurement when users' context is different. In this paper, we propose a context-based Web service reputation measurement approach by weakening the effects on each user's rating caused by different context. The approach first classify ratings based on users' context. Then the approach calculates the difference in ratings given by one user with different context to get users' inner rating. Finally, we adopt User-based Collaborative Filtering to measure the reputation of each Web service. We have implemented our approach with extensive experiments and the results show that our approach outperforms other approaches."}, "conf/icdm/WangSWMXL14": {"title": "Web Service QoS Prediction Approach in Mobile Internet Environments.", "url": "https://doi.org/10.1109/ICDMW.2014.27", "year": "2014", "author": {"Lubao Wang": "160/5992", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "You Ma": "61/7950", "Jinliang Xu": "122/0237", "Jinglin Li": "45/10335"}, "abstract": " Abstract:Existing many Web service QoS prediction approaches are very accurate in Internet environments, however they cannot provide accurate prediction values in Mobile Internet environments since QoS values of Web services have great volatility. In this paper, we propose an accurate Web service QoS prediction approach by weakening the volatility of QoS data from Web services in Mobile Internet environments. This approach contains three process, i.e., QoS preprocessing, user similarity computing, and QoS predicting. We have implemented our proposed approach with experiment based on real world and synthetic datasets. The results show that our approach outperforms other approaches in Mobile Internet environments."}, "conf/icws/SunWLSY14": {"title": "QoS Uncertainty Filtering for Fast and Reliable Web Service Selection.", "url": "https://doi.org/10.1109/ICWS.2014.83", "year": "2014", "author": {"Lei Sun": "02/2264", "Shangguang Wang": "73/8637", "Jinglin Li": "45/10335", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:How to select the optimal composited service from a set of functionally equivalent services but different QoS attributes has become a hot research in service computing. However existing approaches are inefficient as they search all solution spaces. More importantly, they neglect the QoS inherently uncertainty due to the dynamic network environment. In this paper, we propose a fast and reliable Web service selection approach that attempts to select the best reliable composited service on the basis of filtering low reliable Web services according to the uncertainty of QoS. The approach first employs information theory and variance theory to abandon high QoS uncertainty services and downsize the solution spaces. A reliability fitness function is then designed to select the best reliable service for composited services. We experimented with real-world and synthetic datasets and compared our approach with other approaches. Our results show that our approach is not only fast, but also find more reliable composited services."}, "conf/IEEEcloud/ZhouWSZY13": {"title": "A Dynamic Virtual Resource Renting Method for Maximizing the Profit of Cloud Service Provider under SLA Constraint.", "url": "https://doi.org/10.1109/CLOUD.2013.13", "year": "2013", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:To maximize the profit of cloud service provider, we present a dynamic virtual resource renting method under SLA (service level agreement) constraints. According to the price distribution and current task emergency, the method attempts to adjust acceptable price of each virtual resource type at different price interval. If there is price acceptable resource, we choose to rent the most profitable one. Otherwise, if SLA permits, we even suspend the task and restart it when price falls. Partial experimental result in simulation environment is also presented."}, "conf/IEEEscc/MaWSZY13": {"title": "Web Services QoS Measure Based on Subjective and Objective Weight.", "url": "https://doi.org/10.1109/SCC.2013.10", "year": "2013", "author": {"You Ma": "61/7950", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:The previous Quality of Service (QoS) measure method for Web services are not accurate as they often focused on the ambiguity of user preferences but neglected its one-sidedness (i.e., user preferences cannot realize the data distribution characteristics of services set). This paper first points out that user preferences are not only ambiguous but also one-sided. QoS measure should be a co-action of both user preferences and services set, and therefore neglecting the data distribution characteristics of services set have weakened the accuracy of measure results. We present in this paper a novel QoS measure algorithm for Web services employing the subjective and objective weight. The subjective weight is used to quantify ambiguous user preferences and the objective weight is used to correct the one-sidedness of user preference. The two used weights guarantee the measure results can both conform to user preference and reflect the overall performance precisely. The validation of theoretical analysis and experiments based on the QWS real data sets confirmed the efficiency of proposed algorithm."}, "conf/icpads/WangLZSY13": {"title": "Particle Swarm Optimization for Energy-Aware Virtual Machine Placement Optimization in Virtualized Data Centers.", "url": "https://doi.org/10.1109/ICPADS.2013.26", "year": "2013", "author": {"Shangguang Wang": "73/8637", "Zhipiao Liu": "140/7841", "Zibin Zheng": "z/ZibinZheng", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:A critical research issue is to lower the energy consumption of a virtualized data center by means of virtual machine placement optimization while satisfying the resource requirements of the cloud services. In this paper, we focus on different existing schemes and on the energy-aware virtual machine placement optimization problem of a heterogeneous virtualized data center. We attempt to explore a better alternative approach to minimizing the energy consumption, and we observe that particle swarm optimization (PSO) has considerable potential. However, the PSO must be improved to solve an optimization problem. The improvement includes redefining the parameters and operators of the PSO, adopting an energy-aware local fitness first strategy and designing a novel coding scheme. Using the improved PSO, an optimal virtual machine replacement scheme with the lowest energy consumption can be found. Experimental results indicate that our approach significantly outperforms other approaches, and can lessen 13%-23% energy consumption in the context of this paper."}, "conf/icpads/ZhouWSZY13": {"title": "Dynamic Virtual Resource Renting Method for Maximizing the Profits of a Cloud Service Provider in a Dynamic Pricing Model.", "url": "https://doi.org/10.1109/ICPADS.2013.28", "year": "2013", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:With an increasing number of cloud service providers (CSP) delivering services to customers from the cloud, maximizing the profits of CSPs becomes a critical problem. Existing methods are difficult to solve the problem because they do not make full use of temporal price differences. This paper introduces a dynamic virtual resource renting method that attempts to dynamically adjust the virtual resource rental strategy according to price distribution and task urgency. We first pretreat the historical price series and adopt the outlier detection technique to filter the extreme price. Then, considering task urgency and price distribution, we design a weak equilibrium operator to calculate the acceptable price for each type of virtual resource. All types of virtual resources that are at an acceptable price are inserted into a set. Finally, we design a novel rental decision-making algorithm to select the most profitable resource from the set. We provide an extensive evaluation of our method using Amazon EC2 spot price dataset and normally distributed price dataset. The results demonstrate the effectiveness of our method."}, "conf/icpads/WangWSSY13": {"title": "Reputation Measurement of Cloud Services Based on Unstable Feedback Ratings.", "url": "https://doi.org/10.1109/ICPADS.2013.86", "year": "2013", "author": {"Shangguang Wang": "73/8637", "Jie Wei": "35/3800", "Lei Sun": "02/2264", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:With the rapid development of Cloud computing, more and more service providers could provide cloud services (applications) to users. Faced with mass Cloud services, trust and reputation mechanisms offer a promising way to solve the trust evaluation of Cloud services. Hence, trust and reputation play an important role in evaluating of Cloud services. In this paper, we propose a lightweight reputation measurement approach for Cloud services based on (user) feedback ratings. The proposed approach first adopts cloud model to obtain the trust vector of each cloud service by exploiting feedback ratings. The trust vector consists of Expected value, Entropy value and Hyper-Entropy value. Then we use fuzzy set theory to calculate the reputation scores of Cloud services. Simulation results show that the proposed approach is significantly effective for unstable feedback ratings."}, "conf/middleware/ZhouWSZY13": {"title": "FTCloudSim: a simulation tool for cloud service reliability enhancement mechanisms.", "url": "https://doi.org/10.1145/2541614.2541616", "year": "2013", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": "\n\t\tRecently, an increasing number of companies have deployed their application services in the cloud. However, the cloud data center downtime has negative affected the quality of cloud service quality. Many researchers have studied the problem of cloud service reliability assurance. However, there is a shortage of tools that enable researchers to evaluate their new proposed cloud service reliability enhancement mechanisms. To fill this gap, we extend the basic functionalities of CloudSim and present FTCloudSim in this paper. FTCloudSim provides an extensible interface to help researchers implement new cloud service reliability enhancement mechanisms. In addition, FTCloudSim can also study the behavior of the new proposed mechanisms. We demonstrate the capabilities of FTCloudSim by using four reliability enhancement mechanisms. The results can indicate the benefits of our tool.\n\t"}, "conf/middleware/MaWSZY13": {"title": "Predicting unknown QoS value with QoS-Prophet.", "url": "https://doi.org/10.1145/2541614.2541629", "year": "2013", "author": {"You Ma": "61/7950", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": "\n\t\tWe have witnessed the widespread adoption of Collaborative Filtering (CF) in prediction of unknown QoS value. Existing approaches have neglected that CF idea was originated from the processing of subjective data, movies scores for example. However, QoS value is objective, therefore the existing CF-based prediction approaches are not applicable well for predicting unknown QoS value. This paper introduces QoS-Prophet, our highly accurate prediction module for the prediction of unknown QoS value. QoS-Prophet is based on a novel CF idea which is quite different from existing CF-based approaches and is perfectly applicable to QoS value prediction. QoS-Prophet is designed as a decision support middleware and can be conveniently deployed in most SOA systems.\n\t"}, "conf/globecom/LinSWY12": {"title": "A geographic mobility prediction routing protocol for Ad Hoc UAV Network.", "url": "https://doi.org/10.1109/GLOCOMW.2012.6477824", "year": "2012", "author": {"Lin Lin": "00/3361", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Unmanned Aerial Vehicles (UAVs) play more and more important roles in modern warfare. However, the data routing for communication among UAVs faces several challenges, such as packet loss or routing path failure etc. The main problem of UAVs data routing is caused by the high mobility of UAVs. In this paper, an effective geographic mobility prediction routing protocol is proposed to improve the performance of routing among UAVs. First, a Gaussian distribution of UAVs movement probability density function is deduced to reduce the impact of high mobility. Then, two-hop perimeter forwarding is proposed to reduce the impact of routing void. The experiment results show that the proposed approach can provide effective and reliable data routing with acceptable communication overhead in the highly dynamic environment of Ad Hoc UAV Network."}, "conf/iccve/LiSL12": {"title": "A Research on the Applicability of ADS-B Data Links in Near Space Environment.", "url": "http://doi.ieeecomputersociety.org/10.1109/ICCVE.2012.9", "year": "2012", "author": {"Tianyuan Li": "166/0017", "Qibo Sun": "06/43", "Jinglin Li": "45/10335"}, "abstract": ""}, "conf/IEEEscc/WangZSZY11": {"title": "Evaluating Feedback Ratings for Measuring Reputation of Web Services.", "url": "https://doi.org/10.1109/SCC.2011.32", "year": "2011", "author": {"Shangguang Wang": "73/8637", "Zibin Zheng": "z/ZibinZheng", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:In the field of service computing, reputation of a Web service is usually calculated using feedback ratings provided by service users. However, the existing of malicious ratings and different preferences of different service users often lead to a bias towards positive or negative ratings. In this paper, we propose a novel reputation measure method for Web services. The proposed method employs two phases (i.e., malicious rating detection and rating adjustment) to enhance the reputation measure accuracy. We first detect malicious feedback ratings by the Cumulative Sum Method, and then reduce the affect of different user feedback preferences by using Pearson Correlation Coefficient. Extensive experiments are conducted. Experimental results show that our proposed method is effective and can enhance the reliability of service selection."}, "conf/cse/GuLLSY11": {"title": "Delay Aware Multipath Doppler Routing in Aeronautical Ad hoc Networks.", "url": "https://doi.org/10.1109/CSE.2011.53", "year": "2011", "author": {"Wenzhe Gu": "67/10183", "Jinglin Li": "45/10335", "Maohui Lv": "32/10422", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Aeronautical ad hoc network (AANET) is a large scale multi-hop wireless mesh network of aircrafts. It is efficient to provide data communications in high density airspace lacking ground infrastructures and could help the pilots to improve the ability of surveillance and situational awareness. However, reliable and efficient routing in AANET is still a great challenge. In this paper, a novel routing algorithm, termed Delay aware Multipath Doppler Routing (DMDR), is presented. It uses a joint metric which integrates relative velocity and expected queueing delay of nodes to select the next node. By minimizing the joint metric, every node selects the stable neighbor and spreads incoming traffic among all possible nodes, avoiding excessive queueing delay during route discovery. The result is an increase in the throughput without packets being unnecessarily dropped. Many simulations are performed and the results verify that the proposed routing algorithm is effective in selecting stable and efficient paths which could meet critical requirements in highly mobile aeronautical communication environments."}, "conf/emeit/GuSHM11": {"title": "An improved ant routing algorithm for HAP networks.", "url": "https://doi.org/10.1109/EMEIT.2011.6023681", "year": "2011", "author": {"Wenzhe Gu": "67/10183", "Qibo Sun": "06/43", "Fujing He": "08/10179", "Shuai Miao": "08/10184"}, "abstract": " Abstract:This paper explains the potential role of HAP network for providing air traffic control(ATC) and air passenger communication services(APC) in aeronautical communication. An improved ant routing algorithm based on delay of node is presented, which is used to find the shortest path from source to destination and satisfy the QoS metrics. Simulations have been performed to evaluate the performance of the proposed algorithm. The results show that the proposed algorithm could significantly reduce call blocking probability in aeronautical communication."}, "conf/bic-ta/SunWY10": {"title": "Quick service selection approach based on particle swarm optimization.", "url": "https://doi.org/10.1109/BICTA.2010.5645317", "year": "2010", "author": {"Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:With the increasing number of web services, most existing approaches suffer from a concentrated workload which causes response time delays to user's requests. This work proposes a quick service selection approach (QSSA). QSSA adopts particle swarm optimization and fuzzy logic control to support fast and dynamic service selection, assisting users in obtaining most suitable services. Experimental results demonstrate that QSSA can obtain the most suitable composite service with low cost."}, "conf/icica/SunWY10": {"title": "Multi-factor Evaluation Approach for Quality of Web Service.", "url": "https://doi.org/10.1007/978-3-642-16167-4_20", "year": "2010", "author": {"Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": "Accurate evaluation of QoS (Quality of Services) is critical for web services in business applications. In this paper a multi-factor evaluation approach is propose to evaluate QoS of web service. This approach synthetically considers service providers, the context of customers, and historical statistics to evaluate the QoS. The experimental results demonstrate that our approach can effectively obtain accurate QoS evaluation for web services.KeywordsWeb serviceQoS evaluationfuzzy synthetic evaluation methodnon-uniform mutation operator"}, "conf/service/SunWY10": {"title": "A Measure Approach for Trustworthy QoS of Web Service.", "url": "https://doi.org/10.1109/ICSS.2010.32", "year": "2010", "author": {"Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:In order to obtain trustworthy QoS (Quality of Service) in situations which have little or no information regarding a service's QoS, we propose a QoS measure approach, namely Bayesian Approach with Maximum-Entropy Principle (BA-MEP). BA-MEP firstly extracts the QoS prior distribution from the objective data (such as historical statistics data) and subjective data (such as the service providers and QoS experts) by Maximum Entropy Principle, and then Bayesian Approach is used to infer the QoS posterior distribution, finally, trustworthy QoS can be obtained from the QoS model. In addition, we also propose a trustworthy expert algorithm (TEA) and analysis three reasons that the QoS data of Web services are not always true. Some experiments are illustrated to show the effectiveness of BA-MEP."}, "conf/waim/WangYS08": {"title": "Measuring Network Vulnerability Based on Pathology.", "url": "https://doi.org/10.1109/WAIM.2008.66", "year": "2008", "author": {"Yulong Wang": "97/5856", "Fangchun Yang": "06/5366", "Qibo Sun": "06/43"}, "abstract": " Abstract:This paper compares disease with network vulnerability by their definitions and characteristics. A mapping between disease and vulnerability is built based on their similarities. We put forward a novel model of vulnerabilities in computer networks by simulating the reverse of cause-result of disease. Based on the model, a quantitative metric for vulnerabilities of computer networks is presented. The complexity of the algorithm for computing the metric is O(|V|\n2\nX|S|), where V and S stand for set of vulnerabilities and set of network states. By analyzing different structures of the vulnerability model, we found that the value reflecting vulnerability decreases when the model is more linear."}, "journals/iotj/LiWMSWCY22": {"title": "Service Coverage for Satellite Edge Computing.", "url": "https://doi.org/10.1109/JIOT.2021.3085129", "year": "2022", "author": {"Qing Li": "181/2689", "Shangguang Wang": "73/8637", "Xiao Ma": "35/573", "Qibo Sun": "06/43", "Houpeng Wang": "251/1936", "Suzhi Cao": "237/5592", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Recently, increasing investments in satellite-related technologies make the low earth orbit (LEO) satellite constellation a strong complement to terrestrial networks. To mitigate the limitations of the traditional satellite constellation “bent-pipe” architecture, satellite edge computing (SEC) has been proposed by placing computing resources at the LEO satellite constellation. Most existing works focus on space-air-ground integrated network architecture and SEC computing framework. Beyond these works, we are the first to investigate how to efficiently deploy services on the SEC nodes to realize robustness aware service coverage with constrained resources. Facing the challenges of spatial-temporal system dynamics and service coverage-robustness conflict, we propose a novel online service placement algorithm with a theoretical performance guarantee by leveraging Lyapunov optimization and Gibbs sampling. Extensive simulation results show that our algorithm can improve the service coverage by \n 4.3×4.3\\times  \n compared with the baseline."}, "journals/iotj/MaZSW21": {"title": "Freshness-Aware Information Update and Computation Offloading in Mobile-Edge Computing.", "url": "https://doi.org/10.1109/JIOT.2021.3082281", "year": "2021", "author": {"Xiao Ma": "35/573", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:Mobile-edge computing is a promising computing paradigm with the advantages of reduced delay and relieved outsourcing traffic to the core network. In mobile-edge computing, reducing the computation offloading cost of mobile users and maintaining fresh information at edge nodes are two critical while conflicted objectives, as both consume the limited wireless bandwidth of edge nodes. Although extensive efforts have been devoted to optimizing computation offloading decisions and some works have investigated freshness-aware channel allocation issues recently, no prior works have considered the above conflict. This article is the first work to jointly optimize the channel allocation and computation offloading decisions, aiming at reducing the computation offloading cost within freshness requirements of sensors. We analyze the recursiveness of Age of Information (AoI) in analogy to the evolvement of a queue and formulate the problem as a nonlinear integer dynamic optimization problem. To overcome the challenges of AoI-computation cost tradeoff, AoI time dependency and high complexity caused by the heterogeneity of users, we propose an algorithm to solve the problem with reduced computation complexity. Specifically, we first transform the original problem into a static optimization problem in each time slot (which is NP-hard) based on Lyapunov optimization techniques. To reduce the computation complexity, we exploit the finite improvement property of potential games and further enforce centralized control to reduce the number of improvement iterations. Simulations have been conducted and the results demonstrate that the proposed algorithm shows good effectiveness and scalability."}, "journals/iotj/LiMXZSZW21": {"title": "Joint Placement of UPF and Edge Server for 6G Network.", "url": "https://doi.org/10.1109/JIOT.2021.3095236", "year": "2021", "author": {"Yuanzhe Li": "184/4825", "Xiao Ma": "35/573", "Mengwei Xu": "143/0845", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Ning Zhang 0007": "181/2597-7", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:The emerging 6G network will make it possible for cybertwin, which relies deeply on the low latency and powerful computation provided by the edge network. To this end, the convergence of computing and network has been attached great importance. Most existing work study either placing edge servers or deploying user plane functions (UPFs), seldom considers the two processes jointly. In this article, we study how to minimize the latency with cost limitation by means of jointly deploying edge servers and UPFs in 6G scenario. We have shown that the problem is NP-hard. Then, we simplify the problem by analyzing the placement relationship between edge servers and UPFs and prune the solution space of the problem. To solve the problem effectively, a UPF and edge server placement algorithm is proposed. Massive experiments are conducted based on real-world data set and an edge core network emulator. The evaluation results show that our algorithm outperforms the benchmark algorithms."}, "journals/network/SunXMZHW21": {"title": "Edge-Enabled Distributed Deep Learning for 5G Privacy Protection.", "url": "https://doi.org/10.1109/MNET.021.2000292", "year": "2021", "author": {"Qibo Sun": "06/43", "Jinliang Xu": "122/0237", "Xiao Ma": "35/573", "Ao Zhou 0001": "123/6949-1", "Ching-Hsien Hsu": "35/3725", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:Due to the limited storage and computing power, edge devices at the network edge cannot train deep learning models locally. Traditional deep learning training requires users to upload a local dataset to a cloud center, and trains the data using massive computation resources of the cloud center. However, it results in two bad effects: uploading a local dataset to a centralized cloud center controlled by a third party leaves user data privacy at risk; and uploading multimedia data will consume huge bandwidth resources of mobile users and storage resources of the cloud center, resulting in low scalability in term of the number of edge devices. To deal with these two problems, we propose an edge-enabled distributed deep learning platform by dividing a general deep learning training network into a front and back subnetwork. Specifically, the front subnetwork consisting of several layers is deployed close to input data and is trained separately at each edge device using the local dataset, and the outputs of all front subnetworks are sent to the back subnetwork for later training at a cloud center; while the back subnetwork is deployed at the cloud center, and its output is sent to each front subnetwork. As no original dataset is transferred from edge devices to the cloud center, the platform can protect data privacy and has high scalability. Above that, another two measures are taken to ensure data privacy: asymmetric encryption technology is adopted to guarantee the safety and integrality of the transferred parameters between edge servers and the cloud center; and blockchain technology is used to monitor the actions of the stakeholders in this platform and thereby ensure trust among the stakeholders. Experimental results show the validation of the proposed method."}, "journals/spe/ZhouSL21": {"title": "BCEdge: Blockchain-based resource management in D2D-assisted mobile edge computing.", "url": "https://doi.org/10.1002/spe.2758", "year": "2021", "author": {"Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Jinglin Li": "45/10335"}, "abstract": ""}, "journals/tii/LiHSSW21": {"title": "Cognitive Service Architecture for 6G Core Network.", "url": "https://doi.org/10.1109/TII.2021.3063697", "year": "2021", "author": {"Yuanzhe Li": "184/4825", "Jie Huang": "29/6643", "Qibo Sun": "06/43", "Tao Sun": "74/3590", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:5G communication is making much progress in achieving the Internet of Things and improving the quality of user experience in large bandwidth scenarios. By introducing a variety of new technologies, the performance of 5G has been greatly improved. However, emerging applications put forward more stringent requirements in terms of latency, reliability, peak data rate, service continuity, etc. Communication technology still needs to be further developed. In this article, the next generation of core networks is conceptualized. Inspired by the nervous system of the octopus, we propose a new cognitive service architecture. Cognitive service architecture is a new architecture designed for the 6G core network. It is proposed to enhance the core network so that it is qualified for the increasingly high requirement for quality of service and complicated scenarios. We first give a short vision of the 6G core network. Then cognitive service architecture is demonstrated in detail. A case study is demonstrated to show how cognitive service architecture enhances the performance of the system. Enabling technologies for 6G cognitive service architecture are discussed at last."}, "journals/corr/abs-2112-14957": {"title": "Tiansuan Constellation: An Open Research Platform.", "url": "https://arxiv.org/abs/2112.14957", "year": "2021", "author": {"Shangguang Wang": "73/8637", "Qing Li": "181/2689", "Mengwei Xu": "143/0845", "Xiao Ma": "35/573", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43"}, "abstract": "\n      Abstract:  Satellite network is the first step of interstellar voyages. It can provide\nglobal Internet connectivity everywhere on earth, where most areas cannot\naccess the Internet by the terrestrial infrastructure due to the geographic\naccessibility and high cost. The space industry experiences a rise in large\nlow-earth-orbit satellite constellations to achieve universal connectivity. The\nresearch community is also urgent to do some leading research to bridge the\nconnectivity divide. Researchers now conduct their work by simulation, which is\nfar from enough. However, experiments on real satellites are blocked by the\nhigh threshold of space technology, such as deployment cost and unknown risks.\nTo solve the above dilemma, we are eager to contribute to the universal\nconnectivity and build an open research platform, Tiansuan constellation to\nsupport experiments on real satellite networks. We discuss the potential\nresearch topics that would benefit from Tiansuan constellation. We provide two\ncase studies that have already deployed in two experimental satellites of\nTiansuan constellation.\n\n    "}, "journals/access/ZhuSLW20": {"title": "FARM: A Fairness-Aware Recommendation Method for High Visibility and Low Visibility Mobile APPs.", "url": "https://doi.org/10.1109/ACCESS.2020.3007617", "year": "2020", "author": {"Qiliang Zhu": "42/591", "Qibo Sun": "06/43", "Zengxiang Li": "95/6812", "Shangguang Wang": "73/8637"}, "abstract": " Abstract:The number of mobile applications(APPs) has increased dramatically with the development of mobile Internet. It becomes challenging for users to identify these APPs they are really interested in. Existing mobile APP recommendation methods focus on learning users' preference and recommending high visibility APPs. However, some low visibility APPs may satisfy users and even surprise them. If those low visibility APPs have the opportunity to show to the user, they will not only improve the user's satisfaction, but also provide a fair competitive market for APP providers. Furthermore, it will improve the vitality of the APP market. To this end, we present a fairness-aware APP recommendation method named FARM. The principal study of this method emphasizes on the fairness issue during the recommendation process. In this method, APP candidates are divided into high visibility and low visibility APPs, and implement recommendation algorithm respectively. For low visibility APPs, we set a fairness factor for everyone, and use the user's latest feedback to make a dynamic adjustment. Based on the fairness factor, the recommendation is implemented by roulette-wheel. For high visibility APPs, we employ the fuzzy analytic hierarchy process to implement the recommendation. The evaluation results show that FARM outperforms baselines in terms of recommendation fairness."}, "journals/complexity/SunYZ20": {"title": "An Entropy-Based Self-Adaptive Node Importance Evaluation Method for Complex Networks.", "url": "https://doi.org/10.1155/2020/4529429", "year": "2020", "author": {"Qibo Sun": "06/43", "Guoyu Yang": "187/6083", "Ao Zhou 0001": "123/6949-1"}, "abstract": ""}, "journals/ijwgs/LuLLSZ20": {"title": "Efficient service deployment in mobile edge computing environment.", "url": "https://doi.org/10.1504/IJWGS.2020.107917", "year": "2020", "author": {"Jiawei Lu": "203/0822", "Jinglin Li": "45/10335", "Wei Liu": "49/3283", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1"}, "abstract": ""}, "journals/jcloudc/RazaLAAMSW20": {"title": "An efficient task offloading scheme in vehicular edge computing.", "url": "https://doi.org/10.1186/s13677-020-00175-w", "year": "2020", "author": {"Salman Raza": "219/5970", "Wei Liu": "49/3283", "Manzoor Ahmed": "146/9028", "Muhammad Rizwan Anwar": "241/0074", "Muhammad Ayzed Mirza": "225/7160", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637"}, "abstract": ""}, "journals/access/ZhuWCSYC18": {"title": "Context-Aware Group Recommendation for Point-of-Interests.", "url": "https://doi.org/10.1109/ACCESS.2018.2805701", "year": "2018", "author": {"Qiliang Zhu": "42/591", "Shangguang Wang": "73/8637", "Bo Cheng 0001": "05/2700-1", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366", "Rong N. Chang": "68/4237"}, "abstract": " Abstract:Group recommendation generates a ranked list of recommendations for a group of users. Point-of-interests (POIs) group recommendation aims to suggest the most agreeable meeting places for a group of users. Although there are a lot of studies on group recommendation for POIs, few studies take into account the rationality of location for the whole group. In this paper, we propose a novel POI group recommendation method which factors into the rationality of the location and the intra-group influence when making group decisions. We take into account the importance of location in POI recommendations and employ distance-based pre-filtering and distance-based ranking adjustment to improve recommendation satisfaction. We have conducted extensive experimental evaluations of the proposed method via a realworld data set, which is prepared from 1 375 024 Beijing POI comment records hosted by a review website. Comprehensive experimental results show that our proposed POI group recommendation method outperforms other representative ones in terms of global satisfaction and distance satisfaction, even in the context of individual recommendation."}, "journals/cluster/ZhouWSLZY18": {"title": "Support for spot virtual machine purchasing simulation.", "url": "https://doi.org/10.1007/s10586-017-0882-8", "year": "2018", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Jinglin Li": "45/10335", "Qinglin Zhao": "98/3940", "Fangchun Yang": "06/5366"}, "abstract": "With the rapid progress of cloud computing technology, a growing number of big data application providers begin to deploy applications on virtual machines rented from infrastructure as a service providers. Current infrastructure as a service provider offers diverse purchasing options for the application providers. There are mainly three types of purchasing options: reserved virtual machine, on-demand virtual machine and spot virtual machine. The spot virtual machine is a specific type of virtual machine that employs a dynamic pricing model. Because can be stopped by the infrastructure as a service providers without notice, the spot virtual machine is suitable for large-scale divisible applications, such as big data analysis. Therefore, spot virtual machine is chosen by many big data application providers for its low rental cost per hour. When spot virtual machine is chosen, a major issue faced by the big data application providers is how to minimize the virtual machine rental cost while meet service requirements. Many optimal spot virtual machine purchasing approaches have been presented by the researchers. However, there is a shortage of simulators that enable researchers to evaluate their newly proposed spot virtual machine purchasing approach. To fill this gap, in this paper, we propose SpotCloudSim to support for dynamic virtual machine pricing model simulation. SpotCloudSim provides an extensible interface to help researchers implement new spot virtual machine purchasing approach. In addition, SpotCloudSim can also study the behavior of the newly proposed spot virtual machine purchasing approaches. We demonstrate the capabilities of SpotCloudSim by using three spot virtual machine purchasing approaches. The results indicate the benefits of our proposed simulation system."}, "journals/wicomm/ZhangZSWY18": {"title": "Overview on Fault Tolerance Strategies of Composite Service in Service Computing.", "url": "https://doi.org/10.1155/2018/9787503", "year": "2018", "author": {"Jun-Na Zhang": "31/7794", "Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/mta/ZhouWHSY16": {"title": "Task rescheduling optimization to minimize network resource consumption.", "url": "https://doi.org/10.1007/s11042-015-2549-x", "year": "2016", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Ching-Hsien Hsu": "35/3725", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": "An increasing number of big-data services are being deployed in a cloud computing environment, attracted by the on-demand service, rapid elasticity, and low maintenance costs. As a result, ensuring the quality of service has become an important research problem. Traditionally, task rescheduling is used to ensure a consistent quality of service in the event of failure of a virtual machine. However, the network resource consumption of different rescheduling methods varies. To address this problem, we propose a task rescheduling method that minimizes network resource consumption.The method includes three algorithms. The first obtains a set of good virtual machines from the large quantity of service-providing virtual machines using the skyline operation. A ranking algorithm then fuses the data size and the task emergency to identify significant tasks. Finally, we present an algorithm that automatically determines the optimal insertion point for each task. To verify the effectiveness of the proposed method, we extend the renowned simulator CloudSim and conduct a series of experiments. The results show that our method is more efficient than other methods in terms of network resource consumption."}, "journals/nrhm/SunWWMH16": {"title": "QoS prediction for Web service in Mobile Internet environment.", "url": "https://doi.org/10.1080/13614568.2016.1152315", "year": "2016", "author": {"Qibo Sun": "06/43", "Lubao Wang": "160/5992", "Shangguang Wang": "73/8637", "You Ma": "61/7950", "Ching-Hsien Hsu": "35/3725"}, "abstract": ""}, "journals/sj/WangFHSY16": {"title": "A Vertical Handoff Method via Self-Selection Decision Tree for Internet of Vehicles.", "url": "https://doi.org/10.1109/JSYST.2014.2306210", "year": "2016", "author": {"Shangguang Wang": "73/8637", "Cunqun Fan": "138/2247", "Ching-Hsien Hsu": "35/3725", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Vehicles often communicate among different networks in Internet of Vehicles (IoVs). However, existing unstable network statuses and different user preferences result in vehicle frequent vertical handoffs (VHOs). In this paper, we propose a novel VHO method based on a self-selection decision tree for IoVs. We first establish the respective handoff probability distribution of vehicles according to network attributes and movement trend. Then, based on handoff probability distributions and defined user preferences, we propose a novel handoff method by the self-selection decision tree for IoVs. Finally, we also present a feedback decision method according to the feedback of vehicle handoff, to improve next handoff quality when vehicle movement trend and vehicle service status change. Simulation results show that the proposed method not only supports the VHO among Wireless Access in Vehicular Environments, Worldwide Interoperability for Microwave Access, and third-generation cellular but also reduces switching times and ensures the network update rate and the vehicles’ service quality."}, "journals/tjs/ZhouWLSY16": {"title": "Optimal mobile device selection for mobile cloud service providing.", "url": "https://doi.org/10.1007/s11227-016-1704-0", "year": "2016", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Jinglin Li": "45/10335", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": "With the rapid growth of the mobile devices and the emergence of cloud computing, mobile cloud computing has gained widespread interest. In mobile cloud computing, a large-scale collection of mobile devices cooperate with each other to provide a cloud service at the edge. However, the improper mobile device selection has a negative effect on the quality of service. Existing methods are difficult to solve the problem, because they do not take the status and the historical characteristics of the mobile devices into consideration. This paper introduces a device status-aware and stability-aware mobile device selection method. Firstly, a model is designed to store the status and the historical characteristics of each mobile device. Secondly, an optimized cloud model is employed to evaluate the stability of each mobile device. Lastly, an optimal mobile device searching algorithm is presented to select the optimal mobile device. We provide an extensive evaluation of our method. The results show that our method can increase the quality of mobile cloud service compared with the traditional method."}, "journals/tsc/MaWHHSY16": {"title": "A Highly Accurate Prediction Algorithm for Unknown Web Service QoS Values.", "url": "https://doi.org/10.1109/TSC.2015.2407877", "year": "2016", "author": {"You Ma": "61/7950", "Shangguang Wang": "73/8637", "Patrick C. K. Hung": "h/PCKHung", "Ching-Hsien Hsu": "35/3725", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Quality of service (QoS) guarantee is an important component of service recommendation. Generally, some QoS values of a service are unknown to its users who has never invoked it before, and therefore the accurate prediction of unknown QoS values is significant for the successful deployment of web service-based applications. Collaborative filtering is an important method for predicting missing values, and has thus been widely adopted in the prediction of unknown QoS values. However, collaborative filtering originated from the processing of subjective data, such as movie scores. The QoS data of web services are usually objective, meaning that existing collaborative filtering-based approaches are not always applicable for unknown QoS values. Based on real world web service QoS data and a number of experiments, in this paper, we determine some important characteristics of objective QoS datasets that have never been found before. We propose a prediction algorithm to realize these characteristics, allowing the unknown QoS values to be predicted accurately. Experimental results show that the proposed algorithm predicts unknown web service QoS values more accurately than other existing approaches."}, "journals/ejwcn/ZhouLSFLY15": {"title": "A security authentication method based on trust evaluation in VANETs.", "url": "https://doi.org/10.1186/s13638-015-0257-x", "year": "2015", "author": {"Ao Zhou 0001": "123/6949-1", "Jinglin Li": "45/10335", "Qibo Sun": "06/43", "Cunqun Fan": "138/2247", "Tao Lei": "91/8024", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ejwcn/ZhouSSLY15": {"title": "Maximizing the profits of cloud service providers via dynamic virtual resource renting approach.", "url": "https://doi.org/10.1186/s13638-015-0256-y", "year": "2015", "author": {"Ao Zhou 0001": "123/6949-1", "Qibo Sun": "06/43", "Lei Sun": "02/2264", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ijwgs/ZhouWYSSY15": {"title": "FTCloudSim: support for cloud service reliability enhancement simulation.", "url": "https://doi.org/10.1504/IJWGS.2015.072804", "year": "2015", "author": {"Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Chenchen Yang": "117/5395", "Lei Sun": "02/2264", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ijwgs/WangSSWY15": {"title": "Reputation measurement of cloud services based on unstable feedback ratings.", "url": "https://doi.org/10.1504/IJWGS.2015.072805", "year": "2015", "author": {"Shangguang Wang": "73/8637", "Lei Sun": "02/2264", "Qibo Sun": "06/43", "Jie Wei": "35/3800", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/mis/WangSSLY15": {"title": "Efficient Service Selection in Mobile Information Systems.", "url": "https://doi.org/10.1155/2015/949436", "year": "2015", "author": {"Shangguang Wang": "73/8637", "Lei Sun": "02/2264", "Qibo Sun": "06/43", "Xuyan Li": "181/9849", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/cj/LiuWSZY14": {"title": "Cost-Aware Cloud Service Request Scheduling for SaaS Providers.", "url": "https://doi.org/10.1093/comjnl/bxt009", "year": "2014", "author": {"Zhipiao Liu": "140/7841", "Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/isf/WangHLSY14": {"title": "Multi-user web service selection based on multi-QoS prediction.", "url": "https://doi.org/10.1007/s10796-013-9455-4", "year": "2014", "author": {"Shangguang Wang": "73/8637", "Ching-Hsien Hsu": "35/3725", "Zhongjun Liang": "127/6141", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": "In order to find best services to meet multi-user’s QoS requirements, some multi-user Web service selection schemes were proposed. However, the unavoidable challenges in these schemes are the efficiency and effect. Most existing schemes are proposed for the single request condition without considering the overload of Web services, which cannot be directly used in this problem. Furthermore, existing methods assumed the QoS information for users are all known and accurate, and in real case, there are always many missing QoS values in history records, which increase the difficulty of the selection. In this paper, we propose a new framework for multi-user Web service selection problem. This framework first predicts the missing multi-QoS values according to the historical QoS experience from users, and then selects the global optimal solution for multi-user by our fast match approach. Comprehensive empirical studies demonstrate the utility of the proposed method."}, "journals/jim/WangLSZY14": {"title": "Towards an accurate evaluation of quality of cloud service in service-oriented cloud computing.", "url": "https://doi.org/10.1007/s10845-012-0661-6", "year": "2014", "author": {"Shangguang Wang": "73/8637", "Zhipiao Liu": "140/7841", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": "Cloud computing promises to provide high quality, on-demand services with service-oriented architecture. However, cloud service typically come with various levels of services and performance characteristics, which makes Quality of Cloud Service (QoCS) high variance. Hence, it is difficult for the users to evaluate these cloud services and select them to fit their QoCS requirements. In this paper, we propose an accurate evaluation approach of QoCS in service-oriented cloud computing. We first employ fuzzy synthetic decision to evaluate cloud service providers according to cloud users’ preferences and then adopt cloud model to computing the uncertainty of cloud services based on monitored QoCS data. Finally, we obtain the evaluation results of QoCS using fuzzy logic control. The simulation results demonstrate that our proposed approach can perform an accurate evaluation of QoCS in service-oriented cloud computing."}, "journals/mis/WangZWSZY14": {"title": "Context-aware mobile service adaptation via a Co-evolution eXtended Classifier System in mobile network environments.", "url": "https://doi.org/10.3233/MIS-130178", "year": "2014", "author": {"Shangguang Wang": "73/8637", "Zibin Zheng": "z/ZibinZheng", "Zhengping Wu": "59/4053", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/jsa/WangGCSY13": {"title": "Service vulnerability scanning based on service-oriented architecture in Web service environments.", "url": "https://doi.org/10.1016/j.sysarc.2013.01.002", "year": "2013", "author": {"Shangguang Wang": "73/8637", "Yan Gong": "35/4532", "Guangxiao Chen": "136/8099", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": "Web services are becoming the critical components of business application, but they are often invoked with critical software and application bugs that can be explored by malicious users. Because the existing centralized vulnerability scanning systems often face performance bottleneck because of huge amount of tasks, a novel service vulnerability scanning scheme is high desirable. In this paper, we propose a service vulnerability scanning scheme based on service-oriented architecture (SoA) in Web service environments. The scanning scheme contains three components, i.e., domain-oriented distributed architecture, service providing mode based on SoA and hierarchical strategy scheduling model. The hierarchical strategy scheduling model is the key of the scanning scheme, which is used to solve the problems of distributed scheduling management in vulnerability scanning process for Web service environments. We conduct a centralized scanner to compare our scheme with other schemes by the implement of prototype system. Experimental results show that our proposed scheme outperforms other schemes with respect to time cost, accuracy and load."}, "journals/jsa/WangFDGSY13": {"title": "A-GR: A novel geographical routing protocol for AANETs.", "url": "https://doi.org/10.1016/j.sysarc.2013.07.011", "year": "2013", "author": {"Shangguang Wang": "73/8637", "Cunqun Fan": "138/2247", "Cao Deng": "138/2209", "Wenzhe Gu": "67/10183", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": "With the rapid growth of general aircraft and lack of ground facilities, air traffic control and aeronautical communication system face huge pressure, especially in low-altitude airspace. Aeronautical ad hoc networks (AANETs) are large scale multi-hop wireless network of aircraft, which could provide direct air-to-air communication between aircraft without ground infrastructures. However, the features of aircraft node present a great challenge to provide efficient and reliable data packet delivery in AANETs. In this paper, we present an Automatic dependent surveillance-broadcast (ADS-B) system aided geographic routing protocol (called A-GR) for AANETs. The proposed A-GR uses the position and velocity of aircraft provided by airborne ADS-B system to eliminate the traditional routing beaconing and presents a velocity-based metric for next hop selection, which could adaptively cope with the fast moving of aircraft and dynamic changes of network topology. Many simulations are performed and the results show that the proposed A-GR can effectively decrease the routing overhead, improve the packet delivery ratio and make good use of the network resources."}, "journals/monet/WangSZY13": {"title": "Particle Swarm Optimization with Skyline Operator for Fast Cloud-based Web Service Composition.", "url": "https://doi.org/10.1007/s11036-012-0373-3", "year": "2013", "author": {"Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": "Quality of Services play an increasingly important role during the procedure of Cloud-based web service composition for seamless and dynamic integration of business applications. However, as Cloud-based web services (CWSs) proliferate, it becomes difficult to facilitate service composition quickly in Cloud computing environment. In this paper, based on the notion of Skyline, we propose a fast CWS composition approach. This approach adopts Skyline operator to prune redundant CWS candidates and then employs Particle Swarm Optimization to select CWS from amount of candidates for composing single service into a more powerful composite service. Based on a real dataset, we conduct an experiment to evaluate our proposed approach. Experimental results show that our proposed approach is effective and efficient for CWS composition."}, "journals/wpc/WangZSZY13": {"title": "Low-Cost Web Service Discovery Based on Distributed Decision Tree in P2P Environments.", "url": "https://doi.org/10.1007/s11277-013-1261-2", "year": "2013", "author": {"Shangguang Wang": "73/8637", "XiLu Zhu": "31/9078", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": "Peer to Peer (P2P) techniques were widely applied into Web service discovery fields, but most existing schemes only focused on matching the functional attributes of Web services and ignored the non-functional attributes, i.e. quality of services (QoS). In this paper, we present a QoS-aware Web service discovery approach. The approach maps each Web service into virtual space to distribute all QoS attributes among P2P nodes, and then designs a distributed decision tree to support range service query with QoS requirements. Finally, a load balance algorithm is used to reduce range query cost. Experimental results based on synthetic and real datasets show our proposed approach can perform effective service discovery with low cost in P2P environments."}, "journals/iee/WangSY12": {"title": "Quality of service measure approach of web service for service selection.", "url": "https://doi.org/10.1049/iet-sen.2010.0093", "year": "2012", "author": {"Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/scn/WangZSY12": {"title": "Bayesian Approach with Maximum Entropy Principle for trusted quality of Web service metric in e-commerce applications.", "url": "https://doi.org/10.1002/sec.426", "year": "2012", "author": {"Shangguang Wang": "73/8637", "Hua Zou": "66/3384", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/scn/WangSZY12": {"title": "Detecting SYN flooding attacks based on traffic prediction.", "url": "https://doi.org/10.1002/sec.428", "year": "2012", "author": {"Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/iee/WangSZY11": {"title": "Reputation measure approach of web service for service selection.", "url": "https://doi.org/10.1049/iet-sen.2010.0077", "year": "2011", "author": {"Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ijwgs/SunWZY11": {"title": "QSSA: A QoS-aware Service Selection Approach.", "url": "https://doi.org/10.1504/IJWGS.2011.040446", "year": "2011", "author": {"Qibo Sun": "06/43", "Shangguang Wang": "73/8637", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ijwgs/WangZSZY11": {"title": "Reliable web service selection via QoS uncertainty computing.", "url": "https://doi.org/10.1504/IJWGS.2011.044696", "year": "2011", "author": {"Shangguang Wang": "73/8637", "Zibin Zheng": "z/ZibinZheng", "Qibo Sun": "06/43", "Hua Zou": "66/3384", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ijcisys/WangSZY10": {"title": "An improved Particle Swarm Optimization Algorithm for QoS-aware Web Service Selection in Service Oriented Communication.", "url": "https://doi.org/10.1080/18756891.2010.9727750", "year": "2010", "author": {"Wenbin Wang": "27/3361", "Qibo Sun": "06/43", "Xinchao Zhao": "53/6264", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/ijwgs/WangSY10": {"title": "Towards Web Service selection based on QoS estimation.", "url": "https://doi.org/10.1504/IJWGS.2010.036406", "year": "2010", "author": {"Shangguang Wang": "73/8637", "Qibo Sun": "06/43", "Fangchun Yang": "06/5366"}, "abstract": ""}}}