{"id": "29/5782-4", "name": "Quan Yuan 0004", "Article": {"conf/icann/LiuYCLL22": {"title": "Cooperative Multi-agent Reinforcement Learning with Hierachical Communication Architecture.", "url": "https://doi.org/10.1007/978-3-031-15931-2_2", "year": "2022", "author": {"Shifan Liu": "329/2584", "Quan Yuan 0004": "29/5782-4", "Bo Chen": "89/5615", "Guiyang Luo": "187/6958", "Jinglin Li": "45/10335"}, "abstract": "Communication is an essential way for multi-agent system to coordinate. By sharing local observations and intentions via communication channel, agents can better deal with dynamic environment and thus make optimal decisions. However, restricted by the limited communication channel, agents have to leverage less communication resources to transmit more informative messages. In this article, we propose a two-level hierarchical multi-agent reinforcement learning algorithm which utilizes different timescales in different levels. Communication happens only between high levels at a coarser time scale to generate sub-goals which convey the intention of agents for the low level. And the low level is responsible for implementing these sub-goals by controlling primitive actions at every tick of environment. Sub-goal is the core of this hierachical communication architecture which requires the high level to communicate efficiently and provide guidance for the low level to coordinate. This hierarchical communication architecture conveys several benefits: 1) It coarsens the collaborative granularity and reduces the requirement of communication since communication happens only in high level at a larger scale; 2) It enables the high level to focus on the coordination of goals without paying attention to implementation, thus improves the efficiency of communication; and 3) It makes better control by dividing a complex multi-agent cooperative task into multiple single-agent tasks. In experiments, we apply our approach in vehicle collision avoidance tasks and achieve better performance than baselines.KeywordsMulti-agent cooperationHierarchical architectureCommunication"}, "conf/icann/WangLYL22": {"title": "F-Transformer: Point Cloud Fusion Transformer for Cooperative 3D Object Detection.", "url": "https://doi.org/10.1007/978-3-031-15919-0_15", "year": "2022", "author": {"Jie Wang": "29/5259", "Guiyang Luo": "187/6958", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335"}, "abstract": "We present a novel cooperative detection framework to fuse multi-view point clouds, for accurately detecting hard samples (e.g., partly or fully occluded, or small objects). Building on a two-step communication scheme to transmit the pillar features between views, it is possible to observe the same object from different viewpoints. We then design a feature fusion scheme based on Transformer to fuse the pillar features by discretizing the point clouds. Considering the sparsity of information, we improve Transformer’s self-attention mechanism, with Re-Scaled Dot-Product Attention, which allows the sparse information to capture valuable information more effectively. We evaluate the performance of our method by generating synthetic cooperative datasets over multiple complex traffic scenarios. The results show that our method surpasses all other cooperative perception methods with significant margins.KeywordsFeature fusionCooperative detectionSelf-attention"}, "conf/ijcnn/MengLYLY21": {"title": "MF-Net: Meta Fusion Network for 3D object detection.", "url": "https://doi.org/10.1109/IJCNN52387.2021.9534374", "year": "2021", "author": {"Zhaoxin Meng": "15/1944", "Guiyang Luo": "187/6958", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:3D object detection has attracted a significant amount of attention and interest from both academia and industry due to its indispensable role in understanding 3D environments. By fusing the camera and LiDAR sensors, it is expected to improve both the accuracy and robustness of 3D object detection. However, existing fusion approaches are either limited by cascading processing, or easy to be influenced by the interference information in multi-sensors. To this end, this paper incorporates meta learning to fuse the camera and LiDAR data. Specifically, we first extract meta knowledge from images, and then apply it to generate the parameter weights of a set of convolution kernels, which are further exploited for feature extraction on LiDAR point clouds. Furthermore, we propose a meta fusion network (MF -Net), enabling accurate and robust 3D object detection. The superiority and effectiveness of MF -Net have been demonstrated by extensive experiments on KITTI 3D object detection dataset."}, "conf/itsc/MoYLL21": {"title": "WR-SRPG: Joint Walking Rhythm and Social Relation-Potential for Pedestrian Trajectory Prediction.", "url": "https://doi.org/10.1109/ITSC48978.2021.9564854", "year": "2021", "author": {"Haojie Mo": "305/2973", "Quan Yuan 0004": "29/5782-4", "Guiyang Luo": "187/6958", "Jinglin Li": "45/10335"}, "abstract": " Abstract:Humans are not robots with predefined path planning rules. Pedestrian trajectory prediction is effected by the physical world's laws, social space and their own personality. In this paper, we represent a novel insight walking rhythm and social relation-potential model (WR-SRPG) to solve these problems. We propose a new way to measure the information of pedestrian walking characteristics and personality characteristics. We design a Social Relation-Potential Grid (SRPG) module to model the complex social interaction between pedestrians. And we integrate multi-head attention mechanism, position encoding and remote estimation points to expand the ability of the model to focus on different locations and model long-term spatiotemporal dependence. The experimental results show that our method surpass state-of-the-art method on ETH&UCY datasets in ADE and FDE, and successfully predicts the complex social behaviors among pedestrians."}, "conf/itsc/XueLYLY21": {"title": "ST-Tracking: Spatial-temporal Graph Convolution Neural Network for Multi-object Tracking.", "url": "https://doi.org/10.1109/ITSC48978.2021.9564519", "year": "2021", "author": {"Yaqing Xue": "305/2913", "Guiyang Luo": "187/6958", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Multi-Object Tracking (MOT) which aims to estimate trajectories for objects of interest in videos, is a crucial component in intelligent transportation systems and has gained considerable attention from both academia and industry. However, existing MOT approaches apply simple motion and appearance features, ignoring the spatial-temporal correlations of interactions with other objects. To fill this gap, this paper proposes a novel MOT framework ST-Tracking to extract spatial-temporal features for tracking objects, which is trained in an end-to-end manner. Specifically, a directed graph is first constructed to represent the spatial-temporal correlations, where the node attributes include both geometric and appearance features, and the edges are deliberately defined to embrace location and topology cues. Then, a spatial-temporal graph convolutional module is proposed to aggregate information from both spatial and temporal dimensions, thus extracting discriminative features. Extensive experiments on the challenging KITTI benchmark demonstrate the effectiveness and superior of ST-Tracking as compared with several state-of-the-art methods."}, "conf/itsc/WuLYLY21": {"title": "SI-RCNN: A Shape-Invariant Set-Abstraction for 3D Object detection.", "url": "https://doi.org/10.1109/ITSC48978.2021.9565064", "year": "2021", "author": {"Xiaoping Wu": "50/5734", "Guiyang Luo": "187/6958", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Recent years have witnessed more attention being paid to 3D object detection, due to its indispensable roles in autonomous driving and intelligent transportation systems. The accuracy of 3D object detection heavily depends on sufficient and robust feature extractors. However, most feature extractors adopt fixed perceptive fields or fixed spatial locations, which could not efficiently model geometric variations or geometric transformations in object scale, pose, and part deformation. To fill this gap, this paper proposes a novel Shape-Invariant Set-Abstraction network (SI-RCNN) for 3D object detection in point clouds, which can extract shape-adaptive features. Specifically, we first propose an Offsets Generation Module to learn a set of offsets, where the shape of the offsets can adapt to the changes of features. Then, trilinear interpolation is applied to assign features to each offset, since it might be empty due to discrete points in the cloud data. Finally, we further exploit the ground-truth box to supervise the offsets. Extensive experiments demonstrate the effectiveness of our proposed SI-RCNN on the competitive KITTI 3D detection benchmark, as compared to several state-of-the-art methods."}, "conf/vtc/LiYLL21": {"title": "Learning Effective Multi-Vehicle Cooperation at Unsignalized Intersection via Bandwidth-Constrained Communication.", "url": "https://doi.org/10.1109/VTC2021-Fall52928.2021.9625057", "year": "2021", "author": {"Ziyan Li": "236/7682", "Quan Yuan 0004": "29/5782-4", "Guiyang Luo": "187/6958", "Jinglin Li": "45/10335"}, "abstract": " Abstract:As artificial intelligence and the internet of vehicles are becoming mature, multi-agent reinforcement learning is utilized as an efficient way to coordinate vehicles to achieve safer and more efficient transportation. Communication between vehicles is essential for multi-vehicle cooperation to enhance the understanding of the environment state and the intentions of other vehicles. However, with limited communication resources, how to compress the message and reduce the number of messages that need to be transmitted while ensuring the coordination performance is an urgent problem to be solved. And evaluating whether the message is useful and identifying the valuable information from the received messages are huge challenges for the vehicle communication system. To this end, we propose an efficient communication method that can guarantee coordination performance with limited communication resources. In particular, the efficient communication method using the algorithm in variational auto-encoder to compress the message while guaranteeing the valuable information of the message is preserved in the compressed message. Additionally, the multi-head attention mechanism is utilized to extract valuable information from the received messages and help the vehicle to make the driving decision. To avoid contention of communication resources, the message will be scored before transmitted to other vehicles. So that communication resources can be reserved for valuable messages. The efficient communication method is evaluated in an unsignalized intersections scenario. Experimental results show that the efficient communication method achieves better performance under the bandwidth-constrained environment than the baselines."}, "conf/hpcc/WeiL0ZZY20": {"title": "Enabling Self-defined Navigation on Road Graph via Double Rewarded Generalized VIN.", "url": "https://doi.org/10.1109/HPCC-SmartCity-DSS50907.2020.00132", "year": "2020", "author": {"Xiaojuan Wei": "123/5785", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Zhe Zhang": "87/5809", "Yangyang Zha": "291/5502", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Nowadays navigation systems are mostly centralized and mainly relying on the traffic conditions of road network, and other influence factors are rarely considered, such as roads topology, domain knowledge and planning autonomy, which is result in the recommended seemingly optimal routes may attract numerous vehicles and then congestion. Besides, the existing region-based methods have deviation on acquiring the traffic conditions of road segments, which lead to the inadequate use of road resource and the waste of drivers' time.Considering that MEC can provide low latency and quick responses support for intelligent driving, we propose an online planning approach on the road graph via a double rewarded Generalized Value Iteration Network, 2r-GVIN for short. In detail, a large-scale real GPS trajectories are mapped and discretized into traffic sequence pairs anonymously, that is, capturing the traffic status and driving actions as dataset. Then a neural network ConvLSTM which can effectively capture the spatio-temporal properties, is trained to predict the future traffic situation to form “prediction reward”. To enable learning and planning on irregular road graphs straightforwardly, an economical embedding graph convolution operator network GVIN is used. Combining with the model input “current reward”, 2r-GVIN is formed to solve the plan-involved function iteratively. Lastly, we train and evaluate 2r-GVIN on planning problem in road networks, showing that it can achieve road segment-based self-defined navigation with high success rate."}, "conf/ijcnn/JiL0L20": {"title": "Multi-Range Gated Graph Neural Network for Telecommunication Fraud Detection.", "url": "https://doi.org/10.1109/IJCNN48605.2020.9207589", "year": "2020", "author": {"Shuyun Ji": "275/7098", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Jiawei Lu": "203/0822"}, "abstract": " Abstract:With the expansion of the mobile communication technology, telecommunication fraud is increasing dramatically which results in the loss of billions of dollars worldwide every year. In recent years, some detection methods utilize data mining and statistical techniques to detect fraud from large amount of subscriber content data, and some methods transform the social relation into a set of topological features, such as degree, k-core etc. However, both content and relation have not been fully explored for identifying fraudsters. In this paper, we propose the Multi-Range Gated Graph Neural Network (MRG-GNN) for learning latent features of social network. Specifically, we first model a social network as a directed graph where vertices with subscriber features represent subscribers and edges with relational features represent activities between them. Then, a novel method based on efficient short walks and node-merging is proposed to structure the convolutions, and graph convolution block captures content information and relation information between users. The multi-range gated readout operation is proposed to aggregate informative features in multiple nodes and automatically learns the representation of user social network. Finally, experiments on a real-world telecommunication network show that our MRG-GNN achieves the state-of-the-art results."}, "conf/vtc/HanLYL20": {"title": "A Hierarchical Traffic-Balanced Route Planning Method for Connected Vehicles.", "url": "https://doi.org/10.1109/VTC2020-Fall49728.2020.9348792", "year": "2020", "author": {"Xu Han": "19/3011", "Jiawei Lu": "203/0822", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335"}, "abstract": " Abstract:Urban traffic congestion has a great impact on commute time, energy consumption, and carbon emissions. To deal with traffic congestion, the vehicle cooperative routing method coordinates the routing behavior of vehicles according to dynamic traffic demands. However, city-wide cooperative routing is faced with extremely high communication and computing complexity, which makes it difficult to guarantee real-time performance. To this end, we propose a hierarchical traffic-balanced route planning method for connected vehicles based on edge computing. Specifically, the road network is divided into grids, and an improved back-pressure algorithm is used to guide the inter-grid traffic flow. Furthermore, to balance the intra-grid traffic flow, the vehicle routing is scheduled by evolutionary game method at each intersection. The simulation results show that the algorithm can effectively balance the utilization of road network resources, increase the throughput of the road network and reduce the total traffic time."}, "conf/vtc/LinYLY20": {"title": "A Multi-Timescale Load Balancing Approach in Vehicular Edge Computing.", "url": "https://doi.org/10.1109/VTC2020-Fall49728.2020.9348791", "year": "2020", "author": {"Tao Lin": "64/4492", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Shu Yang 0003": "18/6739-3"}, "abstract": " Abstract:Intelligent and connected vehicles rely on edge computing to offload their perception and planning tasks, so the scheduling of communication and computing resources is critical to the driving safety and efficiency. However, the imbalanced distribution of road traffic and offloading demands impedes the quality of vehicular edge computing. In this paper, we propose a multi-timescale load balancing approach to improve the service quality and resource utility of vehicular edge computing. Specifically, vehicle mobility optimization is leveraged to perform long-term load balancing, and resource allocation is used to achieve real-time load balancing. As the multi-timescale optimization is confronted with the curse of dimensionality, multi-agent deep reinforcement learning is utilized to optimized vehicle mobility and resource allocation in parallel. Experimental results show that the proposed method can significantly reduce the service delay of vehicular edge computing."}, "conf/vtc/XuLYL20": {"title": "A Dual-Attention-Based Neural Network for See-Through Driving Decision.", "url": "https://doi.org/10.1109/VTC2020-Fall49728.2020.9348588", "year": "2020", "author": {"Fanqi Xu": "243/8741", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Guiyang Luo": "187/6958"}, "abstract": " Abstract:The existing end-to-end methods make driving decisions mainly based on the vehicle's own perceived data, which cannot avoid hazards in blind zones. To fill this gap, vehicles should cooperate to construct a comprehensive environment perception by sharing information among each other, equipping each vehicle with see-through ability. While bringing more perceived information, data from other sources may also interfere feature selection and make decision making more difcult. To solve this problem, we propose a dual-attention-based neural network by utilizing two different attention modules. The first module is designed for each source to eliminate redundant features in perception and generate cognitive information for sharing. Since the influences of different cognition on the decision making are different under different circumstances, the second module is used to discriminate the importance of different cognition and focus on the dominant one as needed. Guided by the dual-attention-weighted features, the proposed network extracts the most salient features from the multi-source data, which leads to a signicant reduction of false response in steering angle controlling. Extensive experiments have demonstrated the superior performance of our proposed method, as compared with several state-of-the-arts."}, "conf/blocksys/GaoLL019": {"title": "Cooperative Traffic Signal Control Based on Multi-agent Reinforcement Learning.", "url": "https://doi.org/10.1007/978-981-15-2777-7_65", "year": "2019", "author": {"Ruowen Gao": "257/2668", "Zhihan Liu": "62/2764", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4"}, "abstract": "This paper proposes a traffic signal cooperative control algorithm based on multi-agent reinforcement learning (MARL), and design a framework of edge computing under traffic signal control scene. By introducing edge computing into the scene of traffic signal cooperative control, it will bring minimal response time and reduce network load. We abstracted the traffic signal control problem into the Markov decision process (MDP). The traffic state is discretized by feature extraction to avoid the curse of dimensionality. We propose a fusion of multi-agent reinforcement learning and coordination mechanisms through collaborative Q-values. The action selection strategy of an intersection depends not only on its own local reward, but also on the impact of other intersections. Different from considering only adjacent intersections, algorithm combines the static distance and dynamic traffic flow, and considers the cooperative relationship between neighbor and non-neighbor nodes. Finally, we show through simulation experiments on SUMO that our algorithm can effectively control traffic signal.KeywordsEdge computingTraffic signal controlMulti-agent reinforcement learningCoordination mechanismFuzzy control"}, "conf/icpads/ZhuL0LY19": {"title": "An Edge-Assisted Vehicle Routing Method Based on Game-Theoretic Multiagent Learning.", "url": "https://doi.org/10.1109/ICPADS47876.2019.00072", "year": "2019", "author": {"Bichuan Zhu": "257/6009", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Jiawei Lu": "203/0822", "Shu Yang 0003": "18/6739-3"}, "abstract": " Abstract:Traffic congestion is a serious social issue confronting modern cities. To improve traffic efficiency, route planning for the individual vehicle based on dynamic traffic conditions has been well investigated. However, existing studies usually model the vehicles with perfect rationality and omit the complex routing interaction among multiple vehicles, causing that the routing performance dramatically deviates from the system optimum. Considering the mutual influence in multi-vehicle routing, we propose an edge-assisted distributed routing framework, which enables virtual agents on behalf of vehicles to interact with others to make real-time routing decisions. In the framework, we model the agent interaction as a population game and propose a scalable multiagent learning algorithm to efficiently find the Nash equilibria. Specifically, the multiagent learning algorithm takes the bounded rationality of individuals into account and uses a stage learning algorithm based on best-response dynamics to plan a route for vehicles. The simulation results show that the algorithm efficiently converges to Nash equilibria, and achieves the maximum throughput at the intersection and the minimum average travel time for vehicles."}, "conf/ijcnn/WeiL0HY19": {"title": "Learning Navigation via R-VIN on Road Graphs.", "url": "https://doi.org/10.1109/IJCNN.2019.8852032", "year": "2019", "author": {"Xiaojuan Wei": "123/5785", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Xu Han": "19/3011", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Guiding vehicles to their destination is an essential service. Nowadays navigation systems are mainly relying on the traffic conditions of road network, and other influence factors are not taken into account accurately, which is easy to lead to imbalance between the supply and demand of roads, resulting in congestion. In this paper, we introduce an online guiding approach via value iteration network on road graphs, R-VIN for short, which is an end-to-end planning model. In R-VIN, a large-scale real GPS trajectories are mapped via map-matching based road topology, which enables R-VIN to catch the experienced driving knowledge. Then we propose a conversion method from irregular road graphs to regular grid images to formalize the learning model. For a global optimum, ConvLSTM is used to predict the future traffic situation to form \"prediction reward\" of R-VIN. Combining with \"current reward\", a double rewarded VIN is used to solve the plan-involved function. Lastly, we train and evaluate R-VIN on planning problem in road networks, showing that R-VIN can achieve segment-based autonomous navigation with high top-k accuracy and less commuting time."}, "conf/iov/WangYLDWL19": {"title": "Learning Route Planning from Experienced Drivers Using Generalized Value Iteration Network.", "url": "https://doi.org/10.1007/978-3-030-38651-1_9", "year": "2019", "author": {"Xiao Wang": "49/67", "Quan Yuan 0004": "29/5782-4", "Zhihan Liu": "62/2764", "Yushun Dong": "251/9559", "Xiaojuan Wei": "123/5785", "Jinglin Li": "45/10335"}, "abstract": "Traffic congestion has long been a serious problem in cities, and route planning can improve traffic efficiency. The existing route planning approach relies on current and future traffic status. However, because traffic prediction and route planning interact with each other, the actual driving results deviate from expectations, and the performance is not satisfactory. In order to solve this problem, considering the topology of road networks, this paper proposes a route planning algorithm based on generalized value iteration network (GVIN), which uses graph convolution to extract the features of traffic flow, and then imitates human routing experience under various traffic status. Finally we evaluate the performance of the proposed network on real map and trajectory data in Beijing, China. The experimental results show that GVIN can simulate the human’s routing decisions with high success rate and less commuting time.KeywordsRoute planningReal timeGeneralized value iteration network"}, "conf/iov/LiuLY19": {"title": "Predicting Steering for Autonomous Vehicles Based on Crowd Sensing and Deep Learning.", "url": "https://doi.org/10.1007/978-3-030-38651-1_12", "year": "2019", "author": {"Taiyu Liu": "256/7576", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4"}, "abstract": "The challenge in ensuring the reliability of autonomous vehicles is full awareness of the surrounding environment and high-precision steering control. The latest solutions to this challenge include deep learning technologies that provide end-to-end solutions to predict steering angles directly from environmental cognition information with high accuracy. Under the background of 5G technology, edge device has certain computing power, which can reduce the load of on-board computing equipment. In this paper, we present a new distributed perception-decision network model. This model allows the network’s computing tasks to be offloaded to the edge computing devices to reduce the consumption of vehicle-mounted computing devices. The feasibility of the model is verified by experiments. Compared with the existing methods, the model also has a higher accuracy of steering prediction.KeywordsAutonomous vehiclesDeep neural networkEnd-to-endCrowd sensing"}, "conf/iov/ZhangLY19": {"title": "Edge Service Migration for Vehicular Networks Based on Multi-agent Deep Reinforcement Learning.", "url": "https://doi.org/10.1007/978-3-030-38651-1_27", "year": "2019", "author": {"Haohan Zhang": "138/9922", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4"}, "abstract": "To meet the increasing resource demand of intelligent driving, roadside infrastructure is used to provide communication and computing capabilities to vehicles. Existing studies have leveraged deep reinforcement learning to perform small-scale resource scheduling for vehicles. It is critical to implement large-scale resource scheduling to deal with the high mobility of vehicles. However, this large-scale optimization is confronted with huge state and action space. To overcome this challenge, we propose an edge resource allocation method based on multi-agent deep reinforcement learning to reduce system cost while guarantee the quality of intelligent driving. The proposed method considers both immediate and long-term resource status, which helps to select appropriate base stations and edge servers. Trace driven simulations are performed to validate the efficiency of the proposed method.KeywordsInternet of VehiclesMulti-agent reinforcement learningEdge computingResource allocation"}, "conf/iov/ChenLLY19": {"title": "A Road Traffic Guidance Service Based on Deep Reinforcement Learning.", "url": "https://doi.org/10.1007/978-3-030-38651-1_28", "year": "2019", "author": {"Kaihui Chen": "235/6673", "Zhihan Liu": "62/2764", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4"}, "abstract": "The development of Internet of vehicle (IOV) and autopilot technology indicates the coming of smart traffic and automatic unmanned era. The promotion of networking and intelligence not only provides a rich source for urban traffic data, but also provides an efficient and direct way to solve urban traffic problems. With the help of deep learning and reinforcement learning technology, we propose a model to mine the urban traffic rule from the travel history of urban travelers, and utilize it achieving better allocation of traffic resources by providing a traffic guidance service, finally realize the system optimal traffic travel.KeywordsCloud serviceDeep learningReinforcement learningTraffic guidance"}, "conf/itsc/LuL0C19": {"title": "A Multi-Vehicle Cooperative Routing Method Based on Evolutionary Game Theory.", "url": "https://doi.org/10.1109/ITSC.2019.8917441", "year": "2019", "author": {"Jiawei Lu": "203/0822", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Bo Chen": "89/5615"}, "abstract": " Abstract:Increasing number of vehicles is making congestion problem become more and more deteriorate. This problem could be alleviated by route planning which guides vehicles to routes with small traffic flows to get the shortest travel time. However, the existing route planning algorithms mostly focus on one single vehicle and overlook the coordination among vehicles. If all vehicles follow the same routing recommendation, a large traffic volume will flow into the same route and cause congestion on that route. That makes the routing method ineffective. To resolve this problem, a distributed cooperative routing algorithm (DCR) based on evolutionary game theory is proposed to coordinate vehicles. This method runs on roadside units (RSUs) with combination of edge computing and edge intelligence. A road network is built to evaluate the performance of proposed algorithm. The experiment results show that the proposed DCR algorithm balances the distribution of traffic flow and in the same time makes the total travel time from origin to destination smaller."}, "conf/iov/YanL018": {"title": "HESAVE: An Approach for Online Heuristic GPS Trajectory Sampling.", "url": "https://doi.org/10.1007/978-3-030-05081-8_14", "year": "2018", "author": {"Zexin Yan": "230/2137", "Zhihan Liu": "62/2764", "Quan Yuan 0004": "29/5782-4"}, "abstract": "In location based service system, online trajectory compression can help to relieve the whole system’s pressure by reducing communication, storage and computation cost during network transmission, storage and business computing. Segment simplified sampling method is a kind of trajectory compression methods which is widely used in online trajectory compression, but current methods have the problems such as temporal information loss and difficulty of parameter selection. In this paper, we propose an online heuristic trajectory sampling algorithm base on segment simplification, HESAVE (HEuristic SAmpling based on VEctor feature). HESAVE introduces Iterator Vector to describe motion semantics of trajectory points. Furthermore, Iterator Vector Information is proposed to quantify the information of trajectory points based on Iterator. Moreover, HESAVE adopts a data-driven window called Sliding Mode Window to split multi-mode trajectory into isolated process units and a priority queue for each unit to select trajectory points. Extensive experiments on GeoLife 1.3 dataset show that HESAVE can gain more reservation of trajectory’s temporal and positioning information after sampling under the same sampling ratio compared to SQUISH. In addition, HESAVE’s computation resource consumption is quite acceptable.KeywordsTrajectory compressionHeuristic samplingTrajectory vector featureData-driven window"}, "conf/sc2/XiaSZWXGL018": {"title": "Improving the Performance of Stock Trend Prediction by Applying GA to Feature Selection.", "url": "https://doi.org/10.1109/SC2.2018.00025", "year": "2018", "author": {"Tian Xia": "90/4765", "Qibo Sun": "06/43", "Ao Zhou 0001": "123/6949-1", "Shangguang Wang": "73/8637", "Shilong Xiong": "231/7601", "Siyi Gao": "230/1937", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4"}, "abstract": " Abstract:Predicting stock trend by using machining learning is a hot research issue today. However, due to the non linearity and instability of the stock data, it is still very difficult to predict the stock trend with high accuracy. In order to improve the accuracy, most researchers focus on the models selection and features construction. A variety of feature construction methods have been proposed. However, not all features constructed in those paper are equally useful. Further more, many features of significant importance may not be selected in prediction. In order to improve the accuracy of stock trend prediction, this paper will focus on the features selection problem. Most feature selection methods employed in the stock trend prediction are based on filtration methods. Wrapper methods are rarely used. Compared with filtration methods, wrapper methods have better stability and accuracy. In this paper, we propose a feature selection algorithm by extending genetic algorithm (GA). Experiments are conducted on real-world stock price data set. The experiment results show that our GA-based feature selection algorithm is better in both stability and performance."}, "conf/IEEEscc/YangLLY17": {"title": "Relaying Message and Motivating Collaboration for VANET Data Service.", "url": "https://doi.org/10.1109/SCC.2017.15", "year": "2017", "author": {"Shu Yang 0003": "18/6739-3", "Jinglin Li": "45/10335", "Zhihan Liu": "62/2764", "Quan Yuan 0004": "29/5782-4"}, "abstract": " Abstract:This paper is faced with group sensing problem, where HD map producers motivate private cars to collect data from real world. Group sensing needs vehicles to communicate physically, and drivers to collaborate strategically. First we consider communication module, three VANET-based methods are proposed to achieve inter-vehicle message relaying. Secondly, we consider collaboration module which motivates drivers to be participants, three motivating methods are derived by integrating relaying methods with collaborating strategies. Some combinations of two modules are discussed and classified from centralized or distributed perspective. Finally, we simulate and analyze two modules. The results shows that centralized method could motivate collaboration at a low price, but brings about heavy communication overhead. In contrast, distributed method requires more incentives and less communication overhead than centralized method. Map producers need to make a balance between communication module and collaboration module if they want to improve effectiveness of group sensing."}, "conf/colcom/YangL0L17": {"title": "Route-Oriented Participants Recruitment in Collaborative Crowdsensing.", "url": "https://doi.org/10.1007/978-3-030-00916-8_16", "year": "2017", "author": {"Shu Yang 0003": "18/6739-3", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Zhihan Liu": "62/2764"}, "abstract": "Route-oriented participants recruitment is a critical problem in collaborative crowdsensing, where task publisher uses monetary reward to motivate private cars collecting data along their routes. For map producers, route-oriented crowdsensing scheme helps them achieve maximum roads coverage with a limited budget, by selecting appropriate participants from a group of candidates.Focused on route-oriented participants recruitment problem, this paper first formalizes the road network and vehicle route model. Each vehicle’s route is mapped to a coverage rate on the road set. The recruitment problem therefore transforms to a combinatorial optimization problem, which has proved to be NP-hard. To find a solution, we proposed an approximation algorithm, which leverages submodularity to reduce computation complexity and has a worst performance guarantee. Finally we evaluate the performance of proposed algorithm on real road and trajectory data in Beijing, China.KeywordsParticipants recruitmentCollaborative crowdsensingVehicle trajectoryApproximate algorithm"}, "conf/iov/ZongLYYY17": {"title": "Multi-Task Oriented Participant Recruitment for Vehicular Crowdsensing.", "url": "https://doi.org/10.1007/978-3-319-72329-7_9", "year": "2017", "author": {"Wenlong Zong": "208/9480", "Zhihan Liu": "62/2764", "Shu Yang 0003": "18/6739-3", "Quan Yuan 0004": "29/5782-4", "Fangchun Yang": "06/5366"}, "abstract": "As vehicles are equipped with more sensors, there is a growth of potential for vehicles to contribute to urban crowdsensing. However, participant recruitment, the process that decides which vehicles are appropriate for specific sensing tasks with a budget constraint, is critical, especially in multi-task scenarios. To address on this problem, we first formulate the vehicle’s route and urban road network model to convert this problem to a combinatorial optimization problem. The time complexity of the optimal solution is factorial. Therefore we proposed two algorithms: Naive recruitment and Greedy recruitment to find a suboptimal solution for single task scenario. Furthermore, considering the sensing overlaps in time and regions between multiple tasks, ST-Merge is presented to merge the common sensing requirements in time and space dimensions to alleviate sensing burden. Finally, we evaluate the performance of all algorithms using real road and trajectory data in Beijing, China. The experimental results show that the combination scheme of ST-Merge and Greedy recruitment can effectively improve the sensing effect.KeywordsCrowdsensingParticipant recruitmentTrajectory"}, "conf/hpcc/YuanLLY16": {"title": "Space and Time Constrained Data Offloading in Vehicular Networks.", "url": "https://doi.org/10.1109/HPCC-SmartCity-DSS.2016.0064", "year": "2016", "author": {"Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Zhihan Liu": "62/2764", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Mobile data offloading is a feasible and cost-effective solution to ease the burden of cellular networks. In Internet of Vehicles, however, existing offloading techniques are hardly applicable to the ubiquitous location-dependent services, which impose strict spatiotemporal constraints on content delivery. Particularly, the spatiotemporal constraints cause a phenomenon where the delivery deadlines are different even for the vehicles who subscribe to the same content. To this end, we propose a space and time constrained data offloading scheme (STCDO). The scheme maintains a probability-based contact graph to represent the near-term transmission opportunities between vehicles. Furthermore, a dynamic structure called offloading tree is introduced to evaluate the influence of each vehicle on opportunistic dissemination. Finally, the scheme uses a greedy algorithm to effectively select appropriate vehicles as offloading seeds. We perform extensive experiments based on the real-world map-driven movement model in the ONE simulator. The experimental results show that the proposed scheme largely offloads the overloaded cellular networks while satisfying the spatiotemporal constraints."}, "conf/icpads/YuanLLYY15": {"title": "An Adaptive and Compressive Data Gathering Scheme in Vehicular Sensor Networks.", "url": "https://doi.org/10.1109/ICPADS.2015.34", "year": "2015", "author": {"Quan Yuan 0004": "29/5782-4", "Zhihan Liu": "62/2764", "Jinglin Li": "45/10335", "Shu Yang 0003": "18/6739-3", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:In vehicular sensor networks, probe vehicles can act as mobile sensors to monitor physical world and report to an urban sensing center. However, the distribution of probe vehicles is uneven over space and time. Data redundancy and vacancy are common phenomena for different spatiotemporal positions, which seriously degrade sensing efficiency and accuracy. To address this issue, we propose an adaptive and compressive data gathering scheme (AC-Sense) based on matrix completion theory. The scheme adaptively determines the locations where to obtain samples from so that the principal features of physical world can be captured with a reduced number of probe vehicles. The spatio-temporal correlation between sensor data is exploited to estimate the un-sampled data. Furthermore, we introduce a feedback mechanism to stabilize sensing performance according to the evaluation of data error. We perform extensive experiments based on real taxicab mobility traces and air quality data in Beijing. The experimental results show that the proposed scheme largely improves sensing efficiency while ensuring required data quality."}, "conf/bigdata/ZhangLWLYY14": {"title": "On Retrieving Moving Objects Gathering Patterns from Trajectory Data via Spatio-temporal Graph.", "url": "https://doi.org/10.1109/BigData.Congress.2014.64", "year": "2014", "author": {"Junming Zhang": "47/256", "Jinglin Li": "45/10335", "Shangguang Wang": "73/8637", "Zhihan Liu": "62/2764", "Quan Yuan 0004": "29/5782-4", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Moving object gathering pattern represents a group event or incident that involves congregation of moving objects, enabling the prediction of anomalies in traffic system. However, effectively and efficiently discovering the specific gathering pattern turns to be a remaining challenging issue since the large number of moving objects will generate high volume of trajectory data. In order to address this issue, we propose a moving object gathering pattern retrieving method that aims to support the retrieving of gathering patterns by using spatio-temporal graph. In this method, firstly we use a density based clustering algorithm (DBScan) to collect the moving object clusters. Then, we maintain a spatio-temporal graph rather than storing the spatial coordinates to obtain the spatio-temporal changes in real time. Finally, a gathering retrieving algorithm is developed by searching the maximal complete graphs which meet the spatio-temporal constraints. To the best of our knowledge, effectiveness and efficiency of the proposed methods are outperformed other methods on both real and large trajectory data."}, "journals/network/Luo0LWY22": {"title": "Artificial Intelligence Powered Mobile Networks: From Cognition to Decision.", "url": "https://doi.org/10.1109/MNET.013.2100087", "year": "2022", "author": {"Guiyang Luo": "187/6958", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Mobile networks (MNs) are anticipated to provide unprecedented opportunities to enable a new world of connected experiences and radically shift the way people interact with everything. MNs are becoming more and more complex, driven by ever increasing complicated configuration issues and blossoming new service requirements. This complexity poses significant challenges in deployment, management, operation, optimization, and maintenance, since they require complete understanding and cognition of MNs. Artificial intelligence (AI), which deals with the simulation of intelligent behavior in computers, has demonstrated enormous success in many application domains, suggesting its potential in cognizing the state of an MN and making intelligent decisions. In this article, we first propose an AI-powered MN architecture and discuss challenges in terms of cognition complexity, decisions with high-dimensional action space, and self-adaptation to system dynamics. Then potential solutions associated with AI are discussed. Finally, we propose a deep learning approach that directly maps the state of an MN to perceived QoS, integrating cognition with the decision. Our proposed approach helps operators to make more intelligent decisions to guarantee QoS. Meanwhile, the effectiveness and advantages of our proposed approach are demonstrated on a real-world dataset involving 31,261 users over 77 stations within 5 days."}, "journals/tvt/YuanSZDM22": {"title": "Guest Editorial Introduction to the Special Section on Cybertwin-Driven 6G for V2X Applications.", "url": "https://doi.org/10.1109/TVT.2022.3171000", "year": "2022", "author": {"Quan Yuan 0004": "29/5782-4", "Katsuya Suto": "120/3978", "Haibo Zhou": "14/8431", "Mehrdad Dianati": "51/3596", "Jelena V. Misic": "m/JVMisic"}, "abstract": " Abstract:The papers in this special section focuses on cybertwin-driven 6G mobile communications for V2X applications. Digital twin is envisioned to enhance functionalities of future electric and autonomous vehicles. Serving as the digital representation of a vehicle on the application layer, digital twin models the entire lifecycle of processes and services of the vehicle. To provide fundamental support for digital twin from network and transport layers, an agent service, namely Cybertwin, acts as the communication, mobility, and security agent for each user entity (either human or thing) at the edge of the network. Specifically, Cybertwin, serving as a communication anchor, is the only entrance point of the user for the Internet and records all the user states and behaviors. In addition, Cybertwin can become the personal AI assistant and act as a security agent through customizing the visibility of recorded data. By enhancing edge intelligence and providing composite edge services, Cybertwin can support advanced vehicle-to-everything (V2X) applications in the future intelligent and secure vehicular 6G network."}, "journals/iotj/YuanWZNCC21": {"title": "Guest Editorial Special Issue on Cybertwin-Driven 6G: Architectures, Methods, and Applications.", "url": "https://doi.org/10.1109/JIOT.2021.3115295", "year": "2021", "author": {"Quan Yuan 0004": "29/5782-4", "Miao Wang 0003": "80/5294-3", "Haibo Zhou": "14/8431", "Jianbing Ni": "121/2421", "Jiacheng Chen": "69/10696", "Sandra Céspedes": "47/751"}, "abstract": " Abstract:Internet of Everything (IoE) brings unprecedented challenges regarding scability, mobility, availability, and security to wireless communications. Cybertwin emerges as a promising paradigm for the next-generation mobile network, i.e., 6G. Basically, it serves as the communication anchor of a user at the edge and performs fundamental authentication and network resources control functionalities. Cybertwin is also an indispensable enabler of the cloud native network paradigm and can efficiently support the digital twin and metaverse. With cybertwin, heterogeneous access networks can be easily exploited in a synergic manner, such that advanced applications, such as multiscreen multistream rich media delivery, can be realized with guaranteed QoS. Furthermore, a user’s activities in cyberspace can be recorded naturally which becomes his/her/its digital asset. In the future, cybertwin may become the personal assistant and even an immortal second life of the user."}, "journals/iotj/YuanFLLLY21": {"title": "GraphComm: Efficient Graph Convolutional Communication for Multiagent Cooperation.", "url": "https://doi.org/10.1109/JIOT.2021.3097947", "year": "2021", "author": {"Quan Yuan 0004": "29/5782-4", "Xiaoyuan Fu": "10/575", "Ziyan Li": "236/7682", "Guiyang Luo": "187/6958", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Artificial intelligence-empowered smart things (e.g., robots, autonomous vehicles, and unmanned aerial vehicles) have been transforming the world. The “brains” of smart things can be abstracted as the agents or cybertwins residing on end devices and edge servers. The next-generation communication networks (i.e., 6G) will become the nervous system for these agents and natively support multiagent cooperation. By sharing local observations and intentions via communication channels, the agents could better understand the environments and make right decisions. Due to the limited channel bandwidth, the communication is considered as a bottleneck of multiagent cooperation. In this article, we propose a graph convolutional communication method (GraphComm) for multiagent cooperation to relive the bottleneck. Specifically, a variational information bottleneck is used to encode the observations and intentions compactly. Furthermore, a graph information bottleneck with the attention-based neighbor sampling mechanism is utilized to improve the effectiveness and robustness of the multiround communication process. The experimental results show that GraphComm can improve the effectiveness, robustness, and efficiency of communication in multiagent cooperative tasks as compared to baseline methods."}, "journals/jsac/QianZMYYS21": {"title": "Multi-Operator Spectrum Sharing for Massive IoT Coexisting in 5G/B5G Wireless Networks.", "url": "https://doi.org/10.1109/JSAC.2020.3018803", "year": "2021", "author": {"Bo Qian": "04/6584", "Haibo Zhou": "14/8431", "Ting Ma 0004": "30/4463-4", "Kai Yu": "197/1322", "Quan Yuan 0004": "29/5782-4", "Xuemin Shen": "s/XueminShen"}, "abstract": " Abstract:With a massive number of Internet-of-Things (IoT) devices connecting with the Internet via 5G or beyond 5G (B5G) wireless networks, how to support massive access for coexisting cellular users and IoT devices with quality-of-service (QoS) guarantees over limited radio spectrum is one of the main challenges. In this paper, we investigate the multi-operator dynamic spectrum sharing problem to support the coexistence of rate guaranteed cellular users and massive IoT devices. For the spectrum sharing among mobile network operators (MNOs), we introduce a wireless spectrum provider (WSP) to make spectrum trading with MNOs through the Stackelberg pricing game. This framework is inspired by the active radio access network (RAN) sharing architecture of 3GPP, which is regarded as a promising solution for MNOs to improve the resource utilization and reduce deployment and operation cost. For the coexistence of cellular users and IoT devices under each MNO, we propose the coexisting access rules to ensure their QoS and the priority of cellular users. In particular, we prove the uniqueness of the Stackelberg equilibrium (SE) solution, which can maximize the payoffs of MNOs and WSP simultaneously. Moreover, we propose an iterative algorithm for the Stackelberg pricing game, which is proved to achieve the unique SE solution. Extensive numerical simulations demonstrate that, the payoffs of WSP and MNOs are maximized and the SE solution can be reached. Meanwhile, the proposed multi-operator dynamic spectrum sharing algorithm can support more than almost 40% IoT devices compared with the existing no-sharing method, and the gap is less than about 10% compared with the exhaustive method."}, "journals/ppna/LyuXYS21": {"title": "Space-air-ground integrated networks for future IoT: Architecture, management, service and performance.", "url": "https://doi.org/10.1007/s12083-021-01170-x", "year": "2021", "author": {"Feng Lyu 0001": "214/2000-1", "Wenchao Xu 0001": "96/8862-1", "Quan Yuan 0004": "29/5782-4", "Katsuya Suto": "120/3978"}, "abstract": ""}, "journals/tmc/LuoZCYLYS21": {"title": "Software-Defined Cooperative Data Sharing in Edge Computing Assisted 5G-VANET.", "url": "https://doi.org/10.1109/TMC.2019.2953163", "year": "2021", "author": {"Guiyang Luo": "187/6958", "Haibo Zhou": "14/8431", "Nan Cheng": "73/8540", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366", "Xuemin Shen": "s/XueminShen"}, "abstract": " Abstract:It is widely recognized that connected vehicles have the potential to further improve the road safety, transportation intelligence and enhance the in-vehicle entertainment. By leveraging the 5G enabled Vehicular Ad hoc NETworks (VANET) technology, which is referred to as 5G-VANET, a flexible software-defined communication can be achieved with ultra-high reliability, low latency, and high capacity. Many enabling applications in 5G-VANET rely on sharing mobile data among vehicles, which is still a challenging issue due to the extremely large data volume and the prohibitive cost of transmitting such data using 5G cellular networks. This article focuses on efficient cooperative data sharing in edge computing assisted 5G-VANET. First, to enable efficient cooperation between cellular communication and Dedicated Short-Range Communication (DSRC), we first propose a software-defined cooperative data sharing architecture in 5G-VANET. The cellular link allows the communications between OpenFlow enabled vehicles and the Controller to collect contextual information, while the DSRC serves as the data plane, enabling cooperative data sharing among adjacent vehicles. Second, we propose a graph theory based algorithm to efficiently solve the data sharing problem, which is formulated as a maximum weighted independent set problem on the constructed conflict graph. Specifically, considering the continuous data sharing, we propose a balanced greedy algorithm, which can make the content distribution more balanced. Furthermore, due to the fixed amount of computing resources allocated to this software-defined cooperative data sharing service, we propose an integer linear programming based decomposition algorithm to make full use of the computing resources. Extensive simulations in NS3 and SUMO demonstrate the superiority and scalability of the proposed software-defined architecture and cooperative data sharing algorithms."}, "journals/corr/abs-2112-04263": {"title": "Artificial Intelligence Powered Mobile Networks: From Cognition to Decision.", "url": "https://arxiv.org/abs/2112.04263", "year": "2021", "author": {"Guiyang Luo": "187/6958", "Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Shangguang Wang": "73/8637", "Fangchun Yang": "06/5366"}, "abstract": "\n      Abstract:  Mobile networks (MN) are anticipated to provide unprecedented opportunities\nto enable a new world of connected experiences and radically shift the way\npeople interact with everything. MN are becoming more and more complex, driven\nby ever-increasingly complicated configuration issues and blossoming new\nservice requirements. This complexity poses significant challenges in\ndeployment, management, operation, optimization, and maintenance, since they\nrequire a complete understanding and cognition of MN. Artificial intelligence\n(AI), which deals with the simulation of intelligent behavior in computers, has\ndemonstrated enormous success in many application domains, suggesting its\npotential in cognizing the state of MN and making intelligent decisions. In\nthis paper, we first propose an AI-powered mobile network architecture and\ndiscuss challenges in terms of cognition complexity, decisions with\nhigh-dimensional action space, and self-adaption to system dynamics. Then,\npotential solutions that are associated with AI are discussed. Finally, we\npropose a deep learning approach that directly maps the state of MN to\nperceived QoS, integrating cognition with the decision. Our proposed approach\nhelps operators in making more intelligent decisions to guarantee QoS.\nMeanwhile, the effectiveness and advantages of our proposed approach are\ndemonstrated on a real-world dataset, involving 3126131261 users over 7777\nstations within 55 days.\n\n    "}, "journals/network/YuanLZLLYS20": {"title": "Cross-Domain Resource Orchestration for the Edge-Computing-Enabled Smart Road.", "url": "https://doi.org/10.1109/MNET.011.2000007", "year": "2020", "author": {"Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Haibo Zhou": "14/8431", "Guiyang Luo": "187/6958", "Tao Lin": "64/4492", "Fangchun Yang": "06/5366", "Xuemin Sherman Shen": "s/XueminShen"}, "abstract": " Abstract:Intelligent driving plays a role in significantly improving the safety and efficiency of transportation systems. As the onboard capabilities of perception, comprehension, and decision making are limited, vehicles can employ the edge computing infrastructure of the smart road to enhance their intelligence. Therefore, the smart road is considered an intelligent Internet of Things system. It provides vehicles with not only the road space in the transportation domain, but also the communication, sensing, and computing resources in the information domain to improve the composite quality of intelligent driving. However, the resources in the information and transportation domains are complicatedly coupled, and the orchestration of these cross-domain resources is confronted with the huge state-action space, which cannot be solved in a real-time manner. In this article, we investigate the fundamental research challenges in cross-domain resource orchestration for the smart road, and design a multi-agent-based framework. Within the framework, each vehicle is associated with an exclusive agent on the edge cloud, and the agents utilize swarm intelligence to jointly optimize the traffic flow and information flow for their respective vehicles. Specifically, a value iteration network is used by agents to learn the routing behavior of vehicles, and a multi-agent deep reinforcement learning method is proposed, enabling agents to cooperatively learn decentralized resource optimization policies. To verify the effectiveness of the proposed framework, a cross-domain resource orchestration prototype is implemented and evaluated."}, "journals/tvt/YuanLZLLS20": {"title": "A Joint Service Migration and Mobility Optimization Approach for Vehicular Edge Computing.", "url": "https://doi.org/10.1109/TVT.2020.2999617", "year": "2020", "author": {"Quan Yuan 0004": "29/5782-4", "Jinglin Li": "45/10335", "Haibo Zhou": "14/8431", "Tao Lin": "64/4492", "Guiyang Luo": "187/6958", "Xuemin Shen": "s/XueminShen"}, "abstract": " Abstract:The vehicular edge computing is considered an enabling technology for intelligent and connected vehicles since the optimization of communication and computing on edge has a significant impact on driving safety and efficiency. In this paper, with the road traffic assignment to “proactively” reshape the spatiotemporal distribution of resource demands, we investigate the joint service migration and mobility optimization problem for vehicular edge computing. The goal is to meet the service delay requirements of vehicular edge computing with minimum migration cost and travel time. As service migration and mobility optimization are coupled, the joint scheduling problem suffers from the curse of dimensionality, which cannot be solved in real time by centralized algorithms. To this end, a multi-agent deep reinforcement learning (MADRL) algorithm is proposed to maximize the composite utility of communication, computing, and route planning in a distributed way. In the MADRL algorithm, a two-branch convolution based deep Q-network is constructed to coordinate migration action and routing action. Extensive experimental results show that the proposed algorithm is scalable and substantially reduces service delay, migration cost and travel time as compared with the existing baselines."}, "journals/iotj/LiLCYWGL19": {"title": "An End-to-End Load Balancer Based on Deep Learning for Vehicular Network Traffic Control.", "url": "https://doi.org/10.1109/JIOT.2018.2866435", "year": "2019", "author": {"Jinglin Li": "45/10335", "Guiyang Luo": "187/6958", "Nan Cheng": "73/8540", "Quan Yuan 0004": "29/5782-4", "Zhiheng Wu": "154/0125", "Shang Gao": "28/435", "Zhihan Liu": "62/2764"}, "abstract": " Abstract:The infrastructure to vehicle (I2V) communication boosts a large number of prevailing vehicular services, which can provide vehicles with external information, storage, and computing power located at both mobile edge server (MES) and remote cloud. However, vehicle distribution is imbalanced due to the spatial inhomogeneity and temporal dynamics. As a consequence, the communication load for MES is imbalanced and vehicles may suffer from poor I2V communications where the MES is overloaded. In this paper, we propose a novel proactively load balancing approach that enables efficient cooperation among MESs, which is referred to as end-to-end load balancer (E2LB). E2LB schedules the cached data among MESs based on the predicted road traffic situation. First, a convolutional neural network (CNN) is applied to efficiently learn the spatio-temporal correlation in order to predict the road traffic situation. Then, we formulate the load balancing problem as a nonlinear programming (NLP) problem and a novel framework based on CNN is adopted to approximate the NLP optimization. Finally, we connect the above neural networks into an end-to-end neural network to jointly optimize the performance, where the input is the historical traffic situation while the output is the balanced scheduling solution. E2LB can guarantee the real-time scheduling, since the calling of a well-trained neural network only requires a small number of simple operations. Experiments on the trajectories of taxis and buses in Beijing demonstrate the efficiency and effectiveness of E2LB."}, "journals/tits/YuanZLLYS19": {"title": "CESense: Cost-Effective Urban Environment Sensing in Vehicular Sensor Networks.", "url": "https://doi.org/10.1109/TITS.2018.2873112", "year": "2019", "author": {"Quan Yuan 0004": "29/5782-4", "Haibo Zhou": "14/8431", "Zhihan Liu": "62/2764", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366", "Xuemin Shen": "s/XueminShen"}, "abstract": " Abstract:In vehicular sensor networks, vehicles can act as mobile sensors to monitor the dynamic features of the physical world such as traffic flow, air quality, and temperature. However, the conventional full-coverage sensing approach is neither realizable nor cost-effective since the sensor-equipped vehicles are unevenly distributed and the environmental data are spatio-temporally correlated. To this end, we propose a cost-effective urban environment sensing solution (CESense), that exploits the sensing data correlations to improve the sensing accuracy and efficiency. CESense gathers data only at some specific areas of the whole sensing space and reliably infers the status of unsensed areas. Particularly, CESense uses a probabilistic matrix factorization model to reveal the latent features that impact the environmental status. Then, an appropriate set of sensing areas can be selected by fully taking advantage of these latent features and the sensing resource distribution patterns. In addition, to be adaptive to the dynamic environment, a checkpoint mechanism is designed to supervise the data gathering progress. Extensive experiments, which are based on the real taxicab mobility traces and air quality data collected in Beijing city, demonstrate that CESense can significantly improve the accuracy and efficiency of vehicular sensing."}, "journals/tvt/LiFYZCYY19": {"title": "A Traffic Prediction Enabled Double Rewarded Value Iteration Network for Route Planning.", "url": "https://doi.org/10.1109/TVT.2019.2893173", "year": "2019", "author": {"Jinglin Li": "45/10335", "Dawei Fu": "30/2636", "Quan Yuan 0004": "29/5782-4", "Haohan Zhang": "138/9922", "Kaihui Chen": "235/6673", "Shu Yang 0003": "18/6739-3", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Effective route planning is the key to improving transportation efficiency. By leveraging the in-depth knowledge of road topology and traffic trends, experienced drivers (e.g., taxi drivers) can usually find near-optimal routes. However, existing online route planning services can hardly acquire this domain knowledge, so they just provide the fastest/shortest route based on current traffic conditions. These seemingly optimal routes may attract numerous vehicles and then become extremely congested. To solve this problem and actually improve transportation efficiency, we propose a double rewarded value iteration network (VIN) to fully learn the experienced drivers' routing decisions, which are based on their implicitly estimated traffic trends. First, the global traffic status and routing actions are chronologically extracted from large-scale taxicab trajectories. Then, to model the knowledge of traffic trends, a long short-term memory network is trained. Being expert at learning long-term planning involved functions, the VIN is utilized to model the policy function from both current and predicted future traffic status to an experienced driver's routing action. Finally, the performance of our proposed model is evaluated on real map and taxicab trajectories in Beijing, China. The experimental results demonstrate that the proposed model can achieve human like performance in most cases, with high success rate and less commuting time."}, "journals/tvt/ZhouCWCYS19": {"title": "Toward Dynamic Link Utilization for Efficient Vehicular Edge Content Distribution.", "url": "https://doi.org/10.1109/TVT.2019.2921444", "year": "2019", "author": {"Haibo Zhou": "14/8431", "Nan Cheng": "73/8540", "Jian Wang 0025": "39/449-25", "Jiacheng Chen": "69/10696", "Quan Yuan 0004": "29/5782-4", "Xuemin Shen": "s/XueminShen"}, "abstract": " Abstract:With the significant advance of connected vehicles, future demand for vehicular infotainment services will be greatly increased. Traditional content distribution approaches based on typical cellular architecture suffer from long latency and unstable connections in high-dynamic vehicular environments and even may cause congestion on the backhaul network due to a large amount of requested data. In this paper, we propose a novel content delivery framework by leveraging the 5G edge networks, in which the content caching and data prefetching techniques are exploited accordingly. We investigate the comprehensive dynamic link utilization problem in 5G edge networks from the perspectives of vehicle users and network operator, respectively. For the vehicle users' perspective, our aim is to maximize the vehicular content distribution throughput through optimal scheduling of vehicular access link slots, and also the utilization problem of backhaul link slots in edge networks is studied to reduce the data access delay of vehicles. For the network operator's perspective, the objective is to maximize the total profit of the network operator, and therefore, the auction model is utilized for the vehicular access link slot scheduling and the backhaul link utilization is analyzed in terms of compensations and costs. Finally, extensive simulations are conducted to demonstrate the efficiency of the proposed solutions for edge content delivery of connected vehicles."}, "journals/wicomm/WeiLYCZY19": {"title": "Predicting Fine-Grained Traffic Conditions via Spatio-Temporal LSTM.", "url": "https://doi.org/10.1155/2019/9242598", "year": "2019", "author": {"Xiaojuan Wei": "123/5785", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Kaihui Chen": "235/6673", "Ao Zhou 0001": "123/6949-1", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/network/YuanZLLYS18": {"title": "Toward Efficient Content Delivery for Automated Driving Services: An Edge Computing Solution.", "url": "https://doi.org/10.1109/MNET.2018.1700105", "year": "2018", "author": {"Quan Yuan 0004": "29/5782-4", "Haibo Zhou": "14/8431", "Jinglin Li": "45/10335", "Zhihan Liu": "62/2764", "Fangchun Yang": "06/5366", "Xuemin Sherman Shen": "s/XueminShen"}, "abstract": " Abstract:Automated driving is coming with enormous potential for safer, more convenient, and more efficient transportation systems. Besides onboard sensing, autonomous vehicles can also access various cloud services such as high definition maps and dynamic path planning through cellular networks to precisely understand the real-time driving environments. However, these automated driving services, which have large content volume, are time-varying, location-dependent, and delay-constrained. Therefore, cellular networks will face the challenge of meeting this extreme performance demand. To cope with the challenge, by leveraging the emerging mobile edge computing technique, in this article, we first propose a two-level edge computing architecture for automated driving services in order to make full use of the intelligence at the wireless edge (i.e., base stations and autonomous vehicles) for coordinated content delivery. We then investigate the research challenges of wireless edge caching and vehicular content sharing. Finally, we propose potential solutions to these challenges and evaluate them using real and synthetic traces. Simulation results demonstrate that the proposed solutions can significantly reduce the backhaul and wireless bottlenecks of cellular networks while ensuring the quality of automated driving services."}, "journals/tits/LuoLZYLY18": {"title": "sdnMAC: A Software-Defined Network Inspired MAC Protocol for Cooperative Safety in VANETs.", "url": "https://doi.org/10.1109/TITS.2017.2736887", "year": "2018", "author": {"Guiyang Luo": "187/6958", "Jinglin Li": "45/10335", "Lin Zhang": "37/1629", "Quan Yuan 0004": "29/5782-4", "Zhihan Liu": "62/2764", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:The performance of a vehicular ad hoc network (VANET) largely depends on the underlying medium access control (MAC), as it determines the schedule utility of physical resources. However, in existing time-division multiple access (TDMA)-based MAC protocols, a node usually acquires slots based on what each node senses, which is typically the coupling of the control and data plane. This coupling makes the TDMA protocols unable to rapidly and agilely deal with the challenges in VANETs, such as high mobility and dynamic network densities. Inspired by the software-defined network (SDN), we propose a novel SDN-based MAC protocol, named sdnMAC, to handle these challenges. A novel roadside openflow switch (ROFS) is designed as the roadside unit, controlled by the openflow controller. The sdnMAC can be divided into two tiers, the management of ROFSes (MA-ROFS) by the controller and the management of vehicles (MA-VEH) by ROFSes. In MA-ROFS, the controller schedules the cooperative sharing of time slot information among ROFSes. In MA-VEH, each ROFS allocates slots based on this shared information, thus decoupling of the control and data plane. This decoupling provides great rapidness and agility to sdnMAC, thus handling the rapid mobility and varying vehicle densities. Extensive simulations using network simulator NS3 and traffic simulator SUMO are performed. It is shown that the sdnMAC protocol can better meet the requirements of cooperative safety in VANETs."}, "journals/wicomm/YangLYLY18": {"title": "Message Relaying and Collaboration Motivating for Mobile Crowdsensing Service: An Edge-Assisted Approach.", "url": "https://doi.org/10.1155/2018/1287969", "year": "2018", "author": {"Shu Yang 0003": "18/6739-3", "Jinglin Li": "45/10335", "Quan Yuan 0004": "29/5782-4", "Zhihan Liu": "62/2764", "Fangchun Yang": "06/5366"}, "abstract": ""}, "journals/jwsr/ZhangLLYY16": {"title": "Moving Objects Gathering Patterns Retrieving based on Spatio-Temporal Graph.", "url": "https://doi.org/10.4018/IJWSR.2016070105", "year": "2016", "author": {"Junming Zhang": "47/256", "Jinglin Li": "45/10335", "Zhihan Liu": "62/2764", "Quan Yuan 0004": "29/5782-4", "Fangchun Yang": "06/5366"}, "abstract": ""}}}