{"id": "148/1760", "name": "Shao-Zhang Niu", "Article": {"conf/icsai/ZhangZNH14": {"title": "User level secure deletion for USB flash disks.", "url": "https://doi.org/10.1109/ICSAI.2014.7009444", "year": "2014", "author": {"Peng Zhang": "21/1048", "Wen Zhang": "43/2368", "Shao-Zhang Niu": "148/1760", "Zhen-peng Huang": "229/1337"}, "abstract": " Abstract:In order to prevent the possible leakage of user's sensitive information, it is necessary to delete them securely before USB flash disks are exposed to an untrusted environment. But it is impossible for ordinary users to change functions in the hardware layer of USB flash disks. In order to perform a userlevel secure deletion for USB flash disks, we analyzed data remnant for both logical layer and physical layer after several logical overwriting are applied to a USB flash disk. According to the analysis, a novel approach, called USRM (USB flash disk Secure ReMove), is presented in this paper. First, USRM tries to create junk files quickly to reduce the size of free space. Second, USRM removes target files and related information. Finally, USRM overwrites free space at the logical layer in order to force controller to clean any possible data remnant at the physical layer. Experimental results show that USRM can delete target files, quickly and securely, while comparing with another two secure deleting tools."}, "conf/iih-msp/HuangCN14": {"title": "Regular Clipping Detection of Image Based on SIFT.", "url": "https://doi.org/10.1109/IIH-MSP.2014.165", "year": "2014", "author": {"Yan-Li Huang": "159/9962", "Hao Liang Cui": "179/8948", "Shao-Zhang Niu": "148/1760"}, "abstract": " Abstract:For the issues that the cropped level of image is detected and the cropped region of image is determined, a new scheme is proposed that is based on SIFT (Scale-invariant feature transform) for the regular clipping operation under the situation of existing original image. Features points of original and testing images are extracted by SIFT algorithm, and the matching are done between the corresponding features points. According to the relative position relations among matching points, the scaling of testing images corresponding to the original can be calculated, and further the cropped region can be determined. The experimental results show that the detection way works well for the regular clipping."}, "conf/iih-msp/LiNZ13": {"title": "Research on Image Detection Algorithm with Markov Process.", "url": "https://doi.org/10.1109/IIH-MSP.2013.68", "year": "2013", "author": {"Meng-Jiao Li": "118/5530", "Shao-Zhang Niu": "148/1760", "Jian-Cheng Zou": "148/1807"}, "abstract": " Abstract:A steganography detection algorithm on JPEG images-Markov detection is introduced. On the basics of Markov steganography detection algorithm, we detect many kinds of images, such as stego-images, spliced images and median filtered images and so on. The experiment results show that the improved Markov algorithm has higher detection accuracy rate for many kinds of images."}, "conf/iih-msp/WenNZ12": {"title": "A Key Management Mechanism for DHT Networks.", "url": "https://doi.org/10.1109/IIH-MSP.2012.88", "year": "2012", "author": {"Zhang Wen": "53/10035", "Shao-Zhang Niu": "148/1760", "Jian-Cheng Zou": "148/1807"}, "abstract": " Abstract:This paper proposes a key management mechanism by DH distributed key tree for the DHT network, which is based on the DHT network routing mechanism and network topology structure. The scheme uses the DH algorithm for key agreement, to ensure that the nodes in the DHT network are able to maintain a limited number of keys, and on this basis to complete encryption of routing messages across the network. The key management mechanism provides a secure shared key for the data encryption between the nodes in the DHT network, and maintains a high degree of consistency with the DHT network topology structure, and it has broad application prospects."}, "conf/ipps/TuNLYL12": {"title": "Fine-grained Access Control and Revocation for Sharing Data on Clouds.", "url": "https://doi.org/10.1109/IPDPSW.2012.265", "year": "2012", "author": {"Shan-Shan Tu": "227/4548", "Shao-Zhang Niu": "148/1760", "Hui Li": "66/3387", "Xiao-Ming Yun": "148/1844", "Meng-Jiao Li": "118/5530"}, "abstract": " Abstract:With the current rapid increase of cloud computing, enterprises outsource their sensitive data for sharing in a cloud. The key problems of this approach include establishing access control for the encrypted data, and revoking the access rights from users when they are no longer authorized to access the encrypted data on cloud servers. This paper aims to solve these problems. Firstly, based on the attribute encryption and the dual encryption system, we propose a concrete access control scheme constructed over the composite order bilinear groups, and we prove its security under the standard model. Then, we propose a fully fine-grained revocation scheme under the direct revocation model, so as to efficiently revoke access rights from users on cloud servers."}, "conf/iih-msp/MengNZ10": {"title": "Tamper Detection for Shifted Double JPEG Compression.", "url": "https://doi.org/10.1109/IIHMSP.2010.111", "year": "2010", "author": {"Xian-zhe Meng": "12/10136", "Shao-Zhang Niu": "148/1760", "Jian-Cheng Zou": "148/1807"}, "abstract": " Abstract:This paper presents a copy-paste block detection method based on characteristics of double JPEG compress. The JPEG compress will bring JPEG compression characteristics to the DCT coefficients, these characteristics are closely related with the quality factor. Copy-paste tamper between JPEG images will disrupt the JPEG compression characteristics of the final image. The method in this paper is designed to deal with double JPEG compression whose DCT blocks are different during the two compresses, and the experiment shows that our method can work effectively on double JPEG compression with different quality factors and is not subject to the impact of DCT blocks."}, "journals/concurrency/TuNL16": {"title": "A fine-grained access control and revocation scheme on clouds.", "url": "https://doi.org/10.1002/cpe.2956", "year": "2016", "author": {"Shan-Shan Tu": "227/4548", "Shao-Zhang Niu": "148/1760", "Hui Li": "66/3387"}, "abstract": ""}}}