{"id": "78/10624", "name": "Shujie Yang", "Article": {"conf/iwcmc/JiaXWFCY22": {"title": "Measuring Decentralization in Emerging Public Blockchains.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9825341", "year": "2022", "author": {"Yongpu Jia": "310/0305", "Changqiao Xu": "51/4906", "Zhonghui Wu": "279/4587", "Zichen Feng": "309/9987", "Yaxin Chen": "96/8538", "Shujie Yang": "78/10624"}, "abstract": " Abstract:Bitcoin and Ethereum have always been the two major heavyweight infrastructures in the blockchain space. However, Low throughput and high cost hinder their further development. Recently, some emerging public blockchains have become popular. They all have efficient transaction confirmation mechanism and cheap interaction costs. However, the advantages are actually a sacrifice of decentralization. As we all know, decentralization is an essential feature of blockchain. Therefore, it requires the conceiving of up-to-date metrics of decentralization measurement. However, there is little research on the degree of decentralization of these emerging public blockchains in the past. This paper studies nine popular public chains such as Binance Smart Chain, Cardano, and Avalanche. Since these public chains mostly use the consensus mechanism of POS variants, the distribution of governance token balances on the chain can reflect the decentralization of the blockchain. Hence, We evaluate the distribution of the token balance of those public blockchains to indicate their decentralization degree. Two kinds of indicators are adopted and redesigned: information entropy and Gini coefficients. Among the nine public blockchains we selected, Cardano, Tron and Polkadot have a higher degree of decentralization, while Elrond and Binance Smart Chain have a lower degree of decentralization. We think our work will be helpful for future research on the degree of blockchain decentralization."}, "conf/iwcmc/JiYZZLX22": {"title": "Multi-Domain Multicast Routing Mutation Scheme for Resisting DDoS attacks.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9824529", "year": "2022", "author": {"Weixiao Ji": "141/4730", "Shujie Yang": "78/10624", "Bingchi Zhang": "271/5375", "Tao Zhang": "15/4777", "Yibo Lian": "325/0332", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Network performance of multicast transmissions such as bandwidth, utilization and delay is very important to improve the quality of user experience and the above constraints have to be considered. Most of the current multicast protocol infrastructures use static routes, however, static routing policies provide potential convenience for attackers who can perform network sniffing or initiate DoS attacks. We propose a multi-constraint multicast routing mutation mechanism to enable dynamic changes in multicast routing while satisfying certain quality of service to achieve proactive multicast routing defense, which increases the attacker's attack cost and reduces the defender's defense overhead. In addition, for the high time complexity of the multicast tree generation algorithm, we propose a multi-controller multicast routing algorithm with multi-domains. We perform simulations and show that the defense performance of multicast routing is significantly improved after adopting this mechanism."}, "conf/iwcmc/WangWZYX22": {"title": "CMT-MQ: Multi-QoS Aware Adaptive Concurrent Multipath Transfer With Reinforcement Learning.", "url": "https://doi.org/10.1109/IWCMC55113.2022.9824120", "year": "2022", "author": {"Deguang Wang": "59/10364", "Mingze Wang": "296/7556", "Tao Zhang": "15/4777", "Shujie Yang": "78/10624", "Changqiao Xu": "51/4906"}, "abstract": " Abstract:Concurrent multipath transfer(CMT) can make better use of network resources to increase the data transmission rate. However, there are heterogeneous paths in the real network, the existing scheduling strategy is fixed and does not have self-adaptation, there are still some problems with delay and throughput performance, which reduces the reliability of transmission. Therefore, we propose a novel CMT scheduling strategy based on multi-QoS (CMT-MQ). Combined with reinforcement learning (RL), scheduling strategies are generated according to service QoS requirements and path characteristics. At the same time, in order to reduce the action space of RL and eliminate poor paths, clustering algorithm is introduced to filter the set of paths before training. Finally, the simulation comparison experiment on OmNET++ shows that CMT-MQ has higher throughput and lower message delay."}, "conf/globecom/XiaoXMYZM21": {"title": "Edge Computing-Assisted Multimedia Service Energy Optimization based on Deep Reinforcement Learning.", "url": "https://doi.org/10.1109/GLOBECOM46510.2021.9685687", "year": "2021", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Yunxiao Ma": "46/1709", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:With the development of communication technology, emerging multimedia (e.g. virtual reality) can provide users with more immersive service experience. However, due to the ultra-high rendering and splicing requirements of multimedia content, the higher demand for computing resources is put forward for the playback device. The anomalies of energy consumption and latency caused by such computationally intensive tasks hinder the practical application of emerging multimedia technology in mobile networks. In this regard, this paper proposes an edge computing assisted multimedia service optimization scheme (ECMSO) to broaden the computing capacity of the viewer(i.e. requester), so as to ensure that content can be served in time and reduce the energy cost of computation from the perspective of executor and requester, respectively. First, a computational offloading scheme based on deep reinforcement learning is designed. It optimizes intelligently the energy consumption while meeting the latency requirements of the requester. Secondly, a heuristic algorithm to allocate power, bandwidth, and computing resources for candidate executors is proposed. Finally, a series of simulation experiments are conducted to demonstrate the effectiveness of our proposed scheme."}, "conf/infocom/ChenXWWYZM21": {"title": "A Universal Transcoding and Transmission Method for Livecast with Networked Multi-Agent Reinforcement Learning.", "url": "https://doi.org/10.1109/INFOCOM42981.2021.9488868", "year": "2021", "author": {"Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906", "Mu Wang": "94/4375", "Zhonghui Wu": "279/4587", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Intensive video transcoding and data transmission are the most crucial tasks for large-scale Crowd-sourced Livecast Services (CLS). However, there exists no versatile model for joint optimization of computing resources (e.g., CPU) and transmission resources (e.g., bandwidth) in CLS systems, making maintaining the balance between saving resources and improving user viewing experience very challenging. In this paper, we first propose a novel universal model, called Augmented Graph Model (AGM), which converts the above joint optimization into a multi-hop routing problem. This model provides a new perspective for the analysis of resource allocation in CLS, as well as opens new avenues for problem-solving. Further, we design a decentralized Networked Multi-Agent Reinforcement Learning (MARL) approach and propose an actor-critic algorithm, allowing network nodes (agents) to distributively solve the multi-hop routing problem using AGM in a fully cooperative manner. By leveraging the computing resource of massive nodes efficiently, this approach has good scalability and can be employed in large-scale CLS. To the best of our knowledge, this work is the first attempt to apply networked MARL on CLS. Finally, we use the centralized (single-agent) RL algorithm as a benchmark to evaluate the numerical performance of our solution in a large-scale simulation. Additionally, experimental results based on a prototype system show that our solution is superior in saving resources and service performance to two alternative state-of-the-art solutions."}, "conf/nana/DingYLMFW21": {"title": "CD-SR: A Real-time Anomaly Detection Framework for Continuous Concept Drift.", "url": "https://doi.org/10.1109/NaNA53684.2021.00040", "year": "2021", "author": {"Zhongyi Ding": "309/9697", "Shujie Yang": "78/10624", "Zhaoyang Liu": "120/5899", "Tengchao Ma": "245/4704", "Zichen Feng": "309/9987", "Ming-Ze Wang": "251/4117"}, "abstract": " Abstract:System administrators need to monitor various metrics (network traffic, NTP offset, etc.) of their internal services in real-time as a way to determine whether anomalies occur in the system. Traditional Spectral Residual (SR) anomaly detection methods do not take into account the interference of certain human factors (e.g., changes in personal preferences) in certain scenarios, i.e., concept drift. In these scenarios, the accuracy of anomaly detection is bound to be affected. In order to guarantee the availability and stability of network services, we propose an intelligent and pervasive anomaly detection strategy, CD-SR. First, we use the traditional SR model and the SVM method to train the time series that have not drifted to determine the threshold value. Then, to solve the problem of the pervasiveness of application scenarios, we use a drift detection model to find the time series where concept drift occurs. Finally, the sequence where the concept drift occurs is imported into the drift adaptation model to complete the replacement of the old and new concepts, the data is processed in real-time, and the replaced data is detected again in the detection model for anomalies. In the experimental stage, we obtained several data metrics using the cloud platform system built by Openstack, and by comparing several mainstream anomaly detection algorithms, our method obtained superior results."}, "conf/iwcmc/ZhangXZKWYM20": {"title": "DQ-RM: Deep Reinforcement Learning-based Route Mutation Scheme for Multimedia Services.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148371", "year": "2020", "author": {"Tao Zhang 0063": "15/4777-63", "Changqiao Xu": "51/4906", "Bingchi Zhang": "271/5375", "Xiaohui Kuang": "18/1267", "Yue Wang": "33/4822", "Shujie Yang": "78/10624", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Increasingly growing various multimedia services (e.g., interactive live video and so on) have brought tremendous pressure on existing static defense techniques. To cope with inherent drawback of static defense techniques, Network Moving Target Defense (NMTD) such as route mutation (RM) was proposed. What's more, applying reinforcement learning (RL) into RM has been proved feasible in our previous work. But two main problems still need to be considered in this combination of RL with RM: 1) It lacks the consideration of multiple flows situation. 2) With the state-action space grow larger, current solution can't handle efficiently. In this paper, we propose a deep Q-learning method for RM (DQ-RM) to solve above two problems. Firstly, benefited from the satisfiability module theory, we formalize RM space considering single flow and multiple flows concurrently. Then we further propose a deep reinforcement learning-based RM scheme based on our previous work, which is suitable for large-scale state-action space. Finally, extensive experimental results highlight the improvement of DQ-RM in defense performance and convergence speed compared to the representative solution."}, "conf/iwcmc/WangXZYS20": {"title": "A Survey of Blockchain-based Cybersecurity for Vehicular Networks.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148566", "year": "2020", "author": {"Xifeng Wang": "80/10587", "Changqiao Xu": "51/4906", "Zan Zhou 0001": "203/3329", "Shujie Yang": "78/10624", "Limin Sun": "37/4705"}, "abstract": " Abstract:The development of vehicular networks has greatly improved the efficiency and safety of intelligent traffic systems. However, it also introduces additional security threats into the system. The special characteristics of vehicular networks, such as dynamic topology, huge network scale and so on, make it difficult to adopt the traditional security solutions directly into this scenario. In addition, the single point failure problem of the centralized security mechanisms is also a big challenge. Recently, blockchain technology, which is a distributed database, is a potential approach to address these security issues. In this paper, a comprehensive review of the existing blockchain-based cybersecurity mechanisms is presented with the corresponding performance analysis. The purpose of this work is to provide a guideline for the further study in the application of blockchain in the vehicular network security area."}, "conf/nana/WuCXY20": {"title": "Nesterov Accelerated Gradient-based Algorithm for the Allocation Problem of NFV Service.", "url": "https://doi.org/10.1109/NaNA51271.2020.00044", "year": "2020", "author": {"Zhonghui Wu": "279/4587", "Xingyan Chen": "211/5842", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624"}, "abstract": " Abstract:Network Functions Virtualization, as well as Software Defined Networking, is a crucial technology to distributed cloud network, providing support for network services allocations with elastic Virtual Network Functions instantiated in a flexible way at distributed cloud locations. In this paper, an O (E) approximation optimal solution with time complexity O([1/(E)]) to NFV Service Allocation Problem is proposed. Enlightened by the Nesterov Accelerated Gradient-based method, we use the cloud augmented graph model and redefine the service chain model to deal with the flow requirement, processes and transmission of cloud network. We formulate the VNFs services place problem as a non-smooth concave problem with integer programming form. Then, we translate the integer form into the linear program by linear relaxation of the problem. We further propose a Distributed Nesterov Accelerated Gradient-based algorithm which enables network nodes to obtain the optimal scheme by only requiring weight information from one-hop neighbors. Besides, we give three main theoretical results of our algorithm, which are queue-length reduction performance, utility optimal and convergence rate. Finally, multiple simulations are conducted to show the dominance of the proposed algorithm against the state-of-art solution."}, "conf/dsc/SongXYZG19": {"title": "A Black-Box Approach to Generate Adversarial Examples Against Deep Neural Networks for High Dimensional Input.", "url": "https://doi.org/10.1109/DSC.2019.00078", "year": "2019", "author": {"Chengru Song": "144/1365", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Zan Zhou 0001": "203/3329", "Changhui Gong": "247/9178"}, "abstract": ""}, "conf/hpsr/GongXZZY19": {"title": "A Reputation Management Scheme for Identifying Malicious Nodes in VANET.", "url": "https://doi.org/10.1109/HPSR.2019.8808102", "year": "2019", "author": {"Changhui Gong": "247/9178", "Changqiao Xu": "51/4906", "Zan Zhou 0001": "203/3329", "Tao Zhang 0063": "15/4777-63", "Shujie Yang": "78/10624"}, "abstract": ""}, "conf/iwcmc/XiaoXCYZM19": {"title": "Energy Efficient for Scalable Video Caching Service over Device-to-Device Communication.", "url": "https://doi.org/10.1109/IWCMC.2019.8766708", "year": "2019", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Tengfei Cao": "224/0908", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": ""}, "conf/nana/PiHYLX19": {"title": "RBDR: A Distributed Routing Algorithm in High Mobility UAV Network.", "url": "https://doi.org/10.1109/NaNA.2019.00017", "year": "2019", "author": {"Wenchao Pi": "260/7683", "Hao Hao": "96/10637", "Shujie Yang": "78/10624", "Yong Liao": "69/2622", "Changqiao Xu": "51/4906"}, "abstract": ""}, "conf/nana/XiaoCYZLX19": {"title": "Service Stochastic Optimization with Energy Constraint Over UAV-Assisted Network.", "url": "https://doi.org/10.1109/NaNA.2019.00022", "year": "2019", "author": {"Han Xiao": "98/627", "Tengfei Cao": "224/0908", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Yong Liao": "69/2622", "Changqiao Xu": "51/4906"}, "abstract": ""}, "conf/wcnc/GaoXQYZM19": {"title": "QoS-driven Path Selection for MPTCP: A Scalable SDN-assisted Approach.", "url": "https://doi.org/10.1109/WCNC.2019.8885585", "year": "2019", "author": {"Kai Gao": "12/4000", "Changqiao Xu": "51/4906", "Jiuren Qin": "203/3456", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": ""}, "conf/nana/YangXGZ18": {"title": "Event-based Diffusion Kalman Filter Strategy for Clock Synchronization in WSNs.", "url": "https://doi.org/10.1109/NANA.2018.8648770", "year": "2018", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Tao Zhang 0063": "15/4777-63"}, "abstract": ""}, "conf/nana/HaoXYGLZ17": {"title": "BF-PDT: A New Name Lookup Mechanism in Content-Centric Networking.", "url": "https://doi.org/10.1109/NaNA.2017.11", "year": "2017", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Lujie Zhong": "124/8701"}, "abstract": ""}, "conf/wcnc/YangXG17": {"title": "Diffusion Kalman Filter Algorithm for Adaptive Network with Quantized Information Exchange.", "url": "https://doi.org/10.1109/WCNC.2017.7925563", "year": "2017", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455"}, "abstract": " Abstract:We study the distributed Kalman filter in sensor networks where multiple sensors collaborate to achieve a common objective. Diffusion Kalman filtering algorithms have been a popular topic in linear dynamic system estimation problems, In there algorithms, nodes cooperate with their direct neighbors and diffuse the information across the entire network through a sequence of Kalman iterations and data-aggregation. In this article, we propose the diffusion Kalman filtering with quantized global (DKFQFI)algorithm because of the limited sources in the wireless environment, where nodes exchange their quantized states with neighbors to reduce the consumption of resources. To prove the convergence of the DKFQFI algorithm, we derive the theoretical expressions of the mean and mean-square performance. From the expressions, we show that the mean performance and mean-square performance of the proposed algorithm are unbiased and stable. Therefore, the feasibility of the algorithm is verified. Moreover, the proposed algorithm achieves an outperform by simulation."}, "conf/icc/ZhuXGY16": {"title": "Finding top-k similar users based on Trajectory-Pattern model for personalized service recommendation.", "url": "https://doi.org/10.1109/ICCW.2016.7503845", "year": "2016", "author": {"Liang Zhu": "85/20", "Changqiao Xu": "51/4906", "Jianfeng Guan": "47/6455", "Shujie Yang": "78/10624"}, "abstract": " Abstract:Service recommendation for Location-based Social Networks (LBSNs) has been received much attention mainly in the field of large-scale Wireless Communication Networks. It is a promising solution to guarantee service reliability and improve quality of experience (QoE) of users. Many schemes have been proposed to provide the reliable and personalized services for users, such as collaborative filtering (CF), content-based recommendation(CBR), and context-aware recommendation, etc. However, the activity sequence and type popularity is lacked in above researches, which leads to the recommendation accuracy and service experience decline. In this paper, we propose TopSim-TP, a novel trajectory-pattern-based similar users discovery method aiming to effectively mine the life cycle and preference of users. First, we describe the mobile behavior of users by mapping location information into type information. Then, we model the trajectory-pattern for each user. Finally, we present a Common Trajectory-Pattern (CTP) extraction algorithm and compute the similarity of sequences to find the top-k similar users for current user. The experimental results show that our method outperforms the existing method."}, "conf/cyberc/YangMC15": {"title": "A 4-Dimensional Discrete Chaotic System and Application in Image Encryption with Avalanche Effects.", "url": "https://doi.org/10.1109/CyberC.2015.70", "year": "2015", "author": {"Shujie Yang": "78/10624", "Lequan Min": "49/5736", "E. Chen": "70/2005"}, "abstract": " Abstract:This paper introduces a 4-dimensional chaotic map, consisting of sine, and cosine functions. Using this map and a generalized synchronization (GCS) theorem designs an 8-dimensional GCS system. The GCS system is used to design a chaotic pseudorandom number generator (CPRNG). Using the FIPS 140-2 test suit/generalized FIPS 140-2 test suit tests the randomness of three 1000-key streams consisting of 20000bits generated by the CPRNG, the RC4 algorithm and the ZUC algorithm, respectively. The results show that there are100%/98.9%, 99.9%/98.8%, 100%/97.9% key streams passing the tests, respectively. The analysis of the keys sensitivity suggests that there are no significant correlations between the key stream and the perturbed key streams. The key space of the CPRNGis larger than 2 1195. The CPGNG with an avalanche effect encryption scheme is used to encrypt an RGB image. The numerical calculations demonstrate that the CPRNG can generate the avalanche effects which are similar to those generated by ideal CPRNGs."}, "journals/ett/YangHJXW22": {"title": "Hybrid-360: An adaptive bitrate algorithm for tile-based 360 video streaming.", "url": "https://doi.org/10.1002/ett.4430", "year": "2022", "author": {"Shujie Yang": "78/10624", "Jialu Hu": "57/7618", "Ke Jiang": "55/6803", "Han Xiao": "98/627", "Mu Wang": "94/4375"}, "abstract": ""}, "journals/ett/ZhangZYM22": {"title": "Distributed data backup and recovery for software-defined wide area network controllers.", "url": "https://doi.org/10.1002/ett.4411", "year": "2022", "author": {"Yi Zhang": "64/6544", "Lujie Zhong": "124/8701", "Shujie Yang": "78/10624", "Gabriel-Miro Muntean": "81/2584"}, "abstract": ""}, "journals/ett/CaoZXSYX22": {"title": "Credible and economic multimedia service optimization based on game theoretic in hybrid cloud networks.", "url": "https://doi.org/10.1002/ett.3779", "year": "2022", "author": {"Tengfei Cao": "224/0908", "Lujie Zhong": "124/8701", "Han Xiao": "98/627", "Chengru Song": "144/1365", "Shujie Yang": "78/10624", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/ijis/MaXYHKTG22": {"title": "An intelligent proactive defense against the client-side DNS cache poisoning attack via self-checking deep reinforcement learning.", "url": "https://doi.org/10.1002/int.22934", "year": "2022", "author": {"Tengchao Ma": "245/4704", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Yiting Huang": "319/7758", "Xiaohui Kuang": "18/1267", "Hong Tang": "00/2111", "Luigi Alfredo Grieco": "23/4819"}, "abstract": ""}, "journals/jise/QinGZY22": {"title": "Q-Learning based and Energy-Aware Multipath Congestion Control in Mobile Wireless Network.", "url": "https://jise.iis.sinica.edu.tw/JISESearch/pages/View/PaperView.jsf?keyId=184_2472", "year": "2022", "author": {"Jiuren Qin": "203/3456", "Kai Gao": "12/4000", "Lujie Zhong": "124/8701", "Shujie Yang": "78/10624"}, "abstract": ""}, "journals/jsac/XiaoXFDYZLM22": {"title": "A Transcoding-Enabled 360° VR Video Caching and Delivery Framework for Edge-Enhanced Next-Generation Wireless Networks.", "url": "https://doi.org/10.1109/JSAC.2022.3145813", "year": "2022", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Zichen Feng": "309/9987", "Renjie Ding": "91/1057", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Jie Liang": "51/239", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Virtual reality (VR) content, including 360° panoramic video, provides users with an immersive multimedia experience and therefore attracts increasing research and development attention. However, the requirement of high bandwidth and low latency of virtual reality service demand puts forward greater challenges to the current infrastructure, especially mobile networks. Inspired by the sharable nature of virtual reality content tiles, we further considered the potential opportunities for computing, caching, and multicast to address the challenges of transmission of panoramic content. This paper proposes a novel transcoding-enabled VR video caching and delivery framework for edge-enhanced next-generation wireless networks. Firstly, an edge cooperative caching scheme based on multi-agent reinforcement learning is introduced to improve the utilization efficiency of computing and storage resources, and then reduce service delay. Second, a two-tier NOMA-based base station-multicast group matching mechanism is designed to solve the collaboration challenge during the edge delivery process. A series of experiments have demonstrated the advantages of the proposed scheme in terms of cache hit rate, latency and other aspects in comparison with alternative approaches."}, "journals/sensors/GuRTWSY22": {"title": "Unmanned Surface Vehicle Collision Avoidance Path Planning in Restricted Waters Using Multi-Objective Optimisation Complying with COLREGs.", "url": "https://doi.org/10.3390/s22155796", "year": "2022", "author": {"Yang Gu": "01/5858", "Zhenwei Rong": "327/5355", "Huzhou Tong": "327/5543", "Jia Wang": "58/6299", "Yulin Si": "03/8026", "Shujie Yang": "78/10624"}, "abstract": ""}, "journals/twc/XiaoXMYZM22": {"title": "Edge Intelligence: A Computational Task Offloading Scheme for Dependent IoT Application.", "url": "https://doi.org/10.1109/TWC.2022.3156905", "year": "2022", "author": {"Han Xiao": "98/627", "Changqiao Xu": "51/4906", "Yunxiao Ma": "46/1709", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Computational offloading, as an effective way to extend the capability of resource-limited edge devices in Internet of Things (IoT), is considered as a promising emerging paradigm for coping with delay-sensitive services. However, on one hand, applications commonly include several subtasks with dependent relations and on the other hand, the dynamic changes in network environments make offloading decision-making become a coupling and complex NP-hard problem, difficult to address. This paper proposes an intelligent Computational Offloading scheme for Dependent IoT Application (\nCODIA\n), which decouples the performance enhancement problem into two processes: scheduling and offloading. First, a prioritized scheduling strategy is designed and its complexity is analyzed. Then, an offloading algorithm with offline training and online deployment is introduced. Due to the temporal continuity between subtasks, the dependency relation is transformed into a transition of device state, and the overhead for the whole application is considered to be the long-term benefit. \nCODIA\n leverages an Actor-Critic-based solution, where the IoT devices are able to deploy intelligent models and dynamically adjust the offloading strategy to achieve low latency, while controlling energy consumption. Finally, a series of experiments are conducted to verify the robustness and efficiency of the proposed solution in terms of convergence, latency, and energy consumption."}, "journals/corr/abs-2206-04564": {"title": "TwiBot-22: Towards Graph-Based Twitter Bot Detection.", "url": "https://doi.org/10.48550/arXiv.2206.04564", "year": "2022", "author": {"Shangbin Feng": "295/9571", "Zhaoxuan Tan": "301/7706", "Herun Wan": "295/9587", "Ningnan Wang": "295/9628", "Zilong Chen": "87/8238", "Binchi Zhang": "304/7647", "Qinghua Zheng": "32/1858", "Wenqian Zhang": "137/6026", "Zhenyu Lei": "229/5143", "Shujie Yang": "78/10624", "Xinshun Feng": "322/2350", "Qingyue Zhang": "42/8773", "Hongrui Wang": "05/2831", "Yuhan Liu": "125/8141", "Yuyang Bai": "261/0192", "Heng Wang": "61/5618", "Zijian Cai": "313/5163", "Yanbo Wang": "80/6085", "Lijing Zheng": "239/3098", "Zihan Ma": "322/1997", "Jundong Li": "144/7997", "Minnan Luo": "99/10051"}, "abstract": "\n      Abstract:  Twitter bot detection has become an increasingly important task to combat\nmisinformation, facilitate social media moderation, and preserve the integrity\nof the online discourse. State-of-the-art bot detection methods generally\nleverage the graph structure of the Twitter network, and they exhibit promising\nperformance when confronting novel Twitter bots that traditional methods fail\nto detect. However, very few of the existing Twitter bot detection datasets are\ngraph-based, and even these few graph-based datasets suffer from limited\ndataset scale, incomplete graph structure, as well as low annotation quality.\nIn fact, the lack of a large-scale graph-based Twitter bot detection benchmark\nthat addresses these issues has seriously hindered the development and\nevaluation of novel graph-based bot detection approaches. In this paper, we\npropose TwiBot-22, a comprehensive graph-based Twitter bot detection benchmark\nthat presents the largest dataset to date, provides diversified entities and\nrelations on the Twitter network, and has considerably better annotation\nquality than existing datasets. In addition, we re-implement 35 representative\nTwitter bot detection baselines and evaluate them on 9 datasets, including\nTwiBot-22, to promote a fair comparison of model performance and a holistic\nunderstanding of research progress. To facilitate further research, we\nconsolidate all implemented codes and datasets into the TwiBot-22 evaluation\nframework, where researchers could consistently evaluate new models and\ndatasets. The TwiBot-22 Twitter bot detection benchmark and evaluation\nframework are publicly available at this https URL\n\n    "}, "journals/corr/abs-2208-08200": {"title": "AHEAD: A Triple Attention Based Heterogeneous Graph Anomaly Detection Approach.", "url": "https://doi.org/10.48550/arXiv.2208.08200", "year": "2022", "author": {"Shujie Yang": "78/10624", "Binchi Zhang": "304/7647", "Shangbin Feng": "295/9571", "Zhaoxuan Tan": "301/7706", "Qinghua Zheng": "32/1858", "Jun Zhou": "99/3847", "Minnan Luo": "99/10051"}, "abstract": "\n      Abstract:  Graph anomaly detection on attributed networks has become a prevalent\nresearch topic due to its broad applications in many influential domains. In\nreal-world scenarios, nodes and edges in attributed networks usually display\ndistinct heterogeneity, i.e. attributes of different types of nodes show great\nvariety, different types of relations represent diverse meanings. Anomalies\nusually perform differently from the majority in various perspectives of\nheterogeneity in these networks. However, existing graph anomaly detection\napproaches do not leverage heterogeneity in attributed networks, which is\nhighly related to anomaly detection. In light of this problem, we propose\nAHEAD: a heterogeneity-aware unsupervised graph anomaly detection approach\nbased on the encoder-decoder framework. Specifically, for the encoder, we\ndesign three levels of attention, i.e. attribute level, node type level, and\nedge level attentions to capture the heterogeneity of network structure, node\nproperties and information of a single node, respectively. In the decoder, we\nexploit structure, attribute, and node type reconstruction terms to obtain an\nanomaly score for each node. Extensive experiments show the superiority of\nAHEAD on several real-world heterogeneous information networks compared with\nthe state-of-arts in the unsupervised setting. Further experiments verify the\neffectiveness and robustness of our triple attention, model backbone, and\ndecoder in general.\n\n    "}, "journals/jaciii/WangZLY21": {"title": "Uncertain Nonlinear Process Monitoring Using Interval Ensemble Kernel Principal Component Analysis.", "url": "https://doi.org/10.20965/jaciii.2021.p0101", "year": "2021", "author": {"Xianrui Wang": "275/7859", "Guo-Xin Zhao": "150/7047", "Yu Liu": "97/2274", "Shujie Yang": "78/10624"}, "abstract": ""}, "journals/jnca/HaoXYZM21": {"title": "Multicast-aware optimization for resource allocation with edge computing and caching.", "url": "https://doi.org/10.1016/j.jnca.2021.103195", "year": "2021", "author": {"Hao Hao": "96/10637", "Changqiao Xu": "51/4906", "Shujie Yang": "78/10624", "Lujie Zhong": "124/8701", "Gabriel-Miro Muntean": "81/2584"}, "abstract": "Mobile edge computing (MEC) is rising as a key technology for computation-intensive and delay-sensitive applications. Many works have focused on MEC, but most of them only consider unicast scenarios, and ignore multicast issues. The reason is that MEC aiming at personalized computing of users conflicts with multicast which demands the same data stream. This makes MEC and multicast seem inconsistent. However, in fact, there will be lots of services, whose computation process is different but the result may be same (e.g. media push), which can greatly benefit from multicast over MEC and make the combination of multicast and MEC meaningful. In this paper, we first consider challenges and propose multicast-aware resource allocation for MEC, which jointly optimizes computing and caching in multicast scenarios. We formulate the problem by considering user request, network communication, service caching and service computing. But this model is knotty because it is an optimization problem with mixed discrete and continuous variables. Besides its optimization objective is the average value over a long time. Considering the complexity, we first transform the problem into an online optimization, which jointly minimizes the average time delay and energy consumption, by stochastic optimization. Then we separate the discrete variables and continuous variable, and decompose the problem into two subproblems. By solving subproblems, an efficient online algorithm called MA-ECC is proposed. Finally, we compare it with other three baseline methods, and result shows that MA-ECC can effectively reduce service latency while still keeping energy consumption low."}, "journals/tbc/ZhongXCYYM21": {"title": "Joint Optimal Multicast Scheduling and Caching for Improved Performance and Energy Saving in Wireless Heterogeneous Networks.", "url": "https://doi.org/10.1109/TBC.2020.3028354", "year": "2021", "author": {"Lujie Zhong": "124/8701", "Changqiao Xu": "51/4906", "Jiewei Chen": "261/2815", "Weiqi Yan": "287/2866", "Shujie Yang": "78/10624", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Base station caching and multicast are two promising methods to support mass content delivery in future wireless network environments. However, existing scheduling designs do not take full advantage of the two methods. This article focuses on employing multicast scheduling and caching in a network architecture which involves both macro cell base stations (MBS) and small cell base stations (SBS) in order to achieve joint optimization of average delay and power consumption. We describe this co-optimization problem as the Multicast-Aware Caching Scheduling Problem (MACSP). This article proposes a novel pending request queue model, which aims to solve the problem of long waiting time for non-popular content, and transform this collaborative multicast-cache scheduling problem into a Markov Decision Process that can be solved using reinforcement learning methods. For actual deployment, the paper further introduces a Distributed Policy Gradient algorithm (DPG) with similar performance and lower complexity. The simulation-based testing results demonstrate that our model and algorithm have better performance and lower energy consumption than existing state-of-the-art approaches."}, "journals/jise/ZhongYC20": {"title": "QoS Aware Multi-Convergence Node Coordination Mechanism Based on Cellular Automata in Vehicular Sensor Networks.", "url": "https://jise.iis.sinica.edu.tw/JISESearch/pages/View/PaperView.jsf?keyId=175_2334", "year": "2020", "author": {"Lujie Zhong": "124/8701", "Shujie Yang": "78/10624", "Jiewei Chen": "261/2815"}, "abstract": ""}, "journals/tbc/YangXZSM20": {"title": "A QoE-Driven Multicast Strategy With Segment Routing - A Novel Multimedia Traffic Engineering Paradigm.", "url": "https://doi.org/10.1109/TBC.2019.2932338", "year": "2020", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Lujie Zhong": "124/8701", "Jiahao Shen": "249/6524", "Gabriel-Miro Muntean": "81/2584"}, "abstract": " Abstract:Quality of Experience (QoE) reflects end users' overall experience and feeling with network services, but needs support in terms of end-to-end Quality of Service (QoS). Segment routing (SR) as a new routing paradigm can provide good end-to-end QoS guarantee, making traditional multimedia traffic routing more efficient and scalable. In this paper, we address two problems related to the new SR mechanism: enabling fine-grained end-to-end QoS routing under a complex network environment and constructing the multicast routing tree with branch node load balancing. To solve these problems, an Inaccurate information-based QoE-driven Routing algorithm (IQdR) and a Branch-aware Multicast Tree (BaMT) algorithm were proposed. Simulation test results that have compared the performance of our proposed solution against that of other algorithms show that the previous works were outperformed. Additionally, the results also show that our multicast architecture improves the scalability of the network in terms of the number of flows."}, "journals/wicomm/LiQZCYZ20": {"title": "An Intelligent Adaptive Algorithm for Servers Balancing and Tasks Scheduling over Mobile Fog Computing Networks.", "url": "https://doi.org/10.1155/2020/8863865", "year": "2020", "author": {"Xuejing Li": "40/10215", "Yajuan Qin": "61/2725", "Huachun Zhou": "95/796", "Du Chen": "87/6150", "Shujie Yang": "78/10624", "Zhewei Zhang": "125/0867"}, "abstract": ""}, "journals/iotj/YangXQW19": {"title": "Diffusion Kalman Filter With Quantized Information Exchange in Distributed Mobile Crowdsensing.", "url": "https://doi.org/10.1109/JIOT.2018.2881542", "year": "2019", "author": {"Shujie Yang": "78/10624", "Changqiao Xu": "51/4906", "Xuesong Qiu 0001": "13/342", "Dapeng Oliver Wu": "88/1600"}, "abstract": " Abstract:With the explosion of smart devices and the gradual maturation of mobile systems, mobile crowdsensing (MCS) is playing more and more important roles in our daily life. In traditional MCS with a centralized framework, participants directly send perceived information to the task provider alone. This framework greatly increases the burden of cloud-based servers and cannot make full use of the increasing computation and storage capabilities of Internet of Things devices. To offload the computing and storage burden from traditional MCS architecture, a distributed MCS architecture was proposed in this paper, in which participants exchange sensing information with each other rather than forward it to central servers to complete a task together. Then, a diffusion Kalman filtering algorithm with quantized information exchange (QDKF) was proposed to solve the dynamic real-time estimate problem and limited communication resources in distributed MCS, where nodes exchange their quantized observations with neighbors to reduce the consumption of computing and storage resources. To prove the convergence and stability of the QDKF algorithm, an in-depth analysis of the algorithm uncertainty was reported to completely characterize the proposed solution. Moreover, the proposed algorithm achieves a superior performance by simulation."}, "journals/ett/YangQXGLX18": {"title": "GDSoC: Green dynamic self-optimizing content caching in ICN-based 5G network.", "url": "https://doi.org/10.1002/ett.3221", "year": "2018", "author": {"Shujie Yang": "78/10624", "Xuesong Qiu 0001": "13/342", "Haiyong Xie 0001": "30/6562", "Jianfeng Guan": "47/6455", "Yang Liu 0038": "51/3710-38", "Changqiao Xu": "51/4906"}, "abstract": ""}, "journals/jise/YangXLJZ18": {"title": "SKCFS: Stochastic Optimal Forwarding Strategy for Knowledge Centric Network.", "url": "https://jise.iis.sinica.edu.tw/JISESearch/pages/View/PaperView.jsf?keyId=163_2161", "year": "2018", "author": {"Shujie Yang": "78/10624", "Haiyong Xie 0001": "30/6562", "Yifeng Liu": "44/4345", "Zhongbai Jiang": "166/6020", "Lujie Zhong": "124/8701"}, "abstract": ""}, "journals/iet-spr/LiSYYW16": {"title": "In-flight initial alignment scheme for radar-aided SINS in the arctic.", "url": "https://doi.org/10.1049/iet-spr.2015.0497", "year": "2016", "author": {"Jing Li": "181/2820", "Ningfang Song": "178/6869", "Gongliu Yang": "157/3819", "Shujie Yang": "78/10624", "Jing Wang": "02/736"}, "abstract": ""}, "journals/mis/YangHGXW16": {"title": "Diffusion Strategies for Distributed Kalman Filter with Dynamic Topologies in Virtualized Sensor Networks.", "url": "https://doi.org/10.1155/2016/8695102", "year": "2016", "author": {"Shujie Yang": "78/10624", "Tao Huang 0005": "34/808-5", "Jianfeng Guan": "47/6455", "Yongping Xiong": "61/8573", "Mu Wang": "94/4375"}, "abstract": ""}, "journals/amc/YangSZ12": {"title": "Complete controllability of nonlinear stochastic impulsive functional systems.", "url": "https://doi.org/10.1016/j.amc.2011.11.043", "year": "2012", "author": {"Shujie Yang": "78/10624", "Bao Shi": "70/3967", "Qiang Zhang": "72/3527"}, "abstract": "This paper is concerned with the controllability of a kind of nonlinear stochastic impulsive functional systems. Sufficient conditions for the complete controllability of the nonlinear stochastic impulsive functional systems are obtained by using Schauder fixed-point theorem. A numerical example is given to illustrate the effectiveness of the theoretical results."}, "journals/bmcsb/HsiehYREW10": {"title": "Spatio-temporal modeling of signaling protein recruitment to EGFR.", "url": "https://doi.org/10.1186/1752-0509-4-57", "year": "2010", "author": {"Ming-yu Hsieh": "07/9461", "Shujie Yang": "78/10624", "Mary Raymond-Stinz": "140/6028", "Jeremy S. Edwards": "29/4056", "Bridget S. Wilson": "121/1162"}, "abstract": ""}}}