{"id": "29/7673", "name": "Songwei Pei", "Article": {"conf/date/JinPW20": {"title": "On Improving Fault Tolerance of Memristor Crossbar Based Neural Network Designs by Target Sparsifying.", "url": "https://doi.org/10.23919/DATE48585.2020.9116187", "year": "2020", "author": {"Song Jin": "15/7691", "Songwei Pei": "29/7673", "Yu Wang": "02/5889"}, "abstract": " Abstract:Memristor based crossbar (MBC) can execute neural network computations in an extremely energy efficient manner. However, stuck-at faults make memristors cannot represent network weight correctly, thus degrading classification accuracy of the network deployed on the MBC significantly. By carefully analyzing all the possible fault combinations in a pair of differential crossbars, we found that most of the stuck-at faults can be accommodated perfectly by mapping a zero value weight onto the memristors. Based on such observation, in this paper we propose a target sparsifying based fault tolerant scheme for the MBC which executes neural network applications. We first exploit a heuristic algorithm to map weight matrix onto the MBC, aiming at minimizing weight variations in the presence of stuck-at faults. After that, some weights mapped onto the faulty memristors which still have large variations will be purposefully forced to zero value. Network retraining is then performed to recover classification accuracy. For a 4-layer CNN designed for MNIST digit recognition, experimental results demonstrate that our scheme can achieve almost no accuracy loss when 10% of memristors in the MBC are faulty. As the faulty memristors increasing to 20%, accuracy loss is only within 3%."}, "conf/ats/PeiRJ17": {"title": "On-Chip Ring Oscillator Based Scheme for TSV Delay Measurement.", "url": "https://doi.org/10.1109/ATS.2017.15", "year": "2017", "author": {"Songwei Pei": "29/7673", "Alrashdi Ahmed Rabehb": "213/5121", "Song Jin": "15/7691"}, "abstract": " Abstract:Due to the complexity of fabrication and bonding processes, TSVs are susceptible to delay defects and have become a serious concern in 3D ICs. To assure the quality and yield of 3D ICs, it is imperative to conduct effective delay testing for TSVs. In this paper, we present a novel on-chip ring oscillator based TSV delay measurement scheme for TSV delay defect detection. In the proposed scheme, three TSVs and the associated logic gates are implemented to construct a basic TSV propagation delay measurement unit. By configuring the control signals, three different oscillators can be created in the unit. By firstly measuring the oscillation periods of the three oscillators, the propagation delay of the target TSV can then be calculated with high resolution. Experimental results are presented to verify the effectiveness of the proposed scheme."}, "conf/aspdac/PeiGLLJ15": {"title": "Enhanced LCCG: A novel test clock generation scheme for faster-than-at-speed delay testing.", "url": "https://doi.org/10.1109/ASPDAC.2015.7059058", "year": "2015", "author": {"Songwei Pei": "29/7673", "Ye Geng": "160/1584", "Huawei Li": "70/576", "Jun Liu": "95/3736", "Song Jin": "15/7691"}, "abstract": " Abstract:On-chip faster-than-at-speed delay testing provides a promising way for small delay defect detection. However, the frequency of on-chip generated test clock would be impacted by process variations. Hence, it requires determining the actual frequency of generated test clock to ensure the effectiveness of faster-than-at-speed delay testing. In this paper, we present a novel test clock generation scheme, namely Enhanced LCCG, for faster-than-at-speed delay testing. In the proposed scheme, faster-than-at-speed test clock is firstly generated by configuring the corresponding control information specified in the test pattern into Enhanced LCCG. Then, by constructing oscillation paths and counting the corresponding oscillation iteration numbers, the actual frequency of test clock can be measured and calculated with high resolution. Experimental results are presented to validate the proposed method."}, "conf/glvlsi/PeiZJJLX15": {"title": "An Effective TSV Self-Repair Scheme for 3D-Stacked ICs.", "url": "https://doi.org/10.1145/2742060.2742071", "year": "2015", "author": {"Songwei Pei": "29/7673", "Jingdong Zhang": "163/0015", "Yu Jin": "06/6174", "Song Jin": "15/7691", "Jun Liu": "95/3736", "Weizhi Xu": "71/8419"}, "abstract": "\n\t\tVarious types of defects are prone to be occurred inside the TSV during the manufacturing and bonding steps, thereby severely impacting the yield of 3D-stacked ICs. Moreover, several types of TSV defects are latent and may easily escape detection during the manufacturing test. However, these latent TSVs are prone to degrade during the field operation and may eventually become faulty and then destroy the entire 3D-stacked IC. To tackle the above problems, in this paper, we present an effective TSV self-repair scheme for 3D-stacked ICs. By designing redundant TSVs and a TSV self-repair architecture, the proposed scheme can effectively repair faulty TSVs detected by manufacturing test for improving the yield of 3D-stacked ICs. Moreover, the latent TSVS failed and then detected during the in-field operation can also be self-repaired, thereby elevating the 3D ICs' quality and reliability. Experimental results are presented to validate the proposed method.\n\t"}, "conf/vlsi-dat/JinPHL15": {"title": "On optimizing system energy of multi-core SoCs based on dynamically reconfigurable voltage-frequency island.", "url": "https://doi.org/10.1109/VLSI-DAT.2015.7114569", "year": "2015", "author": {"Song Jin": "15/7691", "Songwei Pei": "29/7673", "Yinhe Han": "32/2695", "Huawei Li": "70/576"}, "abstract": " Abstract:Voltage-frequency island (VFI)-based design has been widely exploited for optimizing system energy of embedded multi-core chip in recent years. The existing work either constructed a single static VFI partition for all kinds of applications or required per core voltage domain configuration. However, the former solution is difficult to find a single optimal VFI partition for diverse applications while the latter one suffers from high hardware cost. In this paper, we propose an energy optimization framework based on dynamically reconfigurable VFI (D-VFI). Our framework treats a small number of cores as dynamic cores (D-cores) and configures each of them with an independent voltage domain. At runtime, the D-cores can be pieced together with neighboring static VFIs. This can dynamically construct the optimal VFI partition for different kinds of applications, achieving more aggressive energy optimization under low cost. To identify the D-cores, we propose a D-VFI aware task scheduling and VFI partitioning algorithm. Moreover, we analyze all the VFI partitions to determine the optimal voltage scaling intervals which can accommodate performance degradation resulted from voltage scaling. Experimental results demonstrates that the effectiveness of the proposed scheme."}, "conf/aspdac/JinHP14": {"title": "Variation-aware statistical energy optimization on voltage-frequency island based MPSoCs under performance yield constraints.", "url": "https://doi.org/10.1109/ASPDAC.2014.6742975", "year": "2014", "author": {"Song Jin": "15/7691", "Yinhe Han": "32/2695", "Songwei Pei": "29/7673"}, "abstract": " Abstract:Energy efficiency is a primary design concern for embedded multiprocessor system-on-chips (MPSoCs). Recently, Voltage-Frequency Island (VFI) - based design paradigm was introduced for fine-grained power management, which can seamlessly combine with the task scheduling algorithm to optimize system energy. However, the ever-increasing variabilities cause large uncertainty on delay and power. Such statistical nature in performance parameters easily makes deterministic energy optimization hard to achieve desirable performance yield, defined as the probability of the design meeting timing constraints of the system. In this paper, we propose a variation-aware statistical energy optimization framework, which takes account of performance yield constraints in energy-aware task scheduling, voltage assignment and VFI partitioning process. Energy optimization sensitivity, defined as energy variations of the task under voltage scaling, combines with the statistical slack of the task to guide the overall optimization flow. Experimental results demonstrate the effectiveness of the proposed scheme."}, "conf/vts/PeiLL11": {"title": "A unified test architecture for on-line and off-line delay fault detections.", "url": "https://doi.org/10.1109/VTS.2011.5783733", "year": "2011", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Xiaowei Li 0001": "37/5372-1"}, "abstract": " Abstract:This paper proposes a unified delay test architecture, in which the design resources for on-line delay fault detection can be reused to support off-line delay testing. A stability checker, which has low hardware overhead, is presented to monitor the stability violation from each critical combinational output. A global error generator, which is shared among stability checkers, can produce a global error signal from individual stability checkers to indicate whether a delay fault appears. A local scan enable generator is incorporated into the scan chain to support scan-based off-line delay testing. Experimental results are presented to validate the effectiveness of the proposed approach."}, "conf/date/PeiLL10": {"title": "An on-chip clock generation scheme for faster-than-at-speed delay testing.", "url": "https://doi.org/10.1109/DATE.2010.5457020", "year": "2010", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Xiaowei Li 0001": "37/5372-1"}, "abstract": " Abstract:Faster-than-at-speed testing provides an effective way for detecting and debugging small delay defects in modern fabricated chips. However, the use of external automatic test equipment for faster-than-at-speed delay testing could be costly. In this paper, we present an on-chip clock generation scheme which facilitates faster-than-at-speed delay testing for both launch on capture and launch on shift test frameworks. The required test clock frequency with a high resolution can be obtained by specifying the information in the test patterns, which is then shifted into the delay control stages to configure the launch and capture clock generation circuit (LCCG) embedded on-chip. Similarly, the control information for selecting various test frameworks and clock signals can also be embedded in the test patterns. Experimental results are presented to validate the proposed scheme."}, "conf/ats/PeiLL09": {"title": "A Low Overhead On-Chip Path Delay Measurement Circuit.", "url": "https://doi.org/10.1109/ATS.2009.64", "year": "2009", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Xiaowei Li 0001": "37/5372-1"}, "abstract": " Abstract:In this paper, we present a novel on-chip path delay measurement circuit for efficiently detecting and debugging of delay faults in the fabricated integrated circuits. Several delay stages are employed in the proposed circuit, whose delay ranges are increased by a factor of two gradually from the last to the first delay stage. Thus, the proposed method can achieve a large delay measurement range with a small quantity of delay stages. Experimental results show that a significant reduction in both delay measurement time and area overhead can be obtained compared to the previous Vernier Delay Line based delay measurement schemes. In addition, by conducting delay compensation, the proposed method can achieve both improved delay measurement resolution and measurement accuracy."}, "conf/prdc/PeiLL09": {"title": "Flip-Flop Selection for Transition Test Pattern Reduction Using Partial Enhanced Scan.", "url": "https://doi.org/10.1109/PRDC.2009.20", "year": "2009", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Xiaowei Li 0001": "37/5372-1"}, "abstract": " Abstract:Enhanced scan delay testing approach can achieve high transition delay fault coverage by a small size of test pattern set but with significant hardware overhead. Although the implementation cost of launch on capture (LOC) approach is relatively low, the generated pattern set for testing delay faults is typically very large. In this paper, we present a novel flip-flop selection method to combine the respective advantages of the two approaches, by replacing a small number of selected regular scan cells with enhanced scan cells, thus to reduce the overall volume of transition delay test patterns effectively. Moreover, higher fault coverage can also be obtained by this approach compared to the standard LOC approach. Experimental results on larger ISCAS-89 and ITC-99 benchmark circuits using a commercial test generation tool show that the volume of test patterns can be reduced by over 70% and the transition delay fault coverage can be improved by up to 8.7%."}, "journals/cluster/JinPWQ21": {"title": "A parallel sparse triangular solve algorithm based on dependency elimination of the solution vector.", "url": "https://doi.org/10.1007/s10586-020-03188-x", "year": "2021", "author": {"Song Jin": "15/7691", "Songwei Pei": "29/7673", "Yu Wang": "02/5889", "Yincheng Qi": "150/4799"}, "abstract": "Sparse triangular solve (SpTRSV) is an important kernel in many scientific computing applications. In traditional viewpoints, accelerating SpTRSV by parallelizing the solution process is a challenging task. Dependencies among the variables that exist in the solution process not only restrict the parallelism that can be achieved, but also introduce large synchronization overhead among the parallel tasks. Moreover, a time-consuming pre-processing phase is commonly required to identify calculations that can be parallelized. However, we have observed that a large number of dependencies among the variables can be eliminated if we only calculate partial values of the variables first and add them together to obtain the final values later. By using such a strategy, starting to solve a variable does not need to wait for all of its prerequisite variables having been solved. In consequence, parallelism of the SpTRSV can be increased significantly. In this paper, we transform above mentioned observations into a subtree-based parallel algorithm to accelerate SpTRSV. The proposed algorithm calculates partial values of the variable along with an implicit subtree traversal and utilizes hardware atomic operation to implement accumulation of the partial values. This not only introduces no pre-processing overhead, but also avoids any barrier synchronization among the parallel threads. We evaluate the proposed algorithm on 2135 matrices from SuiteSparse Matrix Collection based on a generic GPU platform. Experimental results demonstrate that our scheme outperforms the state-of-the-art GPU and CPU vendor libraries in 1949 and 1782 matrices, respectively. Compared with the latest synchronization-free method, our scheme outperforms in 1779 matrices."}, "journals/fgcs/JinPW20": {"title": "A variation tolerant scheme for memristor crossbar based neural network designs via two-phase weight mapping and memristor programming.", "url": "https://doi.org/10.1016/j.future.2020.01.021", "year": "2020", "author": {"Song Jin": "15/7691", "Songwei Pei": "29/7673", "Yu Wang": "02/5889"}, "abstract": "Memristor crossbar can implement neural network computations in an extremely energy efficient manner. However, resistance variation exists after memristor programming due to fabrication induced process variation. Such resistance variation degrades prediction accuracy of a well-trained network when the network is mapped onto the crossbar. We notice that resistance variation is much smaller when we program the memristor into the higher resistance state (representing logic 0), compared to the one that the memristor is at the lower resistance state (representing logic 1). Such observation motivates us to exploit sparse neural network and propose a two-phase weight mapping and memristor programming scheme to improve prediction accuracy of the network under process variation. In the first phase, the unpruned large value weights are mapped onto the crossbar. Benefited from the large amount of zero value weights in the sparse network, most of the memristors can be programmed into highest resistance state which has good immunity to the variation. In the second phase, we retrain the network to recover a small number of zero value weights to small values. Mapping these small value weights means programming memristors into relatively higher resistance state, thus having good variation resilient and can compensate variations in the mapped large value weights effectively. Experiments are conducted on a neural network deployed on the memristor crossbar. The results demonstrate that the proposed scheme can achieve a similar accuracy to the well-trained software network."}, "journals/ieiceee/PeiZW18": {"title": "A low-overhead RO PUF design for Xilinx FPGAs.", "url": "https://doi.org/10.1587/elex.15.20180093", "year": "2018", "author": {"Songwei Pei": "29/7673", "Jingdong Zhang": "163/0015", "Ruonan Wang": "129/9848"}, "abstract": ""}, "journals/ieiceee/PeiJ18": {"title": "An effective structure and flow for pre-bond TSV test.", "url": "https://doi.org/10.1587/elex.15.20180160", "year": "2018", "author": {"Songwei Pei": "29/7673", "Song Jin": "15/7691"}, "abstract": ""}, "journals/mj/JinHP16": {"title": "Statistical energy optimization on voltage-frequency island based MPSoCs in the presence of process variations.", "url": "https://doi.org/10.1016/j.mejo.2016.05.004", "year": "2016", "author": {"Song Jin": "15/7691", "Yinhe Han": "32/2695", "Songwei Pei": "29/7673"}, "abstract": "Energy efficiency has become a primary design concern for embedded multiprocessor system-on-chips (MPSoCs). Recently, voltage–frequency island (VFI)-based design paradigm was proposed to optimize system energy by combining with task scheduling. However, the ever-increasing variations cause large uncertainty for delay and power of the processors, resulting in performance parameters of the VFIs also manifesting as statistical distribution. As a result, it is more difficult for the deterministic energy optimization to achieve desirable performance yield, defined as the probability of the design meeting timing constraints of the system. In this paper, we propose a variation-aware statistical energy optimization framework which takes account of performance yield constraints in the overall optimization flow. We observed that statistical features of parameter distributions in homogeneous and heterogeneous platforms are different. We hence define two effective metrics, namely energy optimization sensitivity (EOS) and lowest operating voltage (LOV), to make our framework adapt to both of the platforms. Experimental results demonstrate that on average our framework achieves performance yield improvement of 45% than the deterministic scheme. In respect of energy optimization, on average our framework achieves energy reduction of 33% than the existing statistical task scheduling algorithm."}, "journals/todaes/JinPHL16": {"title": "A Cost-Effective Energy Optimization Framework of Multicore SoCs Based on Dynamically Reconfigurable Voltage-Frequency Islands.", "url": "https://doi.org/10.1145/2817207", "year": "2016", "author": {"Song Jin": "15/7691", "Songwei Pei": "29/7673", "Yinhe Han": "32/2695", "Huawei Li": "70/576"}, "abstract": "Voltage-frequency island (VFI)-based design has been widely exploited for optimizing system energy of embedded multicore chip in recent years. The existing work either constructed a single static VFI partition for all kinds of applications or required per-core voltage domain configuration. However, the former solution is hard to find one optimal VFI partition for diverse applications while the latter one suffers from high hardware cost. In this article, we propose a cost effective energy optimization framework based on dynamically reconfigurable VFI (D-VFI). Our framework treats a small number of cores as dynamic cores (D-cores) and configures each of them with an independent voltage domain. At runtime, the D-cores can be pieced together with neighboring static VFIs by scaling their operating voltages. This can dynamically construct the optimal VFI partitions for different kinds of applications, thus achieving more aggressive energy optimization under low cost. To identify the D-cores, we propose a rules constrained task scheduling and VFI partitioning algorithm. Moreover, we analyze the task schedules to determine the optimal scaling intervals which can accommodate voltage scaling induced latency. Experimental results demonstrate that the effectiveness of the proposed scheme."}, "journals/integration/PeiLJL015": {"title": "An on-chip frequency programmable test clock generation and application method for small delay defect detection.", "url": "https://doi.org/10.1016/j.vlsi.2014.12.003", "year": "2015", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Song Jin": "15/7691", "Jun Liu": "95/3736", "Xiaowei Li 0001": "37/5372-1"}, "abstract": "Small delay defects are posing a serious challenge to the quality and reliability of modern fabricated chips. A promising way for screening the timing-related defects in nanometer technology designs is faster-than-at-speed delay testing. However, the use of external automatic test equipment for faster-than-at-speed delay testing could be costly. In this paper, we present an on-chip frequency-programmable test clock generation method which facilitates faster-than-at-speed delay testing for both launch on capture and launch on shift test frameworks. With a reconfigurable launch-and-capture clock generator (LCCG) embedded on-chip, the required test clock, with a reconfigurable frequency and a high resolution, can be achieved by specifying the control information in the test patterns, which is then used to configure the LCCG. Similarly, the control information regarding test framework and clock signal selection can also be embedded in the test patterns. Experimental results are presented to validate the proposed method."}, "journals/jvcir/XuYLSWYPFX15a": {"title": "Corrigendum to \"Fast and scalable lock methods for video coding on many-core architecture\" [J. Visual Communication and Image Representation 25 (7) (2014) 1758-1762].", "url": "https://doi.org/10.1016/j.jvcir.2014.10.010", "year": "2015", "author": {"Weizhi Xu": "71/8419", "Hui Yu": "26/6190", "Dianjie Lu": "02/8333", "Fenglong Song": "01/2674", "Da Wang": "10/3366", "Xiaochun Ye": "22/3129", "Songwei Pei": "29/7673", "Dongrui Fan": "35/2456", "Hongtao Xie": "25/588"}, "abstract": ""}, "journals/jvcir/XuYLSWYPFX15": {"title": "Corrigendum to \"Fast and scalable lock methods for video coding on many-core architecture\" [J. Visual Communication and Image Representation 25(7) (2014) 1758-1762].", "url": "https://doi.org/10.1016/j.jvcir.2014.12.006", "year": "2015", "author": {"Weizhi Xu": "71/8419", "Hui Yu": "26/6190", "Dianjie Lu": "02/8333", "Fenglong Song": "01/2674", "Da Wang": "10/3366", "Xiaochun Ye": "22/3129", "Songwei Pei": "29/7673", "Dongrui Fan": "35/2456", "Hongtao Xie": "25/588"}, "abstract": ""}, "journals/jvcir/XuYLSWYPFX14": {"title": "Fast and scalable lock methods for video coding on many-core architecture.", "url": "https://doi.org/10.1016/j.jvcir.2014.06.009", "year": "2014", "author": {"Weizhi Xu": "71/8419", "Hui Yu": "26/6190", "Dianjie Lu": "02/8333", "Fenglong Song": "01/2674", "Da Wang": "10/3366", "Xiaochun Ye": "22/3129", "Songwei Pei": "29/7673", "Dongrui Fan": "35/2456", "Hongtao Xie": "25/588"}, "abstract": "Many-core processors are good candidates for speeding up video coding because the parallelism of these applications can be exploited more efficiently by the many-core architecture. Lock methods are important for many-core architecture to ensure correct execution of the program and communication between threads on chip. The efficiency of lock method is critical to overall performance of chipped many-core processor. In this paper, we propose two types of hardware locks for on-chip many-core architecture, a centralized lock and a distributed lock. First, we design the architectures of centralized lock and distributed lock to implement the two hardware lock methods. Then, we evaluate the performance of the two hardware locks and a software lock by quantitative evaluation micro-benchmarks on a many-core processor simulator Godson-T. The experimental results show that the locks with dedicated hardware support have higher performance than the software lock, and the distributed hardware lock is more scalable than the centralized hardware lock."}, "journals/tvlsi/PeiLL12": {"title": "A High-Precision On-Chip Path Delay Measurement Architecture.", "url": "https://doi.org/10.1109/TVLSI.2011.2161353", "year": "2012", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Xiaowei Li 0001": "37/5372-1"}, "abstract": " Abstract:In this paper, we present a novel on-chip path delay measurement architecture for efficiently detecting and debugging of delay faults in the fabricated integrated circuits. Several delay stages are employed in the proposed on-chip path delay measurement (OCDM) circuit, whose delay ranges are increased by a factor of two gradually from the last to the first delay stage. Thus, the proposed OCDM circuit can achieve a large delay measurement range with a small quantity of delay stages. A calibration circuit is incorporated into the proposed on-chip path delay measurement technique to calibrate the delay range of the delay stage under process variations. In addition, delay calibration for import lines is conducted to improve the precision of path delay measurement. Experimental results are presented to validate the proposed path delay measurement architecture."}, "journals/tvlsi/PeiLL12a": {"title": "Flip-Flop Selection for Partial Enhanced Scan to Reduce Transition Test Data Volume.", "url": "https://doi.org/10.1109/TVLSI.2011.2170227", "year": "2012", "author": {"Songwei Pei": "29/7673", "Huawei Li": "70/576", "Xiaowei Li 0001": "37/5372-1"}, "abstract": " Abstract:We propose a flip-flop selection method to reduce the overall volume of transition delay test data, by replacing a small number of selected regular scan cells with enhanced scan cells. Relative measures are presented to reflect the gains when controlling a scan cell to a certain value, and guide the scan cell selection. Experimental results on larger IWLS 2005 benchmark circuits show that, to achieve the same fault coverage of the pure launch on capture (LOC) approach, the volume of test data can be reduced to a half on average by replacing only 1% of regular scan cells to enhanced scan cells. The transition delay fault coverage can also be improved using the proposed method with equally low area overhead."}}}