{"id": "151/6228", "name": "Sujie Shao", "Article": {"conf/icccsec/GuoHYCS21": {"title": "Trusted Digital Asset Copyright Confirmation and Transaction Mechanism Based on Consortium Blockchain.", "url": "https://doi.org/10.1007/978-3-030-78612-0_57", "year": "2021", "author": {"Shaoyong Guo": "150/6843", "Cheng Huang": "83/5898", "Yong Yan": "70/374", "Liandong Chen": "231/4740", "Sujie Shao": "151/6228"}, "abstract": "Aiming at the problems of low transaction efficiency, digital asset copyright and transaction privacy in traditional digital asset trading platforms, based on alliance chain technology, this paper proposes a decentralized digital asset trustworthy copyright confirmation and transaction mechanism, which combines The common digital watermark technology in the field of traditional digital asset copyright confirmation and the common homomorphic encryption technology in the field of cloud computing solves the problem of user data privacy protection in the process of embedding digital watermark on the chain. And combined with smart contract technology to solve the problem of security and credibility of digital assets in the process of confirming the chain and transactions, realizing the confirmation of digital copyright and the traceability of transactions on the chain. Finally, experimental simulations prove that the reform mechanism can stably handle the copyright confirmation of digital asset transactions under normal circumstances, and basically meet the digital asset transaction needs of users.KeywordsConsortium blockchainDigital asset transactionCredible confirmation of copyrightsSmart contract"}, "conf/icccsec/XiangYXGDS20": {"title": "Design and Implementation of Four-Meter Reading Sharing System Based on Blockchain.", "url": "https://doi.org/10.1007/978-3-030-57881-7_68", "year": "2020", "author": {"Baoyu Xiang": "273/5160", "Zhuo Yu": "09/6190", "Ke Xie 0005": "266/1925", "Shaoyong Guo": "150/6843", "Meiling Dai": "273/5532", "Sujie Shao": "151/6228"}, "abstract": "The four-meter reading refers to the unified collection and treatment of the energy data of water, electricity, gas and heat, and is a part of the national energy strategy. Although the state has already proposed four-meter reading, it has developed slowly and has little effect. The main reason is the problem of the reliability of the transmission of data in the channel and the collaboration problems caused by the industrial barriers of various energy companies. In this paper, we explore the problem of using the blockchain technology to solve the problem of the application of the four-meter reading application scenario. The research content of this paper is based on the fabric alliance chain, design data format and data management model, guarantee data security isolation, and realize a set of four-meter reading sharing system based on blockchain. For the research content of the four-meter reading scenario, firstly we investigate the knowledge of the four-meter reading application scenario, and then learn the blockchain technology and the fabric blockchain open source project. After that, the system is analyzed and designed, including requirements analysis, data isolation design, and system design. Next, the implementation of the system, including the construction of the fabric blockchain network, the preparation of smart contracts, the development of the client interface. Finally, the system is tested to verify that the system is functioning properly.KeywordsFour-meter readingBlockchainHyperledger fabricData isolation"}, "conf/iwcmc/GuoQ0SQ20": {"title": "Edge Network Resource Synergy for Mobile Blockchain in Smart City.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148266", "year": "2020", "author": {"Shaoyong Guo": "150/6843", "Yuanyuan Qi": "28/8596", "Peng Yu 0001": "50/2599-1", "Sujie Shao": "151/6228", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Blockchain has broad application prospects in Smart City, and the technical characteristics of the blockchain itself can solve the problems of mistrust of network resource production relations and unfair distribution of revenue. However, most of the devices in Smart City are mobile devices with insufficient resources. The demand for computing power of the mining process cannot be met. For this, we introduce mobile edge computing, deploy edge servers on the edge side, and provide resources for mobile devices. We build an edge network resource allocation model for mobile blockchain to realize the effective application of blockchain technology in mobile environments. The resources required by the mining process can be obtained from neighboring resource sharing devices or edge servers. The resource allocation between adjacent devices can be modeled as a two-way auction model, and the Bayesian- Nash equilibrium is solved to determine the optimal price, while considering the trusted value of the device; the process of the mobile device acquiring resources from the edge server can be modeled as a two-stage Stackelberg game. Finally, simulation experiments show that this mechanism achieves a higher personal utility than an existing model that only considers requesting resources from an edge server."}, "conf/im/DaiYYGS19": {"title": "A Blockchain-Based Decentralized Wi-Fi Sharing Mechanism.", "url": "https://ieeexplore.ieee.org/document/8717809", "year": "2019", "author": {"Yao Dai": "50/10186", "Zhuo Yu": "09/6190", "Yong Yan": "70/374", "Shaoyong Guo": "150/6843", "Sujie Shao": "151/6228"}, "abstract": " Abstract:Wi-Fi is widely used as an inexpensive way for terminal service access, which brings a trend of Wi-Fi sharing. However, the current Wi-Fi sharing mode has problems such as low reliability and high cost. In order to cope with these problems, this paper puts forward a decentralized Wi-Fi sharing mechanism based on blockchain, including three sub-mechanisms of Wi-Fi authentication, Wi-Fi sharing, and Wi-Fi usage charging. Specifically, Wi-Fi owners first authenticate their Wi-Fi information on the blockchain and only the authenticated Wi-Fi can be connected. Then, the Wi-Fi users pay for the Wi-Fi usage through the smart contracts. Finally, all transactions are registered on the blockchain to ensure the security and reliability of Wi-Fi sharing process. Simulation results show that the proposed mechanism keeps a high Wi-Fi sharing success rate of more than 97 percent at a high Wi-Fi request rate of 200 tps."}, "conf/cyberc/DengZYSQ17": {"title": "An Energy-Saving Clustering Strategy of Hybrid Network of Sensors and Mobile CR Nodes.", "url": "https://doi.org/10.1109/CyberC.2017.86", "year": "2017", "author": {"Yi-Wei Deng": "212/7715", "Cheng Zhong": "07/1405", "Jun Yu": "50/5754", "Sujie Shao": "151/6228", "Xuesong Qiu 0001": "13/342"}, "abstract": " Abstract:Cognitive radio (CR) networks can be combined with sensor networks, it can not only share traffic of sensor networks but also reduce the transmission delay because of the spectrum advantage, thus can perform monitoring tasks better. To improve the reliability of the mixed network and energy efficiency of sensors, this article achieves sensor networks clustering based on the mobility and distribution of CR nodes. The CR nodes act as cluster head and undertake the task of relay between clusters. In every cluster, the sensor nodes are divided into several coverage subsets, and their working duration are scheduled by the distribution of energy. Simulation results showed that the strategy proposed can reduce the network energy consumption and delay, guarantee the quality of monitoring, and extend the network lifetime effectively."}, "conf/icsai/LiuSGMD17": {"title": "Relay station selecting algorithm based on transmission delay for power line communication networks.", "url": "https://doi.org/10.1109/ICSAI.2017.8248316", "year": "2017", "author": {"Linjun Liu": "219/9623", "Sujie Shao": "151/6228", "Shaoyong Guo": "150/6843", "Luoming Meng": "52/382", "Yi Du": "07/114"}, "abstract": " Abstract:PLC is an important communication mode of distribution communication network. PLC has a high demand for delay. However, because of the channel environment constraints, communication reliability of PLC is difficult to improve. To reduce the delay of PLC networks as well as ensuring reliability and energy requirements, we designed a PLC network relay station selecting algorithm. Based on reliability, N-1 principle and energy consumption limitation of the PLC network, aiming at the minimum average transmission delay, we constructed the selecting model. Simulation results shown that this method could achieve high reliability and low transmission delay, and improved the overall performance of the network."}, "conf/ccis/FanSR16": {"title": "A mining algorithm for frequent closed pattern on data stream based on sub-structure compressed in prefix-tree.", "url": "https://doi.org/10.1109/CCIS.2016.7790298", "year": "2016", "author": {"Muhan Fan": "192/1064", "Sujie Shao": "151/6228", "Lanlan Rui": "03/4227"}, "abstract": " Abstract:The knowledge embedded in data stream has the property of decaying with time, so people are more interested in the new data stream. This paper proposes a method for mining the frequent closed patterns in a sliding window to capture information timely and accurately when new data stream arrives. Data stream is divided into several basic windows. All possible frequent closed patterns are mined in each basic window and be stored in Closed Pattern-tree in the form of node compression to save space; As the data in sliding window updates, Closed Pattern-tree can be incrementally updated and the infrequent or unclosed patterns will be deleted from the tree. The experimental results of the simulation show that the method for mining the frequent closed patterns in a sliding window is efficient in time and space."}, "conf/apnoms/JiaCSQ14": {"title": "Routing algorithm of smart grid data collection based on data balance measurement model.", "url": "https://doi.org/10.1109/APNOMS.2014.6996557", "year": "2014", "author": {"Xiaochun Jia": "156/3699", "Xingyu Chen": "59/7651", "Sujie Shao": "151/6228", "Feng Qi 0004": "42/1054-4"}, "abstract": " Abstract:Data collection communications system for electric power communication network is an important entity network in electric power system. It's significant to provide a reasonable routing mechanism for data collection system. The major risk of original routing mechanism is the burst congestion. In the data collection network of smart grid, that some nodes may suffer from more congestion than others even become the bottleneck of network become the new source of risk. In order to overcome these problems, this paper proposes a routing mechanism to realize data balance. This mechanism firstly abstracts a multigate network model of data collection system. Then, it proposes a routing measurement model to balance data traffic named data balance measurement model (DBMM). Subsequently it proposes a routing algorithm based on DBMM, named RA-DBMM. The RA-DBMM handles the data traffic to achieve data balance by modifying the routing decision measurement function. So the queue length of queuing data and buffer capacity of every nodes are taken into consideration. Simulation illustrates that the proposed RA-DBMM has biggish enhancement in minishing the congestion, reducing loss ratio, overcoming bottleneck and increasing throughput of network."}, "conf/apnoms/ShaoGQMZ14": {"title": "A random switching traffic scheduling algorithm for data collection in wireless mesh network.", "url": "https://doi.org/10.1109/APNOMS.2014.6996531", "year": "2014", "author": {"Sujie Shao": "151/6228", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382", "Cheng Zhong": "07/1405"}, "abstract": " Abstract:Because of the advantages of multi-hop communication, self-organizing, self-healing and reliability, wireless mesh network becomes an ideal choice for data collection. However, wireless mesh network for data collection faces challenge on communication performance of network caused by application layer data traffic. When a large number of data occurs in emergence, some mesh nodes (the last hop nodes) which are in pivotal location will face great communication pressure and probably lead to extremely data congestion, especially in smart grid. For the idea of load balancing, this paper proposes a new random switching traffic scheduling algorithm based on data collection tree. Simulation data show that the new algorithm can create a balanced data collection tree, significantly reduce the packet loss ratio of the burst data and release congestion of system."}, "conf/icccn/ShaoGQM14": {"title": "A random switching traffic scheduling algorithm in wireless smart grid communication network.", "url": "https://doi.org/10.1109/ICCCN.2014.6911827", "year": "2014", "author": {"Sujie Shao": "151/6228", "Shao-Yong Guo": "150/6843", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": " Abstract:One of the key technologies of smart grid is an efficient, reliable and secure two-way communication system for meter data collection. Because of the advantages of muti-hop communication, self-organizing, self-healing and reliability, wireless muti-hop communication technology becomes an ideal choice for smart grid meter data collection. However, forming wireless mesh network with advanced electricity devices (smart meters) which have the communication capabilities for meter data collection faces challenge on communication performance of network caused by application layer data traffic. When a large number of data occur in emergence, some smart meters (the last hop nodes) which are in pivotal location will face great communication pressure and probably lead to extremely data congestion. With the idea of load balancing, this paper proposes a new random switching traffic scheduling algorithm based on meter data collection tree. Simulation data show that the new algorithm can create a balanced meter data collection tree, significantly reduce the packet loss ratio of the burst data and release congestion of system."}, "journals/sj/ShaoZGSQM22": {"title": "Intelligent Farm Meets Edge Computing: Energy-Efficient Solar Insecticidal Lamp Management.", "url": "https://doi.org/10.1109/JSYST.2022.3174925", "year": "2022", "author": {"Sujie Shao": "151/6228", "Qinghang Zhang": "287/8817", "Shaoyong Guo": "150/6843", "Lin Sun": "95/6619", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": " Abstract:Energy-efficient solar insecticidal lamp (SIL) management is an important way to promote the full deployment and application of SILs in intelligent farms. To improve processing latency and precision, an edge computing-based energy-efficient SILs management architecture (ECEEM-SIL) is presented. Considering architecture matching, an SILs management mechanism based on edge computing referring to real-time information of pests and energy (ECEEM-SIL-RRIPE) is proposed. Firstly, considering different weather conditions, the pest distribution model and its update method based on edge computing are established. Secondly, the scheduling strategy based on the maximum coverage of active pest periods with the minimum number of working SILs (MaxCAP-MinNWS) is proposed to address the turning \non\n and \noff\n scheduling of SILs, while considering the joint optimization of energy consumption and insecticidal efficiency. Simulation results show that compared with the existing preset working period scheduling and unified scheduling strategies, the proposed strategy can improve utilization of energy resources in insecticidal by up to 20%. In addition, the energy supply and consumption of SILs can be more balanced, and the battery deep discharging of SILs can be relieved."}, "journals/jwe/ShaoTWLGQ21": {"title": "Delay and Energy Consumption Optimization Oriented Multi-service Cloud Edge Collaborative Computing Mechanism in IoT.", "url": "https://doi.org/10.13052/jwe1540-9589.20810", "year": "2021", "author": {"Sujie Shao": "151/6228", "Jiajia Tang": "234/3242", "Shuang Wu": "85/3231", "Jianong Li": "307/6237", "Shaoyong Guo": "150/6843", "Feng Qi 0004": "42/1054-4"}, "abstract": ""}, "journals/sj/ShaoZGQ21": {"title": "Task Allocation Mechanism for Cable Real-Time Online Monitoring Business Based on Edge Computing.", "url": "https://doi.org/10.1109/JSYST.2020.2988266", "year": "2021", "author": {"Sujie Shao": "151/6228", "Qinghang Zhang": "287/8817", "Shaoyong Guo": "150/6843", "Feng Qi 0004": "42/1054-4"}, "abstract": " Abstract:Edge computing has a promising application prospect in the field of Internet of Things, especially cable real-time online monitoring business in a smart grid. However, for the relatively limited resources and capabilities of the edge nodes, such as computing resource and storage resource, it is hard to highly and comprehensively satisfy the high real-time requirements of cable online monitoring tasks. To solve this problem, effectively dynamic task allocation is needed on the basis of efficient utilization and optimization of resource and capabilities of the edge nodes. In this article, a task allocation mechanism for cable real-time online monitoring business based on edge computing is proposed. First, considering the linear distribution characteristics of the cable, the statuses of edge nodes, the processing overhead of tasks, and the scheduling strategy of delay-sensitive tasks, we establish a task allocation model based on edge computing. Second, a task allocation strategy based on improved discrete particle swarm optimization is proposed. In our strategy, we focus on the task queuing problem in edge nodes and the optimized task allocation problem among edge nodes. Simulation results show that the task allocation mechanism proposed in this article can effectively reduce the average delay of cable real-time online monitoring businesses, and further improve the security and reliability of the smart grid."}, "journals/wicomm/ShaoGGQ21": {"title": "Computational Resource Allocation Strategy in a Public Blockchain Supported by Edge Computing.", "url": "https://doi.org/10.1155/2021/8851121", "year": "2021", "author": {"Sujie Shao": "151/6228", "Weichao Gong": "258/6174", "Shaoyong Guo": "150/6843", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/access/LiQWYS20": {"title": "Distributed Edge Computing Offloading Algorithm Based on Deep Reinforcement Learning.", "url": "https://doi.org/10.1109/ACCESS.2020.2991773", "year": "2020", "author": {"Yunzhao Li": "55/1489", "Feng Qi 0004": "42/1054-4", "Zhili Wang": "15/2643", "Xiuming Yu": "117/7523", "Sujie Shao": "151/6228"}, "abstract": " Abstract:As a mode of processing task request, edge computing paradigm can reduce task delay and effectively alleviate network congestion caused by the proliferation of Internet of things(IoT) devices compared with cloud computing. However, in the actual construction of the network, there are various edge autonomous subnets in the adjacent areas, which leads to the possibility of unbalance of server load among autonomous subnets during the peak period of task request. In this paper, a deep reinforcement learning algorithm is proposed to solve the complex computation offloading problem for the heterogeneous Edge Computing Server(ECS) collaborative computing. The problem is solved based on the real-time state of the network and the attributes of the task, which adopts Actor Critic and Policy Gradient's Deep Deterministic Policy Gradient(DDPG) to make optimized decisions of computation offloading. Considering multi-task, the heterogeneity of edge subnet and mobility of edge devices, the proposed algorithm can learn the network environment and generate the computation offloading decision to minimize the task delay.The simulation results show that the proposed DDPG-based algorithm is competitive compared with the Deep Q Network(DQN) algorithm and Asynchronous Advantage Actor-Critic(A3C) algorithm. Moreover, the optimal solutions are leveraged to analyze the influence of edge network parameters on task delay."}, "journals/access/MaSGWQX20": {"title": "Container Migration Mechanism for Load Balancing in Edge Network Under Power Internet of Things.", "url": "https://doi.org/10.1109/ACCESS.2020.3004615", "year": "2020", "author": {"Zitong Ma": "269/7444", "Sujie Shao": "151/6228", "Shaoyong Guo": "150/6843", "Zhili Wang": "15/2643", "Feng Qi 0004": "42/1054-4", "Ao Xiong": "119/8978"}, "abstract": " Abstract:As a novel computing technology closer to business ends, edge computing has become an effective solution for delay sensitive business of power Internet of Things (IoT). However, the uneven spatial and temporal distribution of business requests in edge network leads to a significant difference in business busyness between edge nodes. Due to the natural lightweight and portability, container migration has become a critical technology for load balancing, thereby optimizing the resource utilization of edge nodes. To this end, this paper proposes a container migration-based decision-making (CMDM) mechanism in power IoT. First, a load differentiation matrix model between edge nodes is constructed to determine the timing of container migration. Then, a container migration model of load balancing joint migration cost (LBJC) is established to minimize the impact of container migration while balancing the load of edge network. Finally, the migration priority of containers is determined from the perspective of resource correlation and business relevance, and by introducing a pseudo-random ratio rule and combining the local pheromone evaporation with global pheromone update at the same time, a migration algorithm based on modified Ant Colony System (MACS) is designed to utilize the LBJC model and thus guiding the choice of possible migration actions. The simulation results show that compared with genetic algorithm (GA) and Space Aware Best Fit Decreasing (SABFD) algorithm, the comprehensive performance of CMDM in load balancing joint migration cost is improved by 7.3% and 12.5% respectively."}, "journals/access/WangSGQW20": {"title": "Task Allocation Mechanism of Power Internet of Things Based on Cooperative Edge Computing.", "url": "https://doi.org/10.1109/ACCESS.2020.3020233", "year": "2020", "author": {"Qianjun Wang": "273/9199", "Sujie Shao": "151/6228", "Shaoyong Guo": "150/6843", "Xuesong Qiu 0001": "13/342", "Zhili Wang": "15/2643"}, "abstract": " Abstract:Edge computing can be widely used in unmanned aerial vehicle (UAV) inspection, field operation control, power consumption information collection and other businesses in the power Internet of Things scene. Edge computing offloads functions such as data processing and applications to network edge nodes near the terminals to provide low-latency services and ensure service quality. However, with the explosive growth of business terminals, the capacity of single edge node is limited and it is difficult to meet all business requirements at the same time. Therefore, this article proposes a task allocation mechanism based on cooperative edge computing. Firstly, a task allocation model based on cooperation of two edge nodes is established to minimize the average task completion delay while meeting business requirements. Secondly, the Two-edge-node Cooperative-task Allocation based on Improved Particle Swarm Optimization (TCA-IPSO) algorithm is proposed, which applies the crossover and mutation strategy in genetic algorithm to improve the particle swarm optimization algorithm, and solves the problem that the task allocation scheme in cooperation is prone to fall into a local optimum. Finally the simulation results show that the proposed TCA-IPSO algorithm reduces the average task completion delay by 53.8% and 36.0% compared to the benchmark and QoS-based Task Distribution (QBTD) algorithm."}, "journals/ejwcn/ShaoWZZW20": {"title": "Cooperative coverage-based lifetime prolongation for microgrid monitoring WSN in smart grid.", "url": "https://doi.org/10.1186/s13638-020-01857-4", "year": "2020", "author": {"Sujie Shao": "151/6228", "Lei Wu": "68/5597", "Qing-Hang Zhang": "78/9534", "Neng Zhang": "128/4245", "Kaixuan Wang": "132/6121"}, "abstract": ""}, "journals/information/ChengSRZFS20": {"title": "Ordered Electric Vehicles Charging Scheduling Algorithm Based on Bidding in Residential Area.", "url": "https://doi.org/10.3390/info11010049", "year": "2020", "author": {"Xiao Cheng": "73/1713", "Jinma Sheng": "258/7791", "Xiuting Rong": "258/7930", "Hui Zhang": "181/2846", "Lei Feng 0001": "76/847-1", "Sujie Shao": "151/6228"}, "abstract": ""}, "journals/wicomm/SuSGL20": {"title": "Blockchain-Based Internet of Vehicles Privacy Protection System.", "url": "https://doi.org/10.1155/2020/8870438", "year": "2020", "author": {"Tianhong Su": "275/5488", "Sujie Shao": "151/6228", "Shaoyong Guo": "150/6843", "Min Lei": "33/5325"}, "abstract": ""}, "journals/access/NiuSXZGCQ19": {"title": "Workload Allocation Mechanism for Minimum Service Delay in Edge Computing-Based Power Internet of Things.", "url": "https://doi.org/10.1109/ACCESS.2019.2920325", "year": "2019", "author": {"Xudong Niu": "81/4304", "Sujie Shao": "151/6228", "Chen Xin": "00/155", "Jun Zhou": "99/3847", "Shaoyong Guo": "150/6843", "Xingyu Chen": "59/7651", "Feng Qi 0004": "42/1054-4"}, "abstract": " Abstract:As a novel computing technology closer to business ends, edge computing has become an effective solution for delay sensitive business of power Internet of Things (IoT) and promotes the application and development of the IoT technology in smart grids. However, the inherent characteristics of a single edge node with limited resources may fail to meet the delay requirements for access ubiquitous IoT businesses of massive access. Multiple edge nodes are needed to cooperate with each other to optimize workload allocation to provide lower delay services. To this end, this paper proposes a workload allocation mechanism, orienting edge computing-based power IoT, which minimizes service delay. The workload optimization allocation model is established, and the optimal workload allocation oriented on delay among multiple edge nodes is further realized on the basis of computing resource optimization within the single edge node. The balanced initialization, resource allocation, and task allocation (BRT) algorithm are proposed. Based on the balanced initialization of workload within edge nodes, the particle swarm algorithm modified by the pheromone strategy is used to solve the problem of the computing resources' allocation inside edge nodes. Finally, the task allocation among multiple edge servers is converted into a semi-definite programming problem. The simulation results show that the proposed BRT algorithm reduces the service delay by 9.1%, 16.9%, and 26.4%, and the service delay growth rate by 24.6%, 34.5%, and 38.7%, respectively, compared with the simulated annealing algorithm (SAA), LoAd Balancing (LAB), and Latency-awarE workloAd offloaDing (LEAD) algorithms."}, "journals/ijdsn/DuSQM19": {"title": "Multi-requests satisfied based on energy optimization for the service composition in wireless sensor network.", "url": "https://doi.org/10.1177/1550147719879049", "year": "2019", "author": {"Cong Du": "42/3215", "Sujie Shao": "151/6228", "Feng Qi 0004": "42/1054-4", "Luoming Meng": "52/382"}, "abstract": ""}, "journals/sensors/ShaoGQ17": {"title": "Distributed Fault Detection Based on Credibility and Cooperation for WSNs in Smart Grids.", "url": "https://doi.org/10.3390/s17050983", "year": "2017", "author": {"Sujie Shao": "151/6228", "Shaoyong Guo": "150/6843", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/ieicet/HuangRZNQS16": {"title": "General, Practical and Accurate Models for the Performance Analysis of Multi-Cache Systems.", "url": "https://doi.org/10.1587/transcom.2016CNP0012", "year": "2016", "author": {"Haoqiu Huang": "168/7949", "Lanlan Rui": "03/4227", "Weiwei Zheng": "176/0935", "Danmei Niu": "68/10365", "Xuesong Qiu 0001": "13/342", "Sujie Shao": "151/6228"}, "abstract": ""}, "journals/jcm/LinWZSQ16": {"title": "Fault Recovery Algorithm for WSNs in Smart Grid.", "url": "https://doi.org/10.12720/jcm.11.9.827-833", "year": "2016", "author": {"Yanfei Lin": "22/10613", "Xingang Wang": "81/3525", "Cheng Zhong": "07/1405", "Sujie Shao": "151/6228", "Xuesong Qiu 0001": "13/342"}, "abstract": ""}, "journals/jcm/ShaoQM13": {"title": "Smart Gird Distribution and Consumption Communication Network Architecture.", "url": "https://doi.org/10.12720/jcm.8.8.480-489", "year": "2013", "author": {"Sujie Shao": "151/6228", "Xuesong Qiu 0001": "13/342", "Luoming Meng": "52/382"}, "abstract": ""}}}