{"id": "70/6770-2", "name": "Tong Xu 0002", "Article": {"conf/emnlp/DuSWQLXL19": {"title": "Capsule Network with Interactive Attention for Aspect-Level Sentiment Classification.", "url": "https://doi.org/10.18653/v1/D19-1551", "year": "2019", "author": {"Chunning Du": "254/8020", "Haifeng Sun 0001": "00/11044-1", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951", "Tong Xu 0002": "70/6770-2", "Ming Liu": "20/2039"}, "abstract": ""}, "conf/ijcnn/WangXLS19": {"title": "CSSD: Cascade Single Shot Face Detector.", "url": "https://doi.org/10.1109/IJCNN.2019.8851713", "year": "2019", "author": {"Shuainan Wang": "249/8355", "Tong Xu 0002": "70/6770-2", "Wei Li": "64/6025", "Haifeng Sun 0001": "00/11044-1"}, "abstract": " Abstract:Face detection has achieved great success with the development of convolution neural network. However, it remains a challenging problem to detect small and blurred faces in unconstrained environment. This paper presents a novel cascade single-shot face detector, named Cascade Single Shot Face Detector (CSSD), which introduces novel cascade classification and regression network in an anchor-based face detector to reject false positives and improve location accuracy. We have contributed in the following three aspects: 1) proposing a feature enchanted and scale-invariable face detection architecture to process faces with different scales; 2) regressing bounding boxes of faces in two steps with a cascade method; 3) filtering negative anchors online after anchor refinement and rebalancing puzzle negative anchors and positive anchors with rate of 3:1. As a consequence, our method achieves state-of-the-art detection performance on FDDB and WIDER FACE dataset."}, "conf/nana/LiWLXQ16": {"title": "Load Prediction-Based Automatic Scaling Cloud Computing.", "url": "https://doi.org/10.1109/NaNA.2016.49", "year": "2016", "author": {"Tao Li": "75/4601", "Jingyu Wang 0001": "37/2749-1", "Wei Li": "64/6025", "Tong Xu 0002": "70/6770-2", "Qi Qi 0001": "80/6406-1"}, "abstract": " Abstract:It is vital to cloud computing that the elastic control technology can dynamically adjust resources on demand by changing the size or number of virtual machines. It will improve the utilization and realize the cost savings. However, there are still some shortcomings for elastically scaling technology. On the one hand, the elastic scaling of resources will take some time, so changing resource requirements can not be responded timely. On the other hand, whenever the resources do not meet the demand, it can not properly allocate resources based on the size of demand. Therefore, this paper proposes an algorithm about automatic scaling of resources based on load prediction. By using the algorithm combining linear regression and the improved Knuth-Morris-Pratt match to predict the next moment load, complete automatic extension before the changes in resource requirements and reduce resource adjustment time. In addition, according to the results, integer programming algorithm is used for solving specific resource expansion. The experiment results indicated that the proposed method can increase resource utilization and reduce cost of cloud computing resources while meeting the changing demand."}, "conf/giis/ZhangLWQXTL13": {"title": "Diversified SLT codes based on feedback for communication over wireless networks.", "url": "https://doi.org/10.1109/GIIS.2013.6684363", "year": "2013", "author": {"Lei Zhang 0094": "97/8704-94", "Jianxin Liao": "60/4951", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Tong Xu 0002": "70/6770-2", "Shengwen Tian": "42/2738", "Minyan Liao": "130/3902"}, "abstract": " Abstract:Fountain codes, such as LT (Luby transform) codes have been practical techniques for communication over wireless networks. RSD (Robust Soliton degree Distribution) is a key component of LT codes. However, LT codes do not make use of feedback. SLT (Shifted LT) codes have shown benefit by shifting RSD based on the number of recovered input symbols. However, degree values are limited to a small set. In this paper, DSLT (Diversified SLT) codes with a new degree distribution are proposed to explore the full potential of feedback. DSLT codes modify the RSD of LT codes in a different manner. They diversify the value of degree compared with SLT codes. Furthermore, hybrid SLT/DSLT codes were proposed to address the problem that most input symbols are recovered at the ending. We show both analytically and through real experiments, that DSLT codes have better performance in term of communication complexity and memory usage compared with SLT codes."}, "conf/icmlc/LiaoZWLQX13": {"title": "Security and efficient data dissemination over wireless sensor network with raptor codes.", "url": "https://doi.org/10.1109/ICMLC.2013.6890856", "year": "2013", "author": {"Jianxin Liao": "60/4951", "Lei Zhang 0094": "97/8704-94", "Jingyu Wang 0001": "37/2749-1", "Minyan Liao": "130/3902", "Qi Qi 0001": "80/6406-1", "Tong Xu 0002": "70/6770-2"}, "abstract": " Abstract:Security and efficient data dissemination over wireless network has been the focus of research in academic, military and commercial domains for many years. Unfortunately, proposed security solutions for data dissemination over wireless network are not efficient enough. In this work, a novel security and efficient data dissemination scheme which integrates authentication into a SE-Raptor (security enhanced Raptor) codes is investigated. In SE-Raptor codes, encoding packets with degree one are encoded again, and many promiscuous packets are took part in encoding. Simulation results show that the proposed method has better performance in terms of encoding ratio, degree ratio, encoding and decoding efficiency. Additionally, our analysis shows that data confidentiality, bogus data protection and deny of service properties are provided by the proposed scheme."}, "conf/globecom/QingQWXL12": {"title": "Topology-aware virtual network embedding through bayesian network analysis.", "url": "https://doi.org/10.1109/GLOCOM.2012.6503512", "year": "2012", "author": {"Sude Qing": "122/5072", "Qi Qi 0001": "80/6406-1", "Jingyu Wang 0001": "37/2749-1", "Tong Xu 0002": "70/6770-2", "Jianxin Liao": "60/4951"}, "abstract": " Abstract:Multiple heterogenous virtual networks are given the ability to run on a shared infrastructure simultaneously as independent slices in the network virtualization environment. However, a major challenge is how to map multiple virtual networks, with specific node and link constraints, onto the shared substrate network, known as virtual network embedding problem. By taking topology attribute into account, topology-aware virtual network embedding algorithms efficiently improve the performance by leveraging a node ranking method based on Markov chain. However, as the basis of node ranking, the resource evaluation of node which is calculated as the product of its CPU and bandwidth may be incorrect. Moreover, a greedy matching strategy is always applied in the node mapping stage, which may lead to unnecessary bandwidth consumption by ignoring the relationships between the mapped substrate nodes and the mapping one. In this paper, we re-think the topology-aware virtual network embedding from a statistical perspective by proposing a statistical method to generate a dependency matrix representing the importance of every node and the relationships between every two nodes in the substrate network. Based on this dependency matrix, bayesian network analysis is leveraged to iteratively select the substrate node, with the closest relationship to the selected ones, to achieve node mapping process. Extensive simulations were conducted and the results show that our proposed algorithm has better performance in the long-term run."}, "conf/icws/LiaoLZXWS12": {"title": "Ontology Alignment by Combining Lexical Analysis with Consequences from Reasoners.", "url": "https://doi.org/10.1109/ICWS.2012.57", "year": "2012", "author": {"Jianxin Liao": "60/4951", "Xiulei Liu": "23/10432", "Xiaomin Zhu 0002": "09/4144-2", "Tong Xu 0002": "70/6770-2", "Jingyu Wang 0001": "37/2749-1", "Haifeng Sun 0001": "00/11044-1"}, "abstract": " Abstract:Aligning different ontologies from similar (or same) domains is an active field of current research. There are various solutions which process and analyze lexical, structural or semantic information to align ontologies. However, there are few solutions that focus on interpreting the concepts that entities are presented with and using them in relation to the semantics implied in an ontology. In this paper, the prototype (OACLAI) is presented to tackle this by combining lexical analysis with consequences from reasoners which reflect the semantics implied in an ontology. We evaluate OACLAI over the four real ontologies and compare it against the seven solutions. The experiments show that the accuracy of OACLAI is higher than those of others on average."}, "conf/globecom/LiaoLZXW11": {"title": "Niching Particle Swarm Optimization Algorithm for Service Composition.", "url": "https://doi.org/10.1109/GLOCOM.2011.6133596", "year": "2011", "author": {"Jianxin Liao": "60/4951", "Yang Liu": "51/3710", "Xiaomin Zhu 0002": "09/4144-2", "Tong Xu 0002": "70/6770-2", "Jingyu Wang 0001": "37/2749-1"}, "abstract": " Abstract:Service composition constructs composite applications with different services to fulfill numerous service requirements. Different users have various QoS demands for composite services. In this paper, we present a service composition model considering not only multiple QoS constraints but also load balance factors. Moreover, a service selection algorithm based on niching technique and particle swarm optimization (PSO) is proposed for the service composition problem. It supports optimization problems with any kinds of constraints and objective functions. Simulation results show the proposed algorithm is effective and efficient for service composition under any circumstances."}, "journals/access/MemonWBFRXZ21": {"title": "Temperature and Reliability-Aware Routing Protocol for Wireless Body Area Networks.", "url": "https://doi.org/10.1109/ACCESS.2021.3117928", "year": "2021", "author": {"Saifullah Memon": "304/4023", "Jingyu Wang 0001": "37/2749-1", "Ali Raza Bhangwar": "195/3125", "Suliman Mohamed Fati": "143/9421", "Amjad Rehman": "99/7828", "Tong Xu 0002": "70/6770-2", "Lei Zhang 0094": "97/8704-94"}, "abstract": " Abstract:The Wireless Body Sensor Network (WBSN) can be envisioned as a cost-effective solution to provide monitoring and reporting services in medical and non-medical applications to improve quality of life. The dissemination of patient data in a timely and reliable manner is one of the necessities of healthcare applications of WBSN. The critical data packets are highly delay-sensitive. However, these packets reaching the destination beyond timelines undermine the benefit of such networks. To provide real-time health monitoring an adequate link (in terms of reliability, stability, and QoS) has to be maintained. However, the distinguishing characteristics of WBSN pose several challenges to be countered such as limited resources, transmission range, and unreliable wireless links in terms of QoS as low-power radios are sensitive to interference and noise. Consequently, some portions of the network experience a significant level of congestion thereby strain the communication links, available bandwidth, insufficient buffer space, increased number of collisions, packet losses, and transmission disruption. Therefore, importing QoS awareness in routing decisions is important to improve the performance of WBSN. This paper proposes a QoS-aware routing protocol named TLD-RP (Temperature, Link-reliable, and Delay-aware Routing Protocol) for WBSN. Most of the temperature-aware routing protocols proposed for the WBSN incorporate either single or composite routing metrics (temperature, hop count, or energy). However, optimized route discovery has been overlooked in most of the previous studies on QoS requirements such as link reliability, stability, and link delay. Keeping in view these limitations, the proposed TLD-RP makes use of a multi-facet composite routing metric by carefully considering the critical QoS requirements for the WBAN. The design of the proposed TLD-RP scheme centers on the link’s reliability, path delay, and link’s asymmetric property. These design factors enable the p..."}}}