{"id": "126/8068", "name": "Wen-Jun Hou", "Article": {"conf/hci/HouHLB21": {"title": "The Method of Mining the Relationship Between the Use of Architectural Elements in Buildings and Cultural Connotation It Reflects: Case of Beijing's Representative Buildings.", "url": "https://doi.org/10.1007/978-3-030-77411-0_6", "year": "2021", "author": {"Wen-jun Hou": "126/8068", "Qi-ying He": "297/3497", "Tong Li": "29/3826", "Bing Bai": "54/5260"}, "abstract": "Aiming at representative buildings in Beijing, to dig out the cultural factors reflected behind the use of architectural elements in buildings, a set of cultural calculation processes for data collection, quantitative modeling, and analysis have been completed. Firstly, organize and analyze Beijing buildings’ entities and relationships and the architectural elements they use and obtain related corpora. Secondly, use natural language processing methods to complete the structuring and vectorization of the corpus. Finally, combine the clustering algorithm results with the prior knowledge in the humanities field to produce conclusions. It concludes that the word vector cluster clustered by semantics can significantly represent the cultural source of the architectural elements in the corresponding category, so the application of the architectural elements to the elements can reflect the cultural connotations behind them.KeywordsArchitectural elementsCultural connotationWord vectorClusteringNatural language processing"}, "conf/hci/HouLY21": {"title": "A Questionnaire Data Clustering Method Based on Optimized K-Modes Algorithm.", "url": "https://doi.org/10.1007/978-3-030-77772-2_22", "year": "2021", "author": {"Wen-jun Hou": "126/8068", "Jia-xin Liu": "35/10143", "Xiang-yuan Yan": "269/9032"}, "abstract": "When conducting user research, questionnaires are often used to collect user characteristics, attitudes, and other information. Data cluster analysis is often used to divide user groups. The traditional clustering algorithms are mostly only suitable for numerical attributes or disordered categorical attributes. However, questionnaire data is mainly composed of disordered and ordinal categorical attributes. To solve the questionnaire data clustering problem, based on the traditional K-Modes algorithm, a method that combines subjective weighting and objective clustering for questionnaire data analysis is proposed. This method first performs multiple-choice clustering questions to reduce dimensionality and then re-weighting ordinal categorical attributes to rationalize the distance measurement. An optimized mixed K-Modes algorithm for questionnaire data clustering is proposed. The dissimilarity measure between objects according to the two types of disorder and ordinal categorical attributes. In order to evaluate the clustering results, an effective cluster validity index is also defined in this paper. Using a bank user survey questionnaire as a case proved the effectiveness of this data clustering method.KeywordsQuestionnaire data clusteringK-modes algorithmMixed categorical dataOrdinal categorical data weighting"}, "conf/ifip13/MiaoH21": {"title": "Research on the Integration of Human-Computer Interaction and Cognitive Neuroscience.", "url": "https://doi.org/10.1007/978-3-031-02904-2_3", "year": "2021", "author": {"Xiu Miao": "318/2270", "Wen-jun Hou": "126/8068"}, "abstract": "This paper aims at reviewing the development of the integration of Cognitive Neuroscience and Human-computer Interaction, and put forward the main directions of the development of Brain-computer Interaction in the future.Research status and application of Human-computer Interaction based on Cognitive Neuroscience were reviewed by desktop analysis and literature survey, combined with the new research trends of Brain-computer Interface according to domestic and foreign development. According to the brain signal acquisition method and application, the types of BCI are divided into (1) Passive brain-computer interface: exploring and modeling neural mechanisms related to human interaction and on that basis realizing iterative improvement of computer design. (2) Initiative brain-computer interface: direct interaction between brain signal and computer. Then the main development direction of Brain-computer Interface field in the future from three progressive levels are discussed: broadening existing interactive channels, improving the reliability of human-computer interaction system and improving the interaction experience. The deep integration and two-way promotion of Cognitive Neuroscience and Human-computer Interaction will usher in the era of Brain-computer Interface and the next generation of artificial intelligence after overcoming a series of problems such as scene mining, algorithm optimization and model generalization.KeywordsHuman-computer InteractionCognitive NeuroscienceEEGBrain-computer Interface"}, "conf/hci/HouYL20": {"title": "A Method for Quickly Establishing Personas.", "url": "https://doi.org/10.1007/978-3-030-50334-5_2", "year": "2020", "author": {"Wen-jun Hou": "126/8068", "Xiang-yuan Yan": "269/9032", "Jia-xin Liu": "35/10143"}, "abstract": "The use of personas can help teams better understand the characteristics of users, which leads to more accurately discovery the problems and real pain points that users face. At present, there are two main ways to establish personas. One is to generate personas qualitatively or quantitatively through interviews, questionnaires, etc. These processes are related to the experiences of analysts and the statistical methods used, usually resulting in different conclusions and spending much time. The other is that the technical teams directly obtain the users’ operation data on the products and use algorithm models to automatically generate personas. But this method is only suitable for mature products or existing functions, while the questionnaire method has nothing to do with mature products and functions. In this paper, we present persona segmentation through K-Means and PAM clustering algorithms in machine learning for questionnaire data, including mixed data, as an objective, quick, low-cost method for establishing personas. The method consists of four steps: first, design questionnaire. Second, transform the multi variables caused by multiple choice questions into a single variable. K-Means clustering algorithm is used for the continuous data of multi variables. The rule-based clustering method is used for the classified data. Then, cluster the processed data by PAM. The fourth step is to create personas, which are labeled in this paper. In the end, we demonstrate that the method is appropriate to create useful personas by machine evaluation and expert evaluation.KeywordsPersonasQuestionnaireClustering algorithmMachine learningLabel"}, "conf/hci/HouT20": {"title": "Contrast and Parameter Research of Augmented Reality Indoor Navigation Scheme.", "url": "https://doi.org/10.1007/978-3-030-49695-1_6", "year": "2020", "author": {"Wen-jun Hou": "126/8068", "Lixing Tang": "203/1985"}, "abstract": "\nWe are committed to using various indoor and outdoor images, 3D objects and static scenes as recognition objects to build an augmented reality world. This paper focuses on the research and application of indoor augmented reality navigation. Indoor navigation has a variety of technical solutions, such as Wi-Fi Based and indoor sensor based. As one of them, augmented reality has the advantages of no need to deploy additional hardware devices in advance, six degrees of freedom and high precision. By analyzing the development of augmented reality indoor navigation and the underlying technology, we summarize and implement three solutions: map based (MB), point-cloud based (PCB), image based (IB). We first conducted a control experiment, and compared these schemes with the flow theory and the experimental data. At the same time, we collected the feedback and suggestions during the experiment, and carried out a second experiment on some components of augmented reality navigation (such as path, point of interest), and obtained the corresponding quantitative data.\nKeywordsAugmented realityIndoor navigationUser experience"}, "conf/hci/XiWWQCH20": {"title": "Research on Cross-cultural Participatory Design by Design Teams Based on Chinese Cultural Background.", "url": "https://doi.org/10.1007/978-3-030-50341-3_18", "year": "2020", "author": {"Rui Xi": "122/9104", "Xin-Li Wei": "269/5921", "De-Chuan Wang": "269/7445", "Xiangang Qin": "70/4293", "Torkil Clemmensen": "59/2350", "Wen-Jun Hou": "126/8068"}, "abstract": "With the acceleration of globalization, the acculturation issue of design is becoming an emerging challenge. At the same time, as one of the several design patterns in service design, which is becoming a mainstream in design society, has been adopted by more and more designers in design practice. Based on the output of a design workshop on acculturation issue of design, we presented the process of and learnings from participatory design aiming at helping foreigners living in China to use WeChat. To that end, we described the practice, problems and achievements, lessons learned, and outlook into the future for design practice using participatory design to address the acculturation issue.\nKeywordsParticipatory designCross-cultural designWeChat redesign"}, "conf/hci/WeiXH20": {"title": "User-Centric AR Sceneized Gesture Interaction Design.", "url": "https://doi.org/10.1007/978-3-030-49695-1_24", "year": "2020", "author": {"Xin-Li Wei": "269/5921", "Rui Xi": "122/9104", "Wen-jun Hou": "126/8068"}, "abstract": "With the rapid development of AR technology, the interaction between humans and computers has become increasingly complex and frequent. However, many interactive technologies in AR currently do not have a very perfect interaction mode, and they are facing huge challenges in terms of design and technical implementation, including that AR gesture interaction methods have not yet been established. There is no universal gesture vocabulary in currently developed AR applications. Identifying appropriate gestures for aerial interaction is an important design decision based on criteria such as ease of learning, metaphors, memory, subjective fatigue, and effort [1]. It must be designed and confirmed in the early stages of system development, and will seriously affect each aerial application project development process as well as the intended user of the user experience (UX) [2]. Thanks to user-centric and user-defined role-playing method, this paper set up a suitable car simulation scenarios, allowing users to define the 3D space matches the information exchange system under AR design environment based on their habits and cultural backgrounds, in particular, It is a demanding gesture during the tour guide and proposes a mental model of gesture preference.KeywordsGesture interactionGuessabilityAR"}, "conf/hci/HouZWJ19": {"title": "Applicability Study of Eye Movement Menu based on Analytic Hierarchy Process.", "url": "https://doi.org/10.1007/978-3-030-22643-5_22", "year": "2019", "author": {"Wen-jun Hou": "126/8068", "Bo Zhang": "36/2259", "Si-qi Wu": "244/3940", "Zhi-yang Jiang": "244/4031"}, "abstract": "\nEye movement interaction is more natural and intelligent than traditional input by mouse and keyboard, and has a wide range of application scenarios. Menu, as an important user input and selection mechanism, designed and interacted with eye movement input modality can greatly improve user interaction efficiency. An eye movement menu usability evaluation index system based on analytic hierarchy process was proposed in this paper. In addition, combined with experiments and questionnaires, a quantitative and qualitative combination study on eye movement types (fisheye linear menu, marking menu) and eye movement selection mechanisms (time delay selection mechanism, select sub-selection reconfirmation mechanism) was conducted. The problems of easy fatigue and “Midas Touch” in eye movement interaction were also discussed in the paper. The conclusions reached at the end of this paper have a guiding role in the design and evaluation of the eye movement menu.KeywordsHuman-computer interactionEye control selectionMenu designAnalytic hierarchy process"}, "conf/hci/HouWCC19": {"title": "Study on Spatiotemporal Characteristics of Gaze Gesture Input.", "url": "https://doi.org/10.1007/978-3-030-22643-5_23", "year": "2019", "author": {"Wen-jun Hou": "126/8068", "Si-qi Wu": "244/3940", "Xiao-lin Chen": "28/10175", "Kai-xiang Chen": "222/8478"}, "abstract": "\nThe gaze gesture input has the advantages of high bandwidth, high efficiency, no misoperation and high customization, but it also has the disadvantages of high cognitive load and high fatigue degree. At present, few researches have thoroughly explored the regularity of gaze gesture input, which cause designers lack of design guidance, and it is difficult to reasonably apply gaze gesture input in interaction. This paper focuses on the study of the spatiotemporal features of the gaze gesture input. An experiment was designed so that the input region size, the feedforward type and the input gesture shape were within-subject experimental variables. By analyzing 1200 trajectory data of gaze gestures to exploring the effects of these three variables on the performance of and the subjective satisfaction of the gaze gesture input, the details of the three major characteristics of gaze gesture-based interaction were summarized, which are the input continuity, the implicit interaction and the real-time feedback. These may provide design guidance for gaze gesture interaction designers.KeywordsEye movement-based interactionGaze gesture inputSpatiotemporal featureFeedforward"}, "conf/hci/WuHY19": {"title": "Research on Factors Affecting Behavior of Taking Selfies in China Based on Logistic Regression Analysis.", "url": "https://doi.org/10.1007/978-3-030-23535-2_44", "year": "2019", "author": {"Si-qi Wu": "244/3940", "Wen-jun Hou": "126/8068", "Meng-yun Yue": "244/8286"}, "abstract": "With the popularity of smartphones and photo-based social networking sites, taking selfies have become a trend among young people. A number of camera apps developed by third-party with face-beauty feature have become popular in China and original camera apps (developed by phone manufacturer) such as HUAWEI have also added face-beauty feature. However, smartphones such as iPhone without face-beauty feature are criticized by the majority of Chinese users. At present, there is little research on the design of original camera apps. In this paper, behavior of taking selfies of Chinese users were focused. An online questionnaire was used to investigate Chinese behavior of taking selfies and the design of face-beauty feature in original camera apps. The analysis of variance and Ordinal Logistic Regression analysis were used as the primary method of data analysis. This study concluded the factors affecting the user’s frequency of taking selfies, high-frequency scenes of taking selfies, the relationship between face-beauty feature and recognition of taking selfies, the function usage of original camera apps and third-party camera apps, as well as the influence of face-beauty feature on taking selfies. It can help to design the functions of original cameras of foreign smartphone brands entering the Chinese market to a certain extent.KeywordsBehavior of taking selfiesLogistic regressionFace-beauty feature"}, "conf/hci/HouC18": {"title": "Application of Logistic Regression Analysis of Smartphone Speech Interaction Usage in China: A Questionnaire-Based Study of 622 Adults.", "url": "https://doi.org/10.1007/978-3-319-91250-9_11", "year": "2018", "author": {"Wen-jun Hou": "126/8068", "Xiao-lin Chen": "28/10175"}, "abstract": "Speech interaction as one of the contact-free input techniques has been applied in mobile devices (e.g. smartphone) for many years, which means that a considerable number of users were exposed to speech interaction. In China, speech interaction, while undoubtedly natural, has also entered users’ life for more than 5 years but it is still perceived as “not that good”. Curiosities are stimulated that what barriers are that prevent speech from becoming one of the mainstream interaction modality in China, yet there is no research on the user experience of mobile speech interaction. An online questionnaire was used to measure participants’ speech interaction use of smartphone. Simple Logistic Regression Model and Ordinal Logistic Regression Model were used as the primary method of data analysis. This study concluded that speech interaction is an interactive modality for the future and need to give full play to the advantages of speech interaction by reducing interface exclusivity, offering services to users actively in combination with situational awareness and guiding users in a variety of modalities.KeywordsSpeech interactionQuestionnaire-basedLogistic regression analysis"}, "conf/hci/HouWC17": {"title": "The Research of Wearable Device User Fatigue Based on Gesture Interaction.", "url": "https://doi.org/10.1007/978-3-319-58077-7_14", "year": "2017", "author": {"Wen-jun Hou": "126/8068", "Chun-jing Wu": "201/9969", "Xiao-lin Chen": "28/10175"}, "abstract": "In this paper, in order to study the user fatigue of gesture interaction of wearable device, we combine Surface electromyography (sEGM) and the subjective fatigue evaluation of users to evaluate the fatigue degree of the basic interactive gestures of the left arm. By analyzing the normalized date of the sEMG in time domain, we featured the EMG discharge. We also find that the operation of information content has lower physical fatigue compared with the operation of physical device and layer structure. And because of the asymmetry of gesture, gesture of different direction has different fatigue even they belong to same type. And we build a model by combining sEMG and the subjective fatigue feeling evaluation of users to mapping the relationship between the objective energy expenditure and subjective fatigue. The result of this experiment provides basis and measures for fatigue detection, mission planning and the design of gesture interaction.KeywordsHand gestureWearable deviceFatigue evaluation"}, "conf/icpca/ZhangH12": {"title": "Research and Analysis of Method of Ranking Micro-blog Search Results Based on Binary Logistic Model.", "url": "https://doi.org/10.1007/978-3-642-37015-1_72", "year": "2012", "author": {"Jing Zhang": "05/3499", "Wen-jun Hou": "126/8068"}, "abstract": "Ranking results in micro-blog search as user’s interests is challenging because of the special form of micro-blog search results. To attempt to solve the problem, in this paper, we summarize the characteristics of micro-blog search results, propose a method using a sort of decision model- binary logistic model, test the confidence level of the model and estimate the weight of the variable in the model collecting the real samples. The result shows the relation between user’s decision and the factors from each individual micro-blog search result as well as the feasibility of ranking using the model. We also analyze the model.Keywordsmicro-blog searchbinary logistic modelrankingutility"}, "journals/corr/abs-2205-04121": {"title": "Identifying Fixation and Saccades in Virtual Reality.", "url": "https://doi.org/10.48550/arXiv.2205.04121", "year": "2022", "author": {"Xiao-lin Chen": "28/10175", "Wen-jun Hou": "126/8068"}, "abstract": "\n      Abstract:  Gaze recognition can significantly reduce the amount of eye movement data for\na better understanding of cognitive and visual processing. Gaze recognition is\nan essential precondition for eye-based interaction applications in virtual\nreality. However, the three-dimensional characteristics of virtual reality\nenvironments also pose new challenges to existing recognition algorithms. Based\non seven evaluation metrics and the Overall score (the mean of the seven\nnormalized metric values), we obtain optimal parameters of three existing\nrecognition algorithms (Velocity-Threshold Identification, Dispersion-Threshold\nIdentification, and Velocity & Dispersion-Threshold Identification) and our\nmodified Velocity & Dispersion-Threshold Identification algorithm. We compare\nthe performance of these four algorithms with optimal parameters. The results\nshow that our modified Velocity & Dispersion-Threshold Identification performs\nthe best. The impact of interface complexity on classification results is also\npreliminarily explored. The results show that the algorithms are not sensitive\nto interface complexity.\n\n    "}, "journals/ijhci/HouC21": {"title": "Comparison of Eye-Based and Controller-Based Selection in Virtual Reality.", "url": "https://doi.org/10.1080/10447318.2020.1826190", "year": "2021", "author": {"Wen-jun Hou": "126/8068", "Xiao-lin Chen": "28/10175"}, "abstract": ""}}}