{"id": "86/3126", "name": "Wenan Zhou", "Article": {"conf/qrs/LuLHZ21": {"title": "A code clone detection algorithm based on graph convolution network with AST tree edge.", "url": "https://doi.org/10.1109/QRS-C55045.2021.00156", "year": "2021", "author": {"Zhicheng Lu": "189/8748", "Ruochen Li": "191/6092", "Huamiao Hu": "164/9016", "Wen'an Zhou": "86/3126"}, "abstract": " Abstract:Detecting code cloning will prevent it from bringing risks such as vulnerabilities and intellectual property disputes in complex software systems such as large-scale defense software systems and commercial software systems. In the field of deep code clone detection, neural networks such as Tree-CNN and Tree-LSTM, which extract features from AST (abstract syntax tree), can't collect global information of upper and lower nodes, and information can't flow globally, but graph neural network can avoid this problem. This paper presents a method of edging AST, and uses GCN (Graph Convolutional Network) and GAT(Graph Attention Networks) to extract code feature vector. Finally, the experiment is carried out on BigCloneBench data set, using several common binary classification indexes, and analyzing the time consumption, it is concluded that the effect and time efficiency of using graph neural network for code clone detection are significantly improved, especially for the code fragments with completely different semantics."}, "conf/globecom/ZhangLZ20": {"title": "ACB scheme based on reinforcement learning in M2M communication.", "url": "https://doi.org/10.1109/GLOBECOM42002.2020.9322144", "year": "2020", "author": {"Dong Zhang": "68/3245", "Jianlong Liu": "195/1689", "Wen'an Zhou": "86/3126"}, "abstract": " Abstract:Machine-to-machine (M2M) communication is a networked application and service taking the intelligent interaction of machine terminals as the core. However, the existing access control scheme cannot adapt to the rapidly changing access conditions during the long-term evolution process, resulting in a sharp decline in the success rate of massive M2M devices including delay tolerant devices (DTDs) and delay sensitive devices (DSDs). Quality of Experience (QoE) refers to the subjective experience of the quality and performance of devices, networks and systems, applications or services. In this paper, QoE with delay mapping is used as the simulation target. To solve the problem of adaptability, the paper proposes a access class barring (ACB) scheme based on reinforcement learning, which can be recorded as RL-ACB. The DTD, DSD barring factors and DSD scaling factor were adjusted to ensure the random access of massive M2M devices including DTDs and DSDs, and reduce the delay as much as possible. The simulation results verify the effectiveness of the scheme."}, "conf/vtc/BiZ20": {"title": "Deep Reinforcement Learning Based Power Allocation for D2D Network.", "url": "https://doi.org/10.1109/VTC2020-Spring48590.2020.9129537", "year": "2020", "author": {"Zhengran Bi": "269/7698", "Wenan Zhou": "86/3126"}, "abstract": " Abstract:In device-to-device (D2D) networks, when D2D communication shares cellular network spectrum resources, it will cause serious co-channel interference. The problem of solving interference is complicated because of the large number of D2D users and the fading of the wireless channel. Aiming at this problem, this paper proposes a centralized Deep Reinforcement Learning (DRL) algorithm to solve the power allocation problem of D2D communication in time-varying environment. The algorithm regards D2D network as a multi-agent system, and represents the channel as a Finite State Markov Channel (FSMC). In particular, the method obtains power control by maximizing system capacity and user experience quality, respectively, while considering actual time-varying channels and D2D interference. Our results indicate that the proposed method outperforms the conventional reinforcement learning methods in terms of system throughput and user experience quality."}, "conf/iconip/XuZX19a": {"title": "Super-Resolution Network for General Static Degradation Model.", "url": "https://doi.org/10.1007/978-3-030-36711-4_3", "year": "2019", "author": {"Yingjie Xu": "29/11053", "Wenan Zhou": "86/3126", "Ying Xing": "79/5063"}, "abstract": "Recent research on single image super-resolution (SISR) has made some progress. However, most previous SISR methods simply assume that a low-resolution (LR) image is bicubicly downsampled from a high-resolution (HR) image. when the LR images don’t follow this assumption, these previous methods will generate poor HR images that still retain the blur and noise information. To solve this problem, we propose the super-resolution network for general static degradation model (SR-GSD). Specifically, we propose degradation factors proposal Network (DFPN) which can automatically identify blur kernel and noise level, and furthermore, we utilize predicted degradation factors and the LR images to reconstruct the HR images in a high-resolution reconstruction network (HRN). Moreover, to simplify the training process, we unify the two-stages steps into a neural network and jointly optimize it through a multi-task loss function. Extensive experiments show that our SR-GSD can achieve satisfactory results on the general static degradation model.KeywordsSuper-resolutionDeep learningMulti-task learning"}, "conf/im/ZhangZL19": {"title": "Mining And Application of User Behavior Pattern Based on Operation And Maintenance Data.", "url": "https://ieeexplore.ieee.org/document/8717841", "year": "2019", "author": {"Wenji Zhang": "54/5451", "Wenan Zhou": "86/3126", "Jun Luo": "42/2501"}, "abstract": " Abstract:In order to provide users with personalized services, or to implement user-centric management, operators usually need to collect various information of users. However, in an actual network scenario, such information is often difficult to obtain accurately due to reasons such as protecting user privacy and avoiding interference with the user experience process. Common methods such as setting up a laboratory network environment, implementing user research, etc., are difficult to implement in the live network. Through the service log of the network device interface, this paper extracts a variety of data related to the user's network behavior, and proposes a comprehensive multi-dimensional data user behavior expression method, which is transformed into the expression of user behavior, including time, space and behavior semantics. For the user's daily network behavior, we propose a user behavior symbolization method for different application scenarios, and propose a user behavior pattern mining method based on PrefixSpan to mine the user behavior sequence pattern after symbolization. This method can mine the patterns of user behavior and behavior from the data, and provide the basis for personalized service and management. We used the http connection log of all mobile users of a carrier in a city for one day to conduct our experiments."}, "conf/bigcomp/GaoZH18": {"title": "A QoE Estimation Model Considering Video Popularity for Video Streaming Services.", "url": "https://doi.org/10.1109/BigComp.2018.00059", "year": "2018", "author": {"Mengyu Gao": "202/3927", "Wenan Zhou": "86/3126", "Zheng Hu": "04/1729"}, "abstract": " Abstract:With the increasing demand of keeping competitive force for video streaming service provider, the user-oriented QoE evaluation is significant to be optimized. In previous work, those user-centric QoE evaluation methods depend on user perception collection which are generally based on subjective feedbacks which causes the impracticality of evaluation model. In this paper, a QoE estimated model considering video popularity is proposed. The model substitutes the user preference by the mapping relationship between video popularity and user preference so that the service provider can estimate user perceived QoE with objective video information. The mapping relationship between video popularity and user preference is explored by analysis of uncertainty of user prefenrece for different popularity degree. Then, a crowdsourcing-based experiment is conducted to collect data for QoE model regression and verification. With data analysis, a QoE model based on video popularity is developed and the correlation coefficient shows the well estimation on QoE."}, "conf/cisis/LuoZZZD18": {"title": "A User-Centric Wireless Networks' Optimization Method for Data Service.", "url": "https://doi.org/10.1007/978-3-319-93659-8_19", "year": "2018", "author": {"Jun Luo": "42/2501", "Wenan Zhou": "86/3126", "Wenji Zhang": "54/5451", "Qiang Zhou": "43/3182", "Yu Du": "27/6228"}, "abstract": "The optimization method based on traditional KPI statistics can’t effectively meet the goal of improving user experience of quality (QoE). Based on QoE, this paper presents a kind of user-centric wireless networks optimization method that includes a users’ QoE evaluation model and a locating the network problems method for data service. We propose a novel way of data analysis to build users’ QoE evaluation model to allow operators to monitor users experience quality. Based on the technology of data fusion, we exploit a data mining algorithm for diging out the problems leading poor users’ QoE and the corresponding probability from multisource data. Consequently, the operators can not only real-time monitor the entire network users’ QoE and actively identify the wireless network problems, but also obtain reference guidance for the network optimization staff by utilizing the method. Obviously, this method ensures users’ QoE and helps saving a large amount of manpower in networks optimization.KeywordsNetwork Optimization MethodsWireless Network ProblemsPoor UserMultisource DataCommon Data ServiceThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/ica3pp/LuoZD18": {"title": "An Active Learning Based on Uncertainty and Density Method for Positive and Unlabeled Data.", "url": "https://doi.org/10.1007/978-3-030-05051-1_16", "year": "2018", "author": {"Jun Luo": "42/2501", "Wenan Zhou": "86/3126", "Yu Du": "27/6228"}, "abstract": "Active learning can select most informative unlabeled samples to manually annotate to enlarge the training set. Many active learning methods have been proposed so far, most of them work for these data that have all classes of tagged data. A few methods work for positive and unlabeled data and the computational complexity of existing methods is particularly high and they can’t work well for big data. In this paper, we proposed an active learning approach that works well when only small number positive data are available in big data. We utilize data preprocessing to remove most of the outliers, so the density calculation is simplified relative to KNN algorithm, and our proposed sample selection strategy Min-Uncertainty Density (MDD) can help select more uncertain and higher density unlabeled samples with less computation. A combined semi-supervised learning active learning technique (MDD-SSAL) automatically annotating some confident unlabeled samples in the each iteration is proposed to reduce the number of manually annotated samples. Experimental results indicate that our proposed method is competitive with other similar methods.KeywordsActive learningPositive and unlabeled dataSemi-supervised learningBig data"}, "conf/bwcca/LiZLL17": {"title": "A Hybrid-Distributed Base Station Wake-up Algorithm in Dense Heterogeneous Cellular Networks.", "url": "https://doi.org/10.1007/978-3-319-69811-3_32", "year": "2017", "author": {"Da Li": "43/4804", "Wen'an Zhou": "86/3126", "Jianlong Liu": "195/1689", "Bingqian Li": "202/3855"}, "abstract": "Sleep mode techniques for small base stations bring benefits to improving the energy efficiency of Dense Heterogeneous Cellular Network. However, in the traditional sleep mode algorithms, it’s hard to wake up sleeping base station accurately. In this paper, we proposed a Hybrid-Distributed base station Wake-up Algorithm (HDWA), which wakes up sleeping base station using macro-assisted and adjacent-assisted methods based on Cluster Technology. In the face of complex changes in the network environment, the proposed algorithm save system energy while ensuring users’ Quality of Service. The simulation results show that HDWA can improve the energy efficiency effectively while maintaining the average throughput compared with the baseline algorithms.\nKeywordsSmall Base Stations (SBSs)Sleep Mode AlgorithmMacro Base Station (MBS)Signal-to-interference-plus-noise Ratio (SINR)System Power ConsumptionThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/imis/GaoZHZ17": {"title": "A Prospect of Interdisciplinary Methodology of QoE Assessment.", "url": "https://doi.org/10.1007/978-3-319-61542-4_35", "year": "2017", "author": {"Mengyu Gao": "202/3927", "Wenan Zhou": "86/3126", "Zheng Hu": "04/1729", "Wenji Zhang": "54/5451"}, "abstract": "With the development of streaming media service, Quality of Experience (QoE) has become the key competency for those content providers to attract customers. Many researches on QoE assessment have been conducted, but most of them had problems that those subjective experiments are difficult to be regulated and the data is not collected uniformly because of long tail effect. The purpose of this paper is to give a review of QoE assessment, which includes the concept of QoE, the influential factors, the approaches of experiment and QoE analysis and evaluation. Through the survey which shows the development of the QoE assessment, this paper indicates the future trends and challenges. Based on such current challenges and future analysis, an experiment-oriented methodology of QoE assessment is raised by conceptual model description. Also, those technologies which are based on different subjects including communication study and psychology study for supporting the methodology are described. The problems of small data volume, long tail phenomenon in QoE experiments and influence of malicious feedback will be solved by implementation of the personal QoE assessment methodology.\nKeywordsStreaming Media ServerTail PhenomenonMalicious FeedbackConceptual Model DescriptionTail EventsThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/imis/LiZY17": {"title": "A Macro-Assisted Cooperative Edge Caching in Heterogeneous Mobile Networks.", "url": "https://doi.org/10.1007/978-3-319-61542-4_36", "year": "2017", "author": {"Bingqian Li": "202/3855", "Wenan Zhou": "86/3126", "Xuhui Yang": "162/1101"}, "abstract": "\nCaching at mobile edge network is considered as a promising solution, which can not only reduce the network traffic, but also alleviate the backhaul load and improve the quality of service. But most existing caching schemes do not well solve the problem of small cache size and the difficulty to predict content popularity in mobile edge network. In this paper, we propose a macro-assisted cooperative edge caching (MACEC) scheme, which contains a macro base station (MBS) and multiple small base stations (SBSs) within the coverage of the MBS. In addition, we also propose an URL Prefix Weight (URL-PW) Based caching strategy. The simulation results demonstrate that, compared with the distributed edge caching (DEC) scheme using the LRU strategy, the MACEC scheme using the URL-PW strategy can effectively improve the cache hit rate at least by 30%.KeywordsEdge CachingHeterogeneous Mobile NetworksSmall Base Stations (SBSs)Macro Base Station (MBS)Backhaul LoadThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/spaccs/TianZL17": {"title": "Security Review and Study of DoS Attack on DNS in the International Roaming EPC_LTE Network.", "url": "https://doi.org/10.1007/978-3-319-72395-2_7", "year": "2017", "author": {"Ya'nan Tian": "210/8421", "Wen'an Zhou": "86/3126", "Wenlong Liu": "06/5340"}, "abstract": "The communication standard Long Term Evolution (LTE) developed by 3GPP is becoming the mainstream technology of the next generation mobile communication, the new features meet the business needs and improve the user experience, but also bring some security threats. In this paper, we introduce the LTE roaming architecture, the attach procedure and the DNS resolution procedure. Then we analyze that MME initiate the DNS request before the authentication is completed based on the procedures and OpenAirInterface (OAI) code, which will lead to a large load on DNS server, this scheme is very vulnerable to DoS/DDoS attacks on DNS server. Finally, according to the characteristics of LTE, we propose a enhancement scheme in MME and analyze the feasibility.KeywordsLTEDNSDoS/DDoSOAI"}, "conf/bwcca/SongZHG16": {"title": "Load-aware ACB Scheme for M2M Traffic in LTE-A Networks.", "url": "https://doi.org/10.1007/978-3-319-49106-6_7", "year": "2016", "author": {"Lijun Song": "02/2800", "Wenan Zhou": "86/3126", "Yanjun Hou": "177/1385", "Mengyu Gao": "202/3927"}, "abstract": "It’s a primary challenge to support massive machine-type devices to access in LTE-A networks. Surging random access attempts will result in severe congestion to the network. Access Class Barring (ACB) scheme is a critical barring scheme proposed by 3GPP to control access attempts to alleviate the overload for the LTE-A networks. Most existing ACB schemes just consider the ideal case and ignore the effects of radio channels while setting the ACB factors. In this paper, we propose a load-aware Access Class Barring (ACB) scheme to predict access load and adjust the barring factor dynamically, which take into account the effects of radio channels. We improve two load prediction methods. Based on the prediction, we propose a method to adjust the barring factor as the predicted traffic load varies. The simulations results demonstrate that our proposed load-aware scheme efficiently outperforms the traditional ACB scheme in access success performance."}, "conf/bwcca/YangZL16": {"title": "An Energy-Efficient Macro-assisted Sleep-Mode Scheme in Heterogeneous Networks.", "url": "https://doi.org/10.1007/978-3-319-49106-6_8", "year": "2016", "author": {"Xuhui Yang": "162/1101", "Wenan Zhou": "86/3126", "Da Li": "43/4804"}, "abstract": "Ultra-dense small cell deployment is seen as a necessary means to address the explosive mobile traffic growth in the near future. However, a large-scale small cell deployment can substantially increase the network energy consumption with strong ecological and economic implications. In this article, we introduce an energy-efficient macro assisted sleep mode scheme in heterogeneous networks to reduce cellular networks’ power consumption. The designed scheme takes into account that (i) macro base station’s power consumption is varying with the load, (ii) macro starts a UE-small cell connection procedure as soon as a connected UE is required to start receiving data is potentially suboptimal in terms of energy consumption. Furthermore, we present the procedures of the proposed macro assisted sleep mode scheme. By our calculation and analysis, our scheme can yield a further 5% energy savings with respect to the amount of energy savings obtained with existing schemes.KeywordsEnergy SavingTraffic LoadHeterogeneous NetworkSleep ModeMacro CellThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/bwcca/HouZSG16": {"title": "A QoE Estimation Model for Video Streaming over 5G Millimeter Wave Network.", "url": "https://doi.org/10.1007/978-3-319-49106-6_9", "year": "2016", "author": {"Yanjun Hou": "177/1385", "Wenan Zhou": "86/3126", "Lijun Song": "02/2800", "Mengyu Gao": "202/3927"}, "abstract": "With the rapid development of mobile communication, human’s demand for communication capacity increasing, a fifth-generation communications network (5G) have gained popularity because of enormous amount of spectrum in the millimeter wave (mmWave) bands. The 5G network is not only to provide people with more high data transfer rates and lower latency, but also to provide users with more meaningful and personalized service based on the users and their understanding of the service required. Nowadays, video streaming service plays an increasing important role in human’s daily life. However, the existing video streaming service application scenarios are mostly in Long Term Evolution network (LTE) and wireless network, there are few articles about studying video streaming service quality evaluation method in 5G network, so we conduct a study on the quality of experience (QoE) of video streaming service under 5G mmWave network scenario with NS-3. Under this scenario, video streaming system is created. By obtaining the quality of service (QoS) parameters of the network scenario, the non-linear regression function is used to predict the QoE of our video streaming service. The fit coefficient of the result shows that our model is powerful.KeywordsPacket LossVideo StreamingMean Opinion ScoreOFDM SymbolMobile TrafficThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/imis/LiZYD16": {"title": "An Intra-Cluster CoMP Based Sleep-Mode Scheme in Dense Heterogeneous Network.", "url": "https://doi.org/10.1109/IMIS.2016.57", "year": "2016", "author": {"Da Li": "43/4804", "Wenan Zhou": "86/3126", "Xuhui Yang": "162/1101", "Haitao Du": "47/4818"}, "abstract": " Abstract:Dense Heterogeneous Network is one of the key features of 5G. The base station sleep technology has become the focus of attention in mobile communication for its good performance in energy efficiency. In this paper, we propose an Intra-Cluster CoMP based Sleep-mode Scheme (ICCSS) which further improves the energy efficiency in Dense Heterogeneous Network. First, we divide dense small cells into different clusters. Then we introduce a greedy algorithm to optimize the original problem with rapid iteration and formulate a sleep scheme for intra-cluster base station. After that, a system-level simulation shows that ICCSS can improve system energy efficiency by 24.5%."}, "conf/bwcca/YuZTH15": {"title": "Modeling for Short-Form HTTP Adaptive Streaming Considering Memory Effect.", "url": "https://doi.org/10.1109/BWCCA.2015.25", "year": "2015", "author": {"Shipeng Yu": "y/ShipengYu", "Wenan Zhou": "86/3126", "Ran Tao": "99/955", "Yanjun Hou": "177/1385"}, "abstract": " Abstract:With the rapid development of Information and Communication Technology, mobile HTTP adaptive streaming (HAS) technologies have gained popularity. Thusly, the ability to evaluate users' Quality of Experience (QoE) is important. However, changing the transmitted video quality as employed by HAS poses more psychological impact like memory effect on subjectively perceived video quality and modeling HAS QoE considering memory effect is still a challenge. In this paper, we propose a QoE model for short-form HAS video considering memory effect. In order to assess the effect that each segment has in the overall video quality, a subjective online test based on the wisdom of the crowds is conducted. The result shows primacy effect is more obvious than recency effect in short-form videos. The proposed method is validated by plenty subjective tests and the simulation results show that our QoE model for short-form video is powerful."}, "conf/imis/TaoZYH15": {"title": "Passive Storage Based Wireless Network Resource Management for 4G LTE.", "url": "https://doi.org/10.1109/IMIS.2015.41", "year": "2015", "author": {"Ran Tao": "99/955", "Wenan Zhou": "86/3126", "Xuhui Yang": "162/1101", "Guanglin Han": "155/5186"}, "abstract": " Abstract:With the development of the wireless network technology and the smart mobile terminals, some new types of OTT services emerged. These OTT services have high data volume, requires many wireless radio resouces to transmit, which caused the network to be heavily loaded and unable to guarantee the QoE for other services. In order to meet the challenge, we proposed Passive Storage Based Wireless Network Resource Management architecture in the paper. This architecture makes use of the QoE properties of the new services types and balance the network load through time domain by storing the service data and transmit them to the UEs during the low load periods. As a result, the network load caused by the new OTT services is averaged though the time dimension and therefore relived the pressure the OTT services brought to the network. By our calculation and analysis, after implement the architecture, we could balance network load through time dimension as well as increase network capacity. What's more, with the development and the growth of new types of OTT services, the architecture could benefit the network even more."}, "conf/3pgcic/XiaoZCL14": {"title": "An Enhancement for Key Management in LTE/SAE X2 Handover Based on Ciphering Key Parameters.", "url": "https://doi.org/10.1109/3PGCIC.2014.73", "year": "2014", "author": {"Qinshu Xiao": "158/3455", "Wenan Zhou": "86/3126", "Baojiang Cui": "22/1154", "Lingrong Li": "158/3444"}, "abstract": " Abstract:The security of handover key management in Long Term Evolution (LTE) /System Architecture Evolution (SAE) has been a popular topic in recent years. In this paper we first describe the security architecture and key hierarchy of LTE/SAE, clarifying security requirements of key management in handover. Next, we analyze security of key management in X2 handover (intra-MME handover), and point out the current key management mechanism in X2 handover only satisfy two-hops forward security and one-hop backward security, but not one-hop security. And then, aimed at the security vulnerability of lacking one-hop forward security in current X2 handover key management, we proposed a new scheme for key management in X2 handover based on ciphering some key parameters with the local master root key. At last, the proposed new scheme is analyzed under three adversary models. The analysis shows that one-hop forward security and one-hop backward security could be maintained in our new proposal."}, "conf/3pgcic/QiangZCN14": {"title": "Security Analysis of TAU Procedure in LTE Network.", "url": "https://doi.org/10.1109/3PGCIC.2014.124", "year": "2014", "author": {"Li Qiang": "69/5366", "Wenan Zhou": "86/3126", "Baojiang Cui": "22/1154", "Liu Na": "82/385"}, "abstract": " Abstract:LTE has become a commercial communication technology worldwide, and its security issues are attracting more and more attention. Tracking Area Update (TAU) is a series of procedures performed by LTE system when users update Tracking Area (TA). The security of TAU procedure directly affects the whole system. This paper first analyzes the security of LTE core networks when the TA updates, then it puts forward a security enhancement scheme by borrowing the thoughts of denial of service (DoS). Therefore, it is important to protect Serving Gateway from overload problems. The proposed scheme is simple, and it also can prevent Serving Gateway from being attacked by malicious requests."}, "conf/bwcca/HuangZD14": {"title": "Research on the User Behavior-Based QoE Evaluation Method for HTTP Mobile Streaming.", "url": "https://doi.org/10.1109/BWCCA.2014.69", "year": "2014", "author": {"Yajun Huang": "157/4739", "Wenan Zhou": "86/3126", "Yu Du": "27/6228"}, "abstract": " Abstract:With the development of mobile network technology, HTTP mobile steaming is deployed by most of the video websites. Thus a lot of research works have been done on the Quality of experience (QoE) evaluation for HTTP mobile streaming. However, in most of them, only the factors in the network layer was considered, and the important information about user dissatisfaction with the video quality may be ignored. In this paper, we have made a survey to analyze the relationship between user satisfaction and user behaviors while a HTTP video is viewed, and we find that user behaviors will affect their QoE evaluation. Base on the findings, we propose a novel QoE evaluation method for HTTP mobile streaming which is based on user behaviors. The method combines user QoE with user expectations and moods inferred by user behaviors. In addition, not only the video fluency but also video clarity is considered in our work."}, "conf/bwcca/DuZLS14": {"title": "An Optimized Resource Allocation and CoMP Based Interference Coordination Scheme for LTE-A Het-Net.", "url": "https://doi.org/10.1109/BWCCA.2014.65", "year": "2014", "author": {"Haitao Du": "47/4818", "Wenan Zhou": "86/3126", "Xian-Qi Lu": "157/4675", "Jing-Yuan Sun": "157/4679"}, "abstract": " Abstract:Time-domain enhanced inter-cell interference coordination (eICIC) scheme using almost blank sub-frames (ABS) is one of the key technologies in Heterogeneous networks (Het-net). Static configuration of ABS has been proven to increase performance but the optimal ABS ratio is yet to be examined. Moreover, combing Coordinated Multi-Point transmission (CoMP), ABS could be more efficiency. This paper proposes an optimization of time-domain resource allocation for ABS scheme. Combining CoMP technology, it adjusts the portion of ABS sub-frame to improve the system performance on the basis of the requirement of the rate in the hot spot. The system level simulations demonstrates that the proposed scheme can not only improve the overall system throughout significantly but also provide better cell edge user's spectral efficiency."}, "conf/bwcca/HuangZD14a": {"title": "QoE Issues of OTT Services over 5G Network.", "url": "https://doi.org/10.1109/BWCCA.2014.74", "year": "2014", "author": {"Feng-Hui Huang": "157/4737", "Wenan Zhou": "86/3126", "Yu Du": "27/6228"}, "abstract": " Abstract:Currently, 4G network becomes commercial in large scale around the world and the industry has started the fifth-generation mobile communication technology (5G) research. Compared to 4G network, 5G network will support larger mobility as well as higher transmission rate, higher user experience rate, energy efficiency, spectrum efficiency and so forth. All of these will boost a variety of multimedia services, especially for Over-The-Top (OTT) services. So for, OTT services have already gained great popularity and contributed to large traffic consumption, which propose a challenge for operators. As OTT services are designed to deliver over the best effort Internet, the QoE management solutions for traditional multimedia services are obsolete, which propose new challenges in QOE management aspects for network and service providers, especially for the 4G and future 5G network. This paper attempts to present the technical challenges faced by 5G network from QoE management perspective of OTT services. Our objective is to enhance the user experience of OTT services and improve network efficiency. We analysis the characteristics and QoE factors of OTT services over 5G wireless network. With the QoE factors and current QoE management situation, we summarize OTT services QoE quantification and evaluation methods, present QoE-driven radio resource management and optimization solutions. Then, we propose a framework and whole evaluation procedure which aim at obtaining the accurate user experience value as well as improving network efficiency and optimizing the user experience."}, "conf/vtc/XuZLR13": {"title": "A Sub-Optimal Threshold-Based Power Allocation Scheme for Joint Transmission in HetNet.", "url": "https://doi.org/10.1109/VTCFall.2013.6692066", "year": "2013", "author": {"Yujie Xu": "128/7518", "Wenan Zhou": "86/3126", "Te Liang": "143/1072", "Xiaotao Ren": "119/3923"}, "abstract": " Abstract:We study the power allocation of Marco eNodeB (MeNB) for joint transmission in Range Expanding region of HetNet. We formulate the optimization problem of maximizing HetNet throughput. The original problem turns out to be a non-convex problem. To achieve high system throughput and reduce the complexity, we put forward a sub-optimal power allocation scheme, i.e., Threshold-Based Power Allocation TBPA scheme. In TBPA scheme, we analyze the optimal subcarrier assignment and then set a basic power threshold for MeNB. Based on the threshold, subcarriers are selected to allocate power. We mathematically prove the original non-convex problem is turned into a quasi-convex problem. We evaluate TBPA scheme and other interference coordination schemes under different parameters. The simulation results show that compared to the conventional interference coordination schemes, TBPA scheme can improve the system throughput by a large margin with limited complexity."}, "conf/icpca/LiZRLW12": {"title": "Data-Apart Hybrid Centralized Scheduling in Coordinated Multi-Point System with Non-ideal Backhaul Link.", "url": "https://doi.org/10.1007/978-3-642-37015-1_24", "year": "2012", "author": {"Huiqin Li": "126/7992", "Wenan Zhou": "86/3126", "Xiaotao Ren": "119/3923", "Xianqi Lu": "157/4675", "Guowei Wang": "46/10776"}, "abstract": "Coordinated Multi-Point (CoMP) transmission is a promising technique to improve the coverage of high data rates, the cell-edge throughput in cellular networks, in which centralized CoMP can obtain global optimal cooperation when CU can gather CoMP information (including CSI) and send scheduling decisions without delay. However, due to the imperfect channel characteristic, there is CSI latency during the cooperation, which will decrease the CoMP gain. In this paper, we propose a modified centralized CoMP scheme called DAHCS (Data-Apart Hybrid Centralized Scheduling), in which user data process is set apart from CU and a hybrid structure scheduling is adopted to schedule CoMP UEs intensively and non CoMP UEs locally. Simulation results show that the proposed DAHCS CoMP outperforms the traditional method when a lower capacity/higher latency backhaul link is considered.KeywordsCoMPlatencyhybrid schedulerX2 interface"}, "conf/vtc/LiLYMZ12": {"title": "Utility-Based Scheduling Algorithm for Multiple Services in OFDM Cognitive Radio Networks.", "url": "https://doi.org/10.1109/VETECS.2012.6239908", "year": "2012", "author": {"Qiongyao Li": "119/9441", "Pengfei Lu": "23/7474", "Zhongyuan Yu": "27/2929", "Shijia Ma": "119/9325", "Wenan Zhou": "86/3126"}, "abstract": " Abstract:In this paper, the utility-based resource allocation algorithms for the secondary users (SU) supporting heterogeneous services in orthogonal frequency division multiplexing (OFDM)-based cognitive radio cellular networks (CogCells) are studied. Two kinds of users are considered: best-effort-only service users and multiple services users. According to the convex optimization theory, the Lagrangian dual method is proposed, in which the joint subcarrier assignment and power allocation are performed to achieve the optimal solution. To simplify the computation complexity, a low complexity dynamic subcarrier allocation algorithm, named Max Utility for Multiple Services on Cognitive Radio (CR-MUMS), is formulated to extend the non-linear integer optimization to a continuous convex optimization. Final simulation results illustrate that the proposed algorithm with low computational complexity provides better optimal performance than Modified Largest Weighted Delay First (M-LWDF) and Proportional Fair (PF) algorithms."}, "conf/vtc/ZhouCS12": {"title": "Research on Context-Awareness Service Adaptation Mechanism in IMS under Ubiquitous Network.", "url": "https://doi.org/10.1109/VETECS.2012.6239906", "year": "2012", "author": {"Wenan Zhou": "86/3126", "Jie Chang": "06/10395", "Junde Song": "60/5010"}, "abstract": " Abstract:The service adaptation mechanism is one of the key issues in ubiquitous network. However, most of the proposed approaches of service adaptation are either not context-aware or based on a specific definition of context in specific environment. This paper presents a context-aware service adaptation mechanism under ubiquitous network relying on user-to-object, space-time interaction patterns which helps perform service adaptation according to user's contexts (such as preferences and habits), network context, service context and device context. The contribution of this paper is to propose: 1) importing user similarity into the service adaptation process and also considering users' trust value; 2) similar users-based service adaptation algorithm (SUSA) is proposed, by combining entropy theory and fuzzy analytic hierarchy process algorithm (FAHP). Evaluation results show that the service adaptation approach based on context-aware, user similarity and SUSA algorithm outperforms the traditional service adaptation algorithm in the accuracy aspect."}, "conf/wcnc/ChangZS12": {"title": "Multi-device service continuity with adaptive resources provisioning under ubiquitous network.", "url": "https://doi.org/10.1109/WCNC.2012.6214296", "year": "2012", "author": {"Jie Chang": "06/10395", "Wenan Zhou": "86/3126", "Junde Song": "60/5010"}, "abstract": " Abstract:The service continuity mechanism is to provide multimedia application with seamless multimedia experience over multiple networks (Wifi, 3G, Wimax, LTE) as well as multiple devices (mobile, PCs, PDA, Settop box) in ubiquitous network. However, most of the proposed approaches of service continuity are either not adaptive resources provisioning or based on a specific definition of context in ubiquitous network environment. This paper presents a multi-device service continuity with adaptive resources provisioning mechanism under ubiquitous network relying on IMS which helps perform service continuity according to user's contexts (such as preferences and habits), network context, service context and device context. The contribution of this paper is to propose: 1) service continuity scenario, architecture and requirements; 2) signaling flow of resource switching for the proposed scenario is proposed; 3) process of adaptive resources provisioning is put forward. Evaluation results show that the service continuity approach based on context-aware, multi-device coordination and adaptive resources provisioning process outperforms the traditional service continuity."}, "conf/vtc/ChangZS11": {"title": "Performance Improvements of mSCTP-CMT in Ubiquitous Network Scenarios.", "url": "https://doi.org/10.1109/VETECF.2011.6092821", "year": "2011", "author": {"Jie Chang": "06/10395", "Wenan Zhou": "86/3126", "Junde Song": "60/5010"}, "abstract": " Abstract:With the rapid development of wireless broadband services and the steady advancement of ubiquitous network, there is a rising demand for multi-homed network sites to provide services. Mobile Stream Control Transmission Protocol (mSCTP) is ideal to provide vertical handover (VHO) feature by enabling a mobile client to freely switch between IP addresses acquired in different networks. Concurrent Multipath Transfer with mSCTP's multi-homing support (mSCTP-CMT), which is the extension of mSCTP protocol, simultaneously transmits new data from a source host to a destination host via two or more end-to-end paths. This paper proposes bandwidth estimation extension and congestion control modifications for mSCTP-CMT to improve the transmission throughput in ubiquitous network scenarios. In the proposed scheme, the main contribution is that improved Non-Renegable Selective Acknowledgments (NR-SACKs) based on available bandwidth estimation and its congestion control mechanism which can efficiently utilize of send buffer, especially when frequency of loss events. From the simulation test, we can see that the performance of the proposed scheme could improve the application throughput under packet loss rate and time varied."}, "conf/pimrc/XieZHCS10": {"title": "Joint channel-aware and queue-aware relay selection and resource allocation in cooperative OFDMA networks.", "url": "https://doi.org/10.1109/PIMRC.2010.5671663", "year": "2010", "author": {"Bing Xie": "94/2438", "Wenan Zhou": "86/3126", "Chenxi Hao": "52/8605", "Wei Chen": "181/2832", "Junde Song": "60/5010"}, "abstract": " Abstract:In this paper, a joint channel-and-queue-aware relay selection and resource allocation scheme at the scheduling phase in an OFDMA downlink cellular network is proposed. The scheme can choose the best relay to cooperate and allocate subchannels and power for the source and the relay for the selected packet which can maximize the proposed utility function waiting in the base station. Under the premise of satisfying the QoS requirement of the waiting service flow, the utility function consists of the overall power consumption of a packet when it is transmitted between base station to relay station and the relay station to destination and the queue's state. Furthermore, adaptive modulation and coding (AMC) is utilized as a result that the base station and relay station can allocate different power to achieve different bit rates and an ON-OFF model is used to form the traffic model. At the end of this paper, the detailed design and realization of our simulation is presented, and the numerical analysis is done to prove the strength of our proposed scheme."}, "conf/vtc/XieZHAS10": {"title": "A Novel Bargaining Based Relay Selection and Power Allocation Scheme for Distributed Cooperative Communication Networks.", "url": "https://doi.org/10.1109/VETECF.2010.5594320", "year": "2010", "author": {"Bing Xie": "94/2438", "Wenan Zhou": "86/3126", "Chenxi Hao": "52/8605", "Xiaoli Ai": "56/8333", "Junde Song": "60/5010"}, "abstract": " Abstract:Distributed and efficient relay selection and resource allocation are critical for large scale cooperative communication networks. To stimulate a potential relay station to cooperate with the source, a bargaining based relay selection and power allocation (BBRSPA) scheme is proposed. In this paper, Rubinstein-Stahl bargaining game is introduced to provide a possible solution to share the increased benefits, which are obtained at a source when a potential relay joins to help transmit its signals. In this scheme, both a source and a relay calculate the patience factor according to the change in its own service utility. By exchanging the patience factor, a source selects the relay which can provide the maximal extra utility for itself, the corresponding optimal power the chosen relay should allocate is also determined. Furthermore, if the chosen relay could get more utilities from cooperation, it will have incentive to do so. Moreover, the simulation results show the strength of our proposed scheme and prove that our BBRSPA scheme can achieve comparable performance to that employing centralized scheme."}, "conf/wcnc/AiZXS10": {"title": "Network Selection Issue in Heterogeneous Wireless Environment.", "url": "https://doi.org/10.1109/WCNC.2010.5506497", "year": "2010", "author": {"Xiaoli Ai": "56/8333", "Wenan Zhou": "86/3126", "Bing Xie": "94/2438", "Junde Song": "60/5010"}, "abstract": " Abstract:Network selection is one of the key issues in heterogeneous wireless networks. However, very few efforts have been made on both algorithm and management of network selection to satisfy the individual requirements of every single user, so as to attract customers in the future user centric business mode. This paper takes the following steps toward addressing this problem: 1) a novel user preference oriented network selection algorithm (UPNS) is proposed, by combining entropy theory and fuzzy analytic hierarchy process algorithm (FAHP); 2) a service level agreement (SLA) management model is designed for network selection control in heterogeneous wireless environment, mainly including the general function descriptions and a management model instance based on UPNS. Application scenario of the UPNS based instance is simulated. Results show its efficiency in satisfying users' individuality and maintaining user satisfaction."}, "conf/apnoms/MaZSX09": {"title": "Research on Service Abstract and Integration Method in Heterogeneous Network Platform.", "url": "https://doi.org/10.1007/978-3-642-04492-2_48", "year": "2009", "author": {"Fei Ma": "22/1199", "Wenan Zhou": "86/3126", "Junde Song": "60/5010", "Guang-xian Xu": "85/7406"}, "abstract": "With the development of information and communication technologies, network convergence is inevitable trend. Because there are many heterogeneous networks in our daily lives, the heterogeneous network platform should provide the universal interfaces, regardless of the diversity of heterogeneous networks. A service abstract and integration method is proposed with corresponding interfaces in the paper. According to the application requirements, the platform can gain series of common service capability components from bottom heterogeneous networks by the abstract method. These service capabilities can be encapsulated to provide open interfaces with web service. The common services are also integrated to support new services or applications by the integration method. An illustration shows that the method is feasible on the platform to some extent.Keywordsservice abstract methodservice integrationcommon serviceheterogeneous network platform"}, "conf/csie/ZhouLS09": {"title": "Challenges for End-to-End Quality of Service in Heterogeneous Networks.", "url": "https://doi.org/10.1109/CSIE.2009.529", "year": "2009", "author": {"Wenan Zhou": "86/3126", "Lu Liu": "31/2088", "Junde Song": "60/5010"}, "abstract": " Abstract:To guarantee the end-to-end QoS (E2E Quality of Service) in heterogeneous network is an important issue to provide pervasive and trusted service. Currently, the different networks are optimized for different services, but it becomes urgent to provide pervasive service across different networks. This paper gives an overview on how to design a dynamic and integrated QoS architecture under heterogeneous networks. This paper firstly analyzes the actuality of the E2E quality of service in heterogeneous networks, and then discusses the requirements of the E2E QoS of two types of heterogeneous networks, finally points out the five key issues to solve the practical problem in the current network."}, "conf/ichit/MaZSX09": {"title": "Research on load balancing mechanism based on handoff in heterogeneous network platform.", "url": "https://doi.org/10.1145/1644993.1645068", "year": "2009", "author": {"Fei Ma": "22/1199", "Wenan Zhou": "86/3126", "Junde Song": "60/5010", "Guang-xian Xu": "85/7406"}, "abstract": "\n\t\tModern service industry is a new kind of service industry based on information & communication technologies and modern management thinking, which is in accord with the concept \"Service Science\" by IBM. A heterogeneous network platform is founded to implement the applications of modern service industry. In this paper, an intelligent handoff algorithm is proposed to keep the service continuity in the heterogeneous network platform. And service class differentiation is considered to define the service priority according to service characters of real-time traffics and non-real-time traffics. A load balancing mechanism based handoff is proposed to balance the load of a network or cell by comparing the current load value with corresponding throughput thresholds. Simulations illustrate that the load balancing algorithm can improve the blocking probability, call dropping probability and resource utilization to an extent.\n\t"}, "conf/mue/ChenZMS09": {"title": "A Novel Intra-domain Mobility Management Solution in Heterogeneous Networks Using SIP.", "url": "https://doi.org/10.1109/MUE.2009.54", "year": "2009", "author": {"Tian Chen": "66/5721", "Wenan Zhou": "86/3126", "Fei Ma": "22/1199", "Junde Song": "60/5010"}, "abstract": " Abstract:Although Session Initiation Protocol(SIP) has been the main choice of terminal mobility signaling solution in application layer, it is obvious that SIP suffers from considerable handover delay that is not suitable for real-time multimedia and frequent local movements(intra-domain handovers). By introducing Session Border Controller(SBC) and hierarchical SIP registration, this paper proposes a novel intra-domain mobility management architecture which can support seamless vertical handover, location transparency and NAT traversal. Based on the architecture, an intra-domain vertical handover procedure is proposed, using Advance Duplicate Address Detection(A-DAD) to reduce the handover delay. Performance analysis has evaluated the handover delay and indicated that the proposed handover procedure can fulfill the delay requirement of real-time applications."}, "conf/ncm/MaZSX09": {"title": "Research on Handoff Mechanism Based on Capability Adaptation in Heterogeneous Network Platform.", "url": "https://doi.org/10.1109/NCM.2009.110", "year": "2009", "author": {"Fei Ma": "22/1199", "Wenan Zhou": "86/3126", "Junde Song": "60/5010", "Guang-xian Xu": "85/7406"}, "abstract": " Abstract:Heterogeneous convergence networks will integrate multiple access technologies to provide seamless mobility for users with high-speed connectivity. This will give rise to a heterogeneous networks environment that can provide open standard interfaces regardless of the diversity of heterogeneous networks, where handoff mechanism is used to keep the services continued. In this paper, a heterogeneous network platform is constructed according to a novel architecture based on network adaptation layer. And a handoff mechanism based on capability adaptation is proposed to implement seamless handoff process, where the capability adaptation algorithm is given to select the optimal network and terminal. In addition, an illustration is given in detail to present the adaptation and handoff process with stream media service, which is effective to satisfy the requirements of the applications for modern service industry."}, "conf/apscc/HuZZS08": {"title": "A Novel Network Selection Algorithm in Next Generation Heterogeneous Network for Modern Service Industry.", "url": "https://doi.org/10.1109/APSCC.2008.102", "year": "2008", "author": {"Hao Hu": "67/6924", "Wenan Zhou": "86/3126", "Shu Zhang": "30/2700", "Junde Song": "60/5010"}, "abstract": " Abstract:As Modern Service Industry (MSI) improves with economic restructuring in China, emerging user-central applications bring enormous challenges to current communication networks characterized with heterogeneity. In this paper, an advanced mobility management architecture with three main function modules in the next generation heterogeneous network (NGHN), is presented to support personal mobility and seamless service continuity across disparate access technologies. Intelligent selection module is mainly considered in this paper, and a network selection algorithm is proposed for optimal service delivery over consumer devices capable of heterogeneous access networks, when the user has a choice between multiple service delivery networks. The simulation results show that different networks can be chosen for all different services with service requirements and user demands. The network selection results are shown to meet the optimization objectives of the decision maker to support seamless mobility and optimal network access in NGHN."}, "conf/fgcn/HuZS07": {"title": "A Dynamic Spectrum Sharing Scheme Based on SA-OFDM for Cognitive Radios.", "url": "https://doi.org/10.1109/FGCN.2007.11", "year": "2007", "author": {"Hao Hu": "67/6924", "Wenan Zhou": "86/3126", "Junde Song": "60/5010"}, "abstract": " Abstract:In this paper, a novel dynamic spectrum sharing scheme combining spectrum adaptation and OFDM for cognitive radio system is proposed. Given spectrum sensing and channel estimation information by the receiver, an improved model due to transmit power thresholds for SA-OFDM system is adopted to achieve spectrum adaptation for unlicensed users. In order to improve spectrum efficiency and reduce computational complexity, a dynamic power allocation algorithm is also proposed. Simulations indicate that the scheme solves the partial interference problem in interference temperature model and improves the spectrum utilization, and the proposed algorithm is appropriate for SA-OFDM system due to its low computational complexity and good performance."}, "conf/snpd/FuZXS07": {"title": "Extended Mobility Management Challenges over Cellular Networks combined with Cognitive Radio by using Multi-hop Network.", "url": "https://doi.org/10.1109/SNPD.2007.172", "year": "2007", "author": {"Xiuhua Fu": "27/5656", "Wenan Zhou": "86/3126", "Junli Xu": "90/6008", "Junde Song": "60/5010"}, "abstract": " Abstract:The combination of cellular networks with wireless ad-hoc networks composed of cognitive radio (CR) enabled terminals can not only address the inherent capacity and coverage limitations, but also increase the spectrum utilization as a result of opportunistic spectrum usage characterized by cognitive radio. In this paper, the network environment is referred to as CR-MANET, including location management, network handoff, spectrum handoff where the traditional concept of mobility management is largely extended. After several anticipatory challenges facing the CR-MANET being brought forward in this paper, an appropriate model for cooperative and cross-layer design is proposed. Finally, the main open research issues for efficient spectrum handoff and network mobility management are analyzed detail, which include spectrum handoff and performance optimization, location areas management, location update and paging, network handoff and QoS guarantee."}, "conf/vtc/ChenYZS07": {"title": "Research on Service Management Data Modeling Based on SID.", "url": "https://doi.org/10.1109/VETECF.2007.419", "year": "2007", "author": {"Gang Chen": "67/6383", "Baofei Yang": "80/6453", "Wenan Zhou": "86/3126", "Junde Song": "60/5010"}, "abstract": " Abstract:In order to resolve problems related to information integration in service management system (SMS), this paper introduces Meta Object Facility (MOF) into SMS to propose the concept of universal metamodel in service management domain. And then, Service Management Data Model (SMDM) is established to complete instantiation of metamodel by studying Share Information /Data (SID) Model. In this methodology, firstly, universal metamodel is established to ensure data sharing and reuse in SMS. Secondly, based on analysis of all kinds of information and process in SMS, core classes are defined to instantiate metadata classes and guarantee extendibility of SMDM. Each operational process can establish corresponding data model by definition of sub-class inheriting core class. Finally, data model of service quality monitoring is established to validate modeling methodology's validity. Therefore, consistency between SMDM and functional requirements is achieved and extension of business entities in SID is realized."}, "journals/csl/WangZZ22": {"title": "Talking-heads attention-based knowledge representation for link prediction.", "url": "https://doi.org/10.1016/j.csl.2021.101340", "year": "2022", "author": {"Shirui Wang": "128/4433", "Wen'an Zhou": "86/3126", "Qiang Zhou": "43/3182"}, "abstract": "State-of-the-art methods for link prediction, also known as knowledge graph embedding, aim to represent both entities and relations in the given knowledge graphs (KGs) into a continuous low-dimensional vector space and thus could be used to fill the missing facts or identify the spurious facts in KGs, where a fact is represented as a triple in the form of (head entity, relation, tail entity). Most previous attempts solely learn triples independently and thus fail to utilize the rich hidden inference and semantic information in the local neighbourhood existed surrounding each triple in KGs. To this effect, this paper proposes a talking-heads attention-based knowledge representation method, a novel graph attention networks-based method for link prediction which learns the knowledge graph embedding with talking-heads attention guidance from multi-hop neighbourhood triples. We evaluate our model in Freebase, WordNet and Kinship datasets on link prediction, experimental results demonstrate that the injection of talking-heads attention mechanism could better capture the semantic relationship of the neighbourhood surrounding triples and indeed achieve promising performance on link prediction."}, "journals/ppna/LiuWLZ22": {"title": "Double agents-DQL based D2D computing-offloading for SHVC.", "url": "https://doi.org/10.1007/s12083-021-01203-5", "year": "2022", "author": {"Jianlong Liu": "195/1689", "Jiaye Wen": "312/0640", "Lixia Lin": "252/2831", "Wen'an Zhou": "86/3126"}, "abstract": "To make the network provide a better Quality-of-Service (QoS) guarantee for compute-intensive applications, many researchers study Device-to-Device (D2D) based Multi-access Edge Computing (MEC) for reducing computing task completion time and energy consumption. However, the majority of works applies only to the scenario, in which, a specific video coding algorithm with a fixed number of enhancement layer is employed, i.e., the computing task with certain computing amount. Then, the computing task can only be continuously executed by edge computing-offloading. In fact, the Scalable High-efficiency Video Coding (SHVC) algorithm has an uncertain computing amount. Also, the computing task has multiple execution steps by D2D computing-offloading. This is because the executor may interrupt the execution of the ongoing SHVC computing task and change its execution step. Therefore, it is a challenging problem that, how to minimize the completion time and energy consumption of this scenario. To solve this problem, firstly, we model the SHVC computing tasks by ten atomic operations. Secondly, we propose an action space dynamic generation method to solve the reward sparse problem, and we propose an action space coding method to reduce the storage space and searching cost of experience pool matrix, and we employ a double-agent deep Q-learning algorithm to further improve the efficiency of solving the problem. Finally, the simulation results show that the long-term QoS of users is improved."}, "journals/ijon/ZhouZW21": {"title": "Semantic adaptation network for unsupervised domain adaptation.", "url": "https://doi.org/10.1016/j.neucom.2021.05.041", "year": "2021", "author": {"Qiang Zhou": "43/3182", "Wen'an Zhou": "86/3126", "Shirui Wang": "128/4433"}, "abstract": "Domain adaptation methods aim at learning transferable model for the unlabeled target domain. Recently, extensive domain adaptation models are proposed to align representations by minimizing distribution distance between different domains or adversarial training manner. However, most existing methods only adapt the different features in feature space and ignore the semantic features that generated by the classifier, which can lead to misclassification of target samples near the source decision boundaries. In this paper, we propose a Semantic Adaptation Network (SAN) for unsupervised domain adaptation. SAN aligns the domain representations at both feature-level and semantic-level. SAN utilizes adversarial training to align different domain representations in the feature space. In the semantic space, SAN obtains the pseudo labels of target samples by nearest source semantic representation centroid, then forces the pseudo labeled target semantic representations close to corresponding source semantic representation centroids. Experiments on ImageCLEF-DA, Office-Home and VisDA datasets validate the effectiveness and superiority of our model."}, "journals/ivc/ZhouZW21": {"title": "Cluster adaptation networks for unsupervised domain adaptation.", "url": "https://doi.org/10.1016/j.imavis.2021.104137", "year": "2021", "author": {"Qiang Zhou": "43/3182", "Wen'an Zhou": "86/3126", "Shirui Wang": "128/4433"}, "abstract": "Domain adaptation is an important technology for transferring source domain knowledge to new, unseen target domains. Recently, domain adaptation models are applied to learn domain invariant representations by minimizing distribution distance or adversarial training in the feature space. However, existing adversarial domain adaptation methods fail to preserve the data structure in the feature space. In this paper, we propose a novel domain adaptation method called Cluster adaptation Networks (CAN). CAN decreases the domain shift by aligning the category centers of source representations and the cluster centers of target representations in the feature space, which preserves the class-level structure and facilitates the classification of the target domain. Experiments on Digits, Office-Home and ImageCLEF-DA datasets validate the effectiveness of the structure preservation in our model."}, "journals/kbs/ZhouZWX21": {"title": "Duplex adversarial networks for multiple-source domain adaptation.", "url": "https://doi.org/10.1016/j.knosys.2020.106569", "year": "2021", "author": {"Qiang Zhou": "43/3182", "Wen'an Zhou": "86/3126", "Shirui Wang": "128/4433", "Ying Xing": "79/5063"}, "abstract": "Domain adaptation is a powerful tool for transferring the knowledge of the source domain with sufficient annotations for target tasks. However, most existing domain adaptation methods focus on the single-source–single-target adaptation setting, which ignore that existing different but related multiple source domains are available for target tasks. In this paper, we propose a novel theoretical generalization bound for multiple source domain adaptation, which averages the multiple source hypothesis risks by using HΔH-distance with an assumption that the target hypothesis is the combination of all the source hypotheses. Following this theoretical result, we propose a new algorithm called Duplex Adversarial Networks for Multi-source Adaptation (DAN_MA): one adversarial network is utilized for feature generator to learn domain invariant representations between source and target domains with a domain classifier for each pair of source and target; the other is utilized to eliminate the domain characteristics among different sources by making target samples close to each source task-specific decision boundaries. The shared feature generator aims to learn target representations which are invariant to the multiple domain shifts while still close to the source decision boundaries. Extensive experiments show that our method outperforms other domain adaptation methods on three public datasets."}, "journals/kbs/ZhouZWX21a": {"title": "Multiple adversarial networks for unsupervised domain adaptation.", "url": "https://doi.org/10.1016/j.knosys.2020.106606", "year": "2021", "author": {"Qiang Zhou": "43/3182", "Wen'an Zhou": "86/3126", "Shirui Wang": "128/4433", "Ying Xing": "79/5063"}, "abstract": "Domain adaptation algorithm is a powerful tool for transferring the knowledge of source domain with sufficient annotations for target tasks. Recently, adversarial learning is embedded into deep networks to reduce domain shift between source and target domains for learning transferable features. Existing adversarial domain adaptation methods aim at reducing the source and target domain discrepancy ignoring the class discrepancy between source and target domains. This paper proposes a novel Multiple Adversarial Networks (MAN) for unsupervised domain adaptation. MAN utilizes a pair of classifiers to minimize inter-domain discrepancy and embeds a domain discriminator for each category for intra-class discrepancy. Furthermore, we extend our MAN as improved MAN (iMAN) by utilizing a feature norm term to regularize the task-specific features, which can improve model generalization and help for minimizing intra-class discrepancy. We conduct extensive experiments on two real-world datasets Office–Home and ImageCLEF-DA, and experiment results show the effectiveness and superiority of our methods compared with several state-of-the-art unsupervised domain adaptation methods."}, "journals/nca/ZhouZWX21": {"title": "Unsupervised domain adaptation with adversarial distribution adaptation network.", "url": "https://doi.org/10.1007/s00521-020-05513-2", "year": "2021", "author": {"Qiang Zhou": "43/3182", "Wen'an Zhou": "86/3126", "Shirui Wang": "128/4433", "Ying Xing": "79/5063"}, "abstract": "Adversarial domain adaptation is a powerful approach to transfer the knowledge of the label-rich source domain to the label-scarce target domain by mitigating domain shifts across distributions. Existing domain adaptation methods align either the marginal distribution with a single-domain discriminator or conditional distributions with multiple-domain discriminators. However, aligning both marginal (global) and conditional (local) distributions should be considered for domain adaptation. This paper proposes a novel adversarial distribution adaptation network (ADAN) to jointly reduce both the global and local distribution discrepancies between different domains for learning domain-invariant representations. ADAN utilizes a single-domain discriminator to adapt the global distribution between two domains, and source decision boundaries to align the local distributions between sub-domains. Furthermore, we extend our ADAN as improved ADAN (iADAN), in which we utilize a feature norm term to regularize the task-specific features to improve model generalization. Extensive experimental results show that our method outperforms other state-of-the-art domain adaptation methods on Office-Home and ImageCLEF-DA datasets."}, "journals/computing/WangZJ20": {"title": "A survey of word embeddings based on deep learning.", "url": "https://doi.org/10.1007/s00607-019-00768-7", "year": "2020", "author": {"Shirui Wang": "128/4433", "Wen'an Zhou": "86/3126", "Chao Jiang": "38/2068"}, "abstract": "The representational basis for downstream natural language processing tasks is word embeddings, which capture lexical semantics in numerical form to handle the abstract semantic concept of words. Recently, the word embeddings approaches, represented by deep learning, has attracted extensive attention and widely used in many tasks, such as text classification, knowledge mining, question-answering, smart Internet of Things systems and so on. These neural networks-based models are based on the distributed hypothesis while the semantic association between words can be efficiently calculated in low-dimensional space. However, the expressed semantics of most models are constrained by the context distribution of each word in the corpus while the logic and common knowledge are not better utilized. Therefore, how to use the massive multi-source data to better represent natural language and world knowledge still need to be explored. In this paper, we introduce the recent advances of neural networks-based word embeddings with their technical features, summarizing the key challenges and existing solutions, and further give a future outlook on the research and application."}, "journals/icl/LinZZ20": {"title": "Analytical Modeling of NOMA-Based Mobile Edge Computing Systems With Randomly Located Users.", "url": "https://doi.org/10.1109/LCOMM.2020.3013002", "year": "2020", "author": {"Lixia Lin": "252/2831", "Wen'an Zhou": "86/3126", "Zhongyuan Zhao 0001": "40/9951-1"}, "abstract": " Abstract:Non-orthogonal multiple access (NOMA) has been treated as a promising technology to improve the computation offloading performance of mobile edge computing (MEC). A complete understanding of the impact of applying NOMA on MEC is essential for network operators to deploy MEC systems. In this letter, we develop a mathematical framework to analyze the impact of NOMA on offloading decisions in MEC, which captures the interaction among the offloading decisions of multiple co-channel users. Using stochastic geometry and order statistics, we derive the expression for the computation offloading probability of the nn -th ranked user in terms of serving distances in a NOMA-based MEC system. Numerical simulations are performed to verify the accuracy of our analysis and demonstrate the performance gain of applying NOMA on MEC."}, "journals/npl/WangZZ20": {"title": "Radical and Stroke-Enhanced Chinese Word Embeddings Based on Neural Networks.", "url": "https://doi.org/10.1007/s11063-020-10289-6", "year": "2020", "author": {"Shirui Wang": "128/4433", "Wen'an Zhou": "86/3126", "Qiang Zhou": "43/3182"}, "abstract": "The internal structural information of words has proven to be very effective for learning Chinese word embeddings. However, most previous attempts made a single form extraction of internal feature to learn representations, ignoring the comprehensive combination of such information. And they focused only on explicit feature of internal structures, even though these structures still have the implicit semantics of words. In this paper, we propose Radical and Stroke-enhanced Word Embeddings (RSWE), a novel method based on neural networks for learning Chinese word embeddings with joint guidance from semantic and morphological internal information. RSWE enables an embedding model to learn simultaneously from (1) implicit semantic information that is exploited from the radicals, and (2) stroke n-grams information that can be explicitly obtained from Chinese words. In the learning process, RSWE uses stroke n-grams to capture the local structural feature of words, and integrates the implicit information exploited from radicals to enhance the semantic of embeddings. Through this combination procedure, semantics of Chinese words are effectively transferred into the learned embeddings. We evaluate the effectiveness of RSWE on word similarity computation, word analogy reasoning, performance over dimensions, performance over learning corpus size, and named entity recognition tasks, the experimental results show that our model outperforms existing state-of-the-art approaches."}, "journals/access/ZhouZ19b": {"title": "Deep Embedded Clustering With Adversarial Distribution Adaptation.", "url": "https://doi.org/10.1109/ACCESS.2019.2935388", "year": "2019", "author": {"Wen'an Zhou": "86/3126", "Qiang Zhou": "43/3182"}, "abstract": " Abstract:Clustering methods based on deep neural networks have been extensively studied and applied in data mining. Most existing unsupervised deep embedded clustering methods jointly learn feature representations and cluster assignments with deep neural networks. However, to the best of our knowledge, most of them ignore the relevance between representation learning and clustering, so that fail to couple feature representation learning and cluster assignments effectively, which leads to non-representative features for clustering and this in turn hurts clustering performance. In this paper, we propose Adversarial Deep Embedded Clustering (ADEC), a novel unsupervised clustering method based on adversarial auto-encoder (AAE) and k -means clustering method. Specifically, ADEC matches distribution of feature representations with the given prior distribution to preserve the data structure with AAE, and k -means based on distribution distance metrics is conducted for clustering with these feature representations, simultaneously. ADEC optimizes a clustering objective iteratively with backpropagation algorithm in learning AAE from data space to feature space. Extensive experiments have demonstrated the effectiveness of our proposed method on images clustering compared to several strong baseline methods."}, "journals/access/ZhouWJ19": {"title": "Knowledge Graph Embedding With Interactive Guidance From Entity Descriptions.", "url": "https://doi.org/10.1109/ACCESS.2019.2950015", "year": "2019", "author": {"Wen'an Zhou": "86/3126", "Shirui Wang": "128/4433", "Chao Jiang": "38/2068"}, "abstract": " Abstract:Knowledge Graph (KG) embedding aims to represent both entities and relations into a continuous low-dimensional vector space. Most previous attempts perform the embedding task using only knowledge triples to indicate relations between entities. Entity descriptions, although containing rich background information, have not been well utilized in these methods. In this paper, we propose Entity Descriptions-Guided Embedding (EDGE), a novel method for learning the knowledge graph representations with semantic guidance from entity descriptions. EDGE enables an embedding model to learn simultaneously from 1) knowledge triples that have been directly observed in a given KG, and 2) entity descriptions which have rich semantic information about these entities. In the learning process, EDGE encodes the semantics of entity descriptions to enhance the learning of knowledge graph embedding, and integrates such learned KG embedding to constraint their corresponding word embeddings in entity descriptions. Through this interactive procedure, semantics of entity descriptions may be better transferred into the learned KG embedding. We evaluate EDGE in link prediction and entity classification on Freebase and WordNet. Experimental results show that: 1) with entity descriptions injected, EDGE achieves significant and consistent improvements over state-of-the-art baselines; and 2) compared to those one-time injection schemes studied before, the interactive guidance strategy maximizes the utility of entity descriptions for KG embedding, and indeed achieves substantially better performance."}, "journals/access/ZhouLLZX19": {"title": "Joint Offloading Decision and Resource Allocation for Multiuser NOMA-MEC Systems.", "url": "https://doi.org/10.1109/ACCESS.2019.2959434", "year": "2019", "author": {"Wen'an Zhou": "86/3126", "Lixia Lin": "252/2831", "Jianlong Liu": "195/1689", "Donglong Zhang": "255/8725", "Yifan Xie": "39/10452"}, "abstract": " Abstract:Mobile edge computing (MEC) is becoming a promising paradigm to provide computing services for smart mobile devices (SMDs) via offloading computation-intensive tasks to MEC servers deployed at the network edge. In this paper, in order to further improve the accessing capacity of MEC systems and minimize all users' computation overhead, taking advantage of the superior spectral efficiency of Non-Orthogonal Multiple Access (NOMA) technology, we introduce NOMA into MEC systems and investigate a multi-user computation offloading problem through jointly optimizing offloading decisions, communication and computation resources allocation. To tackle the formulated mixed integer nonlinear programming (MINLP) problem which is NP-hard, we iteratively update either the resource allocation or the offloading decision via fixing the other solution and efficiently solve it in polynomial time. Specifically, given a fixed offloading decision, the sub-channel assignment problem is solved via applying a many-to-one matching model with peer effects, the transmission power of SMDs is optimized by combing sequential convex programming and parametric convex programming, and the computation resources allocation is addressed by convex optimization. Furthermore, the results of resource allocation are applied to guide the offloading decision. Extensive simulations show that our proposed algorithm performs closely to the optimal solution, and compared with existing solutions, our algorithm can efficiently improve the accessing capacity of MEC systems and reduce the total computation overhead of all users."}, "journals/iet-cvi/ZhouZYH19": {"title": "Deep cycle autoencoder for unsupervised domain adaptation with generative adversarial networks.", "url": "https://doi.org/10.1049/iet-cvi.2019.0304", "year": "2019", "author": {"Qiang Zhou": "43/3182", "Wen'an Zhou": "86/3126", "Bin Yang": "77/377", "Jun Huan": "58/2597"}, "abstract": ""}, "journals/ijes/YanDZ18": {"title": "Study on the local path planning for intelligent vehicles based on an improved VFH method.", "url": "https://doi.org/10.1504/IJES.2018.10016819", "year": "2018", "author": {"Yingwei Yan": "169/4529", "Yu Du": "27/6228", "Wenan Zhou": "86/3126"}, "abstract": ""}, "journals/access/LiuZS17": {"title": "A Novel Congestion Reduction Scheme for Massive Machine-to-Machine Communication.", "url": "https://doi.org/10.1109/ACCESS.2017.2753797", "year": "2017", "author": {"Jianlong Liu": "195/1689", "Wen'an Zhou": "86/3126", "Lijun Song": "02/2800"}, "abstract": " Abstract:Machine-to-machine (M2M) communication is a system that allows information interaction between machines independently and automatically through a network without human intervention. However, when massive M2M devices access the network, they can quickly scramble preambles, and induce significant network congestion. Specially, when the massive M2M devices consist of delay tolerant devices (DTDs) and delay sensitive devices (DSDs), DSD success rate will decrease sharply. Therefore, this paper proposes a novel scheme of congestion reduction, Markov chain-based access class barring (M-ACB) to guarantee random access success for massive M2M devices that incorporate DTDs and DSDs, and ensure network resources are utilized efficiently. The proposed M-ACB scheme uses a 6D Markov chain to model preamble transfer status of preambles, and estimate the number of access devices for the next time slot. Dynamic regulation of barring factors and preserved DTD and DSD preamble is then applied based on the estimate. Simulation results validated the proposed M-ACB scheme for several key performance indicators, such as success rate, collision rate, time delay, and repeat times."}, "journals/cm/XiangZDP17": {"title": "Network Slicing in Fog Radio Access Networks: Issues and Challenges.", "url": "https://doi.org/10.1109/MCOM.2017.1700523", "year": "2017", "author": {"Hongyu Xiang": "162/9761", "Wenan Zhou": "86/3126", "Mahmoud Daneshmand": "92/4586", "Mugen Peng": "75/6927"}, "abstract": " Abstract:Network slicing has been advocated by both academia and industry as a cost-efficient way to enable operators to provide networks on an as-a-service basis and meet the wide range of use cases that the fifth generation wireless network will serve. The existing works on network slicing are mainly targeted at the partition of the core network, and the prospect of network slicing in radio access networks should be jointly exploited. To solve this challenge, enhanced network slicing in F-RANs, called access slicing, is proposed. This article comprehensively presents a novel architecture and related key techniques for access slicing in F-RANs. The proposed hierarchical architecture of access slicing consists of a centralized orchestration layer and a slice instance layer, which makes access slicing adaptively implementable in a convenient way. Meanwhile, key techniques and their corresponding solutions, including radio and cache resource management as well as social-aware slicing, are presented. Open issues in terms of standardization developments and field trials are identified."}, "journals/itiis/ZhouLZYY17": {"title": "A Novel Resource Scheduling Scheme for CoMP Systems.", "url": "https://doi.org/10.3837/tiis.2017.02.003", "year": "2017", "author": {"Wen'an Zhou": "86/3126", "Jianlong Liu": "195/1689", "Yiyu Zhang": "138/6842", "Cheng-Yi Yang": "97/7719", "Xuhui Yang": "162/1101"}, "abstract": ""}, "journals/corr/abs-1709-04655": {"title": "Network Slicing in Fog Radio Access Networks: Issues and Challenges.", "url": "http://arxiv.org/abs/1709.04655", "year": "2017", "author": {"Hongyu Xiang": "162/9761", "Wenan Zhou": "86/3126", "Mahmoud Daneshmand": "92/4586", "Mugen Peng": "75/6927"}, "abstract": "\n      Abstract:  Network slicing has been advocated by both academia and industry as a\ncost-efficient way to enable operators to provide networks on an as-a-service\nbasis and meet the wide range of use cases that the fifth generation wireless\nnetwork will serve. The existing works on network slicing are mainly targeted\nat the partition of the core network, and the prospect of network slicing in\nradio access networks should be jointly exploited. To solve this challenge, an\nenhanced network slicing in fog radio access networks (F-RANs), termed as\naccess slicing, is proposed. This article comprehensively presents a novel\narchitecture and related key techniques for access slicing in F-RANs. The\nproposed hierarchical architecture of access slicing consists of centralized\norchestration layer and slice instance layer, which makes the access slicing\nadaptively implement in an convenient way. Meanwhile, key techniques and their\ncorresponding solutions, including the radio and cache resource management, as\nwell as the social-aware slicing, are presented. Open issues in terms of\nstandardization developments and field trials are identified.\n\n    "}, "journals/ijcnds/ZhouHYYD16": {"title": "Research on the personalised QoE evaluation method for HTTP mobile streaming.", "url": "https://doi.org/10.1504/IJCNDS.2016.076649", "year": "2016", "author": {"Wenan Zhou": "86/3126", "Yajun Huang": "157/4739", "Shipeng Yu": "y/ShipengYu", "Liyan You": "180/5138", "Yu Du": "27/6228"}, "abstract": ""}, "journals/jcp/ZhouZQCL13": {"title": "Joint Scheduling Algorithms for LTE-A CoMP System.", "url": "http://www.jcomputers.us/index.php?m=content&c=index&a=show&catid=115&id=1631", "year": "2013", "author": {"Wenan Zhou": "86/3126", "Yiyu Zhang": "138/6842", "Pei Qin": "127/2910", "Wei Chen": "181/2832", "Xu Li": "25/3528"}, "abstract": ""}}}