{"id": "80/4406", "name": "Wendong Wang", "Article": {"conf/icassp/SunZW22": {"title": "Adversarial Learning Enhancement for 3D Human Pose and Shape Estimation.", "url": "https://doi.org/10.1109/ICASSP43922.2022.9746244", "year": "2022", "author": {"Yidian Sun": "321/6752", "Jiwei Zhang 0007": "61/7812-7", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Adversarial learning plays an important role in recovering 3D human pose and shape from monocular videos. However, the effectiveness of this process is not often considered. Hence we aim to improve the performance of adversarial learning in 3D human pose and shape estimation. The performance of adversarial learning is mainly influenced by two parts: generator and discriminator. For the generator, we utilize temporal information on a deeper level by adding an attention-based temporal encoder in generator to model the time series of features, which contributes to a more appropriate data representation for pose and shape regression. For the discriminator, we innovatively make use of human skeleton topology information when extracting features from the estimation results. To realize this, we base the discriminator’s design on the graph convolution network. In addition, to eliminate the jitter in the estimation results, we design a rotation disentangled smoothing module to process the estimated rotation parameters. We did adequate experiments on public in-the-wild datasets 3DPW and MPI-INF-3DHP. On both datasets, our method achieves higher accuracy and lower acceleration error compared with previous methods."}, "conf/infocom/WangHCWL22": {"title": "Learning Buffer Management Policies for Shared Memory Switches.", "url": "https://doi.org/10.1109/INFOCOM48880.2022.9796784", "year": "2022", "author": {"Mowei Wang": "206/6742", "Sijiang Huang": "245/6116", "Yong Cui 0001": "91/2346-1", "Wendong Wang": "80/4406", "Zhenhua Li 0001": "61/1951-1"}, "abstract": " Abstract:Today’s network switches often use on-chip shared memory to improve buffer efficiency and absorb bursty traffic. Current buffer management practices usually rely on simple heuristics and have unrealistic assumptions about the traffic pattern, since developing a buffer management policy suited for every scenario is infeasible. We show that modern machine learning techniques can be of essential help to learn efficient policies automatically.In this paper, we propose Neural Dynamic Threshold (NDT) that uses deep reinforcement learning (RL) to learn buffer management policies without human instructions except for a high-level objective. To tackle the high complexity and scale of the buffer management problem, we develop two domain-specific techniques upon off-the-shelf deep RL solutions. First, we design a scalable RL model by leveraging the permutation symmetry of the switch ports. Second, we use a two-level control mechanism to achieve efficient training and decision-making. The buffer allocation is directly controlled by a low-level heuristic during the decision interval, while the RL agent only decides the high-level control factor according to the traffic density. Testbed and simulation experiments demonstrate that NDT generalizes well and outperforms hand-tuned heuristic policies even on workloads for which it was not explicitly trained."}, "conf/isbi/WangZZMWHMW22": {"title": "A Feature Regularization Based Meta-Learning Framework for Generalizing Prostate Mri Segmentation.", "url": "https://doi.org/10.1109/ISBI52829.2022.9761564", "year": "2022", "author": {"Hui Wang": "39/721", "Zheng Zhang": "181/2621", "Bo Zhang 0032": "36/2259-32", "Yue Mi": "206/0346", "Jingyun Wu": "213/9300", "Haiwen Huang": "220/3988", "Zibo Ma": "319/5934", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Magnetic Resonance Imaging acquired by different operators and devices often vary greatly, causing the domain shift problem, where deep learning models trained from existing data sources perform poorly on other data sources. This paper proposes a novel feature regularization based meta learning framework to address this problem. In particular, we design a domain discriminator module to regularize the encoder to extract domain-invariant features, and an image reconstruction module to regularize the shape compactness of predictions for target domain data. We evaluate our method on three public prostate MRI datasets. Experimental results show that our approach has better segmentation performance and more powerful generalization performance."}, "conf/isbi/YanZZMWHQW22": {"title": "MPTGAN: A Multimodal Prior-Based Triple-Branch Network for Fast Prostate Mri Reconstruction.", "url": "https://doi.org/10.1109/ISBI52829.2022.9761418", "year": "2022", "author": {"Shuo Yan": "09/8350", "Zheng Zhang": "181/2621", "Bo Zhang 0032": "36/2259-32", "Yue Mi": "206/0346", "Jingyun Wu": "213/9300", "Haiwen Huang": "220/3988", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:As the most commonly used radiological examination for prostate disorder diagnosis, Magnetic Resonance Imaging (MRI) acquisition is very time-consuming. To accelerate prostate MRI reconstruction while maintaining high quality, this paper provides MPTGAN, a multimodal prior-based triple-branch network. MPTGAN guides the reconstruction of time-consuming MRI modality by utilizing time-efficient MRI modality as prior knowledge, thus the massive loss of low and high-frequency information in under-sampled data could be replenished. In particular, a hybrid feature interaction module (HFIM) is employed to integrate and fuse the latent relation clues between multimodal MRIs. Besides, we also design a triple-attention upsampling module (TAUM) to capture the salient features from the fused multimodal information. We collected 7300 pairs of T1 and T2 images from 387 prostate disorder patients and applied MPTGAN on them. Experiments show that MPTGAN significantly improved the reconstruction quality of prostate MRI and outperformed state-of-the-art methods."}, "conf/iwqos/CongZWNWGYLX22": {"title": "Break the Blackbox! Desensitize Intra-domain Information for Inter-domain Routing.", "url": "https://doi.org/10.1109/IWQoS54832.2022.9812918", "year": "2022", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Lei Wang": "181/2817", "Hao Ni": "25/9101", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Tong Yang": "44/7710", "Dan Li": "48/4185", "Ke Xu 0002": "181/2626-2"}, "abstract": " Abstract:Along with the ever-increasing amount of data generated from edge networks, cross domain (also known as Autonomous Systems, AS) transmission problem has attracted more and more attention. As mature and widely used inter-domain routing protocols, BGP-based solutions often use the number of domains (i.e. AS hops) of each path to make inter-domain routing decisions, which is simple and effective, but usually can not get the optimal routing results due to the lack of real state/information within ASes. These protocols choose the path with less AS hops as the forwarding path, even if the total latency or cost of the domains on this path is higher. While to solve this problem, directly access to intra-domain information as the assistance to make routing decisions is impractical due to data privacy.In this paper, we propose DIT, which makes near-optimal inter-domain routing decisions with desensitized intra-domain information. To do so, we design a homomorphic encrypted-based private number comparison scheme to export intra-domain information securely and thus assist in routing decisions. We conduct a series of experiments according to five real network topologies with nearly 900 simulated flows, and the results show that DIT reduces the number of forwarding hops by about 45% in average and reduces flow completion time by about 60%."}, "conf/bigdataconf/ZhangFZSZZZW21": {"title": "DRA U-Net: An Attention based U-Net Framework for 2D Medical Image Segmentation.", "url": "https://doi.org/10.1109/BigData52589.2021.9672031", "year": "2021", "author": {"Xian Zhang": "56/5624", "Ziyuan Feng": "263/5330", "Tianchi Zhong": "311/1650", "Sicheng Shen": "305/1713", "Ruolin Zhang": "136/5308", "Lijie Zhou": "198/2653", "Bo Zhang 0032": "36/2259-32", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Limited by the size of the dataset, deep learning models for medical image analysis are usually difficult to train well, and the complex deep learning model with large amount of trainable parameters can not achieve good results. At the same time, due to the lack of clear boundaries, especially in the root tips and roots, as well as the huge differences in shape and texture between images from different patients, an overly simple model cannot accurately segment organs. In order to improve the accuracy of organ segmentation for prostate region detection, in this paper we propose an attention based U-Net framework, which includes an attention mechanism and residual feature extraction network. In addition, we also design an improved loss function to improve the training effect for organ segmentation. We conduct several batches of experiments with the prostate dataset PROMISE12 and the pneumothorax dataset SIIM, the experimental results show that significant segmentation accuracy improvement has been achieved by our proposed method compared to other reported approaches."}, "conf/bigdataconf/ZhangZZMWHQW21": {"title": "MFSL-Net: A Modality Fusion and Shape Learning based Cascaded Network for Prostate Tumor Segmentation.", "url": "https://doi.org/10.1109/BigData52589.2021.9671960", "year": "2021", "author": {"Fan Zhang": "21/3626", "Bo Zhang 0032": "36/2259-32", "Zheng Zhang": "181/2621", "Yue Mi": "206/0346", "Jingyun Wu": "213/9300", "Haiwen Huang": "220/3988", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Contouring prostate tumor in magnetic resonance images is a prerequisite for diagnosis. Automatically segmenting blurred lesion regions is challenging and requires fully leveraging multi-parameter MR images. This paper proposes MFSL-Net, an end-to-end network that cascades two novel sub-networks: 1) a modality fusion network that selectively fuses information of two MRI modalities by expanding a dual-stream CNN with spatial and channel attention modules; 2) a shape learning network that integrates shape learning and context learning to recognize the shape and edge information while preserving high-resolution semantic information. We justify MFSL-Net’s design by ablation experiments and compare its performance with the state-of-the-art approaches. Experimental results show a 3.6% improvement in Dice Similarity Coefficient, which confirms the effectiveness of MFSL-Net."}, "conf/bmvc/SuB0ZW21": {"title": "HAT-Net: A Hierarchical Transformer Graph Neural Network for Grading of Colorectal Cancer Histology Images.", "url": "https://www.bmvc2021-virtualconference.com/assets/papers/1245.pdf", "year": "2021", "author": {"Yihan Su": "322/6109", "Yu Bai": "03/6325", "Bo Zhang 0032": "36/2259-32", "Zheng Zhang": "181/2621", "Wendong Wang": "80/4406"}, "abstract": ""}, "conf/hpcc/LiZWZLXZ21": {"title": "Frend for Edge Servers: Reduce Server Number! Keeping Service Quality!", "url": "https://doi.org/10.1109/HPCC-DSS-SmartCity-DependSys53884.2021.00041", "year": "2021", "author": {"Pengmiao Li": "249/3869", "Yuchao Zhang": "42/7674", "Wendong Wang": "80/4406", "Kaichuan Zhao": "183/8187", "Bo Lian": "206/1561", "Ke Xu 0002": "181/2626-2", "Zhili Zhang": "54/3914"}, "abstract": " Abstract:To keep pace with the exploding data volume raised from geographical distribution edge networks, more and more edge servers have been built in recent years. As the computing power and storage capacity are different on each server, requests have to be transferred from one server to another before finally being responded and returned back to users. Such server-to-server transmission naturally introduce non negligible latency, which inevitably affects the quality of service (QoS). To eliminate this transmission latency, Internet Service Providers (ISPs) are building or renting more edge servers (both computing servers and storage servers) to reduce transmission distance and enhance the server configuration, which brings great costs. Fortunately, through a large number of real trace analysis, we found that it is possible to reduce server number while keeping the QoS! In this paper, we first disclose three key characteristics from Kuaishou Company: (1) Unbalanced request frequencies on dif-ferent servers; (2) Imprecise latency measure on server-to-server transmission; (3) Nonlinear latency reduction to server number increment. Based on these findings, we propose a frequency-aware edge storage server deployment strategy Frend that is an improved Genetic Algorithm to optimize the number of edge storage servers by the internal diffusion capability that is a new latency measure called S2SL. Through a series of experiments using real application data, we demonstrate that while achieving the same S2SL, Frend can reduce the number of required edge storage servers by up to 56% compared with the state-of-the-art Anveshak method."}, "conf/icc/CongZW0LL21": {"title": "A Deep Reinforcement Learning-based Routing Scheme with Two Modes for Dynamic Networks.", "url": "https://doi.org/10.1109/ICC42927.2021.9500466", "year": "2021", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Wendong Wang": "80/4406", "Ke Xu 0002": "181/2626-2", "Ruidong Li": "06/7035", "Fuliang Li": "95/8385"}, "abstract": " Abstract:With the development of communication and transmission technologies, more and more applications, like Internet of vehicles and tele-medicine, become more sensitive to network latency and accuracy, which requires routing schemes to be more efficient. In order to meet such urgent need, learning-based routing strategies emerges, with the advantages of high flexibility and accuracy. These strategies can be divided into two categories, centralized and distributed, enjoying the advantages of high precision and high efficiency, respectively. However, routing become more complex in dynamic network, where the link connections and access states are time-varying, so these learning-based routing mechanisms are required to be able to adapt to network changes in real time. In this paper, we designed and implemented both two of centralized and distributed reinforcement learning-based routing schemes (RLR-T). By conducting a series of experiments, we deeply analyzed the results and gave the conclusion that the centralized is better to cope with dynamic networks due to its faster reconvergence, while the distributed is better to handle with large-scale networks by its high scalability."}, "conf/iwqos/ZhangCLWX21": {"title": "AIR: An AI-based TCAM Entry Replacement Scheme for Routers.", "url": "https://doi.org/10.1109/IWQOS52092.2021.9521314", "year": "2021", "author": {"Yuchao Zhang": "42/7674", "Peizhuang Cong": "260/2955", "Bin Liu 0001": "35/837-1", "Wendong Wang": "80/4406", "Ke Xu 0002": "181/2626-2"}, "abstract": " Abstract:Ternary Content Addressable Memory (TCAM) is an important hardware used to store route entries in routers, which is used to assist routers to make fast decision on forwarding packets. In order to cope with the explosion of route entries due to massive IP terminals brought by 5G and the Internet of Things (IoT), today’s commercial TCAM has to keep the corresponding growth in capacity. But large TCAM capacity is causing many problems such as circuit design difficulties, production costs, and high energy consumption, so it is urgent to design a lightweight TCAM with small capacity while still maintains the original query performance.Designing such a TCAM faces two fundamental challenges. Firstly, it is essential to accurately predict the incoming flows in order to cache correct entries in limited TCAM capacity, but prediction on aggregated time-sequential data is challenging in the massive IoT scenarios. Secondly, the prediction algorithm needs to be real-time as the lookup process is in line-rate. In order to address the above two challenges, in this paper, we proposed a lightweight AI-based solution, called AIR, where we successfully decoupled the route entries and designed a parallel-LSTM prediction method. The experiment results under real backbone traffic showed that we successfully achieved comparable query performance by using just 1/8 TCAM size."}, "conf/msn/LiZZWXZ21": {"title": "CRATES: A Cache Replacement Algorithm for Low Access Frequency Period in Edge Server.", "url": "https://doi.org/10.1109/MSN53354.2021.00033", "year": "2021", "author": {"Pengmiao Li": "249/3869", "Yuchao Zhang": "42/7674", "Huahai Zhang": "318/6422", "Wendong Wang": "80/4406", "Ke Xu 0002": "181/2626-2", "Zhili Zhang": "54/3914"}, "abstract": " Abstract:In recent years, with the maturity of 5G and Internet of Things technologies, the traffic in mobile network is growing explosively. To reduce the burden of cloud data centers and CDN network, edge servers that are closer to users are widely deployed, caching hot contents and providing higher Quality of Service (QoS) by shortening access latency. Storage resources on edge servers are much limited compared with CDN servers, so the research on cache replacement strategy of edge servers is critical to edge computing and storage area. Many efforts have been made to improve caching performance on edge servers. Existing caching strategies only focus on the high access frequency period to solve the caching problem, they ignore low access frequency period with two characteristics, including that hot contents are difficult to predict and hot topics usually change unstably, which makes it inefficient to improve the hit rate on edge servers.In this paper, we deeply analyzed the real traces from Chuang-Cache and found some specific user groups are playing more important roles than general users during low access frequency period, and the contents accessed by these specific user groups have a much higher possibility to become hot contents. Therefore, we firstly classify such users to core users, and treat others as common users. Then we adopt the principal component analysis algorithm to analyze the relationship between hot contents and core users. On this basis, we finally propose a hot contents pre-cache protection mechanism, which is a significant part of our cache replacement algorithm CRATES. To improve CRATES’s efficiency, we extract key part of historical data by designing a sliding window method. Through a series of experiments using real application data, we demonstrate that CRATES reaches about 98% in caching hit rate and outperforms the state-of-the-art algorithm LRB by 1.4X."}, "conf/cacre/WangLXQ20": {"title": "Design method and experiment of robot joint flexible drive based on magnetorheological fluid.", "url": "https://doi.org/10.1109/CACRE50138.2020.9230351", "year": "2020", "author": {"Wendong Wang": "80/4406", "Hanhao Li": "277/2745", "Menghan Xiao": "277/2956", "Lei Qin": "20/1306"}, "abstract": " Abstract:Traditional high-rigidity robots are difficult to meet the safety of human-machine interaction and the self-adaptability of complex environments. This paper proposed a new design method of variable stiffness flexible actuator for robot joints based on magnetorheological fluid, and completed relevant experiments. The magnetic field simulation results of the magnetorheological flexible actuator were analyzed, and the physical design was optimized to determine the final structure of the magnetorheological flexible actuator. The simulation model of the magnetorheological flexible actuator is established in Matlab/Simulink, so as to obtain the relationship between excitation current and maximum output torque of the magnetorheological flexible actuator. Finally, to analyze the effect of variable stiffness, an experimental prototype and a control system were fabricated to test the maximum torque of flexible actuator under different current. The results of position step test and collision test show that the new type of flexible actuator based on magnetorheological fluid designed realizes the function of variable stiffness, and its control system also meets the requirements."}, "conf/hpcc/ZhangWWZH20": {"title": "HttpDNS: A Flexible Architecture for Edge Server Exploration and Selection in 5G Network.", "url": "https://doi.org/10.1109/HPCC-SmartCity-DSS50907.2020.00137", "year": "2020", "author": {"Yuchao Zhang": "42/7674", "Shuang Wu": "85/3231", "Wendong Wang": "80/4406", "Zhuoyun Zhang": "60/10365", "Yunbo Han": "121/2543"}, "abstract": " Abstract:With the emerging and development of low-latency applications (such as autonomous driving, SmartCity, telemedicine), low-latency has become one of the key requirements of current network services, especially in edge computing and 5G network. While under the state-of-the-art architecture, the request resolution is provided by Internet Service Provider's localDNS, which assigns a specific edge server for each request, but this method is now suffering from inaccurate scheduling problem, and fails to adapt to network changes due to the relatively fixed allocation strategy. These drawbacks result in the long response latency, and are becoming more severe in nowadays 5G edge networks. In this paper, we propose a flexible HttpDNS architecture for 5G edge server exploration and selection, where the domain names of users' requests are resolved by HttpDNS instead of the traditional localDNS. Under such architecture, user's request is directly transmitted to HttpDNS servers, which will then allocate a specific edge server for this request. With a server scoring module, the proposed HttpDNS architecture can finally ensure user requests be guided to the optimal edge server. We implement a prototype of HttpDNS architecture and conduct a series of experiments, the results show that such architecture not only reduces at least 10% latency compared with the traditional localDNS, but also has higher stability when network changes."}, "conf/icws2/ZhangLZZWNL20": {"title": "GraphInf: A GCN-based Popularity Prediction System for Short Video Networks.", "url": "https://doi.org/10.1007/978-3-030-59618-7_5", "year": "2020", "author": {"Yuchao Zhang": "42/7674", "Pengmiao Li": "249/3869", "Zhili Zhang": "54/3914", "Chaorui Zhang": "54/8594", "Wendong Wang": "80/4406", "Yishuang Ning": "130/1045", "Bo Lian": "206/1561"}, "abstract": "As the emerging entertainment applications, short video platforms, such as Youtube, Kuaishou, quickly dominant the Internet multimedia traffic. The caching problem will surely provide a great reference to network management (e.g., traffic engineering, content delivery). The key to cache is to make precise popularity prediction. However, different from traditional multimedia applications, short video network exposes unique characteristics on popularity prediction due to the explosive video quantity and the mutual impact among these countless videos, making the state-of-the-art solutions invalid. In this paper, we first give an in-depth analysis on 105,231,883 real traces of 12,089,887 videos from Kuaishou Company, to disclose the characteristics of short video network. We then propose a graph convolutional neural-based video popularity prediction algorithm called GraphInf. In particular, GraphInf clusters the countless short videos by region and formulates the problem in a graph-based way, thus addressing the explosive quantity problem. GraphInf further models the influence among these regions with a customized graph convolutional neural (GCN) network, to capture video impact. Experimental results show that GraphInf outperforms the traditional Graph-based methods by 44.7%. We believe such GCN-based popularity prediction would give a strong reference to related areas."}, "conf/infocom/ZhangTWCCLX20": {"title": "Federated Routing Scheme for Large-scale Cross Domain Network.", "url": "https://doi.org/10.1109/INFOCOMWKSHPS50562.2020.9162750", "year": "2020", "author": {"Yuchao Zhang": "42/7674", "Ye Tian": "32/5495", "Wendong Wang": "80/4406", "Peizhuang Cong": "260/2955", "Chao Chen": "66/3019", "Dan Li": "48/4185", "Ke Xu 0002": "181/2626-2"}, "abstract": " Abstract:With the development of multi-network integration, how to ensure interconnections among multiple independent network domains is becoming a key problem. Traditional interdomain routing protocol such as BGP (Border Gateway Protocol) or SR (Segment Routing) fails due to the limitation of information island (data privacy), where each autonomous network domain does not share any specific intra-domain information. In this poster, we propose a federated routing scheme FRP, which realizes global routing without any intra-domain data. Each domain only needs to exchange the very lightweight cumulative gradients of overlapped parameters to build the federated routing model. With FRP, flows between any pair of nodes can get global optimal routing results no matter which domain the source and destination nodes locate."}, "conf/seke/0008WGQWY20": {"title": "Personalized Video Recommendation Based on Latent Community.", "url": "https://doi.org/10.18293/SEKE2020-023", "year": "2020", "author": {"Han Yan": "63/49", "Ye Tian 0008": "32/5495-8", "Shunyao Wang": "213/6021", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": ""}, "conf/vts/WangGS20": {"title": "A Zero-Cost Detection Approach for Recycled ICs using Scan Architecture.", "url": "https://doi.org/10.1109/VTS48691.2020.9107583", "year": "2020", "author": {"Wendong Wang": "80/4406", "Ujjwal Guin": "13/9680", "Adit D. Singh": "s/AditDSingh"}, "abstract": " Abstract:The recycling of used integrated circuits (ICs) has raised serious problems in ensuring the integrity of today’s globalized semiconductor supply chain. This poses a serious threat to critical infrastructure due to potentially shorter lifetime, lower reliability, and poorer performance from these counterfeit new chips. Recently, we have proposed a highly effective approach for detecting such chips by exploiting the power-up state of on-chip SRAMs. Due to the symmetry of the memory array layout, an equal number of cells power-up to the 0 and 1 logic states in a new unused SRAM; this ratio gets skewed in time due to uneven NBTI aging from normal usage in the field. Although this solution is very effective in detecting recycled ICs, its applicability is somewhat limited as a large number older designs do not have large on-chip memories. In this paper, we propose an alternate approach based on the initial power-up state of scan flip-flops, which are present in virtually every digital circuit. Since the flip-flops, unlike SRAM cells, are generally not perfectly symmetrical in layout, an equal number of scan cells will not power-up to 0 or 1 logic states in most designs. Consequently, a stable time zero reference of 50% logic 0s and 1s cannot be used for determining the subsequent usage of a chip. To overcome this key limitation, we propose a novel solution in this paper that reliably identifies used ICs from testing the part alone, without the need for any additional reference data or even the netlist of the circuit. Through scan testing of the IC, we first identify a significant number of asymmetrically stressed flip-flops in the design, divided into two groups. One group of flip-flops is selected such that it mostly experiences the 1 logic state during functional operation, while the other group mostly experiences the 0 state. The resulting differential stress during operation causes growing disparity over time in the number of 0s (and 1s) observed in these two groups a..."}, "conf/globecom/CongZW019": {"title": "DND: The Controllability of Dynamic Temporal Network in Smart Transportations.", "url": "https://doi.org/10.1109/GCWkshps45667.2019.9024562", "year": "2019", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Wendong Wang": "80/4406", "Bo Bai 0001": "10/4008-1"}, "abstract": " Abstract:Along with the development of IoT and mobile edge computing in recent years, everything can be connected into the network at anytime, resulting in quite dynamic networks with time-varying connections. Controllability has long been recognized as one of the fundamental properties of such temporal networks, which can provide valuable insights for the construction of new infrastructures, and thus is in urgent need to be explored. In this paper, we take smart transportation as an example, first disclose the controllability problem in IoV (Internet of Vehicles), and then design an DND (Driver NoDe) algorithm based on Kalman's rank condition to analyze the controllability of dynamic temporal network and also to calculate the minimum number of driver nodes. At last, we conduct a series of experiments to analyze the controllability of IoV network, and the results show the effects from vehicle density, speed, connection radius on network controllability. These insights are critical for varieties of applications in the future smart connected living."}, "conf/host/GuinWHS19": {"title": "Detecting Recycled SoCs by Exploiting Aging Induced Biases in Memory Cells.", "url": "https://doi.org/10.1109/HST.2019.8741032", "year": "2019", "author": {"Ujjwal Guin": "13/9680", "Wendong Wang": "80/4406", "Charles Harper": "243/5362", "Adit D. Singh": "s/AditDSingh"}, "abstract": " Abstract:The rise of recycled ICs being sold as new through the global semiconductor supply chain is a serious threat due to their inferior quality, shorter remaining life, and potentially poorer performance, compared to their authentic counterparts. While solutions, such as on-chip age monitors, have been proposed for new designs, detecting the recycling of older legacy ICs already in use is much harder; no reliable solution currently exists. In this paper, we propose a new and highly effective approach for detecting recycled ICs by exploiting the powerup state of on-chip SRAMs to evaluate the age of the chip. Our methodology does not require the introduction of any special aging detection circuitry, nor the recording and saving of historical circuit performance data as a reference to detect degradation from use. Instead, we exploit the novel observation that in a new unused SRAM, an equal number of cells power up to the 0 and 1 logic states, and also that this distribution becomes skewed in time due to aging in operation. Since SRAMs exist in virtually all systems-on-chip (SoCs), this simple aging detection method is widely applicable to both old and new designs. It is also low cost since does not require any special test equipment. We present experimental results using commercial off-the-shelf SRAM chips to validate the effectiveness of the proposed approach."}, "conf/infocom/ZhangLZ0ZWL19": {"title": "Challenges and Chances for the Emerging Short Video Network.", "url": "https://doi.org/10.1109/INFCOMW.2019.8845192", "year": "2019", "author": {"Yuchao Zhang": "42/7674", "Pengmiao Li": "249/3869", "Zhili Zhang": "54/3914", "Bo Bai 0001": "10/4008-1", "Gong Zhang": "77/6324", "Wendong Wang": "80/4406", "Bo Lian": "206/1561"}, "abstract": " Abstract:Short video has rapidly become one of the most popular online entertainment applications in the last two years. The new service pattern of short video network shows its unique characteristics, making it much more difficult to improve QoS by using traditional methods in content delivery network. In this paper, we deeply analyze the real traces of more than 28 million videos with 100 million accesses from 488 servers located in 33 cities, disclosing the following three unique characteristics/challenges of short video network compared to traditional Video on Demand (VoD) services: First, user access pattern shows less preferences on videos, making it's hard to find out the popular ones. Second, most videos have very few visits, which makes it difficult to learn and predict due to the lack of historical data. Third, the popularity changes much more quickly, which further makes it challenging to design efficient caching policy. To address these challenges, we're designing CoStore, a reinforcement learning-based caching policy which pre-fetches videos with the help of video correlations. This poster brings the short video network to light and we hope CoStore could also provide inspirations to related areas."}, "conf/ksem/0006WTGQ19": {"title": "Data and Knowledge: An Interdisciplinary Approach for Air Quality Forecast.", "url": "https://doi.org/10.1007/978-3-030-29551-6_70", "year": "2019", "author": {"Cheng Feng 0006": "76/3473-6", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": "\nAir pollution has become a critical problem in rapidly developing countries. Prior domain knowledge combined with data mining offers new ideas for air quality prediction. In this paper, we propose an interdisciplinary approach for air quality forecast based on data mining and air mass trajectory analysis. The prediction model is composed of a temporal predictor based on local factors, a spatial predictor based on geographical factors, an air mass predictor tracking air pollutants transport corridors and an aggregator for final prediction. Experimental results based on real world data show that the cross-domain data mining method can significantly improve the prediction accuracy compared with other baselines, especially in the period of severe pollution.KeywordsAir quality predictionMachine learningData and knowledgeInterdisciplinary approach"}, "conf/globecom/XiWTG18": {"title": "Mutual Information Maximization for Collaborative Mobile Sensing with Calibration Constraint.", "url": "https://doi.org/10.1109/GLOCOM.2018.8647285", "year": "2018", "author": {"Teng Xi": "176/0053", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Hui Gao 0002": "46/5223-2"}, "abstract": " Abstract:Highly resolved and accurate air pollution maps are valuable resources for many issues related to air quality including exposure modeling and urban planning. Due to the high equipment costs, there are limited high quality monitoring stations (HQMS) in cities. In order to achieve high resolution air pollution maps, a large number of mobile sensors are required. Besides, mobile sensors require frequent calibrations with the HQMS to maintain data accuracy. Existing work on route design for mobile sensors largely focuses on data reconstruction, which either ignores calibration or views it as an independent problem. To improve the accuracy of data reconstruction, this paper proposes a novel scheme that jointly considers sensor calibration and data reconstruction in route design for mobile sensors. We formulate a novel sensor route planning problem (SRPP) which aims to maximize the mutual information and guarantee the accuracy of measurements through sensor calibration. A heuristic algorithm is proposed to solve the SRPP, which supports calibration between mobile sensors and HQMS in route planning. Simulation results show that, compared with traditional approach, our approach can reduce 83% root mean square error (RMSE) on average."}, "conf/iros/WangKKLS18": {"title": "Collectives of Spinning Mobile Microrobots for Navigation and Object Manipulation at the Air-Water Interface.", "url": "https://doi.org/10.1109/IROS.2018.8593519", "year": "2018", "author": {"Wendong Wang": "80/4406", "Vimal Kishore": "29/9219", "Lyndon Koens": "233/0183", "Eric Lauga": "233/0196", "Metin Sitti": "25/3694"}, "abstract": " Abstract:We use multiple spinning micro-rafts at the air-water interface as mobile microrobot collectives and present here their collective behaviors, including navigating around anchored obstacles, and trapping and transporting floating objects. The 3D-printed micro-rafts are circular disKS of 100 μm in diameter and have parametrically defined undulating edge profile. The study of their local interactions, manifested by the pairwise interactions between micro-rafts, reveals competing magnetic and capillary interactions that keep the collectives in their dynamic state. Using collectives of 7, 19, and 36 micro-rafts and micro-channels between millimeter-sized posts, we demonstrate the effects of the size of the collectives, the size of the obstacles, and maneuver strategies on the collective navigation. Employing methods from information theory, we show that the pairwise mutual information of the collectives increases significantly during the channel-crossing as a result of the additional constraints of the channel walls on the collectives. Finally, we demonstrate the trapping of 1-mm-diameter polystyrene bead and the trapping and transporting of 600~μm-wide pm."}, "conf/latw/WangSGC18": {"title": "Exploiting power supply ramp rate for calibrating cell strength in SRAM PUFs.", "url": "https://doi.org/10.1109/LATW.2018.8349685", "year": "2018", "author": {"Wendong Wang": "80/4406", "Adit D. Singh": "s/AditDSingh", "Ujjwal Guin": "13/9680", "Abhijit Chatterjee": "31/928"}, "abstract": " Abstract:SRAM arrays are particularly attractive for use as physically unclonable functions (PUFs) because each manufactured copy of an SRAM array displays a different memory pattern when initially powered-on. This is due to random differences in device parameters in individual memory cells from manufacturing process variations. However, instability in the SRAM PUF response over the expected range of operating voltages and temperature, as well as environmental noise and aging degradation over time, is a challenge. Recent proposals aim at identifying a subset of all the cells in an SRAM, the most robust or strong cells, and using only these to construct a PUF. However, the manner in which the SRAM is powered up has been largely ignored in earlier work. We show that the SRAM power-up state is strongly dependent on the power supply ramp rate and direction; very different power-up states are obtained under different power-on scenarios. Furthermore, analyzing the power-up states under different ramp rates and directions can provide considerable insight into which transistor pairs in each individual cell are mismatched, and even the extent of the mismatch. Since such threshold voltage mismatch is key to cell power-on bias, we finally show how such experiments can be exploited to reliably identify the most robust strong cells in SRAMs for use in PUFs. These cells can be expected to generating reliable keys for cryptographic operations across a wide range of operating conditions, noise and device degradation."}, "conf/mobihoc/XiWNL18": {"title": "Spatio-Temporal Aware Collaborative Mobile Sensing with Online Multi-Hop Calibration.", "url": "https://doi.org/10.1145/3209582.3225202", "year": "2018", "author": {"Teng Xi": "176/0053", "Wendong Wang": "80/4406", "Edith C. H. Ngai": "25/5713", "Xiuming Liu 0001": "48/9143-1"}, "abstract": "\n\t\tReal-time accurate air quality data is very important for pollution exposure monitoring and urban planning. However, there are limited high-quality air quality monitoring stations (AQMS) in cities due to their high equipment costs. To provide real-time and accurate data covering large area, this paper proposes a novel scheme that jointly considers online multi-hop calibration and spatio-temporal coverage in route selection for mobile sensors. A novel sensor carrier selection problem (SCSP) is formulated, which aims to maximize the spatio-temporal coverage ratio and guarantee the accuracy of measurements through sensor calibration. An online Bayesian based collaborative calibration (OBCC) scheme is proposed to relax the multi-hop calibration constraint in the SCSP. Based on the OBCC, a multi-hop calibration judgment algorithm (MCJA) is proposed to decide whether the data accuracy of a given set of routes can be guaranteed through collaborative calibration. Furthermore, a heuristic sensor route selection algorithm (SRSA) is then developed to solve the SCSP.\n\t"}, "conf/wcnc/0006WTQG18": {"title": "Air quality estimation based on multi-source heterogeneous data from wireless sensor networks.", "url": "https://doi.org/10.1109/WCNC.2018.8377129", "year": "2018", "author": {"Cheng Feng 0006": "76/3473-6", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:It's a great challenge to offer a fine-grained and accurate air quality monitoring service in urban areas limited to the cost of the professional facilities. With the development of the wireless sensor networks (WSNs), it brings new opportunity to achieve this goal at low cost. However, WSNs are quite different on temporal and spatial distribution, some WSNs even have irregular real-time features, which makes it a hard problem to use the data collected from different WSNs to achieve the same goal. In this paper, we propose a framework for air quality estimation based on multi-source heterogeneous data collected from WSNs. We collect five kinds of data from different sources in real world, including the data with irregular real-time features. We divide the data sets into three sub classifiers to make the analysis and get the final results with an extreme learning machine (ELM) based multilayer perceptron model. The results show that our method outperforms other methods, and the precision of classification can be 90.8%."}, "conf/wcnc/GuoGWQ18": {"title": "Adaptive transmission of split-screen video over wireless networks.", "url": "https://doi.org/10.1109/WCNC.2018.8377085", "year": "2018", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the tremendous growth of video contents and mobility demands, there is a need to develop more personalized video services. Split-screen service, e.g., picture in picture, becomes more and more popular. However, the video transmission of split-screen service still faces several major challenges, one of which is how to assess the users' quality of experience (QoE) of the split-screen service. There may be multiple videos for different resolutions displayed on one screen. A consistent way is needed to assess the users' QoE of the split-screen service. The second challenge is how to choose bitrate of each video stream to maximize users' QoE of the split-screen service. Multiple video streams are transmitted to user over resource-constrained wireless networks. Therefore, it is a difficult issue to select an appropriate bitrate for every video streaming. To address these challenges, in this paper, we first present a dynamic adaptive video transmission scheme (DAVTS) based on MPEG Media Transport (MMT) protocol. Then we introduce a novel mathematical model for characterizing users' QoE to be affected by some factors in the proposed DAVTS. In the model, the objective method of QoE assessment of split-screen service is proposed. Based on the model a problem of maximum income in QoE of users is considered. We use a transmission bitrate selection (TBS) algorithm to solve the optimization problem. Simulation results demonstrate that DAVTS can enrich the video quality while reduce video jitters."}, "conf/bmei/ZhangWS17": {"title": "Research on maximum power point tracking based on an improved fuzzy-PD dual-mode algorithm.", "url": "https://doi.org/10.1109/CISP-BMEI.2017.8302309", "year": "2017", "author": {"Lei Zhang": "97/8704", "Wendong Wang": "80/4406", "Yikai Shi": "134/1122"}, "abstract": " Abstract:In this paper, an improved Fuzzy-PD control Maximum Power Point Tracking (MPPT) algorithm is proposed based on the existing Fuzzy-PI control on the basis of the output characteristics of photovoltaic cells. The traditional fuzzy control method adjusts the duty cycle of the Boost circuit according to the changes of the output power and voltage of the photovoltaic cells, thus making the photovoltaic cells work at the maximum power point. The method can quickly perceive the external environment transformation, but there is repeatedly oscillation near the maximum power point. To eliminate the oscillation a Fuzzy-PI control algorithm has been given in some papers. However, as the oscillation is one characteristic of the PID control, the oscillation problem still cannot be fundamentally solved. In this paper, an improved Fuzzy-PD control algorithm has been proposed, which can effectively eliminate the oscillation phenomenon. Simulation experiments show that this improved algorithm will make the photovoltaic cells work at the maximum power point, and can effectively eliminate the oscillation at the same time."}, "conf/bmei/ZhangWYS17": {"title": "Comparative studies magnetic actuation for drug delivery: A challenge and constraint.", "url": "https://doi.org/10.1109/CISP-BMEI.2017.8302259", "year": "2017", "author": {"Peng Zhang": "21/1048", "Wendong Wang": "80/4406", "Xiaoqing Yuan": "32/9545", "Yikai Shi": "134/1122"}, "abstract": " Abstract:Magnetic actuation micro-robot has developed a promising technology in clinical medicine application. The wireless control or powered-self micro-robot makes the existing invention therapy flexible, accuracy, short cover time. In this work, the major challenges and constraints that must be addressed and reviewed and some of the different magnetic platform are presented and compared. The reviewed magnetic micro-robot highlights the ability and classification of wireless magnetic actuation. Here, the actuation method including offboard and on-board approach is discussed, then provide the design constraints and existing problems for the magnetic actuation micro-robot. Finally, we provide a useful reference information for the design of the medical micro-robot."}, "conf/ccnc/LiuWGQC17": {"title": "A fast and loop-free update mechanism in software defined networking.", "url": "https://doi.org/10.1109/CCNC.2017.7983197", "year": "2017", "author": {"Tao Liu 0013": "43/656-13", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:This paper studies how to extract and group essential nodes to guarantee loop freedom during the update of the network, while minimizing update time. We propose a model to establish the relationships of loops which may arise during the updating procedure. Given the model, we design a heuristic algorithm, with the recursive optimizing for the relationships, to extract essential nodes for the loop-free update, and shorten the updating time. The performance of our proposal has been examined and we verified that our algorithm would obviously reduce the update time."}, "conf/globecom/LiXTW17": {"title": "Inferring Fine-Grained PM2.5 with Bayesian Based Kernel Method for Crowdsourcing System.", "url": "https://doi.org/10.1109/GLOCOM.2017.8254421", "year": "2017", "author": {"Shuai Li": "57/2281", "Teng Xi": "176/0053", "Ye Tian 0008": "32/5495-8", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Air pollution seriously affect people's lives, among which PM\n2.5\n is especially harmful for humans health. Although many countries have established fixed air quality monitoring stations (AQMS) to monitor air pollution, the costs of constructing and maintaining for AQMS are extremely expensive and the density of AQMS is very low. To acquire fine-grained concentration of PM\n2.5\n, this paper have proposed a novel Bayesian based kernel method. Our model leverage heterogeneous data which jointly using images information, camera lens information, GPS information and magnetic sensor information. To study the relationship between PM\n2.5\n concentration and images information, we have established a crowdsourcing system and have collected photos for consecutive 16 months. The performance of the proposed method has been evaluated thoroughly by real dataset we have collected. The results show that, compared with three baselines, our proposed algorithm can reduce up to 35% prediction error in average."}, "conf/ica3pp/LiXQW17": {"title": "Fine-Grained Infer PM_2.5 Using Images from Crowdsourcing.", "url": "https://doi.org/10.1007/978-3-319-65482-9_53", "year": "2017", "author": {"Shuai Li": "57/2281", "Teng Xi": "176/0053", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": "Among all air pollutants, PM_{2.5}2.5_{2.5}, which can be inhaled into lungs, is most harmful for peoples’ health. However, the number of fixed air quality measurement stations is insufficient. In order to make people be more aware of the air quality around them, this paper have proposed a method to infer fine-grained PM_{2.5}2.5_{2.5} concentration. We leverage different type of collected by crowdsourcing for data mining. Then, features which have strong correlation with PM_{2.5}2.5_{2.5} concentration are extracted. Furthermore, we train the proposed model using integrated radial basis function (rbf) kernel based ridge regression. The performance of the proposed method is evaluated thoroughly by real dataset collected by crowdsourcing. The results show that, our method can accurate infer the PM_{2.5}2.5_{2.5} concentration.KeywordsCrowdsourcingFine-grained inferencePM_{2.5}2.5_{2.5} ConcentrationFeatures extract"}, "conf/ica3pp/GaoFWW17": {"title": "A Multi-task Oriented Selection Strategy for Efficient Cooperation of Collocated Mobile Devices.", "url": "https://doi.org/10.1007/978-3-319-65482-9_56", "year": "2017", "author": {"Hui Gao 0002": "46/5223-2", "Jun Feng": "00/4883", "Ruidong Wang": "125/2168", "Wendong Wang": "80/4406"}, "abstract": "As the resource consumption of mobile applications continues to outweigh the hardware capacities of mobile devices, the user experience can be improved by leveraging the resources of the nearby mobile devices. In other words, a mobile device should be able to request surrounding devices to execute tasks on its behalf. By treating the resources of the devices in the vicinity collectively, one can orchestrate a distributed interaction that uses these resources efficiently, thereby improving individual user experiences. In this paper, we study the problem of allocating multiple tasks across multiple mobile devices with the goal of reducing the collective execution time, while limiting the resources consumed by each participating device. Our selection strategy uses a set of heuristics to allocate the task execution in the aforementioned type of distributed interaction scenarios. The results of our experimental evaluation indicate that this strategy can be successfully applied in Mobile Device Cloud applications.KeywordsMobile deviceCollocated cooperationDevice selection"}, "conf/icc/LiuXNW17": {"title": "Path planning for aerial sensor networks with connectivity constraints.", "url": "https://doi.org/10.1109/ICC.2017.7996434", "year": "2017", "author": {"Xiuming Liu 0001": "48/9143-1", "Teng Xi": "176/0053", "Edith C. H. Ngai": "25/5713", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Wireless sensor networks (WSN) based on unmanned aerial vehicles (UAV) are ideal platforms for monitoring dynamics over larger service area. On the other hand, aerial sensor networks (ASNs) are often required to be connected with a command center for sending data and receiving control messages in real time. In this paper, we study the problem of path planning for ASNs with connectivity constraints. The primary goal of path planning is driving UAVs to locations where the most informative measurements can be collected. Meanwhile, the worst link's capacity is assured to be greater than a pre-defined requirement. We proposed a solution for the path planning problem and it consists of two modules: network coordinator (NC) and motion controller (MC). The NC manages the topology of relay-assisted wireless communication networks. For the design of MC, we compare two motion strategies: maximum entropy and maximum mutual information. The simulation results show that our proposed solution achieves accurate signal reconstruction while maintaining the connectivity. We conclude that it's important to enable UAV-to-UAV communications for future ASN-based applications."}, "conf/icinfa/GuoHWZLZ17": {"title": "Materials and structure engineering in wearable monitor: Highly stretchable strain sensor developed by structured SWCNTs/CB networks.", "url": "https://doi.org/10.1109/ICInfA.2017.8079064", "year": "2017", "author": {"Xiaohui Guo": "97/738", "Ying Huang": "62/2964", "Wendong Wang": "80/4406", "Yunong Zhao": "226/9589", "Caixia Liu": "33/6441", "Yugang Zhang": "03/7704"}, "abstract": " Abstract:There is an increasing demand for flexible and wearable strain sensors for the potential applications in wearable monitor, including human activities, human-machine interfaces and master devices for teleoperated robotic system, etc. Herein, we propose a highly stretchable strain sensor developed by structured single-walled carbon nanotube /carbon black (SWCNTs/CB) networks for wearable monitor. The fabrication process, strain sensing mechanism and characterization of the sandwich-structured strain sensor were systematacially investigated. The results show that the sandwich-structured strain sensor has high stretchability of strain up to 160%, a sensitivity with the gauge factor (GF) approximate 1.04, as well as high stability and reproducibility of 1000 repeated stretching/releasing cycles. Furthermore, bending of elbow and knee was recorded, demonstrating that the highly stretchable strain sensor could have promising applications in flexible and wearable devices for human motion monitoring."}, "conf/im/QiWGQ17": {"title": "An analytical model for combined SDN Forwarding Element.", "url": "https://doi.org/10.23919/INM.2017.7987332", "year": "2017", "author": {"Qinglei Qi": "160/4952", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:Recent studies have shown that the flow table size of hardware SDN switch cannot match the number of concurrent flows. Combined SDN Forwarding Element (CFE), which comprises software switch and hardware switch, becomes an alternative approach for tackling this problem. Because software switch has lower lookup speed than hardware switch, different proportions of traffic allocated to software switches in CFE have different effects on the delay bounds of all flows entering CFE. As delay-guarantee is a nontrivial task for network providers, especially with the increasing number of delay-sensitive applications, a model to analyze the delay bound given a flow allocation in CFE is important. With the one-to-one correspondence between flow allocation and rules placement solution, the analytical model can be used to evaluate and compare rules placement solutions and provide a basis for designing better rules placement solution in CFE. In this paper, we propose an analytical model for CFE based on network calculus, and then validate this model through simulations in NS-3."}, "conf/vtc/ZhangSTW17": {"title": "A Runtime Framework for Context-Sensitive Device-to-Device Communication.", "url": "https://doi.org/10.1109/VTCFall.2017.8288152", "year": "2017", "author": {"Yan Zhang": "04/3348", "Zheng Song": "181/2470", "Ye Tian 0008": "32/5495-8", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Mobile applications and Internet of Things applications increasingly require one mobile device to exchange data with another collocated device. Despite the introduction of multiple standard device-to-device communication protocols (i.e., WiFi direct, Bluetooth, Bluetooth Low Energy, NFC), transferring data across devices remains hard for mobile programmers for three reasons. 1) different devices support different D2D communication interfaces, and therefore the available D2D communication channels are dynamically decided by the peers; 2) different D2D interfaces have different features (connection establish time, data rate, energy consumption) and different performances under different contexts, complicating the decision which channel to use; 3) implementing and debugging data transmission functionalities requires knowing the low-level details of communication protocols, which is difficult and error prone. To solve the above mentioned problem, this paper presents a runtime framework for context-sensitive device-to-device communication. The presented framework consists of two major components: 1) a set of encapsulated D2D data transmission interfaces to reduce the programming efforts; 2) a context-sensitive communication channel selection algorithm to select the optimal communication channel as defined by the dynamic context. We design and implement the runtime framework, and evaluate its performance in terms of the required programming effort, energy consumption and data transmission latency under different contexts."}, "conf/wcnc/GaoLTXW17": {"title": "Ensuring High-Quality Data Collection for Mobile Crowd Sensing.", "url": "https://doi.org/10.1109/WCNC.2017.7925926", "year": "2017", "author": {"Hui Gao 0002": "46/5223-2", "Chi Harold Liu": "45/4723", "Ye Tian 0008": "32/5495-8", "Teng Xi": "176/0053", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Mobile Crowd sensing is a new paradigm that encourages ordinary people to collect and share sensing data with their smart devices. However, the uncontrollable data quality is one of the critical problems that is potentially harmful to guarantee the availability and preciseness of mobile crowd sensing based services. In this paper, we propose a quality aware data collection mechanism based on a realistic scenario where participants arrive and report their conditions sequentially one by one. When a participant arrives, the mechanism first forecasts the amount of high quality data he#x002F;she may contribute by employing the expectation of Binomial-Poisson distribution, and then a two-level iterative algorithm is employed to calculate its parametric values. After, our designed mechanism decides to select the participant or not by combining with his#x002F;her requested reward. Extensive simulation results well justify the effectiveness and robustness of our approach, compared with another schemes."}, "conf/wowmom/FengWTQG17": {"title": "Estimate air quality based on mobile crowe sensing and big data.", "url": "https://doi.org/10.1109/WoWMoM.2017.7974308", "year": "2017", "author": {"Cheng Feng 0006": "76/3473-6", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:PM2.5 (particulate matter in the atmosphere with a diameter no more than 2.5 microns) in the air can cause great damage to human beings. It's a great challenge to offer a fine-grained and accurate PM2.5 monitoring service in urban areas as the required facilities are very expensive and huge. Since the PM2.5 has a significant scattering effect on visible light, the large-scale user-contributed image data collected by the mobile crowd sensing bring a new opportunity for understanding the urban PM2.5. After the analysis of image data, we find that several image features are very discriminative in PM2.5 inference. In this paper, we propose a fine-grained PM2.5 estimation method based on the random forest model without any PM2.5 measurement devices. We evaluate our approach with experiments based on five data sources: the meteorological data, the traffic data, the records from the monitoring sites, the POIs and the photos collected. The experimental results show that we have a high evaluation accuracy on PM2.5 estimation (precision: 0.875, recall: 0.872), which outperforms existing methods (Logistic, Naive Bayes, Random Tree, and BP ANN)."}, "conf/bmei/WangHJZS16": {"title": "Path planning algorithm of a novel massage robot.", "url": "https://doi.org/10.1109/CISP-BMEI.2016.7852984", "year": "2016", "author": {"Wendong Wang": "80/4406", "Lijing He": "195/2172", "Qinqin Jiang": "195/2182", "Peng Zhang": "21/1048", "Yikai Shi": "134/1122"}, "abstract": " Abstract:This paper presents a novel wheel massage robot which can achieve hammer, rolling, kneading and other massage operations, and a complete coverage algorithm of massage path planning - improved reciprocating path planning algorithm. Based on the massage robot and traditional Chinese massage, the requirements of path planning of wheel massage robot and the features of traditional reciprocating path planning algorithm were analyzed, and control system model of wheel massage robot was established. By using Matlab/Simulink to simulate the traditional reciprocating path planning algorithm and improved reciprocating path planning algorithm, we obtained the movement path of wheel massage robot under three kinds of massage operation. The results show that the improved reciprocating path planning algorithm could ensure that the massage robot traverses the whole back area, and it apparently improves the coverage rate of massage path and massage effect."}, "conf/dsc/HuWGWQX16": {"title": "Social Recommendation with Tag Side Information.", "url": "https://doi.org/10.1109/DSC.2016.30", "year": "2016", "author": {"Xiang Hu": "81/6204", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Bai Wang 0001": "03/587-1", "Xirong Que": "27/8431", "Hongke Xia": "28/7805"}, "abstract": " Abstract:Social recommendation is the recommendation process by using social information. Being created to annotate and categorize items, tags are shared by users to find, organize and understand online entities, and provide the inherent flexibility to predict users' preference. In this paper, tag information and social relations are combined into recommendation, and a new tag information aided social recommendation method is proposed. By means of matrix factorization and regularization technology, we calculate the feature vectors and predict the rating of users. Also a new similarity measuring method is put forward when exploiting tag information through link prediction. Experiments show that our method generates better performance than state-of-the-art methods."}, "conf/vtc/ZhangLZRMW16": {"title": "Robots-Aided Participatory Crowdsourcing with Limited Task Budget.", "url": "https://doi.org/10.1109/VTCFall.2016.7881203", "year": "2016", "author": {"Bo Zhang 0032": "36/2259-32", "Chi Harold Liu": "45/4723", "Zheng Zhang": "181/2621", "Ziyu Ren": "172/4445", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Participatory Crowdsourcing System (PCS) is now an important source of information for big data applications. In PCS, required environmental parameters are collected and shared by ordinary citizens. And the limited range of human activities and limited power or capability of smart devices make the PCS facing a lot of problems. But the wide use of robots, such as Unmanned Aerial Vehicle (UAV), can effectively alleviate the current problems in PCS. Lots of precision sensors can be installed into the robots, which makes sensory data collected by robots more trustful. However, the power and data transmission capability of robots are also limited. Meanwhile, it is much more expensive to use robots than recruit human participants. Thus, it will be most useful and necessary to use robots in PCS, let the robots and human participants working together, rather than using robots to replace the human participants. Obviously, the cooperation of robots and human participants will also make PCS facing new challenges, such as how to use the least amount of robots to reduce costs, etc.. In this paper, we analyze the different application scenarios of robots-aided PCS, and propose possible solutions to the existing problems. Finally, we discuss possible future work for robots-aided PCS."}, "conf/acsc/DingZTGW15": {"title": "Dynamic Topic Detection Model by Fusing Sentiment Polarity.", "url": "http://crpit.scem.westernsydney.edu.au/abstracts/CRPITV159Ding.html", "year": "2015", "author": {"Xi Ding": "21/1986", "Lan-Shan Zhang": "138/8141", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": ""}, "conf/globecom/GuoGLZZWL15": {"title": "A Hybrid Transmission Approach for DASH over MBMS in LTE Network.", "url": "https://doi.org/10.1109/GLOCOM.2014.7417297", "year": "2015", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Shiju Zhang": "53/1010", "Mincheng Zhao": "150/5528", "Wendong Wang": "80/4406", "Zhiming Li": "69/2834"}, "abstract": " Abstract:Dynamic adaptive streaming over HTTP (DASH) has been a research hotspot, and the current studies focus on the DASH transmission optimization using unicast mode. However, DASH streaming also could be transmitted by multicast mode, which could effectively reduce transmission resource consumption especially when multiple DASH clients request the same video program in parallel. In this paper, we propose the Hybrid Transmission strategies for DASH (HTD) in LTE network, which is considered both unicast and multicast modes for DASH. The optimization problem is formulated as a Mixed Binary Integer Programming (MBIP) problem, and a two-level greedy algorithm is proposed, which could improve the quality of experience (QoE) of wireless DASH users, and save the wireless resources in LTE network. Simulation results demonstrate that our scheme achieves better performance than traditional single transmission mode in the literature."}, "conf/globecom/HuWGQMC15": {"title": "Maximizing Network Utilization in Hybrid Software-Defined Networks.", "url": "https://doi.org/10.1109/GLOCOM.2014.7417144", "year": "2015", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Yue Ma": "08/6794", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:By separating the control and forwarding planes, Software-Defined networking (SDN) enables the forwarding paths to be flexibly controlled by the logically centralized controllers using the global network view. To introduce SDN into existing networks, it is necessary to upgrade traditional devices to SDN- enabled ones. However, due to the business, economic and management limitations, it is difficult to realize full SDN deployment. As a result, how to migrate existing devices to SDN-compliant ones becomes the obvious dilemma for every network operator. In this paper, we address this question from the network performance perspective, and study how to leverage the capability of SDN to maximize traffic flow that can be achieved in hybrid SDNs. We formulate the maximum flow problem in networks with partial SDN deployment, and develop a fast Fully Polynomial Time Approximation Scheme (FPTAS) for solving it. Simulation results using real topologies show that hybrid SDNs outperform traditional networks, and we can obtain a near optimal network performance when 50% of SDN nodes are deployed."}, "conf/globecom/XiWNSTG15": {"title": "Energy-Efficient Collaborative Localization for Participatory Sensing System.", "url": "https://doi.org/10.1109/GLOCOM.2014.7416983", "year": "2015", "author": {"Teng Xi": "176/0053", "Wendong Wang": "80/4406", "Edith C. H. Ngai": "25/5713", "Zheng Song": "181/2470", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:Location based services are getting increasingly popular in participatory sensing systems. They make use of location information on the mobile devices to support applications that improve personal health, object search, and entertainment. However, GPS positioning consumes a lot of energy, which can drain a mobile device's battery. Although WiFi localization and cell tower localization have been suggested as alternatives, they have lower localization accuracy and limited coverage. In this paper, we suggest a novel solution for multiple mobile devices to perform collaborative localization to reduce energy consumption and provide accurate localization. We divide the mobile devices into two groups, the aggregator group and the collector group. The aggregator group turns on their GPS periodically, while the collector group uses the locations of the aggregators to estimate their own locations. We formulate the aggregator set selection problem and propose two novel algorithms to minimize the energy consumption in collaborative localization. Simulations with real traces showed that our proposed solution can save up to 88% of the energy of the entire network."}, "conf/globecom/YangTNZTW15": {"title": "Vulnerable Friend Identification: Who Should You Beware of Most in Online Social Networks?", "url": "https://doi.org/10.1109/GLOCOM.2014.7417301", "year": "2015", "author": {"Yunjuan Yang": "176/5890", "Ye Tian 0008": "32/5495-8", "Edith C. H. Ngai": "25/5713", "Lan-Shan Zhang": "138/8141", "Yining Teng": "176/5943", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Web users are immersed in their roles as information producers and propagation pushers. They are unaware of being potential threats to privacy-protection towards themselves and their friends. It is necessary to know who they should beware of most in their friend-networks once their privacy information is divulged inadvertently. In this paper, we aim to identify the vulnerable friend who maximizes the dissemination of privacy information. First we develop a Privacy Receiving-Disseminating (PRD) model to simulate the iterative course of privacy information dissemination within social graph. The subgraph constituted of those users who are involved in the dissemination, called Ultimate Circle of Disseminating (UCD), is then detected by an iterative algorithm. The contribution of each direct friend could be evaluated by comparing the disseminating intensities of detected UCDs before and after unfriending himself. The performance of our work has been validated empirically with the comparison of different unfriending strategies."}, "conf/hpcc/GaoLWSCT15": {"title": "Maximizing Data Credibility Under Budget Constraint for Participatory Sensing.", "url": "https://doi.org/10.1109/HPCC-CSS-ICESS.2015.93", "year": "2015", "author": {"Hui Gao 0002": "46/5223-2", "Chi Harold Liu": "45/4723", "Wendong Wang": "80/4406", "Zhengguo Sheng": "55/3503", "Alvin Chin": "44/4400", "Ye Tian 0008": "32/5495-8"}, "abstract": " Abstract:Participatory sensing campaigns encourage ordinary people to collect and share sensing data by using their portable smart devices like smartphones, iPad and iWatch. However, compared with static sensors that are deployed in the particular places by people that can provide high-quality data, the quality of sensing data that are collected from smart devices is uncontrollable, and it is costly to pay data usage without knowing the credibility of the collected data. In this paper, we propose to leverage the participant's reputation to maximize total data credibility under budget constraint for participatory sensing systems. Specifically, we formally define a maximum sensing data credibility problem and present a trustable participants selection algorithm to obtain a near optimal solution. Provided the real data set, it has been shown by simulation results that our proposed algorithm selects more credible sensing data than that of the other two comparison algorithms."}, "conf/icc/ZhangGHWQ15": {"title": "SDNMP: Enabling SDN management using traditional NMS.", "url": "https://doi.org/10.1109/ICCW.2015.7247205", "year": "2015", "author": {"Yongyue Zhang": "88/6942", "Xiangyang Gong": "04/8431", "Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Network management system (NMS) is important to ensure security and efficiency of network. Traditional NMS usually adopts SNMP as management protocol and has achieved great success. However, with emerging of various services, traditional network exposes shortcomings. Software-Defined Network (SDN) is a new paradigm which separates the control plane from the forwarding plane as opposed to the distributed control of current networks. This centralized architecture can simplify the complexity of network management. Although SDN has many advantages, it still lacks mature management tools and is difficult to realize full deployment, which makes network operators reluctant to completely replace their legacy NMS. As a result, it is necessary to combine traditional NMS with SDN. This paper presents the design of SDNMP, which is an approach for managing SDN using traditional NMS. To verify our approach, we build and implement a prototype in our own testbed. By deploying virtual networks and services, results show that SDNMP works well in practice."}, "conf/infocom/LiuSNMW15": {"title": "PM2: 5 monitoring using images from smartphones in participatory sensing.", "url": "https://doi.org/10.1109/INFCOMW.2015.7179456", "year": "2015", "author": {"Xiaoyang Liu": "98/3794", "Zheng Song": "181/2470", "Edith C. H. Ngai": "25/5713", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Air pollution has become one of the most pressing environmental issues in many countries, including China. Finegrained PM2.5 particulate data can prevent people from long time exposure and advance scientific research. However, existing monitoring systems with PM2.5 stationary sensors are expensive, which can only provide pollution data at sparse locations. In this paper we demonstrate for the first time that camera on smartphones can be used for low-cost and fine-grained PM2.5 monitoring in participatory sensing. We propose a Learning-Based method to extract air quality related features from images taken by smartphones. These image features will be used to build the haze model that can estimate PM2.5 concentration depending on the reference sensors. We conducted extensive experiments over six months with two datasets to demonstrate the performance of the proposed solution using different models of smartphones. We believe that our findings will give profound impact in many research fields, including mobile sensing, activity scheduling, haze data collection and analysis."}, "conf/iwqos/XiNSTGW15": {"title": "Collaborative localization in participatory sensing with load balancing.", "url": "https://doi.org/10.1109/IWQoS.2015.7404706", "year": "2015", "author": {"Teng Xi": "176/0053", "Edith C. H. Ngai": "25/5713", "Zheng Song": "181/2470", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:The increasingly popular smartphones enable participatory sensing systems to collect location-based sensing data for different tasks. However, GPS positioning is very energy consuming, which could drain a mobile device's battery quickly. High energy consumption may threaten the participants and reduce the sustainability of the participatory sensing systems. In this paper, we propose a collaborative localization strategy with load balancing. Simulations with real traces showed that our proposed solution can save more than 80% of the energy consumption for localization in the entire network with load balancing."}, "conf/mobihoc/KouTSNW15": {"title": "Privacy Preserving Social Tie Discovery Based on Cloaked Human Trajectories.", "url": "https://doi.org/10.1145/2757513.2757522", "year": "2015", "author": {"Qinli Kou": "172/5440", "Ye Tian 0008": "32/5495-8", "Zheng Song": "181/2470", "Edith C. H. Ngai": "25/5713", "Wendong Wang": "80/4406"}, "abstract": "\n\t\tDiscovering social connections of people has become a flourishing research topic considering the rich social information inferable from human trajectories. Existing social tie detection methods often require exact locations of users, which cause serious privacy concerns. Although cloaking is a common technique for location anonymization, it has rarely been applied in social tie detection due to the potential loss of significant location information. In this paper, we propose a semantic tree model for social tie detection, which supports different levels of privacy preserving and allows better understanding of location content of the cloaking regions. We propose a novel algorithm that can infer the social ties between users using only their cloaked trajectories without exposing their exact locations. We model the obscured regions generated by the cloaking algorithms in a semantic region tree and infer the similarity between two users based on their temporal and spatial relations in the tree. We evaluate our proposed approach using real trajectory dataset and show that our algorithm can identify social ties successfully with 15% higher accuracy compared with existing approach.\n\t"}, "conf/pcs/ZhaoGLGWQC15": {"title": "A cloud-assisted DASH-based Scalable Interactive Multiview Video Streaming framework.", "url": "https://doi.org/10.1109/PCS.2015.7170079", "year": "2015", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Jia Guo": "57/4142", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Interactive multiview video streaming (IMVS) allows viewers to periodically switch viewpoint. Its user experience can be further enhanced by creating virtual views from neighboring coded views using view synthesis techniques. Dynamic adaptive streaming over HTTP (DASH) is a new standard that can adjust the quality of video streaming according to the network condition. In this paper, we propose an improved DASH-based IMVS scheme over wireless networks. The main contributions are twofold. First, our scheme allows virtual views to be generated at either the cloud-based server or the client, and can adaptively select the optimal approach based on the network condition and the cost of the cloud. Second, scalable video coding is used in our system. Simulations with the NS3 tool demonstrate the advantage of our proposed scheme over the existing approach with client-based view synthesis and single-layer video coding."}, "conf/pimrc/ZhangLRMW15": {"title": "Crowdsourcing energy-efficient participants to ensure quality-of-information.", "url": "https://doi.org/10.1109/PIMRC.2015.7343555", "year": "2015", "author": {"Bo Zhang 0032": "36/2259-32", "Chi Harold Liu": "45/4723", "Ziyu Ren": "172/4445", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Crowdsourcing systems, by using smart devices like smartphones and iPad, have been widely used in various domains, but are currently facing new challenges. On one hand, different tasks offer different amount of incentive budgets in multitask systems, thus those tasks pay more should be satisfied preferentially. On the other hand, even if there are not enough budget for a sensing task, the system should also try to provide as much sensory data as possible to obtain potential clients. Furthermore, it is challenging to select an “optimal” set of participants as data contributors due to the above two points. In this paper, first, we introduce a metric to describe how the collected sensory data can quantify task's the multi-dimensional data requirements, in terms of data distribution in spatiotemporal domains. Second, we propose a “task priority model” based on incentive budget, to explicitly quantify the relationship between the incentive budget usage and task priority. Then, we present a quality of information (QoI) aware participant selection approach as a suboptimal solution to the defined optimization problem. Finally, we compare our proposed scheme with existing methods via extensive simulations based on the real movement traces of ordinary citizens in Beijing. Extensive simulation results well justify the effectiveness and robustness of our approach."}, "conf/comcomap/XiaoWYW14": {"title": "A video sensing oriented speed adjustable fast multimedia encryption scheme and embedded system.", "url": "https://doi.org/10.1109/ComComAp.2014.7017202", "year": "2014", "author": {"Chen Xiao": "05/3054", "Wendong Wang": "80/4406", "Nan Yang": "51/1629", "Lifeng Wang": "82/6720"}, "abstract": " Abstract:In embedded video sensing system, real-time video data is high-volume. Meanwhile, the computation and energy resources are very limited, which restricts the usage of complex encryption process on video data. Therefore the confidentiality of video data under limited resources needs to be addressed. Firstly, dissymmetry with its trend between data volume and limited resources has been studied, while a strategy of resources optimization is given. Secondly, an all-purpose speed adjustable fast encryption scheme with its improved version is proposed. Thirdly, a DSP and ARM based embedded secure video sensing system is designed, and the fast encryption scheme and the improved version have been implemented in secure video data storage and transmission of system respectively. Experimental analyses show that the encryption schemes can meet the system's real-time requirements under the tight resource constraints."}, "conf/globecom/QiWGQ14": {"title": "A SDN-based network virtualization architecture with autonomie management.", "url": "https://doi.org/10.1109/GLOCOMW.2014.7063427", "year": "2014", "author": {"Qinglei Qi": "160/4952", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:The ossified architecture and widespread application of the internet have restricted its development For overcoming the existing obstacles of network innovation and management, network virtualization and autonomic management have been proposed. However, these two attractive technologies are subjected to the headaches of updating various devices. Software-Defined Networking (SDN) separates the control plane from the data plane. Therefore, some network control and management functions could be implemented through softwares. This provides a chance for the network virtualization and autonomic management In this paper, a SDN-based network Virtualization architecture with Autonomic management (SDNVA) is proposed. The SDNVA architecture enables heterogeneous virtual networks to coexist on the same physical network, and supports hierarchical autonomic management. Moreover, we evaluate SDNVA on our testbed and find that the SDNVA architecture can perceive topology changes and isolate multiple virtual networks."}, "conf/globecom/SunWHQG14": {"title": "SDN-based autonomic CCN traffic management.", "url": "https://doi.org/10.1109/GLOCOMW.2014.7063428", "year": "2014", "author": {"Qi Sun": "05/4187", "Wendong Wang": "80/4406", "Yannan Hu": "133/3740", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:Content-Centric Networking (CCN) is a novel architecture that has been proposed as a solution for dealing with various problems obsessing the Internet, such as the excessive bandwidth costs that result from peer-to-peer (P2P) traffic and content delivery networks (CDN). CCN names packets rather than end-hosts, and most of CCN's characteristics are the consequences of this fact. However, the current design of CCN has some limitations in traffic control, especially in flow fairness and node-to-node collaboration. To solve this problem, we propose an SDN-based autonomie system as the control plane to supplement CCN traffic management. Correspondingly, in the data plane, we utilize a multiprotocol switch to support CCN protocol, flow-aware content delivery and traffic control. We also discuss the implementation and extension issues, and finally, we demonstrate our hybrid scheme to perform centralized and intelligent traffic management, which provides higher awareness, fairness, and low congestion."}, "conf/globecom/HuWGLQC14": {"title": "Control traffic protection in software-defined networks.", "url": "https://doi.org/10.1109/GLOCOM.2014.7037082", "year": "2014", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Chi Harold Liu": "45/4723", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Software Defined Networking (SDN) is an emerging networking paradigm that assumes a logically centralized control plane separated from the data plane. Despite all its advantages, separating the control and data planes introduces new challenges regarding resilient communications between the two. That is, disconnections between switches and their controllers could result in substantial packet loss and performance degradation. To achieve resilient control traffic forwarding, this paper investigates the protection of control traffic in SDNs with multiple controllers. We propose a control traffic protection scheme that combines both local rerouting and constrained reverse forwarding protections. This scheme enables switches to locally react to failures and redirect the control traffic to controllers by using standby backup forwarding options. Our goal is then to find a set of primary routes for control traffic, called protection control network, where as much control traffic as possible can benefit from the proposed protection scheme. We formulate the protection control network problem and develop an algorithm to solve it. Simulation results on real topologies show that our approach significantly improves the resilience of control traffic."}, "conf/icc/ZhaoGLWQC14": {"title": "Scheduling and resource allocation for wireless dynamic adaptive streaming of scalable videos over HTTP.", "url": "https://doi.org/10.1109/ICC.2014.6883564", "year": "2014", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Recently dynamic adaptive streaming over HTTP (DASH) has gained significant attentions. In this paper, we study DASH-based transmission of scalable videos in wireless broadband access networks (e.g. LTE, WiMAX), and propose a DASH-friendly scheduling and resource allocation scheme (DFSRA) to enhance the Quality-of-Experience (QoE) of wireless DASH users. By integrating DASH-based media delivery and radio-level adaptation in a cross-layer manner, the scheme can determine the optimal wireless resource allocation. A gradient-based algorithm is proposed to solve the optimization problem, which has the following advantages over traditional algorithms: (1) The characteristics of video content and scalable video coding are utilized. (2) The client buffer status is considered to reduce video playback interruption and buffer overflow. Simulations with the Qualnet tool demonstrate that our scheme achieves better performance than existing methods in the literature."}, "conf/icsai/LiWZLX14": {"title": "The application of B-spline based interpolation in real-time image enlarging processing.", "url": "https://doi.org/10.1109/ICSAI.2014.7009398", "year": "2014", "author": {"Kaiyu Li": "131/2839", "Wendong Wang": "80/4406", "Kaiwen Zheng": "229/1439", "Wenbo Liu 0001": "55/3754-1", "Guili Xu": "11/3538"}, "abstract": " Abstract:Efficient algorithms for the continuous representation of a discrete signal in terms of B-splines and for interpolative signal reconstruction have been proposed in this paper. It analyzes the relationship between the degree of the spline and the quality of the interpolation. By taking the z-transforms of the sampled B-spline functions, a fast interpolation algorithm based on digital filters of IIR and FIR is proposed, which is quite suitable for hardware realization with its ideal processing result and high-speed computing. Through the example of image enlargement, the application of cubic B-spline based interpolation in image processing is investigated. It designs a fast and high-quality image enlargement and display system based on FPGA. It is proved in the experiment to be qualified for the real-time image processing."}, "conf/iwqos/SongNMW14": {"title": "A novel incentive negotiation mechanism for participatory sensing under budget constraints.", "url": "https://doi.org/10.1109/IWQoS.2014.6914336", "year": "2014", "author": {"Zheng Song": "181/2470", "Edith C. H. Ngai": "25/5713", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Incentive allocation is an important research issue in participatory sensing as it determines the willingness of participants in joining the sensing campaign. Existing incentive approaches either decide the payments without consulting the participants, or require burdensome negotiation procedures like bid-price auction. In this paper, we propose a novel incentive allocation mechanism, which encourages participation and allocates incentives dynamically to achieve accurate sensing results. The proposed mechanism consists of two major elements. The first is a lightweight incentive negotiation procedure, which dynamically offers incentives to participants in spatio-temporal subregions and collects their responses. The second is the optimization problem for incentive allocation as well as it's solution, which aims at maximizing data quality by capturing the amount and the distribution of data samples. Simulations with real datasets confirmed that the proposed solution can provide dynamic incentive offers according to the estimated value of participants' data contribution to the overall quality of sensing result."}, "conf/secon/SongZLVMW14": {"title": "QoI-aware energy-efficient participant selection.", "url": "https://doi.org/10.1109/SAHCN.2014.6990360", "year": "2014", "author": {"Zheng Song": "181/2470", "Bo Zhang 0032": "36/2259-32", "Chi Harold Liu": "45/4723", "Athanasios V. Vasilakos": "40/4747", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:In increasingly popular participatory sensing systems, new challenges are arising to select the most appropriate participants when considering their hand-held smart device's different energy conditions, uncontrollable mobility pattern, and associated sensing capabilities to best satisfy the quality-of-information (QoI) requirements of sensing tasks. This paper proposes a QoI-aware energy-efficient participant selection strategy, where four key design elements are proposed. First is QoI satisfaction metric of a sensing task that uses the data granularity and quantity collected by participants to measure to what extend the task's QoI requirements are satisfied. Second is an “energy consumption index”, which estimates the impact of energy cost during the data collection on different participant's smart devices with different remaining energy levels. Third is the estimation of the collected amount of data by participants, where a probability-based movement model is proposed. Fourth is the proposal of a multi-objective constrained optimization problem for participant selection, where task QoI requirements and energy consumption index of all participants are taken as optimization objectives, and solved by our proposed suboptimal, easy-to-implement solution. Real and extensive trace-based experiments show that, the proposed participant selection scheme can well balance the trade-off between the task QoI and energy consumptions by selecting most efficient participants, compared with existing schemes."}, "conf/vtc/SongMDWGQ14": {"title": "Phone-Radar: Infrastructure-Free Device-to-Device Localization.", "url": "https://doi.org/10.1109/VTCSpring.2014.7023055", "year": "2014", "author": {"Zheng Song": "181/2470", "Jian Ma 0001": "26/4870-1", "Mingming Dong": "158/3407", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:In some practical scenarios such as tour guiding and children babysitting, one mobile device held by tour guides or parents need to know the distance and direction of another nearby mobile device held by tourist or children. However, to date, most existing pedestrian localization methods rely on a fixed external infrastructure, such as a global positioning system(GPS) or pre-deployed wifi access points to provide Localization service for mobile devices. Such methods are constrained either by limited GPS coverage or by complicated set-up procedures. We observe that, when two devices are moving, the change of their positions leads to the change of distance between them. Given the same movements, different relative locations between devices lead to different distance changes. Besides, the distance between and relative movement of devices can be measured by two phone-embedded sensors respectively. This motivates us to exploit the relative localization method by merely two mobile devices. In this work, we present Phone-Radar, which is an infrastructure-free device-to-device localization system. According to the propagation model of wireless signals, the change of distance between devices are modeled by the change of wireless signal strength between them. The movements of devices are recorded by the inertial sensors using step-counting method. We further study the relationship among the initial relative locations between the two devices, their relative movements and the change of received signal strength measurements. Moreover, we implement the proposed method and measure its performance under real world conditions. The testbed experiments show the efficiency of our proposed method."}, "conf/wcnc/SongNMGLW14": {"title": "Incentive mechanism for participatory sensing under budget constraints.", "url": "https://doi.org/10.1109/WCNC.2014.6953116", "year": "2014", "author": {"Zheng Song": "181/2470", "Edith C. H. Ngai": "25/5713", "Jian Ma 0001": "26/4870-1", "Xiangyang Gong": "04/8431", "Yazhi Liu": "70/10126", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Incentive strategy is important in participatory sensing, especially when the budget is limited, to decide how much and where the samples should be collected. Current auction-based incentive strategies purchase sensing data with lowest price requirements to maximize the amount of samples. However, such methods may lead to inaccurate sensing result after data interpolation, particularly for participants that are massing in certain subregions where the low-price sensing data are usually aggregated. In this paper, we introduce weighted entropy as a quantitative metric to evaluate the distribution of samples and find that the distribution of data samples is another important factor to the accuracy of sensing result. We further propose a greedy-based incentive strategy which considers both the amount and distribution of samples in data collection. Simulations with real datasets confirmed the impact of samples distribution to data accuracy and demonstrated the efficacy of our proposed incentive strategy."}, "conf/apcc/LuWGQ013": {"title": "Empirical analysis of different hierarchical addressing deployments.", "url": "https://doi.org/10.1109/APCC.2013.6765943", "year": "2013", "author": {"Xuan Lu": "51/3865", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Currently the increasing prevalence of multi-homing and traffic engineering leads to an explosive growth of the global routing table. It is well known that hierarchical addressing could improve the routing scalability. Hence, some proposals exploring the routing architecture for future Internet reuse the hierarchical addressing for the locator assignment. However, this may result in some ASes assigned too many prefixes which would consequently make hosts, routers, Internet Service Providers and Domain Name System faced with big challenges. By modeling the Internet AS-level topology using a hierarchical graph, we define the processes of prefix assignment and routing advertisement in different hierarchical addressing deployment ways. Then, we quantify the impact of these deployments on the prefix assignment and the routing scalability based on the real routing data. we find that when the deploying position gets lower, the prefix amount of arbitrary AS is getting smaller, while the size of the global Forwarding Information Base is monotonically increasing. Comparing with the actual Internet's data, suitable deployment ways for hierarchical addressing are obtained. With these deployment ways, the excessive prefix problem is solved and the size of the global Forwarding Information Base could be reduced into 56% or even 32% of the one in current Internet."}, "conf/bmei/WangSYGS13": {"title": "Compatibility of US motors for development of MRI-guided surgical robot.", "url": "https://doi.org/10.1109/BMEI.2013.6746969", "year": "2013", "author": {"Wendong Wang": "80/4406", "Yikai Shi": "134/1122", "Xiaoqing Yuan": "32/9545", "Andrew A. Goldenberg": "53/6792", "Peyman Shokrollahi": "156/6688"}, "abstract": " Abstract:US (Ultrasonic) motors have potential applications as MR-compatible actuators for MRI-guided surgical robots. MR compatibility test of US motors (Shinsei USR 30 and USR 60) were performed in 3T MRI scanner under baseline, power-off, power-on, and moving configurations with mounting orientations parallel and perpendicular to the longitudinal bore axis. Normalized SNR was used to calculate the MR compatibility of US motors. The results show that the safe distances for USR 30 and USR 60 from the isocenter are 15cm and 20cm, respectively. Moving configuration decreased the normalized SNR by 15%-25%. In the same mounting orientation, three imaging sequences performed differently in terms of quality of MR images. To conclude, the Shinsei USR 30 and USR 60 are suitable for providing actuation of MRI-guided surgical robot during real-time imaging, and the MR compatibility could be improved by selecting suitable safe distance and mounting orientation."}, "conf/cis/HuangHQW13": {"title": "Polarity Identification of Sentiment Words Based on Emoticons.", "url": "https://doi.org/10.1109/CIS.2013.35", "year": "2013", "author": {"Shuigui Huang": "142/2119", "Wenwen Han": "142/2230", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:The orientation of sentiment words plays an important role in the sentiment analysis, but existing methods have difficulty in classifying the orientation of Chinese words, especially for the newly emerged words in Internet. Most approaches are mining the association between sentiment words and seed words using the big corpora and manually labeled seed words with definite orientation. But less work has ever focused on the efficient seed words selection. As we observed, emoticons, which are widely used on social network because of the simplicity and visualization, are good indicators for sentiment orientation. Thus this paper proposes the sentiment word model based on emoticons, which built orientation model of sentiment words with the orientation of emoticons, and train the model with the SVM classifier. Meanwhile, this work proposes a high efficient way to automatically classify the orientation of emoticons. Experiments show the precision rate of emoticon classification could reach 93.6%, and that of sentiment words classification could be 81.5%."}, "conf/dasc/LinGWWZ13": {"title": "Tunnel Congestion Exposure and Feedback.", "url": "https://doi.org/10.1109/DASC.2013.123", "year": "2013", "author": {"Yi Lin": "42/5120", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xinpeng Wei": "147/7735", "Lei Zhu": "99/549"}, "abstract": " Abstract:Tunneling technology has been widely applied in the network, but the lack of effective congestion exposure in the tunnel, seriously affect the performance of the tunnel technology. This document will focus on the tunnel scenario, to design a tunnel congestion exposure and feedback model, and the tunnel congestion marking scheme and congestion information feedback scheme. First, the document describes Tunneling Protocol, Secondly describes the congestion problems in the tunnel, Thirdly proposes a basic tunnel congestion exposure model, Finally, proposes the detail of tunnel congestion marking and feedback scheme for the model. Modifying the ECN tunnel rules of RFC3168 and RFC6040, congestion marking scheme can be applied to the feedback model. Congestion feedback scheme use GRE (Generic Routing Encapsulation) header format extension to carry the feedback information. Content and format of Congestion feedback, and the transmission of feedback information are also discussed in the document."}, "conf/globecom/LiQHGW13": {"title": "An autonomic management architecture for SDN-based multi-service network.", "url": "https://doi.org/10.1109/GLOCOMW.2013.6825092", "year": "2013", "author": {"Hongyun Li": "146/6873", "Xirong Que": "27/8431", "Yannan Hu": "133/3740", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Software-Defined Networking (SDN) is a new paradigm, which emerged in the innovation for future networks and has been successfully applied in many scenarios including Campus/Enterprise network and Data Center network. By extending the concept of SDN and autonomicity to the design of versatile network infrastructures, especially to the design of a carrier grade network, we propose AMA, which is an autonomic management architecture for SDN-based multi-services network. AMA is designed and implemented by utilizing autonomic management and network virtualization technologies. We believe that AMA can support more application types, and can be used to build a more flexible network."}, "conf/globecom/ZhouGHQW13": {"title": "PindSwitch: A SDN-based protocol-independent autonomic flow processing platform.", "url": "https://doi.org/10.1109/GLOCOMW.2013.6825094", "year": "2013", "author": {"Tong Zhou": "30/97", "Xiangyang Gong": "04/8431", "Yannan Hu": "133/3740", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Software Defined Networking (SDN) has already gained enormous momentum in the industry. Its innovative architecture that separates the control and forwarding planes allows third-party software developers more leeway in controlling network behavior. Since new protocols and forwarding schemes are needed to produce better network performance, efforts have been put forth in redefining user-defined protocol support. Besides, the concept of autonomicity has been proposed recently to solve the dilemma of management in complex network environments. In this paper, we propose the design and implementation of PindSwitch, which provides a SDN-based Protocol-independent platform to allow users to outline their own protocols' format and flow processing rules into physical switches. We also introduce autonomicity and self-* attributes into SDN by extending the architecture of GANA to achieve better management of user-defined protocols and their processing schemes."}, "conf/greencom/SongTHQW13": {"title": "Leading Users Detecting Model in Professional Community Question Answering Services.", "url": "https://doi.org/10.1109/GreenCom-iThings-CPSCom.2013.226", "year": "2013", "author": {"Siqi Song": "155/6875", "Ye Tian 0008": "32/5495-8", "Wenwen Han": "142/2230", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Community question answering (CQA) services provide platforms for increasing number of users to seek for help and exchange ideas in recent years. As a professional community, Quora is quite different from other traditional CQA websites, such as Baidu Zhidao and Yahoo! Answers. As users' social statuses play a more important role, besides just raising questions and finding a proper answer which the asker is satisfied with, people are inclined to have more discussions about the question, corresponding answers and related topics. Due to the spirit of wiki, people, especially some leading users work hard together to make the community a knowledge base of high quality, which in turn attracts more people to take part in this job. Thus, in this study, we focus on detecting leading users within a specific topic area of professional CQA services. A leading capacity model is utilized and three major criteria, which are authority, activity and influence, are taken into consideration. Then, an improved Borda count model is proposed to make a collective decision. Experimental results show effectiveness of the proposed method for finding leading users."}, "conf/icc/LiuMNZW13": {"title": "Roadside units deployment for content downloading in vehicular networks.", "url": "https://doi.org/10.1109/ICC.2013.6655628", "year": "2013", "author": {"Yazhi Liu": "70/10126", "Jian Ma 0001": "26/4870-1", "Jianwei Niu 0002": "25/4653-2", "Yan Zhang 0002": "04/3348-2", "Wendong Wang": "80/4406"}, "abstract": " Abstract:The Vehicular Ad hoc Networks (VANETs) have been recently introduced to provide high-speed Internet access to vehicles by deploying 802.11 enhanced Roadside Units (RSUs) along roads. However, few content downloading oriented RSU deployment strategies have been proposed. In this paper, we propose a new RSU deployment strategy for content downloading in VANETs. The encounters between vehicles and RSUs are modeled as a time continuous homogeneous Markov chain. The optimal inter-meeting time between vehicles and RSUs is analyzed based on the encounter model. Then, the road network is modeled as a weighted undirected graph, and a RSU deployment algorithm is designed based on the depth-first traversal algorithm for edges of a graph. Simulation results show that the proposed RSU deployment algorithm can satisfy the file downloading service requirements with the lowest RSU deployment cost."}, "conf/im/HuWGQC13": {"title": "Reliability-aware controller placement for Software-Defined Networks.", "url": "https://ieeexplore.ieee.org/document/6573050/", "year": "2013", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:The Software-Defined Network (SDN) approach decouples control and forwarding planes. Such separation introduces reliability design issues of the SDN control network, since disconnection between the control and forwarding planes may lead to severe packet loss and performance degradation. This paper addresses the problem of placing controllers in SDNs, so as to maximize the reliability of control networks. After presenting a metric to characterize the reliability of SDN control networks, several placement algorithms are developed. We evaluate these algorithms and further quantify the impact of controller number on the reliability of control networks using real topologies. Our approach can significantly improve the reliability of SDN control networks without introducing unacceptable latencies."}, "conf/vnc/SongLMGW13": {"title": "Short paper: Multi-task-oriented dynamic participant selection for collaborative vehicle sensing.", "url": "https://doi.org/10.1109/VNC.2013.6737616", "year": "2013", "author": {"Zheng Song": "181/2470", "Yazhi Liu": "70/10126", "Ran Ma": "56/7649", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Vehicles can provide various sensing abilities and unlimited communication capabilities and are taken as an important platform for collecting sensory data for multiple on-going urban sensing tasks. However, new challenge arises for selecting vehicles with different incentive requirements, various sensing abilities and uncontrollable mobilities to best satisfy heteroid sensory data requirements of multiple concurrent applications under budget constraints, but with sparsely research exposure. This paper proposes a multi-task-oriented participant selection strategy to tackle the above mentioned challenge. The difference between data requirements of multiple tasks and data collection expectation of a set of vehicles are converted to a multi-aim optimization problem, and a greedy-algorithm-based participant selection strategy is designed to solve it. Real dataset based simulation show that under the same incentive costs condition, the proposed participant selection strategy can obtain more comprehensive sensory data than selecting vehicles randomly."}, "conf/ACISicis/LiWDZW12": {"title": "The Edge Collapse Algorithm Based on the Batched Iteration in Mesh Simplification.", "url": "https://doi.org/10.1109/ICIS.2012.107", "year": "2012", "author": {"Guanlong Li": "41/11524", "Wendong Wang": "80/4406", "Guohong Ding": "57/9235", "Yanming Zou": "18/5686", "Kongqiao Wang": "51/1789"}, "abstract": " Abstract:The mesh simplification technology plays an important role in computer graphics, reverse engineering, cultural relic protection and other fields which involve 3D modelling and dynamic demonstration. The geometric elements decimation algorithm, as one of triangle mesh simplification algorithms, has many advantages over the other simplified algorithms. The study in this paper puts forward an optimized solution based on QEM (Quadric Error Metric) which is a representative edge collapse algorithm. The optimized algorithm improves efficiency of mesh simplification and provides better pictures quality comparing with QEM algorithm in the project practice."}, "conf/ccis/ZhaoGWQ12": {"title": "A rate adaptive algorithm for HTTP streaming.", "url": "https://doi.org/10.1109/CCIS.2012.6664230", "year": "2012", "author": {"Yanan Zhao": "00/4709", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Recently, the traffic volume of HTTP streaming application is rapidly growing on the Internet. As an adaptive streaming technology, the most challenge of HTTP streaming technology is when and how to switch bitrates so that the user can get satisfactory experience. In this paper, we propose a novel Bitrates Adaptive HTTP Streaming (BAHS) algorithm. This algorithm uses application layer information, not needs to require information from transport layer, detecting network congestion and client buffer state to determine next media quality level. Simulation results show that the flexible BAHS algorithm can effectively combine real-time network state with client player buffer as well as control the frequency and total time of buffer overflow and underflow, prompting user experience."}, "conf/ccis/LiuWGQY12": {"title": "A hybrid model based on Kalman Filter and neutral network for traffic prediction.", "url": "https://doi.org/10.1109/CCIS.2012.6664231", "year": "2012", "author": {"Jianying Liu": "167/5781", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Hao Yang": "54/4089"}, "abstract": " Abstract:In this paper, a hybrid model based on Kalman Filter and Neural Network is introduced for traffic prediction to make our travel more convenient. The proposed model, taking both the real-time data and the historical data, can predict the link travel time in near future more accurately and thus increase the user service quality of APTS. The performance of evaluation is demonstrated on the real link travel time from Wenhui Bridge to Mingguang Bridge collected by mobile phone supporting GPS. Finally MAPE is used to calculate the prediction error and the result shows that the hybrid model performs well than both the two separate models. Based on our proposed model for traffic prediction, the APTS, which is one of the most important applications of ITS, would attract much more people to use the public transportation system and greatly reliever the burden of the urban traffic pressure."}, "conf/ccis/GuoQCWC12": {"title": "A hybrid social search model based on the user's online social networks.", "url": "https://doi.org/10.1109/CCIS.2012.6664235", "year": "2012", "author": {"Liang Guo": "52/2803", "Xirong Que": "27/8431", "Yidong Cui": "03/8966", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Online social networks (OSNs) have become a new networking platform for connecting people through a variety of mutual relationships. Owing to its widespread use of applications such as email, online shopping, online business networking and instant messaging, OSNs play an indispensable part in people's work and life. People tend to seek information through their OSNs rather than the traditional search engine. This paper presents a hybrid social search model, which harnesses the user's social relation to generate the satisfying results. Upon receiving a user's query, the social search model aims to return a list of ranked answerers who might give the correct answers to that query. Two novel algorithms are proposed to calculate the result ranking: 1) Topic Relevance Rank (TRR) evaluates user's professional score on the relevant topics; 2) Social Relation Rank (SRR) captures the social relation strength between users. In addition, a topic classification label is defined to control the weight of these two algorithms. We describe the architecture of the social search model and give details of the ranking algorithms. A use-case is described to illustrate the potential applications of the proposed model. 3G RenRen Network, mobile edition of the biggest student social networking site in China is studied and the experiment results show that the two ranking algorithms under control of topic classification label can benefit the social search model evidently."}, "conf/ccis/HuWGQC12": {"title": "BalanceFlow: Controller load balancing for OpenFlow networks.", "url": "https://doi.org/10.1109/CCIS.2012.6664282", "year": "2012", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:In the discussion about Future Internet, Software-Defined Networking (SDN), enabled by OpenFlow, is currently seen as one of the most promising paradigm. While the availability and scalability concerns rises as a single controller could be alleviated by using replicate or distributed controllers, there lacks a flexible mechanism to allow controller load balancing. This paper proposes BalanceFlow, a controller load balancing architecture for OpenFlow networks. By utilizing CONTROLLER X action extension for OpenFlow switches and cross-controller communication, one of the controllers, called “super controller”, can flexibly tune the flow-requests handled by each controller, without introducing unacceptable propagation latencies. Experiments based on real topology show that BalanceFlow can adjust the load of each controller dynamically."}, "conf/ccis/ChenGWQ12": {"title": "VNMC for network virtualization in OpenFlow network.", "url": "https://doi.org/10.1109/CCIS.2012.6664285", "year": "2012", "author": {"Yang Chen": "48/4792", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Network virtualization provides an efficient way to share physical network infrastructure so that multiple virtual slices can run concurrently. OpenFlow is a promising and successful future networking technology which enables network innovation efficiently. However, the existing network virtualization methods in OpenFlow network usually have limitations such as introducing a proxy, flow entry conflicts, lacking of extensibility. In this paper, we present VNMC, a Virtual Network Management Component for rapidly creating, configuring and managing virtual networks in OpenFlow network. It has the following features: VNMC is implemented in a single controller without a middle layer. VNMC provides bandwidth guarantee, topology isolation, flow isolation and control isolation. It resolves flow entry conflicts from different controllers using the multiple flow tables mechanism defined in the latest OpenFlow standard. It manages the virtual networks in a modular way, which brings great extensibility to add new functionalities to virtual networks."}, "conf/ccis/HanWHTM12": {"title": "Media capacity estimation: Discovering news feed accounts for information sourcing.", "url": "https://doi.org/10.1109/CCIS.2012.6664319", "year": "2012", "author": {"Wenwen Han": "142/2230", "Wendong Wang": "80/4406", "Shuigui Huang": "142/2119", "Ye Tian 0008": "32/5495-8", "Jian Ma 0001": "26/4870-1"}, "abstract": " Abstract:Micro blogging is gaining increasingly popularity for both publishing updates and receiving news. However, the enormous daily generated statuses are far beyond human's reading limitation. “Follow” mechanism partly reduces the information overloaded problem but introduces a new one: it is hard to select whom to subscribe from vast accounts. Our objective is to find the accounts that are suitable to be subscribed as news feeds. We propose a media capacity model that measures accounts' ability using criteria as: activity, reliability, content amount and posting stability. Besides, Weighed Borda Counting model is used to make collective decision. Furthermore, a supervised weight learning approach is designed to assign the weights for each criterion. The proposed method is evaluated on a one-year sampling of Sina postings. Experimental results show that the approach is able to top out accounts that gain better synthetic performance than others under selected criteria, and could obtain an average precision of 93.58% for top 200 users."}, "conf/ccis/ZhangMWL12": {"title": "A novel privacy protection scheme for participatory sensing with incentives.", "url": "https://doi.org/10.1109/CCIS.2012.6664535", "year": "2012", "author": {"Junsong Zhang": "15/9171", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406", "Yazhi Liu": "70/10126"}, "abstract": " Abstract:With the increasing popularity of smart phones, a new collaborative sensing application, named participatory sensing, gradually appeared. The key idea of participatory sensing is to employ so many users to collect and share sensed data using their mobile phones. Current relevant applications are mainly focused on how to collect sensed data. Few methods have been proposed for user privacy in participatory sensing applications. We proposed a novel privacy protection scheme for participatory sensing applications. In this scheme, we use the pseudonym, encryption function and hash function to protect the user's privacy and meanwhile to carry out incentives. Finally, we present an analysis of our protocol to show that our protocol meets the security requirements of participatory sensing application."}, "conf/cwsn/SongX0ZW12": {"title": "Dynamic Bluetooth Packet Selection Strategy Based on Wi-Fi White-Space Prediction.", "url": "https://doi.org/10.1007/978-3-642-36252-1_38", "year": "2012", "author": {"Zheng Song": "181/2470", "Yongping Xiong": "61/8573", "Jian Ma 0001": "26/4870-1", "Ke Zhang": "20/4152", "Wendong Wang": "80/4406"}, "abstract": "In order to coexist Bluetooth with Wi-Fi in mutual interference environment, carrier sensing and traffic forecasting model are used to optimize the packet selection mechanism in Bluetooth frequency-hopping process. The probability of collisions of Bluetooth signal and Wi-Fi signal is gained by baseband layer energy sampling and Wi-Fi traffic forecasting model. According to the collision probability, the packet types are selected to achieve maximum throughput of Bluetooth. Simulation and analysis show that the algorithm can effectively coexist Wi-Fi with Bluetooth by mean of time divided channel multiplexing in real world Wi-Fi environment.KeywordsWireless CommunicationHeterogeneous networks coexistenceDynamic Packet Selection StrategyWhite Space Prediction"}, "conf/fskd/JiaLWGQ12": {"title": "A novel host mobility support method in IPv4/IPv6 network of RANGI architecture.", "url": "https://doi.org/10.1109/FSKD.2012.6233918", "year": "2012", "author": {"Yichen Jia": "116/8410", "Xuan Lu": "51/3865", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the growing demand of the host mobility, the problems of overloading of IP address semantics are becoming increasingly serious. People have figured out various ID/Locator split technologies to support host mobility. In fact, current network environment is still in mixed IPv4/IPv6 transition phase, but the existing technology for host mobility in this transition phase is not considered comprehensively. In this paper, we propose a novel method to support host mobility between IPv4 and IPv6 network, and give a detailed explanation through a new ID/Locator split architecture which called RANGI (Routing Architecture for the Next Generation Internet). There are two contributions in this method: First, it supports the host mobility in transition phase; second, it is like the host mobility means in IPv6, so it provides a good capacity of smooth transition from IPv4 to IPv6."}, "conf/fskd/MaDGWY12": {"title": "Optimal public transit path searching algorithm based on traffic condition.", "url": "https://doi.org/10.1109/FSKD.2012.6233939", "year": "2012", "author": {"Xia Ma": "37/7093", "Yu Ding": "77/6871", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Hao Yang": "54/4089"}, "abstract": " Abstract:Public transit path algorithm is the core of a public transportation query system. Providing travel plans with time information close to the actual situation will bring great convenience to passengers. An optimal public transit path algorithm is presented in this paper. It considers the impact of traffic situation on the bus, and factors such as transfer times, travel time, walking distance, and the priority of transfer stops. The algorithm is implemented and compared with existing public transportation query tools."}, "conf/globecom/WangYQG12": {"title": "Autonomicity design in OpenFlow based Software Defined Networking.", "url": "https://doi.org/10.1109/GLOCOMW.2012.6477681", "year": "2012", "author": {"Wendong Wang": "80/4406", "H. U. Yannan": "127/6295", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:Software Defined Networking (SDN) is a new area in network management. It is understood as using software to improve the network capabilities and intelligence. Autonomicity is one of proposed technologies, which also can improve network management capabilities. A scheme of the combination of OpenFlow based SDN and Autonomicity is proposed in this paper to introduce self-* attributes into OpenFlow Based SDN so that the network could be better controlled and operated efficiently."}, "conf/globecom/WangGQ11": {"title": "Context-aware autonomic QoS model for future Internet.", "url": "https://doi.org/10.1109/GLOCOMW.2011.6162534", "year": "2011", "author": {"Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the rapid expansion of Internet applications and network infrastructure, Internet is facing many technical challenges. Autonomicity is proposed as one of candidate technologies to solve the Internet management problems. In this paper, a context-aware autonomic QoS model is proposed to improve the Internet manageability. Some key design principles based on the EFIPSANS GANA reference model are introduced. The framework and function blocks of context-aware autonomic QoS model are described in detail. This design has been approved by the implementation of the self-* functionalities testbed."}, "conf/icc/ChengDCMW11": {"title": "Robust Forwarding for Reactive Routing Protocols in Wireless Ad Hoc Networks with Unreliable Links.", "url": "https://doi.org/10.1109/icc.2011.5963282", "year": "2011", "author": {"Long Cheng 0005": "49/225-5", "Sajal K. Das 0001": "d/SajalKDas", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Wireless ad hoc networks can experience significant performance degradation under fading channels. In this work, we present a robust forwarding extension (RFE) for reactive routing protocols in wireless ad hoc networks. RFE is designed to enhance existing reactive routing protocols to provide reliable and energy-efficient packet delivery against the unreliable wireless links. Specifically, we introduce a biased backoff scheme during the route discovery phase to find a robust virtual path, which can provide more cooperative forwarding opportunities. Along this virtual path, data packets are greedily progressed toward the destination through nodes cooperation. We extend the widely used AODV routing protocol with RFE to study its performance. Through extensive simulations, we demonstrate that AODV-RFE effectively improves the reliability, end-to-end energy efficiency and latency."}, "conf/cikm/TianWWRCM10": {"title": "Topic detection and organization of mobile text messages.", "url": "https://doi.org/10.1145/1871437.1871752", "year": "2010", "author": {"Ye Tian 0008": "32/5495-8", "Wendong Wang": "80/4406", "Xueli Wang": "84/6759", "Jinghai Rao": "r/JinghaiRao", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1"}, "abstract": "\n\t\tHow to organize and visualize big amount of text messages stored on one's mobile phone is a challenging problem, since they can hardly be organized by threads as we do for emails due to lack of necessary metadata such as \"subject\" and \"reply-to\". In this paper, we propose an innovative approach based on clustering algorithms and natural language processing methods. We first cluster the text messages into candidate conversations based on their temporal attributes, and then do further analysis using a semantic model based on Latent Dirichlet Allocation (LDA). Considering that the text messages are usually short and sparse, we trained the model using a large scale external data collected from twitter-like web sites, and applied the model to text messages. In the end, the text messages are organized as conversations based on their topics. We evaluated our approach based on 122,359 text messages collected from 50 university students during 6 months.\n\t"}, "conf/mvhi/LiWT10": {"title": "A Modified Feature Points Extraction Algorithm and it's Adaptability Evaluation.", "url": "https://doi.org/10.1109/MVHI.2010.172", "year": "2010", "author": {"Zhulin Li": "74/443", "Wendong Wang": "80/4406", "Yunna Tian": "157/0239"}, "abstract": " Abstract:Extracting integral feature points is important to object recognition and 3D reconstruction in image processing field. This paper modifies a kind of feature extracting algorithm based on image edge. First, image edge contour is extracted. Second, geometric gravity center of edge outline is calculated. Third, argument-polar radius curve of polar coordinate system whose pole is geometric gravity is formed, and maximum and minimum value points are searched, they are feature points. Comparing the original algorithm, the modified algorithm can not only extract protruding points, but also concave points. In order to evaluate the quality of the algorithm, the paper appraises the adaptability of the algorithm in the case of scale transformation, rotation transformation and affine transformation. The result indicates that the algorithm is simple and its adaptability can reach 79.1%. In actual application, the algorithm has important value to auto-input of two-dimension curve based on feature points and three-dimension reconstruction."}, "conf/pcm/TianRWCM10": {"title": "The Organization of Mobile Personal Lifelog by Activity.", "url": "https://doi.org/10.1007/978-3-642-15696-0_4", "year": "2010", "author": {"Ye Tian 0008": "32/5495-8", "Jinghai Rao": "r/JinghaiRao", "Wendong Wang": "80/4406", "Canfeng Chen": "13/2491", "Jian Ma 0001": "26/4870-1"}, "abstract": "Mobile phone is now playing a role of indispensable assistant in people’s daily life. Abundant of data collections which reflect people’s daily experiences are captured and stored on mobile phone, these data collections are usually referred as mobile personal lifelogs (PLLs), which include data such as: SMS messages, emails, photographs, calendars, videos, notes and etc. Activity based organization of PLLs could not only provide effective visualization and retrieval of data collections, but also benefit augmenting human memory by integrating fragments of memories which embedded in pieces of separated PLL objects. In this paper, we first briefly analyze activity based mobile PLLs organization, then we propose a clustering-based mechanism to realize this objective, finally we will introduce a demonstration prototype “Kaleido Photo” in our research work.KeywordsActivity-basedPersonal LifelogContext-awareOrganization"}, "conf/bmei/WangSWY09": {"title": "Research on Biomechanical Model of Children with Pectus Excavatum.", "url": "https://doi.org/10.1109/BMEI.2009.5305715", "year": "2009", "author": {"Wendong Wang": "80/4406", "Yikai Shi": "134/1122", "Huan Wang": "70/6155", "Li-na Yin": "77/8351"}, "abstract": " Abstract:Overlapping threshold of costal cartilage and muscle tissue is the main issue of pectus excavatum(PE) modeling all the time. A rapid and accurate three dimensional (3D) model was described based on Mimics10.01. The contrast of thorax CT image can be strengthened in advance. The pixels of rigid skeleton and costal cartilage were separated by threshold segment, therefore, we could get rigid skeleton'3D model and costal cartilage's 3D model by region growing. An integrated 3D model was complied by assembling them. Modification was the necessary procedure to acquire a more accurate model, such as erasing noise, drawing missing pixels. The function of editing mask is that it could filter noise which had close pixels with costal cartilage. Surface smooth processing was required to improve the definition of 3D model which we had got. As a result, the shortcomings of traditional method and GE workstation can be overcome. This method has important reference value for finite element analysis (FEA) and draft program of the Nuss procedure."}, "conf/icns/YuanmingWXX08": {"title": "Initiator-Domain-Based SLA Negotiation for Inter-domain QoS-Service Provisioning.", "url": "https://doi.org/10.1109/ICNS.2008.43", "year": "2008", "author": {"Yuanming Cao": "13/8431", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:The problem of providing quality of service (QoS) applications across multi-domain through service level agreement (SLA) negotiation is addressed in this paper. Nowadays, the IP network which can only provide best effort services can not fulfil customers' QoS requirements, and SLA contract signed between service provider and service consumer is proposed to support QoS-based service offering. Service Provider (SP) separated from Network Provider (NP) acts as an independent entity in service provisioning, and needs to negotiate SLA with NP to attain network resource, which enables SP to provide QoS guaranteed services for customers. But in the current Internet, network domains are owned by different network operators and SP and customers may locate in different domains, which makes the SLA negotiation more complicated in QoS-Service provisioning. The initiator-domain-based SLA negotiation system is proposed to meet the negotiation problem."}, "conf/ifip12/HaoMW08": {"title": "An New Algorithm for Modeling Regression Curve.", "url": "https://doi.org/10.1007/978-0-387-87685-6_12", "year": "2008", "author": {"Jisheng Hao": "95/1861", "Lerong Ma": "41/9712", "Wendong Wang": "80/4406"}, "abstract": "A new algorithm for modeling regression curve is put forward in the paper, it combines the B-spline network with improved support vector regression. Our experimental results on simulated data demonstrate that it is feasible and effective.KeywordsSupport vector machinessupport vector regressionB-spline networkregression curve"}, "conf/apweb/WangW06": {"title": "On Studying Partial Coverage and Spatial Clustering Based on Jensen-Shannon Divergence in Sensor Networks.", "url": "https://doi.org/10.1007/11610496_30", "year": "2006", "author": {"Yufeng Wang": "90/6339", "Wendong Wang": "80/4406"}, "abstract": "The idea of partial coverage is provided in this paper, which means that the distance among data trends gathered by neighbor sensors is so small that, in some period, we can cluster those sensors, and replace the cluster with certain sensor in this cluster to form the virtual sensor network topology. But adopting this approach, we need to solve two problems: 1) how to characterize the distance among data trends (rather than raw data) of different sensors; 2) based on the distance, how to form the cluster and use the virtual network to represent the whole sensor network within certain error range. For the first problem, the Jensen-Shannon Divergence (JSD) is used to characterize the distance among different distributions which represent the data trend of sensors. Then, based on JSD, a hierarchical clustering algorithm is provided to form the virtual sensor network topology. Finally, the performance of our approach is evaluated through simulation."}, "conf/atc/TianZWC06": {"title": "A Group Based Reputation System for P2P Networks.", "url": "https://doi.org/10.1007/11839569_33", "year": "2006", "author": {"Huirong Tian": "69/4134", "Shihong Zou": "16/4301", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "In large scale P2P networks, it is less likely that repeat interactions will occur between same peers for the asymmetric interests between them. So it is difficult to establish the direct trust relationship between peers and the network is vulnerable to malicious peers. A group based reputation system GroupRep for P2P networks is proposed in this paper to solve this problem. In GroupRep, the trust relationship is classified into three tiers: the trust relationship between groups, between groups and peers, and between peers. A peer evaluates the credibility of a given peer by its local trust information or the reference from the group it belonging to. A filtering cluster algorithm is proposed to filter unfair ratings provided by malicious peers. As a result, good peers are distinguished from malicious ones. Choosing the download source based on the trust value of responders can make good peers happy with the high ratio of the success query and the high satisfaction level under malicious collusive attacks with front peers.KeywordsTrust RelationshipReputation SystemTrust InformationHigh Positive RatingMalicious PeerThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/cscwd/SunCLW06": {"title": "A Willing-to-Share Based Incentive Mechanism for File Sharing P2P Networks.", "url": "https://doi.org/10.1109/CSCWD.2006.253015", "year": "2006", "author": {"Liang Sun": "18/5837", "Shiduan Cheng": "35/3871", "Yu Lin": "74/2577", "Wendong Wang": "80/4406"}, "abstract": " Abstract:In peer-to-peer file sharing networks, files can be regarded as public goods. Based on the economic game theory, we firstly analyze the performance of file sharing in P2P networks in this paper, and demonstrate that being free-rider is the best strategy for most users without external incentives. Furthermore, another factor is considered in our research that each user has its own willingness to share the file resources (willing-to-share) which is his private information unobserved by other users. Based on these premises, we design an incentive mechanism to induce all users to share the file as many as possible according to his true willingness. In this mechanism, users are inspired to provide commons by taxing them. The correctness and efficiency of this mechanism have been proved by mathematic. At the end of this work, a logical P2P management system has been proposed to make this mechanism running"}, "conf/icc/HuangZWC06": {"title": "Fault management for Internet Services: Modeling and Algorithms.", "url": "https://doi.org/10.1109/ICC.2006.254814", "year": "2006", "author": {"Xiaohui Huang": "22/6958", "Shihong Zou": "16/4301", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:A modeling approach is proposed in this paper to build the bipartite fault propagation model (FPM) for Internet services. The FPM is layered as Internet services involve multiple layers. Two fault localization algorithms, MCA (Max-Covering Algorithm) and MCA+, are designed for the bipartite FPM. MCA+ is an extension of MCA, taking lost and spurious symptoms into account. Simulation results show that MCA+ achieves high detection rate, low false positive rate and has polynomial computational complexity even in the presence of lost and spurious symptoms."}, "conf/icic/WangW06": {"title": "On Studying P2P Topology Based on Modified Fuzzy Adaptive Resonance Theory.", "url": "https://doi.org/10.1007/11816171_50", "year": "2006", "author": {"Yufeng Wang": "90/6339", "Wendong Wang": "80/4406"}, "abstract": "Considering vast and miscellaneous contents in P2P system, intelligent P2P network topology is required to route queries to a relevant subset of peers. Based on the incremental clustering capability of Fuzzy Adaptive Resonance Theory (Fuzzy ART), this paper made use of the modified fuzzy ART to provide small-world P2P construction mechanism, which was not only to categorize peers so that all the peers in a cluster were semantically similar, but, more important, to construct the P2P topology into small-world network structure. In detail, the modified fuzzy ART net was used to cluster peer into one or more appropriate categories according to its data interest, and the reverse selection mechanism in modified fuzzy ART was provided to construct semantic long-range edges among clusters. Simulations demonstrated that P2P small-world network emerged, i. e., highly clustered networks with small diameter, and the information retrieval performance was significantly higher than random topology."}, "conf/icoin/TianZWC06": {"title": "A Reciprocal Capacity Based Adaptive Topology Protocol for P2P Networks.", "url": "https://doi.org/10.1007/11919568_98", "year": "2006", "author": {"Huirong Tian": "69/4134", "Shihong Zou": "16/4301", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "A Reciprocal Capacity based Adaptive Topology Protocol (RC-ATP) for P2P networks is proposed in this paper. It is based on the rational belief that a peer is only willing to maintain connections with those which will benefit it in future. Reciprocal capacity is defined based on peers’ capacity of providing services and of recommending service providers. As a result, reciprocal peers connect each other adequately. Therefore the resulting topologies are more efficient and resilient compared with Adaptive Peer-to-Peer Topologies (APT).KeywordsRational BeliefConnection RequestInit CapacityQuery MessageMalicious PeerThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/ifip1-7/TianZWC06": {"title": "A New Trust Model Based on Advanced D-S Evidence Theory for P2P Networks.", "url": "https://doi.org/10.1007/978-3-540-75227-1_18", "year": "2006", "author": {"Chunqi Tian": "37/4787", "Shihong Zou": "16/4301", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "Building trust relationship between peers in a large-scale distributed P2P file-sharing system is a fundamental and challenging research topic. Recommendation based trust mechanism is widely employed to establish the trust relationship. However, most existing approaches can not efficiently deal with inconsistent or conflicting recommendation information, and uncertainty of information. Dempster-Shafer (D-S) evidence theory is preponderant in tackling uncertainty of information, but classical combination rule always results in unreasonable results especially when evidences severely conflict each other. In this paper, we improve the combination rule for D-S evidence theory and develop a novel trust model based on it. For the problem of security, some measures are also proposed to defense against several malicious attacks. Experimental results show that the proposed model can significantly improve the successful transaction rate of P2P networks and effectively detect malicious behaviors in P2P networks."}, "conf/uic/WangWSH06": {"title": "On Studying P2P Topology Construction Based on Virtual Regions and Its Effect on Search Performance.", "url": "https://doi.org/10.1007/11833529_102", "year": "2006", "author": {"Yufeng Wang": "90/6339", "Wendong Wang": "80/4406", "Kouichi Sakurai": "16/3865", "Yoshiaki Hori": "88/576"}, "abstract": "The virtual region-based P2P architecture was provided in this paper, which extended the proximity concept in overlay network. By virtual region it meant various related factors should be integrated into the design of P2P topology, such as peer interest, peer locality, and heterogeneity in peer capacity etc. But, the shared contents in P2P are vast and miscellaneous, it is very difficult to recognize the interest similarity among peers, dynamically form the interest region and direct peer to appropriate interest region. In this paper, the Jensen-Shannon Divergence (JSD) was used to characterize interest/semantic similarity among peers, and the interest region formation and location mechanism based on Dynamic Interest Landmark (DIL) was offered to facilitate to dynamically guide peers to join the appropriate interest region corresponding to peers’ content semantic. Considering that interest region is composed of geographically sporadic peers, each interest region was organized according to peer proximity in underlying infrastructure. The theoretical and simulated results illustrated that our architecture can significantly reduce the query overhead, and improve the search performance."}, "conf/wasa/WangW06": {"title": "Studying Rational User Behavior in WCDMA Network and Its Effect on Network Revenue.", "url": "https://doi.org/10.1007/11814856_65", "year": "2006", "author": {"Yufeng Wang": "90/6339", "Wendong Wang": "80/4406"}, "abstract": "In WCDMA networks, most economic-based resource management algorithms only assumed that network users were obedient, that is, users only accepted the price declared by network, which is called as price acceptation mechanism. Many research issues argued that it is necessary to accommodate, if possible, to use self-interest behaviours of users to strengthen the technical architecture of network engineering. Thus, this paper explicitly considered the selfishness of users, investigated the price anticipation mechanism in WCDMA networks, in which users acted as price anticipators. By price anticipator it meant users anticipated the effect of their behaviours on the network resource allocation, and adopted strategy correspondingly. From the view point of game theory, we investigated equilibrium properties of the price anticipation mechanism in WCDMA networks, and, through two scenarios, illustrated the relationship between price anticipation mechanism and price acceptation mechanism from the viewpoint of network revenue. Finally, we drew the conclusion that, the network revenue generated in price anticipation mechanism was less than revenue generated in price acceptation mechanism, (the difference between those two mechanisms is called as “price as anarchy”), and the network revenue generated in those two mechanisms tends to be consistent, when the effect of individual user is negligible.KeywordsWCDMA networksprice acceptation mechanismprice anticipation mechanismgame theoryNash equilibrium"}, "conf/mmns/HuangZWC05": {"title": "MDFM: Multi-domain Fault Management for Internet Services.", "url": "https://doi.org/10.1007/11572831_11", "year": "2005", "author": {"Xiaohui Huang": "22/6958", "Shihong Zou": "16/4301", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "New requirements of service-oriented fault management are analyzed and a framework MDFM (Multi-Domain Fault Manager) is proposed in this paper to solve the service fault localization problem in multi-domain context. Different from current solutions, our approach decomposes SLS (Service Level Specification) based on network capability, and monitor service performance in each domain along the end-to-end path. As a result, MDFM can localize the approximate domain rapidly on which the root cause resides, therefore causative region is narrowed down and computation cost for fault analysis is reduced. Faults on both server and client sides are considered in MDFM. A prototype has been implemented to prove the feasibility and efficiency of our service fault management framework.KeywordsPacket Loss RateInternet ServiceServer SideService FailureClient SideThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/mmns/HuangLWC05": {"title": "QoSJava: An End-to-End QoS Solution.", "url": "https://doi.org/10.1007/11572831_26", "year": "2005", "author": {"Xiaohui Huang": "22/6958", "Yu Lin": "74/2577", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "Incompatibility of different QoS (Quality of Service) mechanisms and heterogeneity of different vendors’ network devices are the major obstacles for providing end-to-end QoS in IP network. Inspired by Java, we propose an end-to-end QoS solution in this paper, i.e. QoSJava, which decouples QoS requirements from network details. By QoS Mechanisms Adapter and Device Driver, which act as “Java Virtual Machine”, QoSJava enables interoperation between different QoS mechanisms and cooperation of dissimilar network devices. A prototype of QoSJava has been implemented, and the experimental results prove that network devices can be configured automatically to provide an end-to-end QoS. Moreover, QoSJava is not only compatible with current QoS mechanisms and devices, but open to new QoS solutions and advanced devices in the future.KeywordsPacket Loss RateNetwork DeviceMonitoring TaskDevice DriverJava Virtual MachineThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/wine/SunJWCW05": {"title": "An Adaptive Group-Based Reputation System in Peer-to-Peer Networks.", "url": "https://doi.org/10.1007/11600930_65", "year": "2005", "author": {"Liang Sun": "18/5837", "Li Jiao": "64/6494", "Yufeng Wang": "90/6339", "Shiduan Cheng": "35/3871", "Wendong Wang": "80/4406"}, "abstract": "As more and more P2P applications being popular in Internet, one of important problem to be solved is inspiring users to cooperate each other actively and honestly, the reputation mechanism which is a hot spot for P2P research has been proposed to conquer it. Because of the characters of virtuality and anonymous in the network, it is very easy for users with bad reputations to reenter the system with new identities to regain new reputations in the reputation systems. In order to get rid of the impact of whitewashers and improve the system performance and efficiency, we propose a new probability-based adaptive initial reputation mechanism. In this new mechanism, newcomers will be trusted based on system’s trust-probability which can be adjusted according to the actions of the newcomers. To avoid the system fluctuating for actions of a few whitewashers, we realize the new reputation mechanism in system with group-based architecture, which can localize the impact of whitewashers in their own groups. Both performance analysis and simulation show that this new adaptive reputation mechanism is more effective.KeywordsDistribute Hash TableAbnormal ActionReputation SystemPhysical TopologyReputation InformationThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/wine/WangW05": {"title": "On Modeling Internet QoS Provisioning from Economic Models.", "url": "https://doi.org/10.1007/11600930_93", "year": "2005", "author": {"Yufeng Wang": "90/6339", "Wendong Wang": "80/4406"}, "abstract": "The modeling of Internet quality of service (QoS) provisioning is a multidisciplinary research subject. From the viewpoint of game theory, we propose a model that combines QoS index with price factor. We use the MultiNomial Logit (MNL) to model the choice behaviors of users. Each service class is considered an independent competing entity, which aims at maximizing its own utility. Based on noncooperative game, we demonstrate the existence and uniqueness of equilibria between QoS levels and prices among various service classes, and demonstrate the properties of equilibria. We also verified these results via numerical analysis.KeywordsLoss ProbabilityPrice FactorService ClassTraffic ClassNoncooperative GameThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/dicta/WangYK03": {"title": "Edge-based Non-uniform Light Field Mapping.", "url": "http://www.cmis.csiro.au/Hugues.Talbot/dicta2003/cdrom/pdf/0369.pdf", "year": "2003", "author": {"Wendong Wang": "80/4406", "Baocai Yin": "91/4706", "Dehui Kong": "14/38"}, "abstract": ""}, "conf/pimrc/WangWC03a": {"title": "Priority-based QoS support for multiservice mobile networks.", "url": "https://doi.org/10.1109/PIMRC.2003.1259076", "year": "2003", "author": {"Yufeng Wang": "90/6339", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Due to the fact that future wireless network will support multiclass services, so it is imperative to differentially treat various kinds of traffic types. An adaptive wireless resource management mechanism based on priority is proposed in this paper. Firstly, the mechanism estimates the reserved resource that is needed to support the necessary QoS in terms of handoff call dropping probability, then sets the thresholds according to the priority of various traffic types. The differentiated admission control scheme satisfies QoS requirement of various traffic types and admits high-priority traffic preferentially under high traffic load. The scheme proposed in this paper is simple and adaptive. Finally the paper presents the Markov model of this differentiated admission control, uses the numerical method to analyze the performance of this scheme, and compares the numerical results with simulation data. The results match relatively well."}, "journals/et/WangSG22": {"title": "A Systematic Bit Selection Method for Robust SRAM PUFs.", "url": "https://doi.org/10.1007/s10836-022-06006-x", "year": "2022", "author": {"Wendong Wang": "80/4406", "Adit D. Singh": "s/AditDSingh", "Ujjwal Guin": "13/9680"}, "abstract": "A physical unclonable function (PUF) is a digital circuit that can generate a die specific unique and stable response, which can be used for authentication and key generation. Since no major design or manufacturing modifications are required, exploitation of SRAMs to implement PUFs is a promising option. When initially powered up, in dividual SRAM cells acquire unique logic states based on the inherent bias of the cell. At advanced technology nodes, this bias is primarily due to unavoidable random manufacturing process variations, which are unpredictable and vary randomly from cell to cell, as well as chip to chip. When an SRAM is read out, these power-up states provide a unique output that is largely consistent during repeated power-up cycles for a given SRAM, but varies for different copies of the same part, as required of a PUF. However, this powerup state of SRAMs cannot be directly used (e.g. in cartographic key generation), due to unpredictability in some of the SRAM cells caused by electrical and electromagnetic noise and temperature fluctuations. We show in this paper that power-up states are also influenced by the power supply ramp rate at power-up, which can be yet another source of cell instability. To address the general problem of instability in SRAM power-up states that can result in inconsistent responses from SRAM PUFs, we present an effective stable cell selection method to identify the cells in the SRAM that are strongly biased, thereby resistant to circuit noise, voltage and temperature changes, and also aging. The data from the Silicon experiments presented here shows that the selected stable SRAM cells are highly reliable over temperature and voltage variations, with a bit error rate (BER) close to zero."}, "journals/ett/YanWWWLG22": {"title": "Survey on recent smart gateways for smart home: Systems, technologies, and challenges.", "url": "https://doi.org/10.1002/ett.4067", "year": "2022", "author": {"Wenyao Yan": "80/10470", "Zhixiao Wang": "42/7560", "Hao Wang": "181/2812", "Wendong Wang": "80/4406", "Junhuai Li": "81/7435", "Xiaolin Gui": "65/1767"}, "abstract": ""}, "journals/jns/ChenLW22": {"title": "Remarks on Liouville-Type Theorems for the Steady MHD and Hall-MHD Equations.", "url": "https://doi.org/10.1007/s00332-021-09768-4", "year": "2022", "author": {"Xiaomeng Chen": "11/10645", "Shuai Li": "57/2281", "Wendong Wang": "80/4406"}, "abstract": "In this note, we investigate Liouville-type theorems for the steady three-dimensional MHD and Hall-MHD equations and show that the velocity field u and the magnetic field B are vanishing provided that B\\in L^{6,\\infty }(\\mathbb {R}^3)B\\in L^{6,\\infty }(\\mathbb {R}^3) and u\\in BMO^{-1}(\\mathbb {R}^3)u\\in BMO^{-1}(\\mathbb {R}^3), which state that the velocity field plays an important role. Moreover, the similar result holds in the case of partial viscosity or diffusivity for the three-dimensional MHD equations."}, "journals/jsac/CongZLWXX22": {"title": "A&B: AI and Block-Based TCAM Entries Replacement Scheme for Routers.", "url": "https://doi.org/10.1109/JSAC.2022.3191351", "year": "2022", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Bin Liu 0001": "35/837-1", "Wendong Wang": "80/4406", "Zehui Xiong": "174/9863", "Ke Xu 0002": "181/2626-2"}, "abstract": " Abstract:With the ever-increasing deployment of 5G and IoT, the number of end-hosts/terminals is increasing rapidly, so that routers have to cache more and more forwarding entries to guarantee communication reachability of these terminals, which makes Ternary Content Addressable Memory (TCAM)-based routers keep expanding resource requirements. However, the design and implementation of large-capacity TCAM-based routers are faced with such challenges: difficult circuit design, high production cost and energy consumption, thereby posing an urgent requirement on a lightweight TCAM that can still maintain those massive communication connections. In this paper, we aim to design a lightweight router with small storage requirement while still retaining the original communication connection performance, which is not straightforward due to the following two challenges: First, under the condition of massive sequential flow data, it’s difficult to accurately and timely select the entries to cache for a small capacity TCAM. Second, given the strict prefix matching principle, how to efficiently insert the selected entries into TCAM is also challenging. To address these problems, we propose A&B: an AI-based Routing entry prediction strategy (AIR) and a Block-based entry Insertion Tactic (BIT). AIR can precisely select entries by conducting accurate entry predictions, which converts dynamic flow-based prediction into stable and parallelizable entry-based prediction by decoupling spatio-temporal characteristics. BIT optimizes entry insertion by isolating TCAM into several blocks, thus eliminating the time-consuming entry movements. The experiment results based on real backbone traffic show that our lightweight A&B achieves comparable performance compared to the traditional schemes by using only 1/8 TCAM storage."}, "journals/pr/ZhangTWZZWMHW22": {"title": "LSRML: A latent space regularization based meta-learning framework for MR image segmentation.", "url": "https://doi.org/10.1016/j.patcog.2022.108821", "year": "2022", "author": {"Bo Zhang 0032": "36/2259-32", "Yunpeng Tan": "323/1729", "Hui Wang": "39/721", "Zheng Zhang": "181/2621", "Xiuzhuang Zhou": "85/7674", "Jingyun Wu": "213/9300", "Yue Mi": "206/0346", "Haiwen Huang": "220/3988", "Wendong Wang": "80/4406"}, "abstract": "Data sources for medical image segmentation can be quite extensive, and models trained with data from a source domain may perform poorly on data from the target domain owing to domain shift issues. To overcome the impact of domain shift, we propose a novel meta-learning-based multi-source domain adaptation framework for medical image segmentation. Specifically, we designed a domain discriminator module to produce category prediction over the latent features, and an image reconstruction module to reconstruct the foreground and background of the target domain image separately. Furthermore, we constructed a large-scale multi-modal prostate dataset, which contained 495,902 magnetic resonance images of 419 cases, with prostate and lesion masks, as well as diagnostic descriptions for each patient. We evaluated our proposed method through extensive experiments using the proposed and the benchmark datasets. Experimental results show that our model achieves better segmentation and generalization performance compared to state-of-the-art approaches."}, "journals/ral/BasualdoGWDBGLS22": {"title": "Control and Transport of Passive Particles Using Self-Organized Spinning Micro-Disks.", "url": "https://doi.org/10.1109/LRA.2022.3143306", "year": "2022", "author": {"Franco N. Piñan Basualdo": "301/2508", "Gaurav Gardi": "206/6644", "Wendong Wang": "80/4406", "Sinan Özgün Demir": "259/6349", "Aude Bolopion": "20/7737", "Michaël Gauthier": "47/4257", "Pierre Lambert": "85/5249", "Metin Sitti": "25/3694"}, "abstract": " Abstract:Traditional robotic systems have proven to be instrumental in object manipulation tasks for automated manufacturing processes. Object manipulation in such cases typically involves transport, pick-and-place and assembly of objects using automated conveyors and robotic arms. However, the forces at microscopic scales (e.g., surface tension, Van der Waals, electrostatic) can be qualitatively and quantitatively different from those at macroscopic scales. These forces render the release of objects difficult, and hence, traditional systems cannot be directly transferred to small scales (below a few millimeters). Consequently, novel micro-robotic manipulation systems have to be designed to take into account these scaling effects. Such systems could be beneficial for micro-fabrication processes and for biological studies. Here, we show autonomous position control of passive particles floating at the air-water interface using a collective of self-organized spinning micro-disks with a diameter of \n300μm{300}\\,{\\mathrm {\\mu m}}\n. First, we show that the spinning micro-disks collectives generate azimuthal flows that cause passive particles to orbit around them. We then develop a closed-loop controller to demonstrate autonomous position control of passive particles without physical contact. Finally, we showcase the capability of our system to split from an expanded to several circular collectives while holding the particle at a fixed target. Our system’s contact-free object manipulation capability could be used for transporting delicate biological objects and for guiding self-assembly of passive objects for micro-fabrication."}, "journals/sigpro/WangZ22a": {"title": "Performance guarantees of regularized ℓ1-2-minimization for robust sparse recovery.", "url": "https://doi.org/10.1016/j.sigpro.2022.108730", "year": "2022", "author": {"Wendong Wang": "80/4406", "Jing Zhang": "05/3499"}, "abstract": "Based on the powerful restricted isometry property (RIP) and the coherence tools, this paper develops two types of robust recovery results for a (non-convex) regularized ℓ1−2-minimization model itself, which include some (sufficient) recovery conditions and their resultant recovery error estimates. All these theoretical results show that under some conditions this model is also able to ensure the robust recovery of any signal that is not necessary to be sparse. On the one hand, our RIP-based results not only provide some insights into the regularized ℓ1−2-minimization model, but also well complement the previous ones established for the constrained ℓ1−2-minimization model. On the other hand, our coherence-based recovery condition is demonstrated to be much better than the state-of-the-art one except for a very small number of cases, which to some degree can be neglected in practice. Furthermore, we also discuss the approximate error resulting from the scenario when the regularized ℓ1−2-minimization model is used to replace the classical constrained ℓ1−2-minimization model."}, "journals/access/WangLZKZ21": {"title": "Interval Estimation of Motion Intensity Variation Using the Improved Inception-V3 Model.", "url": "https://doi.org/10.1109/ACCESS.2021.3076281", "year": "2021", "author": {"Wendong Wang": "80/4406", "Hanhao Li": "277/2745", "Chengzhi Zhao": "83/9462", "Dezhi Kong": "194/0874", "Peng Zhang": "21/1048"}, "abstract": " Abstract:In the process of acute resistance exercise, repeated variation in motion intensity can lead to muscle fatigue and heart failure. Therefore, acquiring the interval of motion intensity variation in time the training pattern and effect can be improved by acquiring the interval of motion intensity variation. In order to achieve this goal, an improved Inception-V3 model is proposed for motion intensity variation interval estimation. The MIVIE(Motion Intensity Variation Interval Estimation) dataset consisting of Strong, Moderate, Weak groups achieve centralized and uninterrupted collection. Then, the multi-modal fusion vectors of time-frequency eigenvalues are stacked up to \n 227×227227\\times227 \n grayscale images fed into improved inception-CNN. Finally, the manipulator’s trajectory optimization is completed under the guidance of ATO-DQN (Adaptive Trajectory Optimization-Deep Q Network) algorithm based on the motion intensity interval estimation. This work can improve the non-stationary effect of motor speed caused by changes in motion intensity during rehabilitation, which can better guarantee the safety of patients."}, "journals/chinaf/ZhangWHWH21": {"title": "Tensor restricted isometry property analysis for a large class of random measurement ensembles.", "url": "https://doi.org/10.1007/s11432-019-2717-4", "year": "2021", "author": {"Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406", "Jingyao Hou": "242/9424", "Jianjun Wang 0003": "00/607-3", "Jianwen Huang": "69/7482"}, "abstract": ""}, "journals/cn/CongZLBTWXLL21": {"title": "A deep reinforcement learning-based multi-optimality routing scheme for dynamic IoT networks.", "url": "https://doi.org/10.1016/j.comnet.2021.108057", "year": "2021", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Zheli Liu": "22/8078", "Thar Baker": "83/2178", "Hissam Tawfik": "01/6981", "Wendong Wang": "80/4406", "Ke Xu 0002": "181/2626-2", "Ruidong Li": "06/7035", "Fuliang Li": "95/8385"}, "abstract": "With the development of Internet of Things (IoT) and 5G technologies, more and more applications, such as autonomous vehicles and tele-medicine, become more sensitive to network latency and accuracy, which require routing schemes to be more flexible and efficient. In order to meet such urgent need, learning-based routing strategies are emerging as strong candidate solutions, with the advantages of high flexibility and accuracy. These strategies can be divided into two categories, centralized and distributed, enjoying the advantages of high precision and high efficiency, respectively. However, routing becomes more complex in dynamic IoT network, where the link connections and access states are time-varying, hence these learning-based routing mechanisms are required to have the capability to adapt to network changes in real time. In this paper, we designed and implemented both centralized and distributed Reinforcement Learning-based Routing schemes combined with Multi-optimality routing criteria (RLR-M). By conducting a series of experiments, we performed a comprehensive analysis of the results and arrived at the conclusion that the centralized is better suited to cope with dynamic networks due to its faster reconvergence (2.2 × over distributed), while the distributed is better positioned to handle with large-scale networks through its high scalability (1.6 × over centralized). Moreover, the multi-optimality routing scheme is implemented through model fusion, which is more flexible than traditional strategies and as such is better placed to meet the needs of IoT."}, "journals/ijwmip/Huang00WW21": {"title": "Perturbation analysis of low-rank matrix stable recovery.", "url": "https://doi.org/10.1142/S0219691320500915", "year": "2021", "author": {"Jianwen Huang": "69/7482", "Jianjun Wang 0003": "00/607-3", "Feng Zhang 0023": "48/1294-23", "Hailin Wang": "255/2196", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/mlc/WangHLWWC21": {"title": "Performance guarantees of transformed Schatten-1 regularization for exact low-rank matrix recovery.", "url": "https://doi.org/10.1007/s13042-021-01361-1", "year": "2021", "author": {"Zhi Wang 0015": "95/6543-15", "Dong Hu": "32/4345", "Xiaohu Luo": "00/2818", "Wendong Wang": "80/4406", "Jianjun Wang": "00/607", "Wu Chen": "15/3894"}, "abstract": "Low-rank matrix recovery aims to recover a matrix of minimum rank that subject to linear system constraint. It arises in various real world applications, such as recommender systems, image processing, and deep learning. Inspired by compressive sensing, the rank minimization can be relaxed to nuclear norm minimization. However, such a method treats all singular values of target matrix equally. To address this issue, recently the transformed Schatten-1 (TS1) penalty function was proposed and utilized to construct low-rank matrix recovery models. Unfortunately, the method for TS1-based models cannot provide both convergence accuracy and convergence speed. To alleviate such problems, this paper further investigates the basic properties of TS1 penalty function. And we describe a novel algorithm, which we called ATS1PGA, that is highly efficient in solving low-rank matrix recovery problems at a convergence rate of O(1/N), where N denotes the iterate count. In addition, we theoretically prove that the original rank minimization problem can be equivalently transformed into the TS1 optimization problem under certain conditions. Finally, extensive experimental results on real image data sets show that our proposed algorithm outperforms state-of-the-art methods in both accuracy and efficiency. In particular, our proposed algorithm is about 30 times faster than TS1 algorithm in solving low-rank matrix recovery problems."}, "journals/pami/00230WX21": {"title": "Low-Tubal-Rank Plus Sparse Tensor Recovery With Prior Subspace Information.", "url": "https://doi.org/10.1109/TPAMI.2020.2986773", "year": "2021", "author": {"Feng Zhang 0023": "48/1294-23", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406", "Chen Xu": "54/1474"}, "abstract": " Abstract:Tensor principal component pursuit (TPCP) is a powerful approach in the tensor robust principal component analysis (TRPCA), where the goal is to decompose a data tensor to a low-tubal-rank part plus a sparse residual. TPCP is shown to be effective under certain tensor incoherence conditions, which can be restrictive in practice. In this paper, we propose a Modified-TPCP, which incorporates the prior subspace information in the analysis. With the aid of prior info, the proposed method is able to recover the low-tubal-rank and the sparse components under a significantly weaker incoherence assumption. We further design an efficient algorithm to implement Modified-TPCP based upon the alternating direction method of multipliers (ADMM). The promising performance of the proposed method is supported by simulations and real data applications."}, "journals/tnsm/CongZWZ21": {"title": "DND: Driver Node Detection for Control Message Diffusion in Smart Transportations.", "url": "https://doi.org/10.1109/TNSM.2021.3059696", "year": "2021", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Wendong Wang": "80/4406", "Ning Zhang 0007": "181/2597-7"}, "abstract": " Abstract:Along with the development of IoT and mobile edge computing in recent years, smart transportation holds great potential to improve road safety and efficiency. The network that carries smart transportation service is highly dynamic. Controllability has long been recognized as one of the fundamental properties of such temporal networks, which can provide valuable insights for the construction of new infrastructures, and thus is in urgent need to be explored. In this article, under the smart transportation scenario, we first disclose the controllability problem in Internet of Vehicles (IoV), and then design DND (Driver Node Detection) algorithm based on Kalman's controllability rank condition to analyze the controllability and control message diffusion in such a dynamic temporal network. Moreover, we use the control message diffusion efficiency as a metric to assist in selecting suitable driver nodes. At last, we conduct a series of experiments to analyze the controllability of the IoV network, and the results show the effects of vehicle density, speed, coverage radius on network controllability, and the efficiency of the control message diffusion algorithm and its feedback effect on driver nodes selection. These insights are critical for varieties of applications in the future smart transportation."}, "journals/ton/ZhangNJWXZRCWY21": {"title": "BDS+: An Inter-Datacenter Data Replication System With Dynamic Bandwidth Separation.", "url": "https://doi.org/10.1109/TNET.2021.3054924", "year": "2021", "author": {"Yuchao Zhang": "42/7674", "Xiaohui Nie": "119/6181", "Junchen Jiang": "49/8398", "Wendong Wang": "80/4406", "Ke Xu 0002": "181/2626-2", "Youjian Zhao": "41/3820", "Martin J. Reed": "05/5270", "Kai Chen 0005": "c/KaiChen5", "Haiyang Wang": "22/3326", "Guang Yao": "06/107"}, "abstract": " Abstract:Many important cloud services require replicating massive data from one datacenter (DC) to multiple DCs. While the performance of pair-wise inter-DC data transfers has been much improved, prior solutions are insufficient to optimize bulk-data multicast, as they fail to explore the rich inter-DC overlay paths that exist in geo-distributed DCs, as well as the remaining bandwidth reserved for online traffic under fixed bandwidth separation scheme. To take advantage of these opportunities, we present \nBDS+\n, a near-optimal network system for large-scale inter-DC data replication. BDS+ is an application-level multicast overlay network with a \nfully centralized\n architecture, allowing a central controller to maintain an up-to-date global view of data delivery status of intermediate servers, in order to fully utilize the available overlay paths. Furthermore, in each overlay path, it leverages dynamic bandwidth separation to make use of the remaining available bandwidth reserved for online traffic. By constantly estimating online traffic demand and rescheduling bulk-data transfers accordingly, BDS+ can further speed up the massive data multicast. Through a pilot deployment in one of the largest online service providers and large-scale real-trace simulations, we show that BDS+ can achieve 3-\n 5×5\\times  \n speedup over the provider’s existing system and several well-known overlay routing baselines of static bandwidth separation. Moreover, dynamic bandwidth separation can further reduce the completion time of bulk data transfers by 1.2 to 1.3 times."}, "journals/rfc/rfc8991": {"title": "GeneRic Autonomic Signaling Protocol Application Program Interface (GRASP API).", "url": "https://doi.org/10.17487/RFC8991", "year": "2021", "author": {"Brian E. Carpenter": "c/BrianECarpenter", "Bing Liu 0006": "87/6277", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431"}, "abstract": ""}, "journals/access/LongGLQW20": {"title": "Toward OS-Level and Device-Level Cooperative Scheduling for Multitasking GPUs.", "url": "https://doi.org/10.1109/ACCESS.2020.2983731", "year": "2020", "author": {"Xinjian Long": "206/3728", "Xiangyang Gong": "04/8431", "Yaguang Liu": "60/8700", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:As one of the most popular accelerators, the graphics processing unit (GPU) has been extensively adopted throughout the world. With the burst of new applications and the growing scale of data, co-running applications on limited GPU resources has become increasingly important due to its dramatic improvement in overall system efficiency. Quality of service (QoS) support among concurrent general-purpose GPU (GPGPU) applications is currently one of the most trending research topics. Prior efforts have been focused on providing QoS support either with OS-level or device-level scheduling methods. Each of these scheduling methods possesses pros and cons and may be unable to independently cover all the scheduling cases. In this paper, we propose a cooperative QoS scheduling scheme (C-QoS) that consists of operating-system-level (OS-level) scheduling and device-level scheduling. Our proposed scheme can control the progress of a kernel and provide thorough QoS support for concurrent applications in multitasking GPUs. Due to the accurate resource management of the copy engine and execution engine, C-QoS achieves QoS goals 23.33% more often than state-of-the-art QoS support mechanisms. The results demonstrate that cooperative methods achieve 17.27% higher system utilization than uncooperative methods."}, "journals/appml/LiW20a": {"title": "A Liouville theorem for the plane shear thickening fluids.", "url": "https://doi.org/10.1016/j.aml.2020.106334", "year": "2020", "author": {"Shuai Li": "57/2281", "Wendong Wang": "80/4406"}, "abstract": "In this note we investigate Liouville theorem of plane shear thickening fluids in the whole space R2. By applying a different approach of Point-wise Behavior Theorem, we improve the known Liouville type results by Fuchs (2012) and Zhang (2015)."}, "journals/cmmm/Wang20": {"title": "Research of Epidemic Big Data Based on Improved Deep Convolutional Neural Network.", "url": "https://doi.org/10.1155/2020/3641745", "year": "2020", "author": {"Wendong Wang": "80/4406"}, "abstract": ""}, "journals/et/WangGS20": {"title": "Aging-Resilient SRAM-based True Random Number Generator for Lightweight Devices.", "url": "https://doi.org/10.1007/s10836-020-05881-6", "year": "2020", "author": {"Wendong Wang": "80/4406", "Ujjwal Guin": "13/9680", "Adit D. Singh": "s/AditDSingh"}, "abstract": "A random number generator (RNG) is an important building block for cryptographic operations primarily to generate random nonces and secret keys. The power-up value of an SRAM array has been widely accepted as an entropy source for generating random numbers. However, only a few cells of the SRAM are truly random upon repeated power-ups; the vast majority of cells display a distinct bias from manufacturing process variations. Consequently, a relatively large SRAM array is required to obtain sufficient entropy for generating random numbers. Earlier research has proposed the use of controlled device aging at pre-deployment stage to enhance the initial entropy of an SRAM array. However, aging in the field can adversely affect the entropy and degrade randomness; we show here that any initial aging to increase SRAM entropy can even be counterproductive. Instead, we propose an SRAM-based random number generation approach, which continually manipulates device aging during operation to constantly maximize entropy for the entire deployment period. The key idea is to continually stress the SRAM cells in their power-up states at regular intervals. This helps counteract the aging caused by the random memory states that occur during operation. Silicon results are presented to validate our proposed approach."}, "journals/ijon/JiangZWYW20": {"title": "Robust principal component analysis with intra-block correlation.", "url": "https://doi.org/10.1016/j.neucom.2019.12.092", "year": "2020", "author": {"Can Jiang": "00/9587", "Feng Zhang 0023": "48/1294-23", "Jianjun Wang 0003": "00/607-3", "Chan-Yun Yang": "67/2778", "Wendong Wang": "80/4406"}, "abstract": "This paper proposes a novel optimization program for solving the Robust Principle Component Analysis (RPCA) problem, which decomposes a data matrix into a conventional low-rank part plus a particular block-sparse residual. This kind of block-sparse residual often scattered in the source signal scope as contaminants, and often existed in many practical applications, such as an ordinary imaging system, a Hyper Spectral Imaging system, EEG and MEG, and types of physiological signals. Different from most currently existing approaches, the study perceived especially a highly spatial correlation among the inner structure of the neighbouring pixels in this contiguously block-sparse residual. The high intra-block correlation is then introduced as prior information to deal the governing optimization problem. In order to enhance the block-sparsity and maintain the local smoothness simultaneously, a localized low-rank promoting method is introduced with a theoretical guarantee. An efficient solving algorithm is designed accordingly with a convergence analysis by adopting the classical Alternating Direction Method of Multipliers (ADMM) framework. In addition to the theoretical model derivation, several synthetic simulations together with a real application on image denoising experiment have been conducted to validate the proposed model. As expected, the models outperforms significantly the compared state-of-the-arts."}, "journals/iotj/GaoXYTWW20": {"title": "A Learning-Based Credible Participant Recruitment Strategy for Mobile Crowd Sensing.", "url": "https://doi.org/10.1109/JIOT.2020.2976778", "year": "2020", "author": {"Hui Gao 0002": "46/5223-2", "Yu Xiao 0001": "54/5385-1", "Han Yan": "63/49", "Ye Tian 0008": "32/5495-8", "Danshi Wang": "186/3142", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Mobile crowd sensing (MCS) acts as a key component of Internet of Things (IoT), which has attracted much attention. In an MCS system, participants play an important role, since all the data are collected and provided by them. It is challenging but essential to recruit credible participants and motive them to contribute high-quality data. In this article, we propose a learning-based credible participant recruitment strategy (LC-PRS), which aims to maximize the platform and participants' profits at the same time via MCS participation. Specifically, the LC-PRS consists of two mechanisms, that a learning-based reward allocation mechanism (L-RAM) first calculates the maximum offered reward for different locations based on the number of participants in each location. Under a budget constraint, the proposed L-RAM prefers to collect sensing data from locations in which relatively few data have so far been collected. Furthermore, for each location, we develop a credible participant recruitment mechanism (C-PRM), which employs semi-Markov model and game theory to predict the quality of data provided by each participant and to recruit participants based on the predictions and the maximum offered reward calculated by L-RAM. We formally show LC-PRS has the desirable properties of computational efficiency, selection efficiency, individual rationality, and truthfulness. We evaluate the proposed scheme via simulation using three real data sets. Extensive simulation results well justify the effectiveness of the proposed approach in comparison with the other two methods."}, "journals/jcam/ZhangWHWW20": {"title": "RIP-based performance guarantee for low-tubal-rank tensor recovery.", "url": "https://doi.org/10.1016/j.cam.2020.112767", "year": "2020", "author": {"Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406", "Jianwen Huang": "69/7482", "Jianjun Wang 0003": "00/607-3", "Yao Wang 0003": "72/628-3"}, "abstract": "The essential task of tensor data analysis focuses on the tensor decomposition and the corresponding notion of rank. In this paper, by introducing the notion of tensor Singular Value Decomposition (t-SVD), we establish a Regularized Tensor Nuclear Norm Minimization (RTNNM) model for low-tubal-rank tensor recovery. As we know that many variants of the Restricted Isometry Property (RIP) have proven to be crucial analysis tools for sparse recovery. In the t-SVD framework, we initiatively define a novel tensor Restricted Isometry Property (t-RIP). Furthermore, we show that any third-order tensor X can stably be recovered from few linear noise measurements under some certain t-RIP conditions via the RTNNM model. We note that, as far as the authors are aware, such kind of result has not previously been reported in the literature."}, "journals/network/ZhangLZBZWLX20": {"title": "AutoSight: Distributed Edge Caching in Short Video Network.", "url": "https://doi.org/10.1109/MNET.001.1900345", "year": "2020", "author": {"Yuchao Zhang": "42/7674", "Pengmiao Li": "249/3869", "Zhili Zhang": "54/3914", "Bo Bai 0001": "10/4008-1", "Gong Zhang": "77/6324", "Wendong Wang": "80/4406", "Bo Lian": "206/1561", "Ke Xu 0002": "181/2626-2"}, "abstract": " Abstract:In recent years there has been a rapid increase of short video traffic in CDN. While the video contributors change from large video studios to distributed ordinary end users, edge computing naturally matches the cache requirements from short video network. But distributed edge caching exposes some unique characteristics: non-stationary user access pattern and temporal and spatial video popularity pattern, which severely challenge the edge caching performance. While the QoE in traditional CDN has been much improved, prior solutions become invalid in solving the above challenges. In this article, we present AutoSight, a distributed edge caching system for short video network, which significantly boosts cache performance. AutoSight consists of two main components, solving the above two challenges respectively: the CoStore predictor, which solves the non-stationary and unpredictability of local access pattern, by analyzing the complex video correlations; and a caching engine Viewfinder, which solves the temporal and spatial video popularity problem by automatically adjusting future horizon according to video life span. All these inspirations and experiments are based on the real traces of more than 28 million videos with 100 million accesses from 488 servers located in 33 cities. Experiment results show that AutoSight brings significant boosts on distributed edge caching in short video network."}, "journals/siamma/TaoWZ20": {"title": "Zero-Viscosity Limit of the Navier-Stokes Equations with the Navier Friction Boundary Condition.", "url": "https://doi.org/10.1137/19M1255331", "year": "2020", "author": {"Tao Tao": "73/3197", "Wendong Wang": "80/4406", "Zhifei Zhang": "66/9500"}, "abstract": ""}, "journals/spl/ZhangHWW20": {"title": "Uniqueness Guarantee of Solutions of Tensor Tubal-Rank Minimization Problem.", "url": "https://doi.org/10.1109/LSP.2020.2983305", "year": "2020", "author": {"Feng Zhang 0023": "48/1294-23", "Jingyao Hou": "242/9424", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406"}, "abstract": " Abstract:This letter considers the recovery of a low-tubal-rank tensor from incomplete linear observations. It is shown that the unknown tensor Z ∈ R\nn1×n2×n3\n of tubal-rank r can be reconstructed as a unique solution of a tractable method - tensor nuclear norm (TNN) minimization, provided that the number of Gaussian observations m ≥ 3r(n\n1\n + n\n2\n - r)n\n3\n + 1. In this work, we examine the fundamental question of the minimal number of linear observations needed to reconstruct the tensor Z from these observations, regardless of the practicality of the reconstruction scheme. Consequently, we provide two benchmark results so that different reconstruction schemes including TNN minimization can be compared to each other. Specifically, we conclude that m ≥ 2r(n\n1\n + n\n2\n - 2r)n\n3\n and m ≥ r(n\n1\n + n\n2\n - r)n\n3\n + 1 Gaussian observations are necessary and sufficient to guarantee uniform recovery and nonuniform recovery using tensor tubalrank minimization method, respectively."}, "journals/tcsv/GuoGLWQ20": {"title": "EAAT: Environment-Aware Adaptive Transmission for Split-Screen Video Streaming.", "url": "https://doi.org/10.1109/TCSVT.2019.2955136", "year": "2020", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the tremendous growth of video contents and mobility demands, there is a need to develop more personalized video services. Split-screen services, such as picture in picture become more and more popular. Furthermore, the user's viewing environment affects the user's quality of experience (QoE). Therefore, video transmission of split-screen services face several major challenges, such as to quantify the impact of environmental factors on user's QoE; how to assess the user's QoE of the split-screen services; how to choose the bit-rate of each video stream to maximize user's QoE of the split-screen services. To address these challenges, in the paper, an environment-aware adaptive transmission (EAAT) scheme for split-screen video streaming is first presented. Then, we introduce a mathematical model for characterizing user's QoE to be affected by environmental factors in the proposed EAAT. In the model, the QoE of user's relationship with the viewing environment is proposed. Based on the model, a problem of maximizing user's QoE is formulated, and we develop a heuristic algorithm to solve the optimization problem. In addition, we conduct various trace-bandwidth experiments to rigorously evaluate the proposed EAAT scheme in different network environments, and show that EAAT can enrich the video quality while saving network resources."}, "journals/corr/abs-2003-03180": {"title": "An analysis of noise folding for low-rank matrix recovery.", "url": "https://arxiv.org/abs/2003.03180", "year": "2020", "author": {"Jianwen Huang": "69/7482", "Jianjun Wang 0003": "00/607-3", "Feng Zhang 0023": "48/1294-23", "Hailin Wang": "255/2196", "Wendong Wang": "80/4406"}, "abstract": "\n      Abstract:  Previous work regarding low-rank matrix recovery has concentrated on the\nscenarios in which the matrix is noise-free and the measurements are corrupted\nby noise. However, in practical application, the matrix itself is usually\nperturbed by random noise preceding to measurement. This paper concisely\ninvestigates this scenario and evidences that, for most measurement schemes\nutilized in compressed sensing, the two models are equivalent with the central\ndistinctness that the noise associated with (\\ref{eq.3}???\\ref{eq.3}) is larger by a factor\nto mn/Mmn/Mmn/M, where m,~nm, nm,~n are the dimension of the matrix and MMM is the number\nof measurements. Additionally, this paper discusses the reconstruction of\nlow-rank matrices in the setting, presents sufficient conditions based on the\nassociating null space property to guarantee the robust recovery and obtains\nthe number of measurements. Furthermore, for the non-Gaussian noise scenario,\nwe further explore it and give the corresponding result. The simulation\nexperiments conducted, on the one hand show effect of noise variance on\nrecovery performance, on the other hand demonstrate the verifiability of the\nproposed model.\n\n    "}, "journals/corr/abs-2003-04766": {"title": "An Optimal Condition of Robust Low-rank Matrices Recovery.", "url": "https://arxiv.org/abs/2003.04766", "year": "2020", "author": {"Jianwen Huang": "69/7482", "Jianjun Wang 0003": "00/607-3", "Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406"}, "abstract": "\n      Abstract:  In this paper we investigate the reconstruction conditions of nuclear norm\nminimization for low-rank matrix recovery. We obtain sufficient conditions\n\\delta_{tr}<t/(4-t)\\delta_{tr}<t/(4-t) with 0<t<4/30<t<4/3 to guarantee the robust reconstruction\n(z\\neq0)(z\\neq0) or exact reconstruction (z=0)(z=0) of all rank rr matrices\nX\\in\\mathbb{R}^{m\\times n}X\\in\\mathbb{R}^{m\\times n} from b=\\mathcal{A}(X)+zb=\\mathcal{A}(X)+z via nuclear norm\nminimization. Furthermore, we not only show that when t=1t=1, the upper bound of\n\\delta_r<1/3\\delta_r<1/3 is the same as the result of Cai and Zhang \\cite{Cai and Zhang},\nbut also demonstrate that the gained upper bounds concerning the recovery error\nare better. Moreover, we prove that the restricted isometry property condition\nis sharp. Besides, the numerical experiments are conducted to reveal the\nnuclear norm minimization method is stable and robust for the recovery of\nlow-rank matrix.\n\n    "}, "journals/corr/abs-2006-06283": {"title": "The perturbation analysis of nonconvex low-rank matrix robust recovery.", "url": "https://arxiv.org/abs/2006.06283", "year": "2020", "author": {"Jianwen Huang": "69/7482", "Wendong Wang": "80/4406", "Feng Zhang 0023": "48/1294-23", "Jianjun Wang 0003": "00/607-3"}, "abstract": "\n      Abstract:  In this paper, we bring forward a completely perturbed nonconvex Schatten\npp-minimization to address a model of completely perturbed low-rank matrix\nrecovery. The paper that based on the restricted isometry property generalizes\nthe investigation to a complete perturbation model thinking over not only noise\nbut also perturbation, gives the restricted isometry property condition that\nguarantees the recovery of low-rank matrix and the corresponding reconstruction\nerror bound. In particular, the analysis of the result reveals that in the case\nthat pp decreases 00 and a>1a>1 for the complete perturbation and low-rank\nmatrix, the condition is the optimal sufficient condition \\delta_{2r}<1\\delta_{2r}<1\n\\cite{Recht et al 2010}. The numerical experiments are conducted to show better\nperformance, and provides outperformance of the nonconvex Schatten\npp-minimization method comparing with the convex nuclear norm minimization\napproach in the completely perturbed scenario.\n\n    "}, "journals/access/ZhangXGW19": {"title": "Mutual Information Maximization-Based Collaborative Data Collection With Calibration Constraint.", "url": "https://doi.org/10.1109/ACCESS.2019.2895375", "year": "2019", "author": {"Bo Zhang 0032": "36/2259-32", "Teng Xi": "176/0053", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:People pay greater attention to air quality which is closely related to their health, especially in developing countries. Air quality is a part of the Chinese weather forecast, and the government has developed air quality monitoring systems and built high-quality monitoring stations (HQMS). With the data from HQMS, many companies and research institutes demonstrate an accurate air pollution map on the Internet, which is valuable for many issues related to air quality, including exposure modeling and urban planning. Due to the high equipment and operating costs, the distribution of HQMS is too uneven and sparse to achieve a high-resolution air pollution map. Thus, people try to deploy a large number of high precision sensors in and around the city for detecting air pollution. However, these sensors require frequent calibrations with the HQMS to maintain data accuracy. On the other side, to reduce the cost of sensor deployment, people begin to use mobile sensors instead of fixed sensors, which make sensor route planning a very important issue. Nevertheless, existing works on the route planning of mobile sensors largely focus on data reconstruction, which either ignores calibration or views it as an independent problem. In this paper, we propose a novel scheme to improve the accuracy of data reconstruction, which jointly considers sensor calibration and data reconstruction in route planning for mobile sensors. We formulate a novel sensor route planning problem (SRPP) that aims to maximize the mutual information and guarantee the accuracy of measurements through the sensor calibration. We also propose a heuristic algorithm to solve the SRPP, which supports calibration between mobile sensors and HQMS in route planning. The extensive simulation results well justify the effectiveness of our approach that can reduce 83% root mean square error on average compared with the traditional approach."}, "journals/access/Wang00G19": {"title": "Environmental Monitoring Based on Fog Computing Paradigm and Internet of Things.", "url": "https://doi.org/10.1109/ACCESS.2019.2939017", "year": "2019", "author": {"Wendong Wang": "80/4406", "Cheng Feng 0006": "76/3473-6", "Bo Zhang 0032": "36/2259-32", "Hui Gao": "46/5223"}, "abstract": " Abstract:Providing accurate real-time environmental monitoring services is a meaningful but difficult task. Whereas recent developments in the Internet of Things and the fog computing paradigm have brought new opportunities to improve the service, achieving accurate environmental monitoring faces several challenges. First, data collected by the Internet of Things varies in temporal-spatial distribution, quality, and relevance to objectives. Second, due to the limited communication cost and stability, local real-time monitoring systems can be hardly achieved by adopting centralized cloud paradigm solutions in the real world. Third, the amount of data at a single edge node of fog computing paradigm is usually not sufficient for accurate environmental monitoring. In this paper, we propose a framework for environmental monitoring based on fog computing that uses multi-source heterogeneous data collected from the Internet of Things sensors. At each edge node, we employ local sub-classifiers to analyze the collected data and afterwards, a deep neural network based model to aggregate results from sub-classifiers. For the homologous sub-classifiers at different edge nodes, we design a federated learning mechanism to update sub-classifiers in concert by model transmission. We use multi-source heterogeneous data collected in Beijing to evaluate the proposed fog computing framework. Experimental results show that our federated learning mechanism has almost the same performance compared with centralized data fusion mechanism when training rounds are increased."}, "journals/access/WangZWW19": {"title": "Coherence-Based Robust Analysis of Basis Pursuit De-Noising and Beyond.", "url": "https://doi.org/10.1109/ACCESS.2019.2956829", "year": "2019", "author": {"Wendong Wang": "80/4406", "Feng Zhang 0023": "48/1294-23", "Zhi Wang 0015": "95/6543-15", "Jianjun Wang 0003": "00/607-3"}, "abstract": " Abstract:In this paper, by means of the powerful coherence tool, we first establish a coherence-based performance guarantee for the basis pursuit de-noising (BPDN) to recover the signals corrupted with the `2norm bounded noise, and then extend these theoretical results to guarantee the robust recovery of the signals in the presence of the Dantzig Selector (DS) type noise, as well as the structured block-sparse signal recovery in the presence of the bounded noise. To the best of our knowledge, we first extend nontrivially the (sharp) uniform recovery condition derived by Cai, Wang and Xu (2010) for the constrained ℓ\n1\n-norm minimization model (which takes the form of μ <; 1/2k-1, where μ is defined as the coherence of A) to two unconstrained regularized ℓ\n1\n-norm minimization models to guarantee the robust recovery of any signals (not necessary to be k-sparse) under the ℓ\n2\n-norm bounded noise and the DS type noise settings, respectively. Moreover, a uniform recovery condition and its two resulting error estimates are also established for the first time to our knowledge, for the robust block-sparse signal recovery using a regularized mixed ℓ\n2\n/ℓ\n1\n-norm minimization model, and these results well complement the existing theoretical study on this model which focuses on the non-uniform recovery conditions and/or the robust signal recovery in presence of the random noise. Two real-world applications, i.e., the recovery of the grey images and the fetal electrocardiogram (FECG) signals, are conducted to support our claims."}, "journals/appml/ZhaoWW19": {"title": "Blow-up criteria for the 3D liquid crystal flows involving two velocity components.", "url": "https://doi.org/10.1016/j.aml.2019.04.012", "year": "2019", "author": {"Lingling Zhao": "13/2471", "Wendong Wang": "80/4406", "Suyu Wang": "79/6972"}, "abstract": "This note is devoted to investigating blow-up criteria for the three dimensional nematic liquid crystal flows. More precisely, we mainly proved that the strong solution (u,d) can be extended beyond T, provided that the horizontal velocity components uh=(u1,u2) satisfy uh∈Ls(0,T;Lq(R3)),2s+3q≤12,6≤q≤∞."}, "journals/ar/WangQYMSL19": {"title": "Bionic control of exoskeleton robot based on motion intention for rehabilitation training.", "url": "https://doi.org/10.1080/01691864.2019.1621774", "year": "2019", "author": {"Wendong Wang": "80/4406", "Lei Qin": "20/1306", "Xiaoqing Yuan": "32/9545", "Xing Ming": "58/1236", "Tongsen Sun": "93/11274", "Yifan Liu": "23/4955"}, "abstract": ""}, "journals/fgcs/XiTLGW19": {"title": "Pixel-wise depth based intelligent station for inferring fine-grained PM", "url": "https://doi.org/10.1016/j.future.2018.08.051", "year": "2019", "author": {"Teng Xi": "176/0053", "Ye Tian 0008": "32/5495-8", "Xiong Li 0002": "63/6031-2", "Hui Gao 0002": "46/5223-2", "Wendong Wang": "80/4406"}, "abstract": "Air pollution seriously affects people’s lives, among which PM2.5 is especially harmful for humans health. Although many countries have established air quality monitoring stations (AQMS) to monitor air pollution, the costs of constructing and maintaining for AQMS are extremely expensive and the density of AQMS is very low. Taking advantage of the artificial intelligence (AI) and the internet of things (IoT), we established image based intelligent station (IBIS) to monitor air pollution. To study the relationship between PM2.5 concentration and images information, an IoT based smart systems has been established which has collected photos for consecutive 16 months. Furthermore, we utilize deep learning algorithm to acquire pixel-wise depth information. By combining Bayesian estimation with pixel-wise depth information, knowledge learned from well developed IBIS can be transferred to other newly built IBIS. The performance of the proposed method has been evaluated by real dataset. The results show that, compared with three baselines, our proposed algorithm can reduce up to 35% prediction error in average."}, "journals/iet-spr/Huang0W019": {"title": "Sharp sufficient condition of block signal recovery via ", "url": "https://doi.org/10.1049/iet-spr.2018.5037", "year": "2019", "author": {"Jianwen Huang": "69/7482", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406", "Feng Zhang 0023": "48/1294-23"}, "abstract": ""}, "journals/ijon/WangWWC19": {"title": "Fast and efficient algorithm for matrix completion via closed-form 2/3-thresholding operator.", "url": "https://doi.org/10.1016/j.neucom.2018.10.065", "year": "2019", "author": {"Zhi Wang 0015": "95/6543-15", "Wendong Wang": "80/4406", "Jianjun Wang 0003": "00/607-3", "Siqi Chen": "05/8743"}, "abstract": "Matrix completion is arguably one of the most studied problems in machine learning and data analysis. Inspired by the closed-form formulas for L2/3 regularization, we employ the Schatten 2/3 quasi-norm to approximate the rank of a matrix, which can provide a better approximation than traditional ways. We also establish a necessary optimal condition and propose a fixed point iterative scheme for solving L2/3 regularization problem. Through analysing the monotonicity and the accumulation point of L2/3 regularization problem, the convergence of this iteration is analysed. By discussing the optimal selection of the regularization parameter together with a fast Monte Carlo algorithm and an approximate singular value decomposition (SVD) procedure, we build a fast and efficient algorithm that solves the induced optimization problem well. Extensive experiments have been conducted and the results show that the proposed algorithm is fast, efficient and robust. Specifically, we compare the proposed algorithm with state-of-the-art matrix completion algorithms on many synthetic data and large recommendation datasets. Our proposed algorithm is able to achieve similar or better prediction performance, while being faster and more efficient than alternatives. Furthermore, we demonstrate the effectiveness of our proposed algorithm by solving image inpainting problems."}, "journals/irob/ZhangWSCM19": {"title": "A new variable stiffness actuator and its control method.", "url": "https://doi.org/10.1108/IR-05-2018-0107", "year": "2019", "author": {"Lei Zhang": "97/8704", "Wendong Wang": "80/4406", "Yikai Shi": "134/1122", "Yang Chu": "62/999", "Xing Ming": "58/1236"}, "abstract": ""}, "journals/jei/ChenWZW19": {"title": "Image denoising in impulsive noise via weighted Schatten p -norm regularization.", "url": "https://doi.org/10.1117/1.JEI.28.1.013044", "year": "2019", "author": {"Gang Chen": "67/6383", "Jianjun Wang 0003": "00/607-3", "Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/jsac/LvZLXWWLCL19": {"title": "Communication-Aware Container Placement and Reassignment in Large-Scale Internet Data Centers.", "url": "https://doi.org/10.1109/JSAC.2019.2895473", "year": "2019", "author": {"Liang Lv": "10/8843", "Yuchao Zhang": "42/7674", "Yusen Li": "28/6239", "Ke Xu 0002": "181/2626-2", "Dan Wang 0002": "23/2060-2", "Wendong Wang": "80/4406", "Minghui Li": "53/5842", "Xuan Cao": "185/4253", "Qingqing Liang": "14/804"}, "abstract": " Abstract:Containerization has been used in many applications for isolation purposes due to its lightweight, scalable, and highly portable properties. However, to apply containerization in large-scale Internet data centers faces a big challenge. Services in data centers are always instantiated as a group of containers, which often generate heavy communication workloads and therefore resulting in inefficient communications and downgraded service performance. Although assigning the containers of the same service to the same server can reduce the communication overhead, this may cause heavily imbalanced resource utilization since containers of the same service are usually intensive to the same resource. To reduce communication cost as well as balance the resource utilization in large-scale data centers, we further explore the container distribution issues in a real industrial environment and find that such conflict lies in two phases-container placement and container reassignment. The objective of this paper is to address the container distribution problem in these two phases. For the container placement problem, we propose an efficient communication aware worst fit decreasing algorithm to place a set of new containers into data centers. For the container reassignment problem, we propose a two-stage algorithm called Sweep&Search to optimize a given initial distribution of containers by migrating containers among servers. We implement the proposed algorithms in Baidu's data centers and conduct extensive evaluations. Compared with the state-of-the-art strategies, the evaluation results show that our algorithms perform better up to 70% and increase the overall service throughput up to 90% simultaneously."}, "journals/mta/Wang19": {"title": "A novel rapid point-cloud surface reconstruction algorithm for laser imaging radar.", "url": "https://doi.org/10.1007/s11042-018-6244-6", "year": "2019", "author": {"Wendong Wang": "80/4406"}, "abstract": "In order to obtain the fast three-dimensional surface reconstruction from given scattered point clouds, a novel improved point-cloud surface reconstruction algorithm for laser imaging radar is proposed so as to reconstruct the three-dimensional depth surface from the depth data and image data in this paper. Firstly, the three-dimensional space is partitioned into voxels with local distance points and finds outliers with point histogram features; then the Gaussian process (GP) regression is adopted to generate a plane similar to a Gaussian distribution; finally, the high-resolution gray data and three-dimensional interpolation points are fused by using Markov random fields to build a dense three-dimensional depth surface. Experimental results show that our proposed algorithm will greatly improve the robustness and reconstruction accuracy of three-dimensional surface reconstruction algorithm and can be used to assist unmanned driving in complex urban scenes."}, "journals/sensors/GuoGWQL19": {"title": "SASRT: Semantic-Aware Super-Resolution Transmission for Adaptive Video Streaming over Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.3390/s19143121", "year": "2019", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Jingyu Liu": "43/6883"}, "abstract": ""}, "journals/sigpro/WangZHWY19": {"title": "A nonconvex penalty function with integral convolution approximation for compressed sensing.", "url": "https://doi.org/10.1016/j.sigpro.2019.01.001", "year": "2019", "author": {"Jianjun Wang 0003": "00/607-3", "Feng Zhang 0023": "48/1294-23", "Jianwen Huang": "69/7482", "Wendong Wang": "80/4406", "Changan Yuan 0001": "81/1855"}, "abstract": "In this paper, we propose a novel nonconvex penalty function for compressed sensing using integral convolution approximation. It is well known that an unconstrained optimization criterion based on ℓ1-norm easily underestimates the large component in signal recovery. Moreover, most methods either perform well only under the Gaussian random measurement matrix satisfying restricted isometry property or the highly coherent measurement matrix, which both can not be established at the same time. We introduce a new solver to address both of these concerns by adopting a frame of the difference between two convex functions with integral convolution approximation. What’s more, to better boost the recovery performance, a weighted version of it is also provided. Experimental results suggest the effectiveness and robustness of our methods through several signal reconstruction examples in term of success rate and signal-to-noise ratio."}, "journals/tmc/GaoLTYHW19": {"title": "Online Quality-Aware Incentive Mechanism for Mobile Crowd Sensing with Extra Bonus.", "url": "https://doi.org/10.1109/TMC.2018.2877459", "year": "2019", "author": {"Hui Gao 0002": "46/5223-2", "Chi Harold Liu": "45/4723", "Jian Tang 0008": "181/2667-8", "Dejun Yang": "81/7890", "Pan Hui 0001": "62/1272-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Mobile crowd sensing is a new paradigm that enables smart mobile devices to collect and share various types of sensing data in urban environments. However, new challenges arise: one is how to evaluate the quality of data each mobile user potentially is capable of providing; another is how to allocate a satisfactory yet profitable amount of reward to mobile users in order to keep them participating in crowd sensing tasks. In this paper, we first introduce a mathematical model for characterizing quality of sensing data to be contributed by mobile users. Then, we present a utility function and formulate an optimization problem for the platform, who recruits participants to contribute sensing data, to maximize the amount of high quality sensing data under a limited task budget. We next present an effective and quality-aware incentive mechanism to solve this problem for online scenarios where participants may arrive or leave at any random time. Moreover, the proposed incentive mechanism allows the platform to provide selected participants with an extra bonus according to task completion level and their previous performance to motivate them further. We formally show the proposed mechanism has the desirable properties of truthfulness, individual rationality, budgetary feasibility, and computational efficiency. We compare the proposed scheme with existing methods via simulation using a real dataset. Extensive simulation results well justify the effectiveness and robustness of the proposed approach, e.g, compared with another online method “OMG”, the gap to the optimum for our proposed Online-QIM approach is reduce by 33.3 percent when budget B = 1000."}, "journals/corr/abs-1903-00902": {"title": "Deterministic Analysis of Weighted BPDN With Partially Known Support Information.", "url": "http://arxiv.org/abs/1903.00902", "year": "2019", "author": {"Wendong Wang": "80/4406", "Jianjun Wang 0003": "00/607-3"}, "abstract": "\n      Abstract:  In this paper, with the aid of the powerful Restricted Isometry Constant\n(RIC), a deterministic (or say non-stochastic) analysis, which includes a\nseries of sufficient conditions (related to the RIC order) and their resultant\nerror estimates, is established for the weighted Basis Pursuit De-Noising\n(BPDN) to guarantee the robust signal recovery when Partially Known Support\nInformation (PKSI) of the signal is available. Specifically, the obtained\nconditions extend nontrivially the ones induced recently for the traditional\nconstrained weighted $\\ell_{1}$-minimization model to those for its\nunconstrained counterpart, i.e., the weighted BPDN. The obtained error\nestimates are also comparable to the analogous ones induced previously for the\nrobust recovery of the signals with PKSI from some constrained models.\nMoreover, these results to some degree may well complement the recent\ninvestigation of the weighted BPDN which is based on the stochastic analysis.\n\n    "}, "journals/corr/abs-1906-01198": {"title": "Tensor Restricted Isometry Property Analysis For a Large Class of Random Measurement Ensembles.", "url": "http://arxiv.org/abs/1906.01198", "year": "2019", "author": {"Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406", "Jingyao Hou": "242/9424", "Jianjun Wang 0003": "00/607-3", "Jianwen Huang": "69/7482"}, "abstract": "\n      Abstract:  In previous work, theoretical analysis based on the tensor Restricted\nIsometry Property (t-RIP) established the robust recovery guarantees of a\nlow-tubal-rank tensor. The obtained sufficient conditions depend strongly on\nthe assumption that the linear measurement maps satisfy the t-RIP. In this\npaper, by exploiting the probabilistic arguments, we prove that such linear\nmeasurement maps exist under suitable conditions on the number of measurements\nin terms of the tubal rank r and the size of third-order tensor n1, n2, n3. And\nthe obtained minimal possible number of linear measurements is nearly optimal\ncompared with the degrees of freedom of a tensor with tubal rank r. Specially,\nwe consider a random sub-Gaussian distribution that includes Gaussian,\nBernoulli and all bounded distributions and construct a large class of linear\nmaps that satisfy a t-RIP with high probability. Moreover, the validity of the\nrequired number of measurements is verified by numerical experiments.\n\n    "}, "journals/corr/abs-1906-01774": {"title": "RIP-based performance guarantee for low-tubal-rank tensor recovery.", "url": "http://arxiv.org/abs/1906.01774", "year": "2019", "author": {"Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406", "Jianwen Huang": "69/7482", "Yao Wang 0003": "72/628-3", "Jianjun Wang 0003": "00/607-3"}, "abstract": "\n      Abstract:  The essential task of tensor data analysis focuses on the tensor\ndecomposition and the corresponding notion of rank. In this paper, by\nintroducing the notion of tensor Singular Value Decomposition (t-SVD), we\nestablish a Regularized Tensor Nuclear Norm Minimization (RTNNM) model for\nlow-tubal-rank tensor recovery. As we know that many variants of the Restricted\nIsometry Property (RIP) have proven to be crucial analysis tools for sparse\nrecovery. In the t-SVD framework, we initiatively define a novel tensor\nRestricted Isometry Property (t-RIP). Furthermore, we show that any third-order\ntensor $\\boldsymbol{\\mathcal{X}}$ can stably be recovered from few linear noise\nmeasurements under some certain t-RIP conditions via the RTNNM model. We note\nthat, as far as the authors are aware, such kind of result has not previously\nbeen reported in the literature.\n\n    "}, "journals/access/HuangWZW18a": {"title": "New Sufficient Conditions of Signal Recovery With Tight Frames via l", "url": "https://doi.org/10.1109/ACCESS.2018.2833121", "year": "2018", "author": {"Jianwen Huang": "69/7482", "Jianjun Wang 0003": "00/607-3", "Feng Zhang 0023": "48/1294-23", "Wendong Wang": "80/4406"}, "abstract": " Abstract:This paper discusses the recovery of signals that are nearly sparse with respect to a tight frame \n DD \n by means of the \n l1l_{1} \n-analysis approach. We establish several new sufficient conditions regarding the \n DD \n-restricted isometry property to ensure stable reconstruction of signals that are approximately sparse with respect to \n DD \n. It is shown that if the measurement matrix \n Φ\\Phi  \n fulfills the condition \n δts<t/(4−t)\\delta _{ts}<t/(4-t) \n for \n 0<t<4/30<t<4/3 \n, then signals which are approximately sparse with respect to \n DD \n can be stably recovered by the \n l1l_{1} \n-analysis approach. In the case of \n D=ID=I \n, the bound is sharp (see Cai and Zhang’s work). In addition, numerical simulations are conducted to indicate that the \n l1l_{1} \n-analysis method can stably reconstruct the sparse signal in terms of tight frames."}, "journals/access/Zhang0WHW18": {"title": "Perturbations of Compressed Data Separation With Redundant Tight Frames.", "url": "https://doi.org/10.1109/ACCESS.2018.2851019", "year": "2018", "author": {"Feng Zhang 0023": "48/1294-23", "Jianjun Wang 0003": "00/607-3", "Yao Wang 0003": "72/628-3", "Jianwen Huang": "69/7482", "Wendong Wang": "80/4406"}, "abstract": " Abstract:In the era of big data, the multi-modal data can be seen everywhere. Research on such data has attracted extensive attention in the past few years. In this paper, we investigate the perturbations of compressed data separation with redundant tight frames via Φ̃-Iq-minimization. By exploiting the properties of the redundant tight frame and the perturbation matrix, i.e., mutual coherence, null space property, and restricted isometry property, the condition on reconstruction of sparse signal with redundant tight frames is established, and the error estimation between the local optimal solution and the original signal is also provided. Numerical experiments are carried out to show that Φ̃-Iq-minimization is robust and stable for the reconstruction of sparse signal with redundant tight frames. To our knowledge, our works may be the first study concerning the perturbations of the measurement matrix and the redundant tight frame for compressed"}, "journals/access/WangWWGC18": {"title": "A Novel Thresholding Algorithm for Image Deblurring Beyond Nesterov's Rule.", "url": "https://doi.org/10.1109/ACCESS.2018.2873628", "year": "2018", "author": {"Zhi Wang 0015": "95/6543-15", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406", "Chao Gao": "86/5355", "Siqi Chen": "05/8743"}, "abstract": " Abstract:Image deblurring problem is a tough work for improving the quality of images, in this paper; we develop an efficient and fast thresholding algorithm to handle such problem. We observe that the improved fast iterative thresholding algorithm (IFISTA) can be further accelerated by using a sequence of over relaxation parameters which do not satisfy the Nesterov's rule. Our proposed algorithm preserves the simplicity of the IFISTA and fast iterative shrinkage thresholding algorithm (FISTA). In addition, we theoretically study the convergence of our proposed algorithm and obtain some improved convergence rate. Furthermore, we investigate the local variation of iterations which is still unknown in FISTA and IFISTA algorithms so far. Extensive experiments have been conducted and show that our proposed algorithm is more efficient and robust. Specifically, we compare our proposed algorithm with FISTA and IFISTA algorithms on a series of scenarios, including the different level noise signals as well as different weighting matrices. All results demonstrate that our proposed algorithm is able to achieve better recovery performance, while being faster and more efficient than others."}, "journals/caee/ZhangZWWW18": {"title": "Development of a software tool for teaching real-time state simulation of water distribution networks.", "url": "https://doi.org/10.1002/cae.21909", "year": "2018", "author": {"Hui Zhang 0029": "z/HuiZhang29", "Xue Zhou": "10/3434", "Luobin Wang": "220/8099", "Kai Wang": "78/2022", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/comcom/TianLSNSZW18": {"title": "Privacy-preserving scheme in social participatory sensing based on Secure Multi-party Cooperation.", "url": "https://doi.org/10.1016/j.comcom.2017.10.007", "year": "2018", "author": {"Ye Tian 0008": "32/5495-8", "Xiong Li 0002": "63/6031-2", "Arun Kumar Sangaiah": "150/1679", "Edith C. H. Ngai": "25/5713", "Zheng Song": "181/2470", "Lanshan Zhang": "184/6537", "Wendong Wang": "80/4406"}, "abstract": "Social participant sensing has been widely used to collect location related sensory data for various applications. In order to improve the Quality of Information (QoI) of the collected data with constrained budget, the application server needs to coordinate participants with different data collection capabilities and various incentive requirements. However, existing participant coordination methods either require participants to reveal their trajectories to the server which causes privacy leakage, or tradeoff the location accuracy of participants for privacy, thereby leading to lower QoI. In this paper, we propose a privacy-preserving scheme, which allows application server to provide quasi-optimal QoI for social sensing tasks without knowing participants’ trajectories and identity. More specifically, we first suggest a Secure Multi-party Cooperation (SMC) based approach to evaluate participant’s contribution in terms of QoI without disclosing each individual’s trajectory. Second, a fuzzy decision based approach which aims to finely balance data utility gain, incentive budget and inferable privacy protection ability is adopted to coordinate participant in an incremental way. Third, sensory data and incentive are encrypted and then transferred along with participant-chain in perturbed way to protect user privacy throughout the data uploading and incentive distribution procedure. Simulation results show that our proposed method can efficiently select appropriate participants to achieve better QoI than other methods, and can protect each participant’s privacy effectively."}, "journals/comcom/LiuLWGQC18": {"title": "USA: Faster update for SDN-based internet of things sensory environments.", "url": "https://doi.org/10.1016/j.comcom.2018.02.015", "year": "2018", "author": {"Tao Liu 0013": "43/656-13", "Chi Harold Liu": "45/4723", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": "Internet of Things (IoT) require ubiquitous and seamless network connectivity. Meanwhile, it also asks for effective service management, data transmission and analysis. Towards this end, software defined networks (SDN) technology is introduced as a key solution to enable IoT network management. When IoT requires an efficient forwarding policy reconfiguration as the response to the alteration of system requirement (e.g., network environment or user demand), SDN is able to adjust the configurations easily to meet its demand. Previous research efforts tried to complete the reconfiguration as quickly as possible, since the update speed is critical to the performance of network management. However, update time can be further reduced. In this paper, we propose a novel update mechanism, which is referred to as rule co-existence update. It is able to enlarge the solution space and obtain more individual solutions, without any negative effect to the packet headers or throughput of flows. Then, we propose a scheme called USA (i.e., Update Speed Accelerator), as a novel algorithm for network updates based on the above-mentioned rule co-existence, that accelerates the update of forwarding policy with spare rule space on current network switches for general IoT environments. Based on the obtained suboptimal greedy solution, USA shows a novel way for rule co-existence to accelerate the update of forwarding policies. It also proposes a simplified algorithm to ensure the forwarding correctness during the update process. Extensive simulation results show that USA can clearly reduce the update time for nearly half of policies in our experiments with few rule space overhead, which is less than 8% of all policies, and maximum update time is less than previous works when spare rule space is limited."}, "journals/complexity/XiaLLWLZ18": {"title": "A MapReduce-Based Parallel Frequent Pattern Growth Algorithm for Spatiotemporal Association Analysis of Mobile Trajectory Big Data.", "url": "https://doi.org/10.1155/2018/2818251", "year": "2018", "author": {"Dawen Xia": "143/6314", "Xiaonan Lu": "56/6680", "Huaqing Li 0001": "98/6634", "Wendong Wang": "80/4406", "Yantao Li": "19/9058", "Zili Zhang 0001": "17/1185-1"}, "abstract": ""}, "journals/computer/GaoLW18": {"title": "Hybrid Vehicular Crowdsourcing With Driverless Cars: Challenges and a Solution.", "url": "https://doi.org/10.1109/MC.2018.2879994", "year": "2018", "author": {"Hui Gao 0002": "46/5223-2", "Chi Harold Liu": "45/4723", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Although vehicular crowdsourcing represents an emerging technology to assist many smart city applications, maintaining sensing data quality is still a challenge. This article considers the challenges and offers a potential solution for a hybrid scenario involving both driverless cars and human-controlled vehicles, within the limited task budget."}, "journals/iet-spr/WangWZ18": {"title": "Block-sparse signal recovery via ℓ 2 / ℓ 1 - 2 minimisation method.", "url": "https://doi.org/10.1049/iet-spr.2016.0381", "year": "2018", "author": {"Wendong Wang": "80/4406", "Jianjun Wang 0003": "00/607-3", "Zili Zhang": "17/1185"}, "abstract": ""}, "journals/ijdsn/0006TGQW18": {"title": "MCS-RF: mobile crowdsensing-based air quality estimation with random forest.", "url": "https://doi.org/10.1177/1550147718804702", "year": "2018", "author": {"Cheng Feng 0006": "76/3473-6", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/jsjkx/00150W18": {"title": "基于子空间阈值追踪的矩阵修补算法 (Matrix Completion Algorithm Based on Subspace Thresholding Pursuit).", "url": "https://doi.org/10.11896/j.issn.1002-137X.2018.06.034", "year": "2018", "author": {"Zhi Wang 0015": "95/6543-15", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/network/ZhangSWL18": {"title": "Unlocking the Door to Mobile Social VR: Architecture, Experiments and Challenges.", "url": "https://doi.org/10.1109/MNET.2017.1700014", "year": "2018", "author": {"Lan-Shan Zhang": "138/8141", "Linhui Sun": "66/7278", "Wendong Wang": "80/4406", "Jiangchuan Liu": "l/JiangchuanLiu"}, "abstract": " Abstract:VR redefines the well known social network by introducing impressive environment sharing and revolutionary face-to-face interaction. Benefiting from better mobility and affordability, mobile social VR is gaining popularity; however, very little is known about how and how well it performs. In this article, we characterize the workflow of mobile social VR, propose a tentative architecture by drawing lessons from well known techniques, and implement this architecture as a prototype. To analyze mobile social VR's performance and identify potential bottlenecks, we conduct experiments to evaluate and decouple the prototype. We observe that mobile social VR's performance mainly depends on the scene it renders, and existing high-end mobile devices exhaust most GPU resources but still offer poor experience for complicated scenes. Finally, we highlight the major challenges and prospects for future work."}, "journals/tbc/GuoGLWQ18": {"title": "An Optimized Hybrid Unicast/Multicast Adaptive Video Streaming Scheme Over MBMS-Enabled Wireless Networks.", "url": "https://doi.org/10.1109/TBC.2018.2832444", "year": "2018", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Mobile multimedia services have been increasingly popular. However, radio resources are limited. The quality of experience of all users in wireless networks can be enriched by resource allocation, which is affected by many factors in current wireless networks. In this paper, we focus on a hybrid unicast-multicast (HUM) video streaming scheme, and develop an adaptive resource allocation framework for HUM by combining adaptive cooperative transmission and base station handoff. The optimization problem is formulated as a multi-dimensional, complexity-constrained nonlinear NP-hard problem. To solve the problem, a greedy algorithm and a genetic algorithm are proposed. Simulation results demonstrate that our scheme has superior performance than other transmission methods in the literature. The genetic algorithm has better performance, but the greedy algorithm can maintain better balance between performance and resource consumption."}, "journals/tii/ZhangLTX0W18": {"title": "Learning-Based Energy-Efficient Data Collection by Unmanned Vehicles in Smart Cities.", "url": "https://doi.org/10.1109/TII.2017.2783439", "year": "2018", "author": {"Bo Zhang 0032": "36/2259-32", "Chi Harold Liu": "45/4723", "Jian Tang 0008": "181/2667-8", "Zhiyuan Xu": "42/2832", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Mobile crowdsourcing (MCS) is now an important source of information for smart cities, especially with the help of unmanned aerial vehicles (UAVs) and driverless cars. They are equipped with different kinds of high-precision sensors, and can be scheduled/controlled completely during data collection, which will make MCS system more robust. However, they are limited to energy constraint, especially for long-term, long-distance sensing tasks, and cities are almost too crowded to set stationary charging station. Towards this end, in this paper we propose to leverage emerging deep reinforcement learning (DRL) techniques for enabling model-free unmanned vehicles control, and present a novel and highly effective control framework, called “DRL-RVC.” It utilizes the powerful convolutional neural network for feature extraction of the necessary information (including sample distribution, traffic flow, etc.), then makes decisions under the guidance of the deep Q network. That is, UAVs will cruise in the city without control and collect most required data in the sensing region, while mobile unmanned charging station will reach the charging point in the shortest possible time. Finally, we validate and evaluate the proposed framework via extensive simulations based on a real dataset in Rome. Extensive simulation results well justify the effectiveness and robustness of our approach."}, "journals/corr/abs-1812-03739": {"title": "Coherence-Based Performance Guarantee of Regularized 𝓁", "url": "http://arxiv.org/abs/1812.03739", "year": "2018", "author": {"Wendong Wang": "80/4406", "Feng Zhang 0023": "48/1294-23", "Zhi Wang 0015": "95/6543-15", "Jianjun Wang 0003": "00/607-3"}, "abstract": "\n      Abstract:  In this paper, we consider recovering the signal $\\bm{x}\\in\\mathbb{R}^{n}$\nfrom its few noisy measurements $\\bm{b}=A\\bm{x}+\\bm{z}$, where\n$A\\in\\mathbb{R}^{m\\times n}$ with $m\\ll n$ is the measurement matrix, and\n$\\bm{z}\\in\\mathbb{R}^{m}$ is the measurement noise/error. We first establish a\ncoherence-based performance guarantee for a regularized $\\ell_{1}$-norm\nminimization model to recover such signals $\\bm{x}$ in the presence of the\n$\\ell_{2}$-norm bounded noise, i.e., $\\|\\bm{z}\\|_{2}\\leq\\epsilon$, and then\nextend these theoretical results to guarantee the robust recovery of the\nsignals corrupted with the Dantzig Selector (DS) type noise, i.e.,\n$\\|A^{T}\\bm{z}\\|_{\\infty}\\leq\\epsilon$, and the structured block-sparse signal\nrecovery in the presence of the bounded noise. To the best of our knowledge, we\nfirst extend nontrivially the sharp uniform recovery condition derived by Cai,\nWang and Xu (2010) for the constrained $\\ell_{1}$-norm minimization model,\nwhich takes the form of \\begin{align*} \\mu<\\frac{1}{2k-1}, \\end{align*} where\n$\\mu$ is defined as the (mutual) coherence of $A$, to two unconstrained\nregularized $\\ell_{1}$-norm minimization models to guarantee the robust\nrecovery of any signals (not necessary to be $k$-sparse) under the\n$\\ell_{2}$-norm bounded noise and the DS type noise settings, respectively.\nBesides, a uniform recovery condition and its two resulting error estimates are\nalso established for the first time to our knowledge, for the robust\nblock-sparse signal recovery using a regularized mixed $\\ell_{2}/\\ell_{1}$-norm\nminimization model, and these results well complement the existing theoretical\ninvestigation on this model which focuses on the non-uniform recovery\nconditions and/or the robust signal recovery in presence of the random noise.\n\n    "}, "journals/iet-spr/LiuWWW17": {"title": "Non-convex block-sparse compressed sensing with redundant dictionaries.", "url": "https://doi.org/10.1049/iet-spr.2016.0272", "year": "2017", "author": {"Chunyan Liu": "50/3263", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406", "Zhi Wang 0015": "95/6543-15"}, "abstract": ""}, "journals/internet/LongGQWLJK17": {"title": "Autonomic Networking: Architecture Design and Standardization.", "url": "https://doi.org/10.1109/MIC.2017.3481338", "year": "2017", "author": {"Xinjian Long": "206/3728", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Wendong Wang": "80/4406", "Bing Liu 0006": "87/6277", "Sheng Jiang": "35/6161", "Ning Kong": "07/4165"}, "abstract": " Abstract:Autonomic networking is a promising solution to handle the ever-increasing management complexity of dynamic network environments. This article elaborates on two autonomic networking architectures and current standardization activities revolving around them."}, "journals/itiis/QiWGQ17": {"title": "Rules Placement with Delay Guarantee in Combined SDN Forwarding Element.", "url": "https://doi.org/10.3837/tiis.2017.06.004", "year": "2017", "author": {"Qinglei Qi": "160/4952", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": ""}, "journals/jsjkx/ZhouWCWZ18": {"title": "基于Pthreads的车辆图像兴趣区域提取并行算法研究 (Research on Parallel Algorithm of Vehicle Image Interested Region Based on Pthreads).", "url": "https://doi.org/10.11896/j.issn.1002-137X.2017.03.009", "year": "2017", "author": {"Yihua Zhou": "74/5788", "Wendong Wang": "80/4406", "Hongcai Chen": "65/6146", "Ting Wang": "12/2633", "Changyou Zhang": "85/351"}, "abstract": ""}, "journals/siamma/PuWW17": {"title": "The Landau-Lifshitz Equation of the Ferromagnetic Spin Chain and Oseen-Frank Flow.", "url": "https://doi.org/10.1137/16M1094907", "year": "2017", "author": {"Xueke Pu": "121/5425", "Meng Wang": "93/6765", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/sj/LiuZSMWL17": {"title": "Energy-Aware Participant Selection for Smartphone-Enabled Mobile Crowd Sensing.", "url": "https://doi.org/10.1109/JSYST.2015.2430362", "year": "2017", "author": {"Chi Harold Liu": "45/4723", "Bo Zhang 0032": "36/2259-32", "Xin Su 0001": "54/3643-1", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406", "Kin K. Leung": "04/2707"}, "abstract": " Abstract:Mobile crowd sensing systems have been widely used in various domains but are currently facing new challenges. On one hand, the increasingly complex services need a large number of participants to satisfy their demand for sensory data with multidimensional high quality-of-information (QoI) requirements. On the other hand, the willingness of their participation is not always at a high level due to the energy consumption and its impacts on their regular activities. In this paper, we introduce a new metric, called “QoI satisfaction ratio,” to quantify how much collected sensory data can satisfy a multidimensional task's QoI requirements in terms of data granularity and quantity. Furthermore, we propose a participant sampling behavior model to quantify the relationship between the initial energy and the participation of participants. Finally, we present a QoI-aware energy-efficient participant selection approach to provide a suboptimal solution to the defined optimization problem. Finally, we have compared our proposed scheme with existing methods via extensive simulations based on the real movement traces of ordinary citizens in Beijing. Extensive simulation results well justify the effectiveness and robustness of our approach."}, "journals/spic/ZhaoGLWQGC17": {"title": "QoE-driven optimization for cloud-assisted DASH-based scalable interactive multiview video streaming over wireless network.", "url": "https://doi.org/10.1016/j.image.2017.05.015", "year": "2017", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Yihua Guo": "132/8476", "Shiduan Cheng": "35/3871"}, "abstract": "In interactive multiview video streaming (IMVS), the viewers can periodically switch viewpoints. If the captured view is not available at the desired viewpoint, virtual views can be rendered from neighboring coded views using view synthesis techniques. Dynamic adaptive streaming over HTTP (DASH) is a new standard that allows to adjust the quality of video streaming based on the network condition. In this paper, an improved DASH-based IMVS framework is proposed. It has the following characteristics. First, virtual views could be adaptively generated at either the cloud-based server or the client in our scheme, depending on the network condition and the cost of the cloud. Second, scalable video coding (SVC) is used to improve the flexibility in our system. To optimize the Quality of Experience (QoE) of multiple clients in wireless scenario, we develop a cross-layer optimization scheme. We first propose a new cache management method to selectively store the video data according to SVC structure and the clients’ requesting condition. Next, a cross-layer scheduling scheme is proposed by considering the video rate adaptation and the wireless resource allocation. The optimization problem is shown to be equivalent to the Multiple Choice Knapsack (MCKP) problem. A dynamic programming method and a low-cost greedy method are developed to solve the problem. Simulations with the NS3 tool demonstrate the advantage of our proposed scheme over the existing approach that always uses client-based view synthesis and single-layer video coding."}, "journals/spl/WangWZ17": {"title": "Robust Signal Recovery With Highly Coherent Measurement Matrices.", "url": "https://doi.org/10.1109/LSP.2016.2626308", "year": "2017", "author": {"Wendong Wang": "80/4406", "Jianjun Wang 0003": "00/607-3", "Zili Zhang": "17/1185"}, "abstract": " Abstract:By embedding an ℓ\np\n-norm noise constraint for p ≥ 2 into the recently emerged ℓ\n1-2\n method, in this letter, we study theoretically and numerically an ℓ\n1-2\n/ℓ\np\n method for recovery of general noisy signals from highly coherent measurement matrices. In particular, the obtained theoretical results not only improve the condition deduced in [1] for Gaussian noisy signal recovery but also provide a new theoretical guarantee for generally nonGaussian noisy signal recovery. What is more, to better boost the recovery performance, a partial sum ℓ\n1-2\n/ℓ\np\n method is also proposed latter. This improved method, together with the previous ℓ\n1-2\n/ℓ\np\n method, becomes more competitive when compared with some of the state-of-the-art methods in recovering noisy signals from highly coherent measurement matrices."}, "journals/tvt/TianWWKSN17": {"title": "Privacy-Preserving Social Tie Discovery Based on Cloaked Human Trajectories.", "url": "https://doi.org/10.1109/TVT.2016.2554608", "year": "2017", "author": {"Ye Tian 0008": "32/5495-8", "Wendong Wang": "80/4406", "Jie Wu 0001": "w/JieWu1", "Qinli Kou": "172/5440", "Zheng Song": "181/2470", "Edith C. H. Ngai": "25/5713"}, "abstract": " Abstract:The discovery of peoples' social connections is becoming a flourishing research topic, considering the rich social information inferable from human trajectories. Existing social tie detection methods often require mobile users to upload their accurate locations, causing serious privacy concerns. On the other hand, cloaking methods allow users to upload their obscured locations instead and can efficiently protect their location privacy. However, no existing social tie detection method can generate social relationships among users when only obscured trajectories are provided. To tackle the aforementioned problem, this paper proposes a novel semantic-tree-based algorithm. Specifically, we model the obscured regions from the cloaking algorithm as a semantic region tree and assign weight values for regions based on their popularity, further indicating the similarity between users based on their temporal and spatial relations. We evaluate our proposed approach using a real trajectory data set and show that our algorithm can identify social ties successfully with 20% higher accuracy than the existing approaches."}, "journals/adhoc/WangGLL16": {"title": "Credible and energy-aware participant selection with limited task budget for mobile crowd sensing.", "url": "https://doi.org/10.1016/j.adhoc.2016.02.007", "year": "2016", "author": {"Wendong Wang": "80/4406", "Hui Gao 0002": "46/5223-2", "Chi Harold Liu": "45/4723", "Kin K. Leung": "04/2707"}, "abstract": "Crowd sensing campaigns encourage ordinary people to collect and share sensing data by using their carried smart devices. However, new challenges that must be faced have arisen. One of them is how to allocate tasks to the most appropriate participants when considering their different incentive requirements and credibility, in order to best satisfy the quality-of-information (QoI) requirements of multiple concurrent tasks, with different, and limited budget constraints. Another challenge is how to maximize participants’ rewards to encourage them to contribute sensing data continuously. To this end, in this paper, we first propose a crowd sensing system, that aims to address the above two challenges, where the system considers the benefits of both platform and participants. Then, a participant reputation definition and update method is proposed, that takes participant’s willingness and contributed data quality into consideration. Last, we introduce two metrics called “QoI satisfaction” and “Difficulty of Task (DoT)”. The former quantifies how much collected sensing data can satisfy the multi-dimensional task’s QoI requirements in terms of data quality, granularity and quantity, and the later aids participants to choose proper tasks to maximize their rewards. Finally, we compare our proposed scheme with existing methods via extensive simulations based on a real dataset. Extensive simulation results well justify the effectiveness and robustness of our approach."}, "journals/cn/ZhangLLSRMW16": {"title": "Privacy-preserving QoI-aware participant coordination for mobile crowdsourcing.", "url": "https://doi.org/10.1016/j.comnet.2015.12.022", "year": "2016", "author": {"Bo Zhang 0032": "36/2259-32", "Chi Harold Liu": "45/4723", "Jianyu Lu": "180/5197", "Zheng Song": "181/2470", "Ziyu Ren": "172/4445", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": "Mobile crowdsourcing systems are important sources of information for the Internet of Things (IoT) such as gathering location related sensing data for various applications by employing ordinary citizens to participate in data collection. In order to improve the Quality of Information (QoI) of the collected data, the system server needs to coordinate participants with different data collection capabilities and various incentive requirements. However, existing participant coordination methods require the participants to reveal their trajectories to the system server which causes privacy leakage. But, with the improvement of ordinary citizens’ consciousness to protect their rights, the risk of privacy leakage may reduce their enthusiasm for data collection. In this paper, we propose a participant coordination framework, which allows the system server to provide optimal QoI for sensing tasks without knowing the trajectories of participants. The participants work cooperatively to coordinate their sensing tasks instead of relying on the traditional centralized server. A cooperative data aggregation, an incentive distribution method, and a punishment mechanism are further proposed to both protect participant privacy and ensure the QoI of the collected data. Simulation results show that our proposed method can efficiently select appropriate participants to achieve better QoI than other methods, and can protect each participant’s privacy effectively."}, "journals/ijwmip/ZhangWW16": {"title": "A perturbation analysis of block-sparse compressed sensing via mixed ℓ2/ℓ1 minimization.", "url": "https://doi.org/10.1142/S0219691316500260", "year": "2016", "author": {"Jing Zhang": "05/3499", "Jianjun Wang 0003": "00/607-3", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/internet/ZhangSWT16": {"title": "KaaS: A Standard Framework Proposal on Video Skimming.", "url": "https://doi.org/10.1109/MIC.2016.83", "year": "2016", "author": {"Lan-Shan Zhang": "138/8141", "Linhui Sun": "66/7278", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8"}, "abstract": " Abstract:Video skimming, a technique for video summarization, is particularly significant in the face of explosive growth of video content. This article highlights the necessities and motivations of providing video skimming as a standard service and proposes a standard framework for video skimming."}, "journals/jnca/XiaoWZW16": {"title": "A resource-efficient multimedia encryption scheme for embedded video sensing system based on unmanned aircraft.", "url": "https://doi.org/10.1016/j.jnca.2015.06.021", "year": "2016", "author": {"Chen Xiao": "05/3054", "Lifeng Wang": "82/6720", "Mengjiao Zhu": "173/5568", "Wendong Wang": "80/4406"}, "abstract": "Battery-powered unmanned aerial vehicle based video sensing system is more cost-saving and energy-saving than traditional aircraft based systems. However, high-volume real-time sensing data is more vulnerable in unmanned system than that in manned system. Meanwhile, the computation and energy resources in such system are very limited, which restricts the use of complex encryption process on video data. Therefore, how to achieve confidentiality of video data under limited resources efficiently needs to be addressed. Firstly, resources constraints with their development trends in video sensing system are studied. Secondly, an information-utility-value-oriented resource-efficient encryption optimization model under resources constraints is given. Thirdly, based on this model, a video-compression-independent speed-adjustable lightweight encryption scheme with its improved version is proposed. Fourthly, a DSP and ARM based embedded secure video sensing system is designed, and the proposed encryption scheme has been implemented in it. In addition, theoretical analyses based on information theory and experimental analyses on throughputs show that the proposed encryption schemes can meet the real-time requirements of system under the tight resources constraints."}, "journals/sensors/WangXNS16": {"title": "Energy-Efficient Collaborative Outdoor Localization for Participatory Sensing.", "url": "https://doi.org/10.3390/s16060762", "year": "2016", "author": {"Wendong Wang": "80/4406", "Teng Xi": "176/0053", "Edith C. H. Ngai": "25/5713", "Zheng Song": "181/2470"}, "abstract": ""}, "journals/sensors/LiuWMYY16": {"title": "Distributed Task Offloading in Heterogeneous Vehicular Crowd Sensing.", "url": "https://doi.org/10.3390/s16071090", "year": "2016", "author": {"Yazhi Liu": "70/10126", "Wendong Wang": "80/4406", "Yuekun Ma": "147/6831", "Zhigang Yang": "71/1564", "FuXing Yu": "68/8839"}, "abstract": ""}, "journals/sensors/XuZWT16": {"title": "Adaptive Sampling-Based Information Collection for Wireless Body Area Networks.", "url": "https://doi.org/10.3390/s16091385", "year": "2016", "author": {"Xiaobin Xu": "98/2004", "Fang Zhao 0003": "72/4898-3", "Wendong Wang": "80/4406", "Hui Tian 0003": "57/1592-3"}, "abstract": ""}, "journals/chinaf/HuWGQC15": {"title": "On the feasibility and efficacy of control traffic protection in software-defined networks.", "url": "https://doi.org/10.1007/s11432-015-5483-7", "year": "2015", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": "Software Defined Networking (SDN) is an emerging networking paradigm that assumes a logically centralized control plane separated from the data plane. Despite all its advantages, separating the control and data planes introduces new challenges regarding resilient communications between the two. That is, disconnections between switches and their controllers could result in substantial packet loss and performance degradation. This paper addresses this challenge by studying the issue of control traffic protection in SDNs with arbitrary numbers of controllers. Specifically, we propose a control traffic protection scheme that combines both local rerouting and constrained reverse path forwarding protections, through which switches can locally react to failures and redirect the control traffic using standby backup forwarding options. Our goal is then to find a set of primary routes for control traffic, called protected control network, where as many switches as possible can benefit from the proposed protection scheme. We formulate the protected control network problem, prove its NP-hardness, and develop an algorithm that reconciles protectability and performance (e.g., switch-to-control latency). Through extensive simulations based on real topologies, we show that our approach significantly improves protectability of control traffic. The results should help further the process of deploying SDN in real-world networks."}, "journals/cnsns/0003ZWY15": {"title": "A perturbation analysis of nonconvex block-sparse compressed sensing.", "url": "https://doi.org/10.1016/j.cnsns.2015.05.022", "year": "2015", "author": {"Jianjun Wang 0003": "00/607-3", "Jing Zhang": "05/3499", "Wendong Wang": "80/4406", "Chan-Yun Yang": "67/2778"}, "abstract": "This paper proposes a completely perturbed mixed ℓ2/ℓp minimization to deal with a model of completely perturbed block-sparse compressed sensing. Based on the block restricted isometry property (BRIP), the paper extends the study to a complete perturbation model which considers not only noise but also perturbation, establishes a sufficient condition for efficiently recovering the block-sparse signal under the complete perturbation case, and offers eventually a superior approximation precision. The precision, in this paper, can be characterized in terms of the total noise and the best K-term approximation. The adopted mixed ℓ2/ℓp minimization also gains better robustness and stability than ever that on recovering the block-sparse signal with the presence of total noise. Especially, the analysis of this study shows the condition is the best sufficient condition δ2K < 1 [20] when p tends to zero and a > 1 for the complete perturbation and block-sparse signal. The numerical experiments carried out confirm excellently the assessed performance."}, "journals/comsur/GaoLWZSSCL15": {"title": "A Survey of Incentive Mechanisms for Participatory Sensing.", "url": "https://doi.org/10.1109/COMST.2014.2387836", "year": "2015", "author": {"Hui Gao 0002": "46/5223-2", "Chi Harold Liu": "45/4723", "Wendong Wang": "80/4406", "Jianxin R. Zhao": "197/9438", "Zheng Song": "181/2470", "Xin Su 0001": "54/3643-1", "Jon Crowcroft": "c/JonCrowcroft", "Kin K. Leung": "04/2707"}, "abstract": " Abstract:Participatory sensing is now becoming more popular and has shown its great potential in various applications. It was originally proposed to recruit ordinary citizens to collect and share massive amounts of sensory data using their portable smart devices. By attracting participants and paying rewards as a return, incentive mechanisms play an important role to guarantee a stable scale of participants and to improve the accuracy/coverage/timeliness of the sensing results. Along this direction, a considerable amount of research activities have been conducted recently, ranging from experimental studies to theoretical solutions and practical applications, aiming at providing more comprehensive incentive procedures and/or protecting benefits of different system stakeholders. To this end, this paper surveys the literature over the period of 2004-2014 from the state of the art of theoretical frameworks, applications and system implementations, and experimental studies of the incentive strategies used in participatory sensing by providing up-to-date research in the literature. We also point out future directions of incentive strategies used in participatory sensing."}, "journals/internet/CuiWSLW15": {"title": "IPv4 Address Sharing and Allocation for IPv6 Transition.", "url": "https://doi.org/10.1109/MIC.2015.110", "year": "2015", "author": {"Yong Cui 0001": "91/2346-1", "Wendong Wang": "80/4406", "Qi Sun": "05/4187", "Lishan Li": "57/1102", "Xingwei Wang 0001": "99/4694-1"}, "abstract": " Abstract:Sharing IPv4 addresses is important for IPv4 service continuity when the Internet transitions to IPv6.The IETF proposes IPv4 address sharing during the transition period.This article discusses IPv4 address sharing principles, surveys IPv4 address sharing and allocation mechanisms, and presents IETF standardization efforts."}, "journals/jss/WangTGQH15": {"title": "Software defined autonomic QoS model for future Internet.", "url": "https://doi.org/10.1016/j.jss.2015.08.016", "year": "2015", "author": {"Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Qinglei Qi": "160/4952", "Yannan Hu": "133/3740"}, "abstract": "Software defined technology has gained enormous momentum in both industry and academia. It may change the existing information flow architecture, which centered at hardware, by granting more privileges to deploy third-party software with more flexible network control and management capabilities. However, how to provide intelligent QoS guarantee in future network is still a hot research issue. Based on top-down design strategy, in this paper, we propose a hierarchical autonomic QoS model by adopting software-defined technologies. In this model, the network is divided into: data-plane, control-plane and management-plane. Then the data-plane is sliced as multiple virtual networks with the dynamic resource allocation capabilities, in order to carry different services or applications. The control-plane is abstracted as resource control layer and service control layer for each virtual network respectively. The management-plane then constructs hierarchical autonomic control loops in terms of different services’ bearing virtual networks and the corresponding hierarchical control logic. With the hierarchical autonomic control loop and layered service management functions, this model can provide dynamic QoS guarantee to the underlying data networks. We further proposed a context-aware Collaborative Borrowing Based Packet-Marking (CBBPM) algorithm. As an important underlying QoS component in data-plane, CBBPM can be combined with other QoS components to provide some new QoS functions. Experiment comparisons between different QoS mechanisms demonstrate the effectiveness of our proposed hierarchical autonomic QoS model and the packet marking mechanism."}, "journals/tcsv/ZhaoGLWQC15": {"title": "QoE-Driven Cross-Layer Optimization for Wireless Dynamic Adaptive Streaming of Scalable Videos Over HTTP.", "url": "https://doi.org/10.1109/TCSVT.2014.2357094", "year": "2015", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Recently, Dynamic Adaptive Streaming over HTTP (DASH) has attracted significant attention. In this paper, we consider DASH-based transmission of scalable videos in wireless broadband access networks (e.g., long-term evolution and WiMAX), and propose three methods to enhance the quality of experience of wireless DASH users. First, we design an improved mapping scheme from scalable video coding layers to DASH layers that can provide the desired bitrates, enhance the video end-to-end throughput, and reduce the HTTP communication overhead. Second, we develop a DASH-friendly scheduling and resource allocation algorithm by integrating the DASH-based media delivery and the radio-level adaptation via a cross-layer approach. It utilizes the characteristics of video content and scalable video coding, and greatly reduces the possibility of video playback interruption by considering the client buffer status. The optimization problem is formulated as a mixed binary integer programming problem, and is solved by a subgradient method. Finally, a DASH proxy-based bitrate stabilization algorithm is proposed to improve the video playback smoothness that can achieve the desired tradeoff between playback quality and stability. Simulations with the Qualnet tool demonstrate that our schemes achieve better performances than other methods in the literature."}, "journals/tist/ZhangSLMW15": {"title": "An Event-Driven QoI-Aware Participatory Sensing Framework with Energy and Budget Constraints.", "url": "https://doi.org/10.1145/2630074", "year": "2015", "author": {"Bo Zhang 0032": "36/2259-32", "Zheng Song": "181/2470", "Chi Harold Liu": "45/4723", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": "Participatory sensing systems can be used for concurrent event monitoring applications, like noise levels, fire, and pollutant concentrations. However, they are facing new challenges as to how to accurately detect the exact boundaries of these events, and further, to select the most appropriate participants to collect the sensing data. On the one hand, participants’ handheld smart devices are constrained with different energy conditions and sensing capabilities, and they move around with uncontrollable mobility patterns in their daily life. On the other hand, these sensing tasks are within time-varying quality-of-information (QoI) requirements and budget to afford the users’ incentive expectations. Toward this end, this article proposes an event-driven QoI-aware participatory sensing framework with energy and budget constraints. The main method of this framework is event boundary detection. For the former, a two-step heuristic solution is proposed where the coarse-grained detection step finds its approximation and the fine-grained detection step identifies the exact location. Participants are selected by explicitly considering their mobility pattern, required QoI of multiple tasks, and users’ incentive requirements, under the constraint of an aggregated task budget. Extensive experimental results, based on a real trace in Beijing, show the effectiveness and robustness of our approach, while comparing with existing schemes."}, "journals/ijdsn/ZhangLMW14": {"title": "Secure and Efficient Authentication Scheme for Mobile Sink in WSNs Based on Bilinear Pairings.", "url": "https://doi.org/10.1155/2014/846901", "year": "2014", "author": {"Junsong Zhang": "15/9171", "Xiong Li 0002": "63/6031-2", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/internet/CuiSXWL14": {"title": "Configuring IPv4 over IPv6 Networks: Transitioning with DHCP.", "url": "https://doi.org/10.1109/MIC.2014.49", "year": "2014", "author": {"Yong Cui 0001": "91/2346-1", "Qi Sun": "05/4187", "Ke Xu 0002": "181/2626-2", "Wendong Wang": "80/4406", "Ted Lemon": "145/8009"}, "abstract": " Abstract:To transition to IPv6, ISPs must determine how to configure IPv4 over IPv6 networks using the Dynamic Host Configuration Protocol (DHCP). However, multifarious requirements result in various solutions. The authors sort out the requirements for configuring an IPv4 node in IPv6 networks, survey IETF standardization efforts, and give recommendations on this topic."}, "journals/itiis/ZhangMLW14": {"title": "A Secure and Efficient Remote User Authentication Scheme for Multi-server Environments Using ECC.", "url": "https://doi.org/10.3837/tiis.2014.08.021", "year": "2014", "author": {"Junsong Zhang": "15/9171", "Jian Ma 0001": "26/4870-1", "Xiong Li 0002": "63/6031-2", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/tvt/SongLWMW14": {"title": "QoI-Aware Multitask-Oriented Dynamic Participant Selection With Budget Constraints.", "url": "https://doi.org/10.1109/TVT.2014.2317701", "year": "2014", "author": {"Zheng Song": "181/2470", "Chi Harold Liu": "45/4723", "Jie Wu 0001": "w/JieWu1", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": " Abstract:By using increasingly popular smartphones, participatory sensing systems can collect comprehensive sensory data to retrieve context-aware information for different applications (or sensing tasks). However, new challenges arise when selecting the most appropriate participants when considering their different incentive requirements, associated sensing capabilities, and uncontrollable mobility, to best satisfy the quality-of-information (QoI) requirements of multiple concurrent tasks with different budget constraints. This paper proposes a multitask-oriented participant selection strategy called “DPS,” which is used to tackle the aforementioned challenges, where three key design elements are proposed. First is the QoI satisfaction metric, where the required QoI metrics of the collected data are quantified in terms of data granularity and quantity. Second is the multitask-orientated QoI optimization problem for participant selection, where task budgets are treated as the constraint, and the goal is to select a minimum subset of participants to best provide the QoI satisfaction metrics for all tasks. The optimization problem is then converted to a nonlinear knapsack problem and is solved by our proposed dynamic participant selection (DPS) strategy. Third is how to compute the expected amount of collected data by all (candidate) participants, where a probability-based movement model is proposed to facilitate such computation. Real and extensive trace-based simulations show that, given the same budget, the proposed participant selection strategy can achieve far better QoI satisfactions for all tasks than selecting participants randomly or through the reversed-auction-based approaches."}, "journals/ijdsn/DingWCGW13": {"title": "Moving Target Oriented Opportunistic Routing Algorithm in Vehicular Networks.", "url": "https://doi.org/10.1155/2013/692146", "year": "2013", "author": {"Yu Ding": "77/6871", "Wendong Wang": "80/4406", "Yong Cui 0001": "91/2346-1", "Xiangyang Gong": "04/8431", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "journals/ijdsn/XiongMWT13": {"title": "", "url": "https://doi.org/10.1155/2013/690974", "year": "2013", "author": {"Yongping Xiong": "61/8573", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406", "Dengbiao Tu": "92/7786"}, "abstract": ""}, "journals/jnca/LiuNMSHW13": {"title": "The insights of message delivery delay in VANETs with a bidirectional traffic model.", "url": "https://doi.org/10.1016/j.jnca.2012.01.010", "year": "2013", "author": {"Yazhi Liu": "70/10126", "Jianwei Niu 0002": "25/4653-2", "Jian Ma 0001": "26/4870-1", "Lei Shu 0001": "19/2932-1", "Takahiro Hara": "40/2808", "Wendong Wang": "80/4406"}, "abstract": "Message delivery delay is mainly caused by mobility and sparse distribution of vehicles in Vehicular Ad hoc NETworks (VANETs). It directly impacts the application design and deployments for VANETs. In this paper, we conduct an in-depth study on the insights of message delivery delay in VANETs towards the identified two major factors: (1) message delivery distance, (2) density of vehicles, based on a bidirectional vehicle traffic model. The bidirectional vehicle traffic was modeled as a combination of multiple Poisson point processes. Based on the sub-additive ergodic theory, theoretically, we found that the message delivery delay has a linear relationship with the message delivery distance. Furthermore, the upper bound of the coefficient of the linear relationship has an exponential polynomial relationship with the density of vehicles on the road and decreases with the increase of the velocity of the traffic."}, "journals/jsa/LiuNMW13": {"title": "File downloading oriented Roadside Units deployment for vehicular networks.", "url": "https://doi.org/10.1016/j.sysarc.2013.04.007", "year": "2013", "author": {"Yazhi Liu": "70/10126", "Jianwei Niu 0002": "25/4653-2", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": "Vehicular Ad hoc Networks (VANETs) have been recently introduced to provide high-speed Internet access to vehicles by deploying 802.11 enhanced Roadside Units (RSUs) along roads. However, few file downloading oriented RSU deployment strategies have been proposed. In this paper, we propose a new RSU deployment strategy for file downloading in VANETs. The encounters between vehicles and RSUs are modeled as a time continuous homogeneous Markov chain. The optimal inter-meeting time between vehicles and RSUs is analyzed based on the encounter model. Then, the road network is modeled as a weighted undirected graph, and a RSU deployment algorithm is designed based on the depth-first traversal algorithm for edges of a graph. Simulation results show that the proposed RSU deployment algorithm can satisfy the file downloading service requirements with the lowest RSU deployment cost."}, "journals/jsac/0059CJCXW13": {"title": "Spectrum Assignment and Sharing for Delay Minimization in Multi-Hop Multi-Flow CRNs.", "url": "https://doi.org/10.1109/JSAC.2013.131103", "year": "2013", "author": {"Wei Li 0059": "64/6025-59", "Xiuzhen Cheng 0001": "c/XiuzhenCheng", "Tao Jing": "16/2303", "Yong Cui 0001": "91/2346-1", "Kai Xing": "07/3465", "Wendong Wang": "80/4406"}, "abstract": " Abstract:This paper investigates the problem of spectrum assignment and sharing to minimize the total delay of multiple concurrent flows in multi-hop cognitive radio networks. We first analyze the expected per-hop delay, which incorporates the sensing delay and transmission delay characterizing the PU activities and spectrum capacities. Then we formulate a minimum delay optimization problem with interference constraints, and propose an approximation algorithm termed MCC to solve the problem. According to our theoretical analysis, MCC has a bounded performance ratio and a low computational complexity. Finally, we exploit the minimum potential delay fairness in spectrum sharing to mitigate the inter-flow contentions. Extensive simulation study has been performed to validate our design and to compare the performance of our algorithms with that of the state-of-the-art."}, "journals/mcm/LiMWXZ13": {"title": "A novel smart card and dynamic ID based remote user authentication scheme for multi-server environments.", "url": "https://doi.org/10.1016/j.mcm.2012.06.033", "year": "2013", "author": {"Xiong Li 0002": "63/6031-2", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406", "Yongping Xiong": "61/8573", "Junsong Zhang": "15/9171"}, "abstract": "With the purpose of using numerous different network services with single registration, various multi-server authentication schemes have been proposed. Furthermore, in order to protect the users from being tracked when they login to the remote server, researchers have proposed some dynamic ID based remote user authentication schemes for multi-server environments. Recently, Lee et al. have pointed out the security weaknesses of Hsiang and Shih’s dynamic ID based multi-server authentication scheme, and proposed an improved dynamic ID based authentication scheme for multi-server environments. They claimed that their scheme provided user anonymity, mutual authentication, session key agreement and can resist several kinds of attacks. In this paper, however, we find that Lee et al.’s scheme is still vulnerable to forgery attack and server spoofing attack. Besides, their scheme cannot provide proper authentication if the mutual authentication message is partly modified by the attacker. In order to remove these security weaknesses, we propose a novel smart card and dynamic ID based authentication scheme for multi-server environments. In order to protect the user from being tracked, the proposed scheme enables the user’s identity to change dynamically when the user logs into the server. The proposed scheme is suitable for use in multi-server environments such as financial security authentication since it can ensure security while maintaining efficiency."}, "journals/siamma/WangZ13": {"title": "On the Interior Regularity Criteria for Suitable Weak Solutions of the Magnetohydrodynamics Equations.", "url": "https://doi.org/10.1137/120879646", "year": "2013", "author": {"Wendong Wang": "80/4406", "Zhifei Zhang": "66/9500"}, "abstract": ""}, "journals/tce/TianWGQM13": {"title": "An enhanced personal photo recommendation system by fusing contextual and textual features on mobile device.", "url": "https://doi.org/10.1109/TCE.2013.6490263", "year": "2013", "author": {"Ye Tian 0008": "32/5495-8", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Jian Ma 0001": "26/4870-1"}, "abstract": " Abstract:As a main means to record scene in personal daily life, personal photos convey high-level semantic information (e.g., who, what, when, where) of an activity user engaged in. Different from other information retrieval tasks, personal photo recommendation depends on the measure of activity relevancy which is implicitly embedded in photos. Spurred by this observation, an enhanced recommendation approach by fusing both contextual and textual features is proposed. First, contextual relevancy is incrementally refined with an enhanced temporal and spatial clustering method respectively. Second, textual similarity of photo annotations is calculated using WordNet to augment the activity relevancy. Third, a fuzzy decision based multi-criteria ranking algorithm i.e., Preference Ranking Organization Method of Enrichment Evaluation (PROMETHEE) is adopted to make recommendations when giving an entry photo. A prototype has been developed on mobile device to illustrate this concept. Experiment results on a real dataset which contains 10,827 photos collected from 50 volunteers during 12 months demonstrate that our approach is more accurate than traditional schemes."}, "journals/jnca/LiXMW12": {"title": "An efficient and security dynamic identity based authentication protocol for multi-server architecture using smart cards.", "url": "https://doi.org/10.1016/j.jnca.2011.11.009", "year": "2012", "author": {"Xiong Li 0002": "63/6031-2", "Yongping Xiong": "61/8573", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406"}, "abstract": "Generally, if a user wants to use numerous different network services, he/she must register himself/herself to every service providing server. It is extremely hard for users to remember these different identities and passwords. In order to resolve this problem, various multi-server authentication protocols have been proposed. Recently, Sood et al. analyzed Hsiang and Shih's multi-server authentication protocol and proposed an improved dynamic identity based authentication protocol for multi-server architecture. They claimed that their protocol provides user's anonymity, mutual authentication, the session key agreement and can resist several kinds of attacks. However, through careful analysis, we find that Sood et al.'s protocol is still vulnerable to leak-of-verifier attack, stolen smart card attack and impersonation attack. Besides, since there is no way for the control server CS to know the real identity of the user, the authentication and session key agreement phase of Sood et al.'s protocol is incorrect. We propose an efficient and security dynamic identity based authentication protocol for multi-server architecture that removes the aforementioned weaknesses. The proposed protocol is extremely suitable for use in distributed multi-server architecture since it provides user's anonymity, mutual authentication, efficient, and security."}, "journals/jnca/LiNMWL11": {"title": "Cryptanalysis and improvement of a biometrics-based remote user authentication scheme using smart cards.", "url": "https://doi.org/10.1016/j.jnca.2010.09.003", "year": "2011", "author": {"Xiong Li 0002": "63/6031-2", "Jianwei Niu 0002": "25/4653-2", "Jian Ma 0001": "26/4870-1", "Wendong Wang": "80/4406", "Chenglian Liu": "12/7573"}, "abstract": "Recently, Li and Hwang proposed a biometrics-based remote user authentication scheme using smart cards [Journal of Network and Computer Applications 33 (2010) 1–5]. The scheme is based on biometrics verification, smart card and one-way hash function, and it uses the nonce rather than a synchronized clock, so it is very efficient in computational cost. Unfortunately, the scheme has some security weaknesses, that is to say Li and Hwang's scheme does not provide proper authentication and it cannot resist the man-in-the-middle attacks. If an attacker controls the insecure channel, she/he can easily fabricate messages to pass the user's or server's authentication. Besides, the malicious attacker can impersonate the user to cheat the server and can impersonate the server to cheat the user without knowing any secret information. This paper proposes an improved biometrics-based remote user authentication scheme that removes the aforementioned weaknesses and supports session key agreement."}, "journals/tcsv/LoLSWS11": {"title": "Improved SIMD Architecture for High Performance Video Processors.", "url": "https://doi.org/10.1109/TCSVT.2011.2130250", "year": "2011", "author": {"Wing-Yee Lo": "52/10588", "Daniel Pak-Kong Lun": "73/5761", "Wan-Chi Siu": "61/5203", "Wendong Wang": "80/4406", "Jiqiang Song": "47/4010"}, "abstract": " Abstract:Single instruction multiple data (SIMD) execution is in no doubt an efficient way to exploit the data level parallelism in image and video applications. However, SIMD execution bottlenecks must be tackled in order to achieve high execution efficiency. We first analyze in this paper the implementation of two major kernel functions of H.264/AVC namely, SATD and subpel interpolation, in conventional SIMD architectures to identify the bottlenecks in traditional approaches. Based on the analysis results, we propose a new SIMD architecture with two novel features: 1) parallel memory structure with variable block size and word length support, and 2) configurable SIMD structure. The proposed parallel memory structure allows great flexibility for programmers to perform data access of different block sizes and different word lengths. The configurable SIMD structure allows almost “random” register file access and slightly different operations in ALUs inside SIMD. The new features greatly benefit the realization of H.264/AVC kernel functions. For instance, the fractional motion estimation, particularly the half to quarter pixel interpolation, can now be executed with minimal or no additional memory access. When comparing with the conventional SIMD systems, the proposed SIMD architecture can have a further speedup of 2.1X to 4.6X when implementing H.264/AVC kernel functions. Based on Amdahl's law, the overall speedup of H.264/AVC encoding application can be projected to be 2.46X. We expect significant improvement can also be achieved when applying the proposed architecture to other image and video processing applications."}, "journals/comcom/GongWC10": {"title": "A fast IPv6 packet classification algorithm based on efficient multi-bit selection.", "url": "https://doi.org/10.1016/j.comcom.2010.04.042", "year": "2010", "author": {"Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "Decision tree based schemes are widely used in designing high-speed packet classification algorithms. The primary objective is to construct a decision tree with minimal storage and searching time complexity. In this paper, we proposed a novel decision tree packet classification algorithm based on Efficient Multiple Bit Selection (EMBS). In the proposed algorithm, prefix fields are transformed to a set of independent bits; and multiple arbitrary bits are selected to cut nodes when building the decision tree. A Performance Estimate Function (PEF) and an efficient bit selecting algorithm are exploited to determine which bits should be selected to obtain an efficient decision tree with high performance. The proposed EMBS algorithm is capable of handling range match fields, and it is suitable for IPv6 packet classification as well as IPv4. Evaluation results show that EMBS provides a great improvement over recent decision tree based algorithms in both space requirement and searching performance."}, "journals/jcst/GongWC10": {"title": "ERFC: An Enhanced Recursive Flow Classification Algorithm.", "url": "https://doi.org/10.1007/s11390-010-9380-7", "year": "2010", "author": {"Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "Packet classification on multi-fields is a fundamental mechanism in network equipments, and various classification solutions have been proposed. Because of inherent difficulties, many of these solutions scale poorly in either time or space as rule sets grow in size. Recursive Flow Classification (RFC) is an algorithm with a very high classifying speed. However, its preprocessing complexity and memory requirement are rather high. In this paper, we propose an enhanced RFC (ERFC) algorithm, in which a hash-based aggregated bit vector scheme is exploited to speed up its preprocessing procedure. A compressed and cacheable data structure is also introduced to decrease total memory requirement and improve its searching performance. Evaluation results show that ERFC provides a great improvement over RFC in both space requirement and preprocessing time. The search time complexity of ERFC is equivalent to that of RFC in the worst case; and its average classifying speed is improved by about 100%."}, "journals/ijdsn/LiuWGLCG09": {"title": "A Novel Group Management Protocol for IP Multicast (LW-IGMPv3).", "url": "https://doi.org/10.1080/15501320802533632", "year": "2009", "author": {"Jiwen Liu": "43/2983", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Hui Liu": "93/4010", "Wei Cao": "54/6265", "Xuesong Gao": "202/2854"}, "abstract": ""}, "journals/chinaf/ChuZCW08": {"title": "Active probing based Internet service fault management in uncertain and noisy environment.", "url": "https://doi.org/10.1007/s11432-008-0143-9", "year": "2008", "author": {"LingWei Chu": "60/1996", "Shihong Zou": "16/4301", "Shiduan Cheng": "35/3871", "Wendong Wang": "80/4406"}, "abstract": "In Internet service fault management based on active probing, uncertainty and noises will affect service fault management. In order to reduce the impact, challenges of Internet service fault management are analyzed in this paper. Bipartite Bayesian network is chosen to model the dependency relationship between faults and probes, binary symmetric channel is chosen to model noises, and a service fault management approach using active probing is proposed for such an environment. This approach is composed of two phases: fault detection and fault diagnosis. In first phase, we propose a greedy approximation probe selection algorithm (GAPSA), which selects a minimal set of probes while remaining a high probability of fault detection. In second phase, we propose a fault diagnosis probe selection algorithm (FDPSA), which selects probes to obtain more system information based on the symptoms observed in previous phase. To deal with dynamic fault set caused by fault recovery mechanism, we propose a hypothesis inference algorithm based on fault persistent time statistic (FPTS). Simulation results prove the validity and efficiency of our approach."}, "journals/comcom/TianZWC06": {"title": "Constructing efficient peer-to-peer overlay topologies by adaptive connection establishment.", "url": "https://doi.org/10.1016/j.comcom.2006.05.016", "year": "2006", "author": {"Huirong Tian": "69/4134", "Shihong Zou": "16/4301", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "A Reciprocal Capacity based Adaptive Topology Protocol (RC-ATP) is proposed in this paper to construct efficient peer-to-peer networks. It is based on the rational belief that a peer is only willing to maintain connections with those which will benefit it in future. Reciprocal capacity is defined based on peers’ capacity of providing services and of recommending service providers. As a result, reciprocal peers connect each other adequately. Therefore, the resulting topologies are more efficient and resilient than Adaptive Peer-to-Peer Topologies (APT). Furthermore, RC-ATP has the intrinsic incentive to active peers as they are more advantaged and important in the network than freeriders and malicious peers. Although the overhead of the topology adaptation is a bit higher, RC-ATP works more efficiently with less cost compared with the Adaptive Peer-to-Peer Topologies Protocol (APTP)."}, "journals/twc/LinCWJ06": {"title": "Measurement-based TFRC: improving TFRC in heterogeneous mobile networks.", "url": "https://doi.org/10.1109/TWC.2006.1687706", "year": "2006", "author": {"Yu Lin": "74/2577", "Shiduan Cheng": "35/3871", "Wendong Wang": "80/4406", "Yuehui Jin": "18/3125"}, "abstract": " Abstract:As a well-known multimedia stream transport protocol, TFRC provides smooth transfer rate under stable network conditions, and achieves good fairness to TCP. However, it is not flexible in heterogeneous mobile networks because the available bandwidth varies rapidly. This paper proposes a measurement based TFRC (MBTFRC) protocol, which uses passive bandwidth measurements at the receiver to improve the flexibility of TFRC. In addition, a window-based EWMA filter with two weights is used to achieve stability and fairness simultaneously. Simulation results verify the flexibility, stability and fairness of MBTFRC."}, "journals/cviu/WangD96": {"title": "Recovering the Three-Dimensional Motion and Structure of Multiple Moving Objects from Binocular Image Flows.", "url": "https://doi.org/10.1006/cviu.1996.0033", "year": "1996", "author": {"Wendong Wang": "80/4406", "James H. Duncan": "29/681"}, "abstract": "A new method is presented for recovering the three-dimensional motion and structure of multiple, independently moving, rigid objects through the analysis of binocular image flow fields. The input to the algorithm is the image location and image velocity of a sparse set of feature points in the stereo image pair. The algorithm analyzes one rigid object at a time by simultaneously segmenting the associated feature points from the input data set, establishing the stereo correspondence of these feature points and determining the three-dimensional motion of the object. The solution method is iterative and is based on the stereo-motion algorithm presented in J. H. Duncan, L. Li, and W. Wang, “Recovering Three-Dimensional Velocity and Established Stereo Correspondence from Binocular Image Flows” (Opt. Eng.34(7), July 1995, 2157–2167.) for the analysis of scenes with only one set of three-dimensional motion components. No restrictions on the three-dimensional structure of the scene are required by the theory. Experimental results with numerically generated and laboratory image sequences are given to verify the method."}}}