{"id": "29/1059-3", "name": "Xiang Cheng 0003", "Article": {"conf/aaai/RenCS20": {"title": "Multi-Task Learning with Generative Adversarial Training for Multi-Passage Machine Reading Comprehension.", "url": "https://ojs.aaai.org/index.php/AAAI/article/view/6396", "year": "2020", "author": {"Qiyu Ren": "238/6690", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499"}, "abstract": "Multi-passage machine reading comprehension (MRC) aims to answer a question by multiple passages. Existing multi-passage MRC approaches have shown that employing passages with and without golden answers (i.e. labeled and unlabeled passages) for model training can improve prediction accuracy. In this paper, we present MG-MRC, a novel approach for multi-passage MRC via multi-task learning with generative adversarial training. MG-MRC adopts the extract-then-select framework, where an extractor is first used to predict answer candidates, then a selector is used to choose the final answer. In MG-MRC, we adopt multi-task learning to train the extractor by using both labeled and unlabeled passages. In particular, we use labeled passages to train the extractor by supervised learning, while using unlabeled passages to train the extractor by generative adversarial training, where the extractor is regarded as the generator and a discriminator is introduced to evaluate the generated answer candidates. Moreover, to train the extractor by backpropagation in the generative adversarial training process, we propose a hybrid method which combines boundary-based and content-based extracting methods to produce the answer candidate set and its representation. The experimental results on three open-domain QA datasets confirm the effectiveness of our approach.\n\t\t\t\t"}, "conf/ecir/Jia0S20": {"title": "Improving Knowledge Graph Embedding Using Locally and Globally Attentive Relation Paths.", "url": "https://doi.org/10.1007/978-3-030-45439-5_2", "year": "2020", "author": {"Ningning Jia": "18/8841", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499"}, "abstract": "Knowledge graphs’ incompleteness has motivated many researchers to propose methods to automatically infer missing facts in knowledge graphs. Knowledge graph embedding has been an active research area for knowledge graph completion, with great improvement from the early TransE to the current state-of-the-art ConvKB. ConvKB considers a knowledge graph as a set of triples, and employs a convolutional neural network to capture global relationships and transitional characteristics between entities and relations in the knowledge graph. However, it only utilizes the triple information, and ignores the rich information contained in relation paths. In fact, a path of one relation describes the relation from some aspect in a fine-grained way. Therefore, it is beneficial to take relation paths into consideration for knowledge graph embedding. In this paper, we present a novel convolutional neural network-based embedding model PConvKB, which improves knowledge graph embedding by incorporating relation paths locally and globally. Specifically, we introduce attention mechanism to measure the local importance of relation paths. Moreover, we propose a simple yet effective measure DIPF to compute the global importance of relation paths. Experimental results show that our model achieves substantial improvements against state-of-the-art methods.KeywordsKnowledge graph embeddingLink predictionTriple classificationConvolutional neural networkAttention mechanism"}, "conf/icde/YangCSCRL19": {"title": "Collecting Preference Rankings Under Local Differential Privacy.", "url": "https://doi.org/10.1109/ICDE.2019.00151", "year": "2019", "author": {"Jianyu Yang": "23/6903", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Rui Chen": "02/1003", "Qiyu Ren": "238/6690", "Yuhan Liu": "125/8141"}, "abstract": " Abstract:In this paper, we initiate the study of collecting preference rankings under local differential privacy. The key technical challenge comes from the fact that the number of possible rankings increases factorially in the number of items to rank. In practical settings, this number could be large, leading to excessive injected noise. To solve this problem, we present a novel approach called SAFARI. The general idea is to collect a set of distributions over small domains which are carefully chosen based on the riffle independent model to approximate the overall distribution of users' rankings, and then generate a synthetic ranking dataset from the obtained distributions. By working on small domains instead of a large domain, SAFARI can significantly reduce the magnitude of added noise. Extensive experiments on real datasets confirm the effectiveness of SAFARI."}, "conf/cikm/Liu0SZ18": {"title": "Hierarchical Complementary Attention Network for Predicting Stock Price Movements with News.", "url": "https://doi.org/10.1145/3269206.3269286", "year": "2018", "author": {"Qikai Liu": "228/2546", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shuguang Zhu": "55/9089"}, "abstract": "\n\t\tIt has been shown that stock price movements are influenced by news. To predict stock movements with news, many existing works rely only on the news title since the news content may contain irrelevancies which seriously degrade the prediction accuracy. However, we observe that there is still useful information in the content which is not reflected in the title, and simply ignoring the content will result in poor performance. In this paper, taking advantage of neural representation learning, we propose a hierarchical complementary attention network (HCAN) to capture valuable complementary information in news title and content for stock movement prediction. In HCAN, we adopt a two-level attention mechanism to quantify the importances of the words and sentences in a given news. Moreover, we design a novel measurement for calculating the attention weights to avoid capturing redundant information in the news title and content. Experimental results on news datasets show that our proposed model outperforms the state-of-the-art techniques.\n\t"}, "conf/icde/0003ZSC18": {"title": "A Multi-Objective Optimization Approach for Question Routing in Community Question Answering Services (Extended Abstract).", "url": "https://doi.org/10.1109/ICDE.2018.00240", "year": "2018", "author": {"Xiang Cheng 0003": "29/1059-3", "Shuguang Zhu": "55/9089", "Sen Su": "63/2499", "Gang Chen": "67/6383"}, "abstract": " Abstract:Community Question Answering (CQA) has increasingly become an important service for people asking questions and providing answers online, which enables people to help each other by sharing knowledge. Recently, with accumulation of users and contents, much concern has arisen over the efficiency and answer quality of CQA services. To address this problem, question routing has been proposed which aims at routing new questions to suitable answerers, who have both high possibility and high ability to answer the questions. In this paper, we formulate question routing as a multi-objective ranking problem, and present a multi-objective learning-to-rank approach for question routing (MLQR), which can simultaneously optimize the answering possibility and answer quality of routed users. In MLQR, realizing that questions are relatively short and usually attached with tags, we first propose a tagword topic model (TTM) to derive topical representations of questions. Based on TTM, we then develop features for each question-user pair, which are captured at both platform level and thread level. In particular, the platform-level features summarize the information of a user from his/her history posts in the CQA platform, while the thread-level features model the pairwise competitions of a user with others in his/her answered threads. Finally, we extend a state-of-the-art learning-to-rank algorithm for training a multi-objective ranking model. Extensive experimental results on real-world datasets show that our MLQR can outperform state-of-the-art methods in terms of both answering possibility and answer quality."}, "conf/ijcai/SuJ0ZL18": {"title": "Exploring Encoder-Decoder Model for Distant Supervised Relation Extraction.", "url": "https://doi.org/10.24963/ijcai.2018/610", "year": "2018", "author": {"Sen Su": "63/2499", "Ningning Jia": "18/8841", "Xiang Cheng 0003": "29/1059-3", "Shuguang Zhu": "55/9089", "Ruiping Li": "05/8842"}, "abstract": ""}, "conf/cikm/Zhu0SL17": {"title": "Knowledge-based Question Answering by Jointly Generating, Copying and Paraphrasing.", "url": "https://doi.org/10.1145/3132847.3133064", "year": "2017", "author": {"Shuguang Zhu": "55/9089", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shuang Lang": "156/9165"}, "abstract": "\n\t\tWith the development of large-scale knowledge bases, people are building systems which give simple answers to questions based on consolidate facts. In this paper, we focus on simple questions, which ask about only a subject and relation in the knowledge base. Observing that certain parts of a question usually overlap with names of its corresponding subject and relation in the knowledge base, we argue that a question is formed by a mixture of copying and generation. To model that, we propose a sequence-to-sequence (seq2seq) architecture which encodes a candidate subject-relation pair and decodes it into the given question, where the decoding probability is used to select the best candidate. In our decoder, the copying mode points the subject or relation and duplicates its name, while the generating mode summarizes the meaning of the subject-relation pair and produces a word to smooth the question. Realizing that although sometimes a subject or relation is pointed, different names or keywords might be used, we also incorporate a paraphrasing mode to supplement the copying mode using an automatically mined lexicon. Extensive experiments on the largest dataset exhibit our better performance compared with the state-of-the-art methods.\n\t"}, "conf/ijcai/SuC0B17": {"title": "Deep Supervised Hashing with Nonlinear Projections.", "url": "https://doi.org/10.24963/ijcai.2017/388", "year": "2017", "author": {"Sen Su": "63/2499", "Gang Chen": "67/6383", "Xiang Cheng 0003": "29/1059-3", "Rong Bi": "190/9002"}, "abstract": ""}, "conf/dasfaa/LiCSJ16": {"title": "Followee Recommendation in Event-Based Social Networks.", "url": "https://doi.org/10.1007/978-3-319-32055-7_3", "year": "2016", "author": {"Shuchen Li": "63/348", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Le Jiang": "64/10079"}, "abstract": "Recent years have witnessed the rapid growth of event-based social networks (EBSNs) such as Plancast and DoubanEvent. In these EBSNs, followee recommendation which recommends new users to follow can bring great benefits to both users and service providers. In this paper, we focus on the problem of followee recommendation in EBSNs. However, the sparsity and imbalance of the social relations in EBSNs make this problem very challenging. Therefore, by exploiting the heterogeneous nature of EBSNs, we propose a new method called Heterogenous Network based Followee Recommendation (HNFR) for our problem. In the HNFR method, to relieve the problem of data sparsity, we combine the explicit and latent features captured from both the online social network and the offline event participation network of an EBSN. Moreover, to overcome the problem of data imbalance, we propose a Bayesian optimization framework which adopts pairwise user preference on both the social relations and the events, and aims to optimize the area under ROC curve (AUC). The experiments on real-world data demonstrate the effectiveness of our method.KeywordsFollowee recommendationEvent-based social networksHeterogenous network"}, "conf/dasfaa/LiCSLY16": {"title": "A Combined Collaborative Filtering Model for Social Influence Prediction in Event-Based Social Networks.", "url": "https://doi.org/10.1007/978-3-319-32055-7_13", "year": "2016", "author": {"Xiao Li": "66/2069", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shuchen Li": "63/348", "Jianyu Yang": "23/6903"}, "abstract": "Event-based social networks (EBSNs) provide convenient online platforms for users to organize, attend and share social events. Understanding users’ social influences in social networks can benefit many applications, such as social recommendation and social marketing. In this paper, we focus on the problem of predicting users’ social influences on upcoming events in EBSNs. We formulate this prediction problem as the estimation of unobserved entries of the constructed user-event social influence matrix, where each entry represents the influence value of a user on an event. In particular, we define a user’s social influence on a given event as the proportion of the user’s friends who are influenced by him/her to attend the event. To solve this problem, we present a combined collaborative filtering model, namely, Matrix Factorization with Event Neighborhood (MF-EN) model, by incorporating event-based neighborhood method into matrix factorization. Due to the fact that the constructed social influence matrix is very sparse and the overlap values in the matrix are few, it is challenging to find reliable similar event neighbors using the widely adopted similarity measures (e.g., Pearson correlation and Cosine similarity). To address this challenge, we propose an additional information based neighborhood discovery (AID) method by considering three event-specific features in EBSNs. The parameters of our MF-EN model are determined by minimizing the associated regularized squared error function through stochastic gradient descent. We conduct a comprehensive performance evaluation on real-world datasets collected from DoubanEvent. Experimental results demonstrate the superiority of the proposed model compared to several alternatives.KeywordsRoot Mean Square ErrorSocial InfluenceMatrix FactorizationLatent Dirichlet AllocationEvent NeighborhoodThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/icde/SuTCCW16": {"title": "Differentially private multi-party high-dimensional data publishing.", "url": "https://doi.org/10.1109/ICDE.2016.7498241", "year": "2016", "author": {"Sen Su": "63/2499", "Peng Tang": "93/509", "Xiang Cheng 0003": "29/1059-3", "Rui Chen": "02/1003", "Zequn Wu": "181/9150"}, "abstract": " Abstract:In this paper, we study the novel problem of publishing high-dimensional data in a distributed multi-party environment under differential privacy. In particular, with the assistance of a semi-trusted curator, the involved parties (i.e., local data owners) collectively generate a synthetic integrated dataset while satisfying ε-differential privacy for any local dataset. To solve this problem, we present a differentially private sequential update of Bayesian network (DP-SUBN) solution. In DP-SUBN, the parties and the curator collaboratively identify the Bayesian network ℕ that best fits the integrated dataset D in a sequential manner, from which a synthetic dataset can then be generated. The fundamental advantage of adopting the sequential update manner is that the parties can treat the statistical results provided by previous parties as their prior knowledge to direct how to learn ℕ. The core of DP-SUBN is the construction of the search frontier, which can be seen as a priori knowledge to guide the parties to update ℕ. To improve the fitness of ℕ and reduce the communication cost, we introduce a correlation-aware search frontier construction (CSFC) approach, where attribute pairs with strong correlations are used to construct the search frontier. In particular, to privately quantify the correlations of attribute pairs without introducing too much noise, we first propose a non-overlapping covering design (NOCD) method, and then introduce a dynamic programming method to find the optimal parameters used in NOCD to ensure that the injected noise is minimum. Through formal privacy analysis, we show that DP-SUBN satisfies ε-differential privacy for any local dataset. Extensive experiments on a real dataset demonstrate that DP-SUBN offers desirable data utility with low communication cost."}, "conf/icde/XuSXCX16": {"title": "Differentially private frequent subgraph mining.", "url": "https://doi.org/10.1109/ICDE.2016.7498243", "year": "2016", "author": {"Shengzhi Xu": "161/7873", "Sen Su": "63/2499", "Li Xiong 0001": "39/3530-1", "Xiang Cheng 0003": "29/1059-3", "Ke Xiao": "69/3751"}, "abstract": " Abstract:Mining frequent subgraphs from a collection of input graphs is an important topic in data mining research. However, if the input graphs contain sensitive information, releasing frequent subgraphs may pose considerable threats to individual's privacy. In this paper, we study the problem of frequent subgraph mining (FGM) under the rigorous differential privacy model. We introduce a novel differentially private FGM algorithm, which is referred to as DFG. In this algorithm, we first privately identify frequent subgraphs from input graphs, and then compute the noisy support of each identified frequent subgraph. In particular, to privately identify frequent subgraphs, we present a frequent subgraph identification approach which can improve the utility of frequent subgraph identifications through candidates pruning. Moreover, to compute the noisy support of each identified frequent subgraph, we devise a lattice-based noisy support derivation approach, where a series of methods has been proposed to improve the accuracy of the noisy supports. Through formal privacy analysis, we prove that our DFG algorithm satisfies ε-differential privacy. Extensive experimental results on real datasets show that the DFG algorithm can privately find frequent subgraphs with high data utility."}, "conf/icde/SuXCLY16": {"title": "Differentially private frequent itemset mining via transaction splitting.", "url": "https://doi.org/10.1109/ICDE.2016.7498427", "year": "2016", "author": {"Sen Su": "63/2499", "Shengzhi Xu": "161/7873", "Xiang Cheng 0003": "29/1059-3", "Zhengyi Li": "85/9245", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Frequent itemset mining (FIM) is one of the most fundamental problems in data mining. It has practical importance in a wide range of application areas such as decision support, Web usage mining, bioinformatics, etc. Given a database, where each transaction contains a set of items, FIM tries to find itemsets that occur in transactions more frequently than a given threshold. Despite valuable insights the discovery of frequent itemsets can potentially provide, if the data is sensitive (e.g., web browsing history and medical records), releasing the discovered frequent itemsets might pose considerable threats to individual privacy."}, "conf/icpads/YanCSZX16": {"title": "Authenticated Spatio-Textual Similarity Joins in Untrusted Cloud Environments.", "url": "https://doi.org/10.1109/ICPADS.2016.0095", "year": "2016", "author": {"Han Yan": "63/49", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Qiying Zhang": "193/6719", "Jianliang Xu": "x/JianliangXu"}, "abstract": " Abstract:A spatio-textual similarity join searches a spatio-textual data collection and reports the object pairs that satisfy the specified spatial distance threshold and textual similarity threshold. However, when the data owner outsources the join computations to a third-party cloud service provider, the service provider may send incomplete or incorrect join results to the data owner. In this paper, we propose a pairwise authentication scheme, a cluster based scheme and an order and bound based scheme to authenticate the results of spatiotextual similarity joins. Extensive experiments on a real-world dataset verify the effectiveness and efficiency of our proposed schemes in terms of various performance metrics."}, "conf/trustcom/TengCSB16": {"title": "Privacy-Preserving Top-k Nearest Keyword Search on Outsourced Graphs.", "url": "https://doi.org/10.1109/TrustCom.2016.0143", "year": "2016", "author": {"Yiping Teng": "160/9420", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Rong Bi": "190/9002"}, "abstract": " Abstract:With massive networks emerging with labels or textual contents on the nodes, keyword search on graphs has been used in a wide range of real-life applications in recent years. For achieving great cost savings, data owners are motivated to outsource their services on graphs to the cloud. However, directly outsourcing them may arise serious privacy concerns. In this paper, we study the problem of privacy-preserving top-k nearest keyword search on outsourced graphs. Only a few existing studies primarily focus on the privacy-preserving graph operations under encryption settings, which cannot be directly applied to solve the problem of privacy-preserving keyword search on graphs. To address this problem, we propose a new privacy-preserving scheme for top-k nearest keyword search on graphs, in which a two-level secure index is devised to facilitate privacy-preserving top-k nearest keyword search. To handle the keyword filtering in search processing, we also propose a trapdoor generation method based on privacy-preserving set operations. Leveraging the two-level secure index and trapdoors, we further present the privacy-preserving top-k nearest keyword search algorithm. Thorough analysis shows the validity and security of our scheme. Extensive experimental results on real datasets further demonstrate our scheme can achieve high efficiency."}, "conf/dasfaa/SuYCTXX15": {"title": "Authentication of Top-k Spatial Keyword Queries in Outsourced Databases.", "url": "https://doi.org/10.1007/978-3-319-18120-2_33", "year": "2015", "author": {"Sen Su": "63/2499", "Han Yan": "63/49", "Xiang Cheng 0003": "29/1059-3", "Peng Tang": "93/509", "Peng Xu": "84/586", "Jianliang Xu": "x/JianliangXu"}, "abstract": "In this paper, we study the authentication of top-kk spatial keyword queries in outsourced databases. We first present a scheme based on tree-forest indexes, which consist of an MR-tree (which is the state-of-the-art authenticated data structure for the authentication of spatial queries) and a collection of Merkle term trees (MT-trees). The tree-forest indexes can support efficient top-kk spatial keyword query (kkSKQ) processing and authentication. To derive a small verification object (VO) to be returned to the user, we put forward an entry pruning based scheme, where an MT*-tree is presented. The entries in each node of MT*-tree are ordered and an embedded Merkle hash tree (embedded-MHT) is constructed over them. By employing a novel pruning strategy, the redundant entries in each node of MT*-trees can be eliminated from VO. Our extensive experiments verify the effectiveness, efficiency and scalability of our proposed schemes on several performance metrics, including the index construction time, index size, running time, VO size and authentication time."}, "conf/dasfaa/SuTCWL15": {"title": "Privacy-Preserving Top-k Spatial Keyword Queries over Outsourced Database.", "url": "https://doi.org/10.1007/978-3-319-18120-2_34", "year": "2015", "author": {"Sen Su": "63/2499", "Yiping Teng": "160/9420", "Xiang Cheng 0003": "29/1059-3", "Yulong Wang": "97/5856", "Guoliang Li 0001": "l/GuoliangLi"}, "abstract": "In this paper, we study the privacy-preserving top-kkk spatial keyword query problem in outsourced environments. Existing studies primarily focus on the design of privacy-preserving schemes for either spatial or keyword queries, and they cannot be applied to solve the privacy-preserving spatial keyword query problem. To address this problem, we present a novel privacy-preserving top-kkk spatial keyword query scheme. In particular, we build an encrypted tree index to facilitate privacy-preserving top-kkk spatial keyword queries, where spatial and textual data are encrypted in a unified way. To search with the encrypted tree index, we propose two effective techniques for the similarity computations between queries and tree nodes under encryption. Thorough analysis shows the validity and security of our scheme. Extensive experimental results on real datasets demonstrate our scheme achieves high efficiency and good scalability.KeywordsCloud ServerQuery ProcessingQuery PointData OwnerMinimum Bounding RectangleThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/icde/XuSCLX15": {"title": "Differentially private frequent sequence mining via sampling-based candidate pruning.", "url": "https://doi.org/10.1109/ICDE.2015.7113354", "year": "2015", "author": {"Shengzhi Xu": "161/7873", "Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3", "Zhengyi Li": "85/9245", "Li Xiong 0001": "39/3530-1"}, "abstract": " Abstract:In this paper, we study the problem of mining frequent sequences under the rigorous differential privacy model. We explore the possibility of designing a differentially private frequent sequence mining (FSM) algorithm which can achieve both high data utility and a high degree of privacy. We found, in differentially private FSM, the amount of required noise is proportionate to the number of candidate sequences. If we could effectively reduce the number of unpromising candidate sequences, the utility and privacy tradeoff can be significantly improved. To this end, by leveraging a sampling-based candidate pruning technique, we propose a novel differentially private FSM algorithm, which is referred to as PFS\n2\n. The core of our algorithm is to utilize sample databases to further prune the candidate sequences generated based on the downward closure property. In particular, we use the noisy local support of candidate sequences in the sample databases to estimate which sequences are potentially frequent. To improve the accuracy of such private estimations, a sequence shrinking method is proposed to enforce the length constraint on the sample databases. Moreover, to decrease the probability of misestimating frequent sequences as infrequent, a threshold relaxation method is proposed to relax the user-specified threshold for the sample databases. Through formal privacy analysis, we show that our PFS\n2\n algorithm is ϵ-differentially private. Extensive experiments on real datasets illustrate that our PFS\n2\n algorithm can privately find frequent sequences with high accuracy."}, "conf/icdm/ChengZCS15": {"title": "Exploiting User Feedback for Expert Finding in Community Question Answering.", "url": "https://doi.org/10.1109/ICDMW.2015.181", "year": "2015", "author": {"Xiang Cheng 0003": "29/1059-3", "Shuguang Zhu": "55/9089", "Gang Chen": "67/6383", "Sen Su": "63/2499"}, "abstract": " Abstract:Community Question Answering (CQA) is a popular online service for people asking and answering questions. Recently, with accumulation of users and contents in CQA platforms, their answer quality has aroused wide concern. Expert finding has been proposed as one way to address such problem, which aims at finding suitable answerers who can give high-quality answers. In this paper, we formalize expert finding as a learning to rank task by leveraging the user feedback on answers (i.e., the votes of answers) as the \"relevance\" labels. To achieve this task, we present a listwise learning to rank approach, which is referred to as ListEF. In the ListEF approach, realizing that questions in CQA are relatively short and usually attached with tags, we propose a tagword topic model (TTM) to derive high-quality topical representations of questions. Based on TTM, we develop a COmpetition-based User exPertise Extraction (COUPE) method to capture user expertise features for given questions. We adopt the widely used listwise learning to rank method LambdaMART to train the ranking function. Finally, for a given question, we rank candidate users in descending order of the scores calculated by the trained ranking function, and select the users with high rankings as candidate experts. Experimental results on Stack Overflow show both our TTM and ListEF approach are effective with significant improvements over state-of-art methods."}, "conf/icdm/SuCGY13": {"title": "Co-ClusterD: A Distributed Framework for Data Co-Clustering with Sequential Updates.", "url": "https://doi.org/10.1109/ICDM.2013.76", "year": "2013", "author": {"Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3", "Lixin Gao 0001": "69/3480-1", "Jiangtao Yin": "82/5647"}, "abstract": " Abstract:Co-clustering is a powerful data mining tool for co-occurrence and dyadic data. As data sets become increasingly large, the scalability of co-clustering becomes more and more important. In this paper, we propose two approaches to parallelize co-clustering with sequential updates in a distributed environment. Based on these two approaches, we present a new distributed framework, Co-ClusterD, that supports efficient implementations of co-clustering algorithms with sequential updates. We design and implement Co-ClusterD, and show its efficiency through two co-clustering algorithms: fast nonnegative matrix tri-factorization (FNMTF) and information theoretic co-clustering (ITCC). We evaluate our framework on both a local cluster of machines and the Amazon EC2 cloud. Our evaluation shows that co-clustering algorithms implemented in Co-ClusterD can achieve better results and run faster than their traditional concurrent counterparts."}, "conf/ccgrid/LiSSHXCW12": {"title": "Reducing Operational Costs through Consolidation with Resource Prediction in the Cloud.", "url": "https://doi.org/10.1109/CCGrid.2012.50", "year": "2012", "author": {"Jian Li": "33/5448", "Kai Shuang": "68/189", "Sen Su": "63/2499", "Qingjia Huang": "36/10372", "Peng Xu": "84/586", "Xiang Cheng 0003": "29/1059-3", "Jie Wang 0002": "29/5259-2"}, "abstract": " Abstract:How to achieve energy efficiency to run a cloud data center is a major challenge in the era of rising electricity cost and environmental protection. Various techniques have been devised to help reduce energy consumption for cloud data centers that consist of a large number of identical servers, including dynamic allocation of active servers, consolidating diverse applications to run on them, and adjusting the CPU speed of an active server. Leveraging these techniques, we use an Online Coloring Bin Packing problem to model the consolidation problem and devise an effective application-aware approximation algorithm to find a near-optimal solution. We show a 1.7 asymptotic approximation ratio. We then apply a Predictive Bayesian Network model to identify daily workload patterns and adjust resource provisioning accordingly. We evaluate our approaches using traces collected from a real data center and demonstrate that (1) our prediction algorithm is effective in estimating future demands, (2) our coordinated approaches can provide significant savings of energy and operational costs close to the near-optimal offline solution, and (3) our approaches incur little reliability costs in term of wear-and-tear of server components."}, "conf/globecom/ZhangSNMCS12": {"title": "Minimizing electricity cost in geographical virtual network embedding.", "url": "https://doi.org/10.1109/GLOCOM.2012.6503510", "year": "2012", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Xinli Niu": "129/1141", "Jiao Ma": "94/7902", "Xiang Cheng 0003": "29/1059-3", "Kai Shuang": "68/189"}, "abstract": " Abstract:In light of rapid increase of electricity cost, many business organizations have to find new ways to cut the electricity bill. This paper studies how to reduce the electricity cost in geographical inter-domain virtual network embedding, which embeds virtual networks requested by users to multiple geographically distributed substrate networks run by an infrastructure provider. Previous researches have primarily focused on finding embedding methods to increase revenues by accommodating more virtual network requests, with little attention to reducing the electricity cost. To bridge this gap, we formulate an electricity cost model and design an efficient cost-aware virtual network embedding algorithm by exploiting the location-varying and time-varying diversities of the electricity price and optimizing the energy consumption. Through extensive simulations, we show that our algorithm can significantly reduce the electricity cost by up to 21% over the existing cost-oblivious algorithm, while maintaining nearly the same revenues for the infrastructure provider."}, "conf/infocom/SuZCWLW12": {"title": "Energy-aware virtual network embedding through consolidation.", "url": "https://doi.org/10.1109/INFCOMW.2012.6193473", "year": "2012", "author": {"Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Xiang Cheng 0003": "29/1059-3", "Yiwen Wang": "00/4918", "Yan Luo": "25/2208", "Jie Wang 0002": "29/5259-2"}, "abstract": " Abstract:The rising cost of electricity has forced business organizations to find new ways to cut energy spending. This paper studies how to reduce energy consumption in virtual network embedding, which embeds virtual networks (VNs) requested by users to a shared substrate network (SN) run by an infrastructure provider (InP). Previous research has primarily focused on finding embedding methods to increase revenues by accommodating more VN requests in a fixed SN, with little attention to reducing the energy cost. To fill this gap we formulate an energy consumption model and devise an efficient energy-aware VN embedding algorithm using a consolidation technique. Through preliminary simulations we show that our algorithm can significantly reduce energy consumption by up to 30% over the existing energy-oblivious algorithm, while obtaining attractive revenues for the InPs."}, "conf/hpcc/LiSCHZ11": {"title": "Cost-Conscious Scheduling for Large Graph Processing in the Cloud.", "url": "https://doi.org/10.1109/HPCC.2011.147", "year": "2011", "author": {"Jian Li": "33/5448", "Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3", "Qingjia Huang": "36/10372", "Zhongbao Zhang": "95/9457"}, "abstract": " Abstract:In recent years large graph processing has emerged to be a popular application for companies because of the increasing large Web graph and social networks. The ever growing scale of graphs and recent emergence of cloud computing poses challenges to their efficient and cost-conscious scheduling approach for processing tasks. In this paper, we focus on the use of cloud resources for dispatching large graph processing tasks. We design a novel framework EComer that can be easily integrated into existing cloud infrastructure. The key component of this framework is a cost-conscious scheduling heuristic, called CCSH, which is an extension of Heterogeneous Earliest Finish Time (HEFT). Our algorithm CCSH first constructs a priority list of tasks and then assigns the task with the highest priority value to the cost-efficient virtual machine in a cloud setting. The comparison study, based on randomly generated large graphs and a real-life astronomy application model, demonstrates that our algorithm outperforms HEFT by exhibiting significant monetary cost savings at a reasonable increase in overall execution time."}, "journals/es/JiaCSD21": {"title": "CoGCN: Combining co-attention with graph convolutional network for entity linking with knowledge graphs.", "url": "https://doi.org/10.1111/exsy.12606", "year": "2021", "author": {"Ningning Jia": "18/8841", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Liyuan Ding": "278/1142"}, "abstract": ""}, "journals/tdsc/Tang0SCS21": {"title": "Differentially Private Publication of Vertically Partitioned Data.", "url": "https://doi.org/10.1109/TDSC.2019.2905237", "year": "2021", "author": {"Peng Tang": "93/509", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Rui Chen 0012": "02/1003-12", "Huaxi Shao": "287/7610"}, "abstract": " Abstract:In this paper, we study the problem of publishing vertically partitioned data under differential privacy, where different attributes of the same set of individuals are held by multiple parties. In this setting, with the assistance of a semi-trusted curator, the involved parties aim to collectively generate an integrated dataset while satisfying differential privacy for each local dataset. Based on the latent tree model (LTM), we present a differentially private latent tree (DPLT) approach, which is, to the best of our knowledge, the first approach to solving this challenging problem. In DPLT, the parties and the curator collaboratively identify the latent tree that best approximates the joint distribution of the integrated dataset, from which a synthetic dataset can be generated. The fundamental advantage of adopting LTM is that we can use the connections between a small number of latent attributes derived from each local dataset to capture the cross-dataset dependencies of the observed attributes in all local datasets such that the joint distribution of the integrated dataset can be learned with little injected noise and low computation and communication costs. DPLT is backed up by a series of novel techniques, including two-phase latent attribute generation (TLAG), tree index based correlation quantification (TICQ) and distributed Laplace perturbation protocol (DLPP). Extensive experiments on real datasets demonstrate that DPLT offers desirable data utility with low computation and communication costs."}, "journals/ijon/ZhuCS20": {"title": "Knowledge-based question answering by tree-to-sequence learning.", "url": "https://doi.org/10.1016/j.neucom.2019.09.003", "year": "2020", "author": {"Shuguang Zhu": "55/9089", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499"}, "abstract": "In recent years, many knowledge bases have been constructed or populated. These knowledge bases link real-world entities by their relationships on a large scale, serving as good resources to answer factoid questions. To answer a natural language question using a knowledge base, the main task is mapping it to a structured query of the same meaning, whose results from the knowledge base will be used as the question’s answers. This mapping task is non-trivial since different questions can express a same meaning and many queries can arise from a knowledge base. To fulfill the task, an important thing is to model a query’s structure as it conveys a part of the meaning and affects word orders in the question. However, state-of-the-art methods based on deep learning have neglected query structures and focused only on capturing semantic correlations between a question and a simple relation chain. In this paper, we instead take a query as a tree, and encode the orders of entities and relations into its representations to better distinguish candidate queries of a given question. Overall, we first construct candidate queries of a given question from its linked entities, types and number operations. Then, we adopt an encoder-decoder framework which encodes a candidate query and decodes it into the given question, where the decoding probability is used to select the best query from candidates. During encoding, we propose a tree-based LSTM to properly model contexts of an entity or relation in a query, and one such tree-based LSTM runs from all leafs to the root while another runs reversely. During decoding, we propose to mix a generating mode and a referring mode to capture different levels of correlations between queries and questions. Experiments on two popular datasets demonstrate the effectiveness of both the tree-based encoder and the mixed-mode decoder."}, "journals/ijon/ChenCST20": {"title": "Multiple-Instance ranking based deep hashing for multi-Label image retrieval.", "url": "https://doi.org/10.1016/j.neucom.2020.03.077", "year": "2020", "author": {"Gang Chen": "67/6383", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Chongmo Tang": "266/5543"}, "abstract": "Hashing methods have been widely applied to approximate nearest neighbor search in large-scale image retrieval due to its fast search speed and efficient storage space. In practice, most images are with multiple category-aware objects, i.e., multi-label images. This paper focuses on hash code learning for multi-label image retrieval. Most existing hashing methods directly extract one patch such as a downsized crop from each image as a training example, which ignores the multi-label characteristic of images and leads to suboptimal representations for multi-label images. Some researches have proved that each multi-label image follows a multi-instance assumption, where each image is represented as a bag of category-aware proposals (instances). However, existing multiple-instance learning methods use predefined statistical functions with limited learning capability to construct bag features, and they are designed for classification or pairwise-similarity preserving. Thus, directly applying existing multiple-instance learning methods into deep hashing framework still leads to suboptimal hash codes for retrieval. In this paper, we pose hashing learning for multi-label image retrieval as a problem of multiple-instance ranking learning. To solve this problem, we present an end-to-end deep hashing framework, referred to as Deep Multiple-Instance Ranking based Hashing (DMIRH). In DMIRH, we design a category-aware bag feature construction module, which jointly assigns the learned instances into categories and aggregates the selected instance features into a bag feature representation that can capture the multi-label information of each image. In addition, we propose a novel learning objective, which consists of an Inner Product distance based quantization loss to control the hash quality and a listwise ranking loss to preserve the ranking relationships. Experimental results on public benchmarks show the superiority of DMIRH over several state-of-the-art hashing methods."}, "journals/kbs/ZhuCS20": {"title": "Conversational semantic parsing over tables by decoupling and grouping actions.", "url": "https://doi.org/10.1016/j.knosys.2020.106237", "year": "2020", "author": {"Shuguang Zhu": "55/9089", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499"}, "abstract": "In this article, we present a new approach for answering a series of simple but inter-related questions over a table by mapping them to the corresponding SQLs. We follow the sequence-to-action paradigm and contribute two innovations: (1) an improved action space. We decouple some actions from existing work because they were jointly deciding unrelated query components, and group some actions with one neural network feature extractor as they were seeking the same aspect of information from the question and table. We also extend the equal action to match multiple cells under a column with a key word or phrase. (2) a simplified scoring model. For question-table encoder, we incorporate BERT to enhance the detection of reference and ellipsis, thus better resolve conversations. For action decoder, we adopt simple feed-forward neural networks to avoid heuristically designed features. We achieve competitive performance on the SequentialQA dataset. Further studies show the effectiveness of each part proposed in our approach."}, "journals/pvldb/Yang0L0S20": {"title": "Answering Multi-Dimensional Range Queries under Local Differential Privacy.", "url": "http://www.vldb.org/pvldb/vol14/p378-yang.pdf", "year": "2020", "author": {"Jianyu Yang": "23/6903", "Tianhao Wang 0001": "145/3288-1", "Ninghui Li": "l/NinghuiLi", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499"}, "abstract": ""}, "journals/tkde/ChengTSCWZ20": {"title": "Multi-Party High-Dimensional Data Publishing Under Differential Privacy.", "url": "https://doi.org/10.1109/TKDE.2019.2906610", "year": "2020", "author": {"Xiang Cheng 0003": "29/1059-3", "Peng Tang": "93/509", "Sen Su": "63/2499", "Rui Chen 0012": "02/1003-12", "Zequn Wu": "181/9150", "Binyuan Zhu": "270/7591"}, "abstract": " Abstract:In this paper, we study the problem of publishing high-dimensional data in a distributed multi-party environment under differential privacy. In particular, with the assistance of a semi-trusted curator, the parties (i.e., local data owners) collectively generate a synthetic integrated dataset while satisfying ε-differential privacy. To solve this problem, we present a differentially private sequential update of Bayesian network (DP-SUBN) approach. In DP-SUBN, the parties and the curator collaboratively identify the Bayesian network N that best fits the integrated dataset in a sequential manner, from which a synthetic dataset can then be generated. The fundamental advantage of adopting the sequential update manner is that the parties can treat the intermediate results provided by previous parties as their prior knowledge to direct how to learn N. The core of DP-SUBN is the construction of the search frontier, which can be seen as a priori knowledge to guide the parties to update N. By exploiting the correlations of attribute pairs, we propose exact and heuristic methods to construct the search frontier. In particular, to privately quantify the correlations of attribute pairs without introducing too much noise, we first put forward a non-overlapping covering design (NOCD) method, and then devise a dynamic programming method for determining the optimal parameters used in NOCD. Through privacy analysis, we show that DP-SUBN satisfies ε-differential privacy. Extensive experiments on real datasets demonstrate that DP-SUBN offers desirable data utility with low communication cost."}, "journals/corr/abs-2009-06538": {"title": "Answering Multi-Dimensional Range Queries under Local Differential Privacy.", "url": "https://arxiv.org/abs/2009.06538", "year": "2020", "author": {"Jianyu Yang": "23/6903", "Tianhao Wang 0001": "145/3288-1", "Ninghui Li": "l/NinghuiLi", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499"}, "abstract": "\n      Abstract:  In this paper, we tackle the problem of answering multi-dimensional range\nqueries under local differential privacy. There are three key technical\nchallenges: capturing the correlations among attributes, avoiding the curse of\ndimensionality, and dealing with the large domains of attributes. None of the\nexisting approaches satisfactorily deals with all three challenges. Overcoming\nthese three challenges, we first propose an approach called Two-Dimensional\nGrids (TDG). Its main idea is to carefully use binning to partition the\ntwo-dimensional (2-D) domains of all attribute pairs into 2-D grids that can\nanswer all 2-D range queries and then estimate the answer of a higher\ndimensional range query from the answers of the associated 2-D range queries.\nHowever, in order to reduce errors due to noises, coarse granularities are\nneeded for each attribute in 2-D grids, losing fine-grained distribution\ninformation for individual attributes. To correct this deficiency, we further\npropose Hybrid-Dimensional Grids (HDG), which also introduces 1-D grids to\ncapture finer-grained information on distribution of each individual attribute\nand combines information from 1-D and 2-D grids to answer range queries. To\nmake HDG consistently effective, we provide a guideline for properly choosing\ngranularities of grids based on an analysis of how different sources of errors\nare impacted by these choices. Extensive experiments conducted on real and\nsynthetic datasets show that HDG can give a significant improvement over the\nexisting approaches.\n\n    "}, "journals/access/LiBSC18": {"title": "Conference Paper Recommendation for Academic Conferences.", "url": "https://doi.org/10.1109/ACCESS.2018.2817497", "year": "2018", "author": {"Shuchen Li": "63/348", "Peter Brusilovsky": "b/PBrusilovsky", "Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3"}, "abstract": " Abstract:With the rapid growth of scientific publications, research paper recommendation which suggests relevant research papers to users can bring great benefits to researchers. In this paper, we focus on the problem of recommending conference papers to the conference attendees. While most of the related existing methods depend on the content-based filtering, we propose a unified conference paper recommendation method named \n CPRecCPRec \n, which exploits both the contents and the authorship information of the papers. In particular, besides the contents, we exploit the relationships between a user and the authors of a paper for recommendation. In our method, we extract several features for a user-paper pair from the citation network, the coauthor network, and the contents, respectively. In addition, we derive a user’s pairwise preference towards the conference papers from the user’s bookmarked papers in each conference. Furthermore, we employ a pairwise learning to rank model which exploits the pairwise user preference to learn a function that predicts a user’s preference towards a paper based on the extracted features. We conduct a recommendation performance evaluation using real-world data and the experimental results demonstrate the effectiveness of our proposed method."}, "journals/ijon/LiCSS18": {"title": "Community-based seeds selection algorithm for location aware influence maximization.", "url": "https://doi.org/10.1016/j.neucom.2017.10.007", "year": "2018", "author": {"Xiao Li": "66/2069", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Chenna Sun": "211/3264"}, "abstract": "In this paper, we study the location aware influence maximization problem, which finds a seed set to maximize the influence spread on targeted users for a given query. In particular, we consider users who have geographical preferences on queries as targeted users. One challenge of the problem is how to find the targeted users and compute their preferences efficiently for given queries. To address this challenge, based on the R-tree, we devise a PR-tree index structure, in which each tree node stores the location and information of users’ geographical preferences. By traversing the PR-tree from the root in depth-first order, we can efficiently find the targeted users. Another challenge of the problem is to devise an algorithm for efficient seeds selection. To solve this challenge, we adopt the maximum influence arborescence (MIA) model to approximate the influence spread, and propose an efficient community-based seeds selection (CSS) algorithm. The proposed CSS algorithm finds seeds efficiently by constructing the PR-tree based indexes offline which precompute users’ community based influences, and preferentially computing the marginal influences of those who would be selected as seeds with high probability online. In particular, we propose a community detection algorithm which first computes the social influence based similarities by the MIA model and then adopts the spectral clustering algorithm to find optimal communities of the social network. Experimental results on real-world datasets collected from DoubanEvent demonstrate our proposed algorithm has superiority as compared to several state-of-the-art algorithms in terms of efficiency, while keeping large influence spread."}, "journals/isci/ZhaoZSCX18": {"title": "Group-based keyword-aware route querying in road networks.", "url": "https://doi.org/10.1016/j.ins.2018.03.058", "year": "2018", "author": {"Sen Zhao": "04/11534", "Lei Zhao": "87/734", "Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3", "Li Xiong 0001": "39/3530-1"}, "abstract": "This paper addresses a group-based keyword-aware route (GKAR) query problem in road networks. The road network with Points of Interest (POIs) is modeled as an undirected graph, where each node with coordinates represents a road intersection or a POI, and each weighted edge represents a road segment. The GAKR query aims to find a POI route such that it passes by a set of required keywords sequentially, and the cost of the route is minimized. The GKAR query problem is NP-hard. To solve this problem, we develop a series of query processing algorithms. We first propose two efficient algorithms which give an (n+3)-factor approximation and an (n+1)-factor approximation respectively to find a feasible POI route, where n represents the number of query keywords. The cost of this result is further used to limit the search space in the following algorithms. We then present two exact algorithms, and one greedy algorithm. The first exact algorithm finds the optimal result by enumerating all feasible POI routes. To improve the efficiency, we propose another exact algorithm based on the property of the cost function. At last, we propose a greedy algorithm to make comparisons. Extensive experiments with two real datasets confirm the efficiency, accuracy, and scalability of our proposed algorithms."}, "journals/jasis/SuLCS18": {"title": "Location-aware targeted influence maximization in social networks.", "url": "https://doi.org/10.1002/asi.23931", "year": "2018", "author": {"Sen Su": "63/2499", "Xiao Li": "66/2069", "Xiang Cheng 0003": "29/1059-3", "Chenna Sun": "211/3264"}, "abstract": ""}, "journals/tkde/ChengSXXXZ18": {"title": "A Two-Phase Algorithm for Differentially Private Frequent Subgraph Mining.", "url": "https://doi.org/10.1109/TKDE.2018.2793862", "year": "2018", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shengzhi Xu": "161/7873", "Li Xiong 0001": "39/3530-1", "Ke Xiao": "69/3751", "Mingxing Zhao": "222/9443"}, "abstract": " Abstract:Mining frequent subgraphs from a collection of input graphs is an important task for exploratory data analysis on graph data. However, if the input graphs contain sensitive information, releasing discovered frequent subgraphs may pose considerable threats to individual privacy. In this paper, we study the problem of frequent subgraph mining (FSM) under the rigorous differential privacy model. We present a two-phase differentially private FSM algorithm, which is referred to as DFG. In DFG, frequent subgraphs are privately identified in the first phase, and the noisy support of each identified frequent subgraph is calculated in the second phase. In particular, to privately identity frequent subgraphs, we propose a frequent subgraph identification approach, which can improve the accuracy of discovered frequent subgraphs through candidate pruning. Moreover, to compute the noisy support of each identified frequent subgraph, we devise a lattice-based noisy support computation approach, which leverages the inclusion relations between the discovered frequent subgraphs to improve the accuracy of the noisy supports. Through formal privacy analysis, we prove that DFG satisfies ε-differential privacy. Extensive experimental results on real datasets show that DFG can privately find frequent subgraphs while achieving high data utility."}, "journals/tsc/SuTCXLC18": {"title": "Privacy-Preserving Top-k Spatial Keyword Queries in Untrusted Cloud Environments.", "url": "https://doi.org/10.1109/TSC.2015.2481900", "year": "2018", "author": {"Sen Su": "63/2499", "Yiping Teng": "160/9420", "Xiang Cheng 0003": "29/1059-3", "Ke Xiao": "69/3751", "Guoliang Li 0001": "l/GuoliangLi", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the rapid development of location-based services in mobile Internet, spatial keyword queries have been widely employed in various real-life applications in recent years. To realize the great flexibility and cost savings, more and more data owners are motivated to outsource their spatio-textual data services to the cloud. However, directly outsourcing such services to the untrusted cloud may arise serious privacy concerns. In this paper, we study the privacy-preserving top-\nkk\n spatial keyword query problem in untrusted cloud environments. Existing studies primarily focus on the design of privacy-preserving schemes for either spatial or keyword queries, and they cannot be applied to solve the privacy-preserving spatial keyword query problem. To address this problem, we present a novel privacy-preserving top-\nkk \n spatial keyword query scheme. In particular, we build an encrypted tree index to facilitate privacy-preserving top- \nkk\n spatial keyword queries, where spatial and textual data are encrypted in a unified way. To search with the encrypted tree index, we propose two effective techniques for the similarity computations between queries and tree nodes under encryption. To improve query performance on large-scale spatio-textual data, we further propose a keyword-based secure pruning method. Thorough analysis shows the validity and security of our scheme. Extensive experimental results on real datasets demonstrate our scheme achieves high efficiency and good scalability."}, "journals/es/LiCSS17": {"title": "Exploiting organizer influence and geographical preference for new event recommendation.", "url": "https://doi.org/10.1111/exsy.12190", "year": "2017", "author": {"Shuchen Li": "63/348", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Haonan Sun": "198/6151"}, "abstract": ""}, "journals/geoinformatica/ZhaoCSS17": {"title": "Popularity-aware collective keyword queries in road networks.", "url": "https://doi.org/10.1007/s10707-017-0299-9", "year": "2017", "author": {"Sen Zhao": "04/11534", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Kai Shuang": "68/189"}, "abstract": "This paper addresses a popularity-aware collective keyword (PAC-K) query in road networks. Given a road network with POIs (Points of Interest), which is modeled as a road network graph, where each node locating in a two-dimensional space represents a road intersection or a POI, and each edge with weight represents a road segment, the PACK query aims to find a group of popular POIs (i.e., a popular region) that cover the query’s keywords and satisfy the distance requirements from each node to the query node and between each pair of nodes, such that the sum of rating scores over these nodes for the query keywords is maximized. We show the problem of answering the PACK query is NP-Hard. To solve this problem, we present exact and heuristic solutions on small and large road networks, respectively. In particular, to improve query performance, we propose a rating score scaling technique to reduce the search space and a redundant computation reducing technique to reduce the excessive redundant computations in query processing. Extensive performance studies using two real datasets confirm the efficiency, accuracy, and scalability of the proposed solutions."}, "journals/ijon/LiCSLY17": {"title": "A hybrid collaborative filtering model for social influence prediction in event-based social networks.", "url": "https://doi.org/10.1016/j.neucom.2016.12.024", "year": "2017", "author": {"Xiao Li": "66/2069", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shuchen Li": "63/348", "Jianyu Yang": "23/6903"}, "abstract": "Event-based social networks (EBSNs) provide convenient online platforms for users to organize, attend and share social events. Understanding users’ social influences in social networks can benefit many applications, such as social recommendation and social marketing. In this paper, we focus on the problem of predicting users’ social influences on upcoming events in EBSNs. We formulate this prediction problem as the estimation of unobserved entries of the constructed user-event social influence matrix, where each entry represents the influence value of a user on an event. In particular, we define a user's social influence on a given event as the proportion of the user's friends who are influenced by him/her to attend the event. To solve this problem, we present a hybrid collaborative filtering model, namely, Matrix Factorization with Event-User Neighborhood (MF-EUN) model, by incorporating both event-based and user-based neighborhood methods into matrix factorization. Due to the fact that the constructed social influence matrix is very sparse and the overlap values in the matrix are few, it is challenging to find reliable similar neighbors using the widely adopted similarity measures (e.g., Pearson correlation and Cosine similarity). To address this challenge, we propose an additional information based neighborhood discovery (AID) method by considering both event-specific and user-specific features in EBSNs. The parameters of our MF-EUN model are determined by minimizing the associated regularized squared error function through stochastic gradient descent. We conduct a comprehensive performance evaluation on real-world datasets collected from DoubanEvent. Experimental results show that our proposed hybrid collaborative filtering model is superior than several alternatives, which provides excellent performance with RMSE and MAE reaching 0.248 and 0.1266 respectively in the 90% training data of 10 000 users dataset."}, "journals/ipl/SuZCBCW17": {"title": "Group-based collective keyword querying in road networks.", "url": "https://doi.org/10.1016/j.ipl.2016.10.008", "year": "2017", "author": {"Sen Su": "63/2499", "Sen Zhao": "04/11534", "Xiang Cheng 0003": "29/1059-3", "Rong Bi": "190/9002", "Xin Cao 0001": "77/2970-1", "Jie Wang 0002": "29/5259-2"}, "abstract": "This paper addresses a group-based collective keyword (GBCK) query problem in road networks. We model the road network as an undirected graph, where each node locating in a two-dimensional space represents a road intersection or a Points of Interest (POI), and each edge with weight represents a road segment. The GBCK query aims to find a region containing a set of POIs that covers all the query keywords and these POIs are close to the group of users and are close to each other. We show the problem of answering the GBCK query is NP-hard. To solve this problem, we develop a series of query processing algorithms. We first propose an efficient algorithm, which gives a 5-factor approximation to find a feasible region. The cost of this region is further used to limit the search space in the other algorithms. We then propose an exact algorithm, and an approximate algorithm with a 157-factor approximation. Extensive performance studies using real datasets confirm the efficiency and accuracy of the proposed algorithms."}, "journals/scn/Yan0SZ17": {"title": "Authenticated Location-Aware Publish/Subscribe Services in Untrusted Outsourced Environments.", "url": "https://doi.org/10.1155/2017/4215425", "year": "2017", "author": {"Han Yan": "63/49", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Siyao Zhang": "212/1274"}, "abstract": ""}, "journals/tkde/ChengZSC17": {"title": "A Multi-Objective Optimization Approach for Question Routing in Community Question Answering Services.", "url": "https://doi.org/10.1109/TKDE.2017.2696008", "year": "2017", "author": {"Xiang Cheng 0003": "29/1059-3", "Shuguang Zhu": "55/9089", "Sen Su": "63/2499", "Gang Chen": "67/6383"}, "abstract": " Abstract:Community Question Answering (CQA) has increasingly become an important service for people asking questions and providing answers online, which enables people to help each other by sharing knowledge. Recently, with accumulation of users and contents, much concern has arisen over the efficiency and answer quality of CQA services. To address this problem, question routing has been proposed which aims at routing new questions to suitable answerers, who have both high possibility and high ability to answer the questions. In this paper, we formulate question routing as a multi-objective ranking problem, and present a multi-objective learning-to-rank approach for question routing (MLQR), which can simultaneously optimize the answering possibility and answer quality of routed users. In MLQR, realizing that questions are relatively short and usually attached with tags, we first propose a tagword topic model (TTM) to derive topical representations of questions. Based on TTM, we then develop features for each question-user pair, which are captured at both platform level and thread level. In particular, the platform-level features summarize the information of a user from his/her history posts in the CQA platform, while the thread-level features model the pairwise competitions of a user with others in his/her answered threads. Finally, we extend a state-of-the-art learning-to-rank algorithm for training a multi-objective ranking model. Extensive experimental results on real-world datasets show that our MLQR can outperform state-of-the-art methods in terms of both answering possibility and answer quality."}, "journals/scn/YanCWSZ16": {"title": "Authentication of spatio-textual similarity join queries in untrusted cloud environments.", "url": "https://doi.org/10.1002/sec.1714", "year": "2016", "author": {"Han Yan": "63/49", "Xiang Cheng 0003": "29/1059-3", "Dezheng Wang": "198/7365", "Sen Su": "63/2499", "Qiying Zhang": "193/6719"}, "abstract": ""}, "journals/tkde/XuCSX016": {"title": "Differentially Private Frequent Sequence Mining.", "url": "https://doi.org/10.1109/TKDE.2016.2601106", "year": "2016", "author": {"Shengzhi Xu": "161/7873", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Ke Xiao": "69/3751", "Li Xiong 0001": "39/3530-1"}, "abstract": " Abstract:In this paper, we study the problem of mining frequent sequences under the rigorous differential privacy model. We explore the possibility of designing a differentially private frequent sequence mining (FSM) algorithm which can achieve both high data utility and a high degree of privacy. We found, in differentially private FSM, the amount of required noise is proportionate to the number of candidate sequences. If we could effectively prune those unpromising candidate sequences, the utility and privacy tradeoff can be significantly improved. To this end, by leveraging a sampling-based candidate pruning technique, we propose \nPFS\n 2^2\n, a novel differentially private FSM algorithm. It is the first algorithm that supports the general gap-constrained FSM in the context of differential privacy. The gap constraints in FSM can be used to limit the mining results to a controlled set of frequent sequences. In our \nPFS\n2^2 \n algorithm, the core is to utilize sample databases to prune the candidate sequences generated based on the downward closure property. In particular, we use the noisy local support of candidate sequences in the sample databases to estimate which candidate sequences are potentially frequent. To improve the accuracy of such private estimations, a gap-aware sequence shrinking method is proposed to enforce the length constraint on the sample databases. Moreover, to calibrate the amount of noise required by differential privacy, a gap-aware sensitivity computation method is proposed to obtain the sensitivity of the local support computations with different gap constraints. Furthermore, to decrease the probability of misestimating frequent sequences as infrequent, a threshold relaxation method is proposed to relax the user-specified threshold for the sample databases. Through formal privacy analysis, we show that our \nPFS \n2^2\n algorithm is \n ϵ\\epsilon\n-differentially private. Extensive experiments on real datasets illustrate that our \nPFS\n2^2\n algorithm ca..."}, "journals/cj/SuHLCXS15": {"title": "Enhanced Energy-Efficient Scheduling for Parallel Tasks Using Partial Optimal Slacking.", "url": "https://doi.org/10.1093/comjnl/bxu002", "year": "2015", "author": {"Sen Su": "63/2499", "Qingjia Huang": "36/10372", "Jian Li": "33/5448", "Xiang Cheng 0003": "29/1059-3", "Peng Xu": "84/586", "Kai Shuang": "68/189"}, "abstract": ""}, "journals/compsec/ChengSXL15": {"title": "DP-Apriori: A differentially private frequent itemset mining algorithm based on transaction splitting.", "url": "https://doi.org/10.1016/j.cose.2014.12.005", "year": "2015", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shengzhi Xu": "161/7873", "Zhengyi Li": "85/9245"}, "abstract": "In this paper, we study the problem of designing a differentially private FIM algorithm which can simultaneously provide a high level of data utility and a high level of data privacy. This task is very challenging due to the possibility of long transactions. A potential solution is to limit the cardinality of transactions by truncating long transactions. However, such approach might cause too much information loss and result in poor performance. To limit the cardinality of transactions while reducing the information loss, we argue that long transactions should be split rather than truncated. To this end, we propose a transaction splitting based differentially private FIM algorithm, which is referred to as DP-Apriori. In particular, a smart weighted splitting technique is proposed to divide long transactions into sub-transactions whose cardinality is no more than a specified number of items. In addition, to offset the information loss caused by transaction splitting, a support estimation technique is devised to estimate the actual support of itemsets in the original database. Through privacy analysis, we show that our DP-Apriori algorithm is ɛ-differentially private. Extensive experiments on real-world datasets illustrate that DP-Apriori substantially outperforms the state-of-the-art techniques."}, "journals/compsec/ChengSXTL15": {"title": "Differentially private maximal frequent sequence mining.", "url": "https://doi.org/10.1016/j.cose.2015.08.005", "year": "2015", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Shengzhi Xu": "161/7873", "Peng Tang": "93/509", "Zhengyi Li": "85/9245"}, "abstract": "In this paper, we study the problem of designing a differentially private algorithm for mining maximal frequent sequences, which can not only achieve high data utility and a high degree of privacy, but also provide high time efficiency. To solve this problem, we present a new differentially private algorithm, which is referred to as DP-MFSM. DP-MFSM consists of three phases: pre-processing phase, expected frequent sequence mining (ESM) phase, and candidate extraction and verification (CEV) phase. Specifically, in the pre-processing phase, we first extract some statistical information from the input database, and use the extracted information to determine the values of some variables which will be used in the ESM phase. Then, in the ESM phase, we randomly partition the input database into several sub-databases, and use a partition-based ESM technique to find expected frequent sequences, which are a subset of candidate frequent sequences and more likely to be frequent. At last, in the CEV phase, we extract candidate maximal frequent sequences from the discovered expected frequent sequences, and use a splitting-based technique to verify which candidates are actually frequent in the input database. Through privacy analysis, we show that our DP-MFSM algorithm is ε-differentially private. Extensive experiments on real-world datasets illustrate that our DP-MFSM algorithm can substantially outperform alternative approaches."}, "journals/jnca/ZhangSLCSX15": {"title": "Adaptive multi-objective artificial immune system based virtual network embedding.", "url": "https://doi.org/10.1016/j.jnca.2015.03.007", "year": "2015", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Yikai Lin": "159/3922", "Xiang Cheng 0003": "29/1059-3", "Kai Shuang": "68/189", "Peng Xu": "84/586"}, "abstract": "In network virtualization, there are two decoupled roles involved: (i) infrastructure providers who manage the substrate network, and (ii) service providers who request virtual networks to the infrastructure providers. Embedding virtual networks to a shared substrate network, which is termed as virtual network embedding problem, is widely believed as one of the most significant challenges in such context. For this problem, prior work primarily focuses on either (i) maximizing the revenues by accommodating more virtual network requests or (ii) minimizing the energy consumption by consolidating the virtual networks into minimum number of substrate nodes. In this paper, we aim at achieving these two goals simultaneously. We first formulate the virtual network embedding problem into a multi-objective integer linear programming. We then design an artificial immune system based algorithm to solve this programming. In this algorithm, (i) we design a discrete approach to encode the virtual node mapping solution as an antibody; (ii) to initialize the antibodies, we design two adaptive revenue and energy aware strategies for the node and link mapping, respectively, to strike a balance between revenue and energy costs; (iii) we design corresponding customized strategies in the cloning, crossover and mutation process of artificial immune system in virtual network embedding context; (iv) for the generated antibodies, we leverage the Pareto optimality for evaluating their quality. Through extensive simulations, we show that our algorithm outperforms the state-of-the-art algorithms in terms of the revenue and the energy consumption."}, "journals/pc/LiSCSMW15": {"title": "Cost-efficient coordinated scheduling for leasing cloud resources on hybrid workloads.", "url": "https://doi.org/10.1016/j.parco.2015.02.003", "year": "2015", "author": {"Jian Li": "33/5448", "Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3", "Meina Song": "95/4440", "Liyu Ma": "161/3443", "Jie Wang 0002": "29/5259-2"}, "abstract": "Cloud service providers, leasing resources from cloud vendors under the pay-per-use service model, would want to minimize rental costs while meeting users’ computing needs. They typically serve the following two types of workloads: interactive service requests and batch jobs. Early algorithms were devised to deal with either type of workloads, but not both. In the presence of a mixture of both types of workloads, we observe that these algorithms would often overproduce virtual-machine (VM) instances, resulting in much higher rental costs than necessary. In particular, we show that the VM instances generated by these algorithms for interactive services tend to incur significant resources unused. We present a coordinated scheduling algorithm to solve this problem. First, we use a priority function to handle interactive services, meet stringent service response time, and in the same time collect residual resources needed for batch jobs. Second, we use queueing analysis to adjust resource allocations based on predictions of resource requests for interactive services. Third, we schedule batch jobs according to the dynamics of residual capacity and spot instance pricing. Using traces from real-world interactive services and a library of batch jobs in practical applications, we demonstrate using numerical analysis that our coordinated scheduling is superior to the existing algorithms on cost efficiency designed for either type of workloads."}, "journals/scn/ChengSTX15": {"title": "Enabling secure and efficient kNN query processing over encrypted spatial data in the cloud.", "url": "https://doi.org/10.1002/sec.1245", "year": "2015", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Yiping Teng": "160/9420", "Ke Xiao": "69/3751"}, "abstract": ""}, "journals/tkde/SuXCLY15": {"title": "Differentially Private Frequent Itemset Mining via Transaction Splitting.", "url": "https://doi.org/10.1109/TKDE.2015.2399310", "year": "2015", "author": {"Sen Su": "63/2499", "Shengzhi Xu": "161/7873", "Xiang Cheng 0003": "29/1059-3", "Zhengyi Li": "85/9245", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Recently, there has been a growing interest in designing differentially private data mining algorithms. Frequent itemset mining (FIM) is one of the most fundamental problems in data mining. In this paper, we explore the possibility of designing a differentially private FIM algorithm which can not only achieve high data utility and a high degree of privacy, but also offer high time efficiency. To this end, we propose a differentially private FIM algorithm based on the FP-growth algorithm, which is referred to as PFP-growth. The PFP-growth algorithm consists of a preprocessing phase and a mining phase. In the preprocessing phase, to improve the utility and privacy tradeoff, a novel smart splitting method is proposed to transform the database. For a given database, the preprocessing phase needs to be performed only once. In the mining phase, to offset the information loss caused by transaction splitting, we devise a run-time estimation method to estimate the actual support of itemsets in the original database. In addition, by leveraging the downward closure property, we put forward a dynamic reduction method to dynamically reduce the amount of noise added to guarantee privacy during the mining process. Through formal privacy analysis, we show that our PFP-growth algorithm is ε-differentially private. Extensive experiments on real datasets illustrate that our PFP-growth algorithm substantially outperforms the state-of-the-art techniques."}, "journals/tkde/ChengSGY15": {"title": "Co-ClusterD: A Distributed Framework for Data Co-Clustering with Sequential Updates.", "url": "https://doi.org/10.1109/TKDE.2015.2451634", "year": "2015", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Lixin Gao 0001": "69/3480-1", "Jiangtao Yin": "82/5647"}, "abstract": " Abstract:Co-clustering has emerged to be a powerful data mining tool for two-dimensional co-occurrence and dyadic data. However, co-clustering algorithms often require significant computational resources and have been dismissed as impractical for large data sets. Existing studies have provided strong empirical evidence that expectation-maximization (EM) algorithms (e.g., k-means algorithm) with sequential updates can significantly reduce the computational cost without degrading the resulting solution. Motivated by this observation, we introduce sequential updates for alternate minimization co-clustering (AMCC) algorithms which are variants of EM algorithms, and also show that AMCC algorithms with sequential updates converge. We then propose two approaches to parallelize AMCC algorithms with sequential updates in a distributed environment. Both approaches are proved to maintain the convergence properties of AMCC algorithms. Based on these two approaches, we present a new distributed framework, Co-ClusterD, which supports efficient implementations of AMCC algorithms with sequential updates. We design and implement Co-ClusterD, and show its efficiency through two AMCC algorithms: fast nonnegative matrix tri-factorization (FNMTF) and information theoretic co-clustering (ITCC). We evaluate our framework on both a local cluster of machines and the Amazon EC2 cloud. Empirical results show that AMCC algorithms implemented in Co-ClusterD can achieve a much faster convergence and often obtain better results than their traditional concurrent counterparts."}, "journals/ton/SuZLCWZ14": {"title": "Energy-Aware Virtual Network Embedding.", "url": "https://doi.org/10.1109/TNET.2013.2286156", "year": "2014", "author": {"Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Alex X. Liu": "l/AlexXLiu", "Xiang Cheng 0003": "29/1059-3", "Yiwen Wang": "00/4918", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:Virtual network embedding, which means mapping virtual networks requested by users to a shared substrate network maintained by an Internet service provider, is a key function that network virtualization needs to provide. Prior work on virtual network embedding has primarily focused on maximizing the revenue of the Internet service provider and did not consider the energy cost in accommodating such requests. As energy cost is more than half of the operating cost of the substrate networks, while trying to accommodate more virtual network requests, minimizing energy cost is critical for infrastructure providers. In this paper, we make the first effort toward energy-aware virtual network embedding. We first propose an energy cost model and formulate the energy-aware virtual network embedding problem as an integer linear programming problem. We then propose two efficient energy-aware virtual network embedding algorithms: a heuristic-based algorithm and a particle-swarm-optimization-technique-based algorithm. We implemented our algorithms in C++ and performed side-by-side comparison with prior algorithms. The simulation results show that our algorithms significantly reduce the energy cost by up to 50% over the existing algorithm for accommodating the same sequence of virtual network requests."}, "journals/ijcomsys/ZhangCSWSL13": {"title": "A unified enhanced particle swarm optimization-based virtual network embedding algorithm.", "url": "https://doi.org/10.1002/dac.1399", "year": "2013", "author": {"Zhongbao Zhang": "95/9457", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Yiwen Wang": "00/4918", "Kai Shuang": "68/189", "Yan Luo": "25/2208"}, "abstract": ""}, "journals/cn/ChengSZSYLW12": {"title": "Virtual network embedding through topology awareness and optimization.", "url": "https://doi.org/10.1016/j.comnet.2012.01.022", "year": "2012", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Kai Shuang": "68/189", "Fangchun Yang": "06/5366", "Yan Luo": "25/2208", "Jie Wang 0002": "29/5259-2"}, "abstract": "Embedding a sequence of virtual networks (VNs) into a given physical network substrate to accommodate as many VN requests as possible is known to be NP-hard. This paper presents a new approach to studying this problem. In particular, we devise a topology-aware measure on node resources based on random walks and use it to rank a node’s resources and topological attributes. We then devise a greedy algorithm that matches nodes in the VN to nodes in the substrate network according to node ranks. In most situations there exist multiple embedding solutions, and so we want to find the best embedding that increases the possibility of accepting future VN requests and optimizes the revenue for the provider of the substrate network. We present an integer linear programming formulation for this optimization problem when path splitting is not allowed. We then devise a fast-convergent discrete Particle Swarm Optimization algorithm to approximate this problem. Extensive simulation results show that our algorithms produce near optimal solutions and significantly outperform existing algorithms in terms of the ratio of the long-term average revenue over the VN request acceptance."}, "journals/ccr/ChengSZWYLW11": {"title": "Virtual network embedding through topology-aware node ranking.", "url": "https://doi.org/10.1145/1971162.1971168", "year": "2011", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Hanchi Wang": "03/9458", "Fangchun Yang": "06/5366", "Yan Luo": "25/2208", "Jie Wang 0002": "29/5259-2"}, "abstract": "Virtualizing and sharing networked resources have become a growing trend that reshapes the computing and networking architectures. Embedding multiple virtual networks (VNs) on a shared substrate is a challenging problem on cloud computing platforms and large-scale sliceable network testbeds. In this paper we apply the Markov Random Walk (RW) model to rank a network node based on its resource and topological attributes. This novel topology-aware node ranking measure reflects the relative importance of the node. Using node ranking we devise two VN embedding algorithms. The first algorithm maps virtual nodes to substrate nodes according to their ranks, then embeds the virtual links between the mapped nodes by finding shortest paths with unsplittable paths and solving the multi-commodity flow problem with splittable paths. The second algorithm is a backtracking VN embedding algorithm based on breadth-first search, which embeds the virtual nodes and links during the same stage using node ranks. Extensive simulation experiments show that the topology-aware node rank is a better resource measure and the proposed RW-based algorithms increase the long-term average revenue and acceptance ratio compared to the existing embedding algorithms."}}}