{"id": "04/8431", "name": "Xiangyang Gong", "Article": {"conf/iwqos/CongZWNWGYLX22": {"title": "Break the Blackbox! Desensitize Intra-domain Information for Inter-domain Routing.", "url": "https://doi.org/10.1109/IWQoS54832.2022.9812918", "year": "2022", "author": {"Peizhuang Cong": "260/2955", "Yuchao Zhang": "42/7674", "Lei Wang": "181/2817", "Hao Ni": "25/9101", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Tong Yang": "44/7710", "Dan Li": "48/4185", "Ke Xu 0002": "181/2626-2"}, "abstract": " Abstract:Along with the ever-increasing amount of data generated from edge networks, cross domain (also known as Autonomous Systems, AS) transmission problem has attracted more and more attention. As mature and widely used inter-domain routing protocols, BGP-based solutions often use the number of domains (i.e. AS hops) of each path to make inter-domain routing decisions, which is simple and effective, but usually can not get the optimal routing results due to the lack of real state/information within ASes. These protocols choose the path with less AS hops as the forwarding path, even if the total latency or cost of the domains on this path is higher. While to solve this problem, directly access to intra-domain information as the assistance to make routing decisions is impractical due to data privacy.In this paper, we propose DIT, which makes near-optimal inter-domain routing decisions with desensitized intra-domain information. To do so, we design a homomorphic encrypted-based private number comparison scheme to export intra-domain information securely and thus assist in routing decisions. We conduct a series of experiments according to five real network topologies with nearly 900 simulated flows, and the results show that DIT reduces the number of forwarding hops by about 45% in average and reduces flow completion time by about 60%."}, "conf/icc/ZhangZGW21": {"title": "FreeVM: A Server Release Algorithm in DataCenter Network.", "url": "https://doi.org/10.1109/ICC42927.2021.9500959", "year": "2021", "author": {"Shiyan Zhang": "213/2777", "Yuchao Zhang": "42/7674", "Xiangyang Gong": "04/8431", "Ran Wang": "12/6277"}, "abstract": " Abstract:With the development of 5G access technology and the corresponding explosive growth of user requests, service providers have to activate more and more physical machines (PM) in cloud datacenters. This simple expansion of PMs results in not only low utilization of servers but also high maintenance cost. Existing researches that try to release unnecessary servers by migrating VMs always face a severe challenge-the large searching space for the optimal VM placement solution. In this paper, we prose a two-stage variable neighborhood searching (STVNS) algorithm, named FreeVM, which can significantly reduce the number of occupied servers. FreeVM works harmoniously with all kinds of VM placement schemes under various scenarios. We conducted an extensive series of experiments using real traces, and the results show that FreeVM can release at least 15% physical machines compared with existing solutions."}, "conf/icnp/ZhangG0T20": {"title": "High Speed Route Lookup for Variable-Length IP Address.", "url": "https://doi.org/10.1109/ICNP49622.2020.9259393", "year": "2020", "author": {"Wanli Zhang": "154/4701", "Xiangyang Gong": "04/8431", "Ye Tian 0008": "32/5495-8", "Jifan Tang": "272/6484"}, "abstract": " Abstract:Since the advent of the Internet, IP addresses have been the core of the Internet. However, with the rapid development of the Internet in recent years, IP addresses are facing more and more problems, such as address exhaustion, low packet efficiency and low flexibility. The reason is that IP addresses use a fixed-length design and lack extensibility. The New IP network architecture and addressing method were born to solve these problems. Based on this architecture, the addressing scheme adopts variable-length and structured addresses. The address space can be smoothly expanded according to the network scale without modifying the old network address configuration. But there are some challenges about New IP, and the greatest one lies in the route lookup of variable-length IP addresses. Content Addressable Memories (CAMs) are widely used in high speed routers to find matching routes for packets in a routing table. They enable the longest prefix matching on fixed-length addresses to be completed in a single clock cycle. However, they can not deal with New IP prefixes with variable lengths directly. In this paper, we propose a mechanism using Binary CAMs (BCAMs) and Ternary CAMs (TCAMs) to efficiently store New IP addresses and complete a route lookup in constant time. Moreover, we combine the hash scheme and CAMs matching scheme to shorten the extremely long New IP addresses and reduce TCAM storage space consumption. The simulation results show that our mechanism can provide high speed route lookup with low power consumption."}, "conf/infocom/TangZGLY0LZ20": {"title": "A Flexible Hierarchical Network Architecture with Variable-Length IP Address.", "url": "https://doi.org/10.1109/INFOCOMWKSHPS50562.2020.9162703", "year": "2020", "author": {"Jifan Tang": "272/6484", "Wanli Zhang": "154/4701", "Xiangyang Gong": "04/8431", "Guangpeng Li": "147/8463", "Delei Yu": "65/10879", "Ye Tian 0008": "32/5495-8", "Bowen Liu": "41/1201", "Lei Zhao": "87/734"}, "abstract": " Abstract:IP experiences dramatic development since its birth and has become the fundamental protocol of the Internet. However, IP faced more and more prominent problems in the past years, such as address exhaustion, low flexibility and low packet space efficiency. The root cause of these problems is that IP protocol is designed with fixed-length address and fixed-length delimited packet format, lacking of extensibility and flexibility. In order to solve these problems, we firstly propose a hierarchical network architecture where network is able to extend naturally without limitation. Then we adopt an addressing scheme based on the hierarchical network architecture. The address reflects the hierarchical levels of network and has no quantity limit. Benefiting from the hierarchical network architecture, flexible packet forwarding which improves the flexibility of address is described, and it helps improve packet space efficiency and interconnect heterogeneous networks as well. Implementation and experiments illustrate the feasibility and flexibility of our scheme compared to conventional IP protocol."}, "conf/seke/0008WGQWY20": {"title": "Personalized Video Recommendation Based on Latent Community.", "url": "https://doi.org/10.18293/SEKE2020-023", "year": "2020", "author": {"Han Yan": "63/49", "Ye Tian 0008": "32/5495-8", "Shunyao Wang": "213/6021", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": ""}, "conf/iscc/WangQGTWW19": {"title": "A Scheduling Algorithm for Low Jitter in Ethernet-Based Fronthaul.", "url": "https://doi.org/10.1109/ISCC47284.2019.8969674", "year": "2019", "author": {"Long Wang": "68/4459", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431", "Ye Tian 0008": "32/5495-8", "Tongtong Wang": "124/7108", "Xinyuan Wang": "81/3778"}, "abstract": " Abstract:Due to the low cost, high bandwidth and compatibility of Ethernet, Ethernet-based fronthaul has been utilized to carry sampled radio frequency (RF) signals from radio equipment (RE) to the radio equipment controller (REC). Meeting the stringent performance requirements regarding jitter for the Common Public Radio Interface (CPRI) over Ethernet is challenging. In this paper, a time division multiplexing (TDM) slot-based scheduling (TSS) algorithm is proposed to minimize the jitter; this algorithm consists of two main modules: slot greedy allocation and low-delay collaboration. Specifically, low-complexity slot greedy allocation aims to solve the NP-hard problem caused by the optimal slot allocation, and the low-delay collaboration among different switches is employed to avoid the large delays caused by a strict slot assignment. In the Ethernet-based fronthaul network, the simulation results demonstrate that, compared with the conventional benchmark algorithm, the TSS algorithm ensures lower jitter, and this significant decrease is achieved without incurring a large delay."}, "conf/iscid/GongYHZQ19": {"title": "An Optimization Model for Restructuring Distribution Network Considering Connecting Constraints of DGs.", "url": "https://doi.org/10.1109/ISCID.2019.00070", "year": "2019", "author": {"Xiangyang Gong": "04/8431", "Yinshu Yu": "266/7234", "Liang Huang": "03/5847", "Xiaojie Zhu": "148/4491", "Weiyan Qian": "250/6880"}, "abstract": " Abstract:This paper is to propose an optimization model for restructuring distribution network considering connecting constraints of DGs. First, problems of regional load improving and safe control of system contingency of distribution network connecting distributed generation were analyzed, and the basic concepts of returning current constraints and system contingency constraints of distributed generation were proposed. And then, two indexes of regional power total variable capacitance and 10kV feeder network structure qualification index were put forward. Subsequently, this paper proposed an optimization model for restructuring distribution network considering connecting constraints of DGs. Furthermore, an immune genetic algorithm (IGA) was proposed to solve this model. Finally, the effectiveness of the proposed method was verified by simulation analysis of a practical 10 kV distribution network in a certain area."}, "conf/ksem/0006WTGQ19": {"title": "Data and Knowledge: An Interdisciplinary Approach for Air Quality Forecast.", "url": "https://doi.org/10.1007/978-3-030-29551-6_70", "year": "2019", "author": {"Cheng Feng 0006": "76/3473-6", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": "\nAir pollution has become a critical problem in rapidly developing countries. Prior domain knowledge combined with data mining offers new ideas for air quality prediction. In this paper, we propose an interdisciplinary approach for air quality forecast based on data mining and air mass trajectory analysis. The prediction model is composed of a temporal predictor based on local factors, a spatial predictor based on geographical factors, an air mass predictor tracking air pollutants transport corridors and an aggregator for final prediction. Experimental results based on real world data show that the cross-domain data mining method can significantly improve the prediction accuracy compared with other baselines, especially in the period of severe pollution.KeywordsAir quality predictionMachine learningData and knowledgeInterdisciplinary approach"}, "conf/sigcomm/RenYLHTGM19": {"title": "Routing and Addressing with Length Variable IP Address.", "url": "https://doi.org/10.1145/3341558.3342204", "year": "2019", "author": {"Shoushou Ren": "129/0968", "Delei Yu": "65/10879", "Guangpeng Li": "147/8463", "Shihui Hu": "92/9985", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Robert G. Moskowitz": "209/1660"}, "abstract": "\n\t\tIP addressing has become the core of Internet since the Internet was invented and its significance has never changed. However, with the dramatic development of Internet in recent years, the conventional IP address is facing with more and more problems, such as address exhaustion, low packet efficiency in Internet of Things, etc. The reason is that the conventional IP address is designed with fixed length, lacking of extensibility, while the demands for address varies greatly in different cases. To solve these problems, we propose a new address system called Flexible Address System (FAS). The FAS is designed with an infinite address space and can provide variable-length addresses on demand. Accordingly, multiple Routing Information Bases (RIBs) are used on routers to store FAS routing entries according to their different length. Further, a new data structure called Multi-Entrance-Trie (METrie) is proposed as the realization of multiple RIBs. The METrie is designed with multiple entrance nodes, enabling fast lookup. Experiments show that the METrie can achieve a high efficiency lookup on routers with less storage costs, implying that the FAS is friendly to the scale of routing table.\n\t"}, "conf/wcnc/ZhangGWWWQT19": {"title": "Deterministic Transmittable Time-based Asynchronous Scheduler for Fronthaul Networks.", "url": "https://doi.org/10.1109/WCNC.2019.8885773", "year": "2019", "author": {"Shiyan Zhang": "213/2777", "Xiangyang Gong": "04/8431", "Puye Wang": "252/1300", "Long Wang": "68/4459", "Tongtong Wang": "124/7108", "Xirong Que": "27/8431", "Ye Tian 0008": "32/5495-8"}, "abstract": " Abstract:Time-sensitive Networking (TSN) has been extensively utilized to enable the transport of time-sensitive fronthaul flows in Ethernet-bridged networks. However, recently emerged ultra-low delay and jitter requirements of the TSN pose great challenges to Common Public Radio Interface (CPRI) over Ethernet. Considering this, we propose a Deterministic Transmittable Time-Based Asynchronous Scheduler (DTT-BAS) in this paper. The DTT- BAS uses the deterministic transmittable timestamp as the core scheduling mechanism, which numerically compares the timestamps to optimize the flow scheduling in the network. For the fronthaul scenario, simulation results validate that the DTT-BAS achieves a high probability of zero jitter and reduces the influence of clock skews with a delay performance close to IEEE 802.1CM frame preemption algorithm."}, "conf/wcnc/0006WTQG18": {"title": "Air quality estimation based on multi-source heterogeneous data from wireless sensor networks.", "url": "https://doi.org/10.1109/WCNC.2018.8377129", "year": "2018", "author": {"Cheng Feng 0006": "76/3473-6", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:It's a great challenge to offer a fine-grained and accurate air quality monitoring service in urban areas limited to the cost of the professional facilities. With the development of the wireless sensor networks (WSNs), it brings new opportunity to achieve this goal at low cost. However, WSNs are quite different on temporal and spatial distribution, some WSNs even have irregular real-time features, which makes it a hard problem to use the data collected from different WSNs to achieve the same goal. In this paper, we propose a framework for air quality estimation based on multi-source heterogeneous data collected from WSNs. We collect five kinds of data from different sources in real world, including the data with irregular real-time features. We divide the data sets into three sub classifiers to make the analysis and get the final results with an extreme learning machine (ELM) based multilayer perceptron model. The results show that our method outperforms other methods, and the precision of classification can be 90.8%."}, "conf/wcnc/GuoGWQ18": {"title": "Adaptive transmission of split-screen video over wireless networks.", "url": "https://doi.org/10.1109/WCNC.2018.8377085", "year": "2018", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the tremendous growth of video contents and mobility demands, there is a need to develop more personalized video services. Split-screen service, e.g., picture in picture, becomes more and more popular. However, the video transmission of split-screen service still faces several major challenges, one of which is how to assess the users' quality of experience (QoE) of the split-screen service. There may be multiple videos for different resolutions displayed on one screen. A consistent way is needed to assess the users' QoE of the split-screen service. The second challenge is how to choose bitrate of each video stream to maximize users' QoE of the split-screen service. Multiple video streams are transmitted to user over resource-constrained wireless networks. Therefore, it is a difficult issue to select an appropriate bitrate for every video streaming. To address these challenges, in this paper, we first present a dynamic adaptive video transmission scheme (DAVTS) based on MPEG Media Transport (MMT) protocol. Then we introduce a novel mathematical model for characterizing users' QoE to be affected by some factors in the proposed DAVTS. In the model, the objective method of QoE assessment of split-screen service is proposed. Based on the model a problem of maximum income in QoE of users is considered. We use a transmission bitrate selection (TBS) algorithm to solve the optimization problem. Simulation results demonstrate that DAVTS can enrich the video quality while reduce video jitters."}, "conf/ccnc/LiuWGQC17": {"title": "A fast and loop-free update mechanism in software defined networking.", "url": "https://doi.org/10.1109/CCNC.2017.7983197", "year": "2017", "author": {"Tao Liu 0013": "43/656-13", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:This paper studies how to extract and group essential nodes to guarantee loop freedom during the update of the network, while minimizing update time. We propose a model to establish the relationships of loops which may arise during the updating procedure. Given the model, we design a heuristic algorithm, with the recursive optimizing for the relationships, to extract essential nodes for the loop-free update, and shorten the updating time. The performance of our proposal has been examined and we verified that our algorithm would obviously reduce the update time."}, "conf/im/QiWGQ17": {"title": "An analytical model for combined SDN Forwarding Element.", "url": "https://doi.org/10.23919/INM.2017.7987332", "year": "2017", "author": {"Qinglei Qi": "160/4952", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:Recent studies have shown that the flow table size of hardware SDN switch cannot match the number of concurrent flows. Combined SDN Forwarding Element (CFE), which comprises software switch and hardware switch, becomes an alternative approach for tackling this problem. Because software switch has lower lookup speed than hardware switch, different proportions of traffic allocated to software switches in CFE have different effects on the delay bounds of all flows entering CFE. As delay-guarantee is a nontrivial task for network providers, especially with the increasing number of delay-sensitive applications, a model to analyze the delay bound given a flow allocation in CFE is important. With the one-to-one correspondence between flow allocation and rules placement solution, the analytical model can be used to evaluate and compare rules placement solutions and provide a basis for designing better rules placement solution in CFE. In this paper, we propose an analytical model for CFE based on network calculus, and then validate this model through simulations in NS-3."}, "conf/wowmom/FengWTQG17": {"title": "Estimate air quality based on mobile crowe sensing and big data.", "url": "https://doi.org/10.1109/WoWMoM.2017.7974308", "year": "2017", "author": {"Cheng Feng 0006": "76/3473-6", "Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:PM2.5 (particulate matter in the atmosphere with a diameter no more than 2.5 microns) in the air can cause great damage to human beings. It's a great challenge to offer a fine-grained and accurate PM2.5 monitoring service in urban areas as the required facilities are very expensive and huge. Since the PM2.5 has a significant scattering effect on visible light, the large-scale user-contributed image data collected by the mobile crowd sensing bring a new opportunity for understanding the urban PM2.5. After the analysis of image data, we find that several image features are very discriminative in PM2.5 inference. In this paper, we propose a fine-grained PM2.5 estimation method based on the random forest model without any PM2.5 measurement devices. We evaluate our approach with experiments based on five data sources: the meteorological data, the traffic data, the records from the monitoring sites, the POIs and the photos collected. The experimental results show that we have a high evaluation accuracy on PM2.5 estimation (precision: 0.875, recall: 0.872), which outperforms existing methods (Logistic, Naive Bayes, Random Tree, and BP ANN)."}, "conf/dsc/HuWGWQX16": {"title": "Social Recommendation with Tag Side Information.", "url": "https://doi.org/10.1109/DSC.2016.30", "year": "2016", "author": {"Xiang Hu": "81/6204", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Bai Wang 0001": "03/587-1", "Xirong Que": "27/8431", "Hongke Xia": "28/7805"}, "abstract": " Abstract:Social recommendation is the recommendation process by using social information. Being created to annotate and categorize items, tags are shared by users to find, organize and understand online entities, and provide the inherent flexibility to predict users' preference. In this paper, tag information and social relations are combined into recommendation, and a new tag information aided social recommendation method is proposed. By means of matrix factorization and regularization technology, we calculate the feature vectors and predict the rating of users. Also a new similarity measuring method is put forward when exploiting tag information through link prediction. Experiments show that our method generates better performance than state-of-the-art methods."}, "conf/hucc/ChenYZDG16": {"title": "Novel Hotspot Information Analysis System Using Automatic Information Extraction.", "url": "https://doi.org/10.1007/978-3-319-31854-7_5", "year": "2016", "author": {"Mo Chen": "31/2800", "Deyu Yuan": "159/4569", "Chen Zhang": "94/4084", "Gang Du": "45/9547", "Xiangyang Gong": "04/8431"}, "abstract": "There is large amount of information available on the Internet, which introduces difficulties in capturing and analyzing hotspot information. In this paper, we propose a novel hotspot information analysis system with automatic information extraction using the technologies of internet crawling, similarity elimination and abstract generation. System verification results show that, compared to the traditional solutions based on manual extraction and analysis, the proposed method are more capable of realizing the automated information extraction and analysis, thus improve the efficiency of hotspot analysis.KeywordsMassive information acquiringAutomatic information extractionHotspot analysis"}, "conf/acsc/DingZTGW15": {"title": "Dynamic Topic Detection Model by Fusing Sentiment Polarity.", "url": "http://crpit.scem.westernsydney.edu.au/abstracts/CRPITV159Ding.html", "year": "2015", "author": {"Xi Ding": "21/1986", "Lan-Shan Zhang": "138/8141", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": ""}, "conf/globecom/GuoGLZZWL15": {"title": "A Hybrid Transmission Approach for DASH over MBMS in LTE Network.", "url": "https://doi.org/10.1109/GLOCOM.2014.7417297", "year": "2015", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Shiju Zhang": "53/1010", "Mincheng Zhao": "150/5528", "Wendong Wang": "80/4406", "Zhiming Li": "69/2834"}, "abstract": " Abstract:Dynamic adaptive streaming over HTTP (DASH) has been a research hotspot, and the current studies focus on the DASH transmission optimization using unicast mode. However, DASH streaming also could be transmitted by multicast mode, which could effectively reduce transmission resource consumption especially when multiple DASH clients request the same video program in parallel. In this paper, we propose the Hybrid Transmission strategies for DASH (HTD) in LTE network, which is considered both unicast and multicast modes for DASH. The optimization problem is formulated as a Mixed Binary Integer Programming (MBIP) problem, and a two-level greedy algorithm is proposed, which could improve the quality of experience (QoE) of wireless DASH users, and save the wireless resources in LTE network. Simulation results demonstrate that our scheme achieves better performance than traditional single transmission mode in the literature."}, "conf/globecom/HuWGQMC15": {"title": "Maximizing Network Utilization in Hybrid Software-Defined Networks.", "url": "https://doi.org/10.1109/GLOCOM.2014.7417144", "year": "2015", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Yue Ma": "08/6794", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:By separating the control and forwarding planes, Software-Defined networking (SDN) enables the forwarding paths to be flexibly controlled by the logically centralized controllers using the global network view. To introduce SDN into existing networks, it is necessary to upgrade traditional devices to SDN- enabled ones. However, due to the business, economic and management limitations, it is difficult to realize full SDN deployment. As a result, how to migrate existing devices to SDN-compliant ones becomes the obvious dilemma for every network operator. In this paper, we address this question from the network performance perspective, and study how to leverage the capability of SDN to maximize traffic flow that can be achieved in hybrid SDNs. We formulate the maximum flow problem in networks with partial SDN deployment, and develop a fast Fully Polynomial Time Approximation Scheme (FPTAS) for solving it. Simulation results using real topologies show that hybrid SDNs outperform traditional networks, and we can obtain a near optimal network performance when 50% of SDN nodes are deployed."}, "conf/globecom/XiWNSTG15": {"title": "Energy-Efficient Collaborative Localization for Participatory Sensing System.", "url": "https://doi.org/10.1109/GLOCOM.2014.7416983", "year": "2015", "author": {"Teng Xi": "176/0053", "Wendong Wang": "80/4406", "Edith C. H. Ngai": "25/5713", "Zheng Song": "181/2470", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:Location based services are getting increasingly popular in participatory sensing systems. They make use of location information on the mobile devices to support applications that improve personal health, object search, and entertainment. However, GPS positioning consumes a lot of energy, which can drain a mobile device's battery. Although WiFi localization and cell tower localization have been suggested as alternatives, they have lower localization accuracy and limited coverage. In this paper, we suggest a novel solution for multiple mobile devices to perform collaborative localization to reduce energy consumption and provide accurate localization. We divide the mobile devices into two groups, the aggregator group and the collector group. The aggregator group turns on their GPS periodically, while the collector group uses the locations of the aggregators to estimate their own locations. We formulate the aggregator set selection problem and propose two novel algorithms to minimize the energy consumption in collaborative localization. Simulations with real traces showed that our proposed solution can save up to 88% of the energy of the entire network."}, "conf/icc/ZhangGHWQ15": {"title": "SDNMP: Enabling SDN management using traditional NMS.", "url": "https://doi.org/10.1109/ICCW.2015.7247205", "year": "2015", "author": {"Yongyue Zhang": "88/6942", "Xiangyang Gong": "04/8431", "Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Network management system (NMS) is important to ensure security and efficiency of network. Traditional NMS usually adopts SNMP as management protocol and has achieved great success. However, with emerging of various services, traditional network exposes shortcomings. Software-Defined Network (SDN) is a new paradigm which separates the control plane from the forwarding plane as opposed to the distributed control of current networks. This centralized architecture can simplify the complexity of network management. Although SDN has many advantages, it still lacks mature management tools and is difficult to realize full deployment, which makes network operators reluctant to completely replace their legacy NMS. As a result, it is necessary to combine traditional NMS with SDN. This paper presents the design of SDNMP, which is an approach for managing SDN using traditional NMS. To verify our approach, we build and implement a prototype in our own testbed. By deploying virtual networks and services, results show that SDNMP works well in practice."}, "conf/iwqos/XiNSTGW15": {"title": "Collaborative localization in participatory sensing with load balancing.", "url": "https://doi.org/10.1109/IWQoS.2015.7404706", "year": "2015", "author": {"Teng Xi": "176/0053", "Edith C. H. Ngai": "25/5713", "Zheng Song": "181/2470", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:The increasingly popular smartphones enable participatory sensing systems to collect location-based sensing data for different tasks. However, GPS positioning is very energy consuming, which could drain a mobile device's battery quickly. High energy consumption may threaten the participants and reduce the sustainability of the participatory sensing systems. In this paper, we propose a collaborative localization strategy with load balancing. Simulations with real traces showed that our proposed solution can save more than 80% of the energy consumption for localization in the entire network with load balancing."}, "conf/pcs/ZhaoGLGWQC15": {"title": "A cloud-assisted DASH-based Scalable Interactive Multiview Video Streaming framework.", "url": "https://doi.org/10.1109/PCS.2015.7170079", "year": "2015", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Jia Guo": "57/4142", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Interactive multiview video streaming (IMVS) allows viewers to periodically switch viewpoint. Its user experience can be further enhanced by creating virtual views from neighboring coded views using view synthesis techniques. Dynamic adaptive streaming over HTTP (DASH) is a new standard that can adjust the quality of video streaming according to the network condition. In this paper, we propose an improved DASH-based IMVS scheme over wireless networks. The main contributions are twofold. First, our scheme allows virtual views to be generated at either the cloud-based server or the client, and can adaptively select the optimal approach based on the network condition and the cost of the cloud. Second, scalable video coding is used in our system. Simulations with the NS3 tool demonstrate the advantage of our proposed scheme over the existing approach with client-based view synthesis and single-layer video coding."}, "conf/globecom/QiWGQ14": {"title": "A SDN-based network virtualization architecture with autonomie management.", "url": "https://doi.org/10.1109/GLOCOMW.2014.7063427", "year": "2014", "author": {"Qinglei Qi": "160/4952", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:The ossified architecture and widespread application of the internet have restricted its development For overcoming the existing obstacles of network innovation and management, network virtualization and autonomic management have been proposed. However, these two attractive technologies are subjected to the headaches of updating various devices. Software-Defined Networking (SDN) separates the control plane from the data plane. Therefore, some network control and management functions could be implemented through softwares. This provides a chance for the network virtualization and autonomic management In this paper, a SDN-based network Virtualization architecture with Autonomic management (SDNVA) is proposed. The SDNVA architecture enables heterogeneous virtual networks to coexist on the same physical network, and supports hierarchical autonomic management. Moreover, we evaluate SDNVA on our testbed and find that the SDNVA architecture can perceive topology changes and isolate multiple virtual networks."}, "conf/globecom/SunWHQG14": {"title": "SDN-based autonomic CCN traffic management.", "url": "https://doi.org/10.1109/GLOCOMW.2014.7063428", "year": "2014", "author": {"Qi Sun": "05/4187", "Wendong Wang": "80/4406", "Yannan Hu": "133/3740", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:Content-Centric Networking (CCN) is a novel architecture that has been proposed as a solution for dealing with various problems obsessing the Internet, such as the excessive bandwidth costs that result from peer-to-peer (P2P) traffic and content delivery networks (CDN). CCN names packets rather than end-hosts, and most of CCN's characteristics are the consequences of this fact. However, the current design of CCN has some limitations in traffic control, especially in flow fairness and node-to-node collaboration. To solve this problem, we propose an SDN-based autonomie system as the control plane to supplement CCN traffic management. Correspondingly, in the data plane, we utilize a multiprotocol switch to support CCN protocol, flow-aware content delivery and traffic control. We also discuss the implementation and extension issues, and finally, we demonstrate our hybrid scheme to perform centralized and intelligent traffic management, which provides higher awareness, fairness, and low congestion."}, "conf/globecom/HuWGLQC14": {"title": "Control traffic protection in software-defined networks.", "url": "https://doi.org/10.1109/GLOCOM.2014.7037082", "year": "2014", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Chi Harold Liu": "45/4723", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Software Defined Networking (SDN) is an emerging networking paradigm that assumes a logically centralized control plane separated from the data plane. Despite all its advantages, separating the control and data planes introduces new challenges regarding resilient communications between the two. That is, disconnections between switches and their controllers could result in substantial packet loss and performance degradation. To achieve resilient control traffic forwarding, this paper investigates the protection of control traffic in SDNs with multiple controllers. We propose a control traffic protection scheme that combines both local rerouting and constrained reverse forwarding protections. This scheme enables switches to locally react to failures and redirect the control traffic to controllers by using standby backup forwarding options. Our goal is then to find a set of primary routes for control traffic, called protection control network, where as much control traffic as possible can benefit from the proposed protection scheme. We formulate the protection control network problem and develop an algorithm to solve it. Simulation results on real topologies show that our approach significantly improves the resilience of control traffic."}, "conf/icc/ZhaoGLWQC14": {"title": "Scheduling and resource allocation for wireless dynamic adaptive streaming of scalable videos over HTTP.", "url": "https://doi.org/10.1109/ICC.2014.6883564", "year": "2014", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Recently dynamic adaptive streaming over HTTP (DASH) has gained significant attentions. In this paper, we study DASH-based transmission of scalable videos in wireless broadband access networks (e.g. LTE, WiMAX), and propose a DASH-friendly scheduling and resource allocation scheme (DFSRA) to enhance the Quality-of-Experience (QoE) of wireless DASH users. By integrating DASH-based media delivery and radio-level adaptation in a cross-layer manner, the scheme can determine the optimal wireless resource allocation. A gradient-based algorithm is proposed to solve the optimization problem, which has the following advantages over traditional algorithms: (1) The characteristics of video content and scalable video coding are utilized. (2) The client buffer status is considered to reduce video playback interruption and buffer overflow. Simulations with the Qualnet tool demonstrate that our scheme achieves better performance than existing methods in the literature."}, "conf/vtc/SongMDWGQ14": {"title": "Phone-Radar: Infrastructure-Free Device-to-Device Localization.", "url": "https://doi.org/10.1109/VTCSpring.2014.7023055", "year": "2014", "author": {"Zheng Song": "181/2470", "Jian Ma 0001": "26/4870-1", "Mingming Dong": "158/3407", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:In some practical scenarios such as tour guiding and children babysitting, one mobile device held by tour guides or parents need to know the distance and direction of another nearby mobile device held by tourist or children. However, to date, most existing pedestrian localization methods rely on a fixed external infrastructure, such as a global positioning system(GPS) or pre-deployed wifi access points to provide Localization service for mobile devices. Such methods are constrained either by limited GPS coverage or by complicated set-up procedures. We observe that, when two devices are moving, the change of their positions leads to the change of distance between them. Given the same movements, different relative locations between devices lead to different distance changes. Besides, the distance between and relative movement of devices can be measured by two phone-embedded sensors respectively. This motivates us to exploit the relative localization method by merely two mobile devices. In this work, we present Phone-Radar, which is an infrastructure-free device-to-device localization system. According to the propagation model of wireless signals, the change of distance between devices are modeled by the change of wireless signal strength between them. The movements of devices are recorded by the inertial sensors using step-counting method. We further study the relationship among the initial relative locations between the two devices, their relative movements and the change of received signal strength measurements. Moreover, we implement the proposed method and measure its performance under real world conditions. The testbed experiments show the efficiency of our proposed method."}, "conf/wcnc/SongNMGLW14": {"title": "Incentive mechanism for participatory sensing under budget constraints.", "url": "https://doi.org/10.1109/WCNC.2014.6953116", "year": "2014", "author": {"Zheng Song": "181/2470", "Edith C. H. Ngai": "25/5713", "Jian Ma 0001": "26/4870-1", "Xiangyang Gong": "04/8431", "Yazhi Liu": "70/10126", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Incentive strategy is important in participatory sensing, especially when the budget is limited, to decide how much and where the samples should be collected. Current auction-based incentive strategies purchase sensing data with lowest price requirements to maximize the amount of samples. However, such methods may lead to inaccurate sensing result after data interpolation, particularly for participants that are massing in certain subregions where the low-price sensing data are usually aggregated. In this paper, we introduce weighted entropy as a quantitative metric to evaluate the distribution of samples and find that the distribution of data samples is another important factor to the accuracy of sensing result. We further propose a greedy-based incentive strategy which considers both the amount and distribution of samples in data collection. Simulations with real datasets confirmed the impact of samples distribution to data accuracy and demonstrated the efficacy of our proposed incentive strategy."}, "conf/apcc/LuWGQ013": {"title": "Empirical analysis of different hierarchical addressing deployments.", "url": "https://doi.org/10.1109/APCC.2013.6765943", "year": "2013", "author": {"Xuan Lu": "51/3865", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Bai Wang 0001": "03/587-1"}, "abstract": " Abstract:Currently the increasing prevalence of multi-homing and traffic engineering leads to an explosive growth of the global routing table. It is well known that hierarchical addressing could improve the routing scalability. Hence, some proposals exploring the routing architecture for future Internet reuse the hierarchical addressing for the locator assignment. However, this may result in some ASes assigned too many prefixes which would consequently make hosts, routers, Internet Service Providers and Domain Name System faced with big challenges. By modeling the Internet AS-level topology using a hierarchical graph, we define the processes of prefix assignment and routing advertisement in different hierarchical addressing deployment ways. Then, we quantify the impact of these deployments on the prefix assignment and the routing scalability based on the real routing data. we find that when the deploying position gets lower, the prefix amount of arbitrary AS is getting smaller, while the size of the global Forwarding Information Base is monotonically increasing. Comparing with the actual Internet's data, suitable deployment ways for hierarchical addressing are obtained. With these deployment ways, the excessive prefix problem is solved and the size of the global Forwarding Information Base could be reduced into 56% or even 32% of the one in current Internet."}, "conf/dasc/LinGWWZ13": {"title": "Tunnel Congestion Exposure and Feedback.", "url": "https://doi.org/10.1109/DASC.2013.123", "year": "2013", "author": {"Yi Lin": "42/5120", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xinpeng Wei": "147/7735", "Lei Zhu": "99/549"}, "abstract": " Abstract:Tunneling technology has been widely applied in the network, but the lack of effective congestion exposure in the tunnel, seriously affect the performance of the tunnel technology. This document will focus on the tunnel scenario, to design a tunnel congestion exposure and feedback model, and the tunnel congestion marking scheme and congestion information feedback scheme. First, the document describes Tunneling Protocol, Secondly describes the congestion problems in the tunnel, Thirdly proposes a basic tunnel congestion exposure model, Finally, proposes the detail of tunnel congestion marking and feedback scheme for the model. Modifying the ECN tunnel rules of RFC3168 and RFC6040, congestion marking scheme can be applied to the feedback model. Congestion feedback scheme use GRE (Generic Routing Encapsulation) header format extension to carry the feedback information. Content and format of Congestion feedback, and the transmission of feedback information are also discussed in the document."}, "conf/globecom/LiQHGW13": {"title": "An autonomic management architecture for SDN-based multi-service network.", "url": "https://doi.org/10.1109/GLOCOMW.2013.6825092", "year": "2013", "author": {"Hongyun Li": "146/6873", "Xirong Que": "27/8431", "Yannan Hu": "133/3740", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Software-Defined Networking (SDN) is a new paradigm, which emerged in the innovation for future networks and has been successfully applied in many scenarios including Campus/Enterprise network and Data Center network. By extending the concept of SDN and autonomicity to the design of versatile network infrastructures, especially to the design of a carrier grade network, we propose AMA, which is an autonomic management architecture for SDN-based multi-services network. AMA is designed and implemented by utilizing autonomic management and network virtualization technologies. We believe that AMA can support more application types, and can be used to build a more flexible network."}, "conf/globecom/ZhouGHQW13": {"title": "PindSwitch: A SDN-based protocol-independent autonomic flow processing platform.", "url": "https://doi.org/10.1109/GLOCOMW.2013.6825094", "year": "2013", "author": {"Tong Zhou": "30/97", "Xiangyang Gong": "04/8431", "Yannan Hu": "133/3740", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Software Defined Networking (SDN) has already gained enormous momentum in the industry. Its innovative architecture that separates the control and forwarding planes allows third-party software developers more leeway in controlling network behavior. Since new protocols and forwarding schemes are needed to produce better network performance, efforts have been put forth in redefining user-defined protocol support. Besides, the concept of autonomicity has been proposed recently to solve the dilemma of management in complex network environments. In this paper, we propose the design and implementation of PindSwitch, which provides a SDN-based Protocol-independent platform to allow users to outline their own protocols' format and flow processing rules into physical switches. We also introduce autonomicity and self-* attributes into SDN by extending the architecture of GANA to achieve better management of user-defined protocols and their processing schemes."}, "conf/im/HuWGQC13": {"title": "Reliability-aware controller placement for Software-Defined Networks.", "url": "https://ieeexplore.ieee.org/document/6573050/", "year": "2013", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:The Software-Defined Network (SDN) approach decouples control and forwarding planes. Such separation introduces reliability design issues of the SDN control network, since disconnection between the control and forwarding planes may lead to severe packet loss and performance degradation. This paper addresses the problem of placing controllers in SDNs, so as to maximize the reliability of control networks. After presenting a metric to characterize the reliability of SDN control networks, several placement algorithms are developed. We evaluate these algorithms and further quantify the impact of controller number on the reliability of control networks using real topologies. Our approach can significantly improve the reliability of SDN control networks without introducing unacceptable latencies."}, "conf/pcs/ZhangLG13": {"title": "Distortion estimation for two-step view synthesis.", "url": "https://doi.org/10.1109/PCS.2013.6737691", "year": "2013", "author": {"Dong Zhang": "68/3245", "Jie Liang 0001": "51/239-1", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:In depth-image-based-rendering (DIBR), the quality of the synthesized virtual view depends on that of the depth maps in the reference views. In this paper, we develop a framework to estimate the distortion of the synthesized view when a simplified two-step warping algorithm is used and when there are random errors in the reference depth maps. A graph-based method is developed to obtain the depth and texture distributions in the synthesized view. Experimental results demonstrate the accuracy of the estimated distortion."}, "conf/vnc/SongLMGW13": {"title": "Short paper: Multi-task-oriented dynamic participant selection for collaborative vehicle sensing.", "url": "https://doi.org/10.1109/VNC.2013.6737616", "year": "2013", "author": {"Zheng Song": "181/2470", "Yazhi Liu": "70/10126", "Ran Ma": "56/7649", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:Vehicles can provide various sensing abilities and unlimited communication capabilities and are taken as an important platform for collecting sensory data for multiple on-going urban sensing tasks. However, new challenge arises for selecting vehicles with different incentive requirements, various sensing abilities and uncontrollable mobilities to best satisfy heteroid sensory data requirements of multiple concurrent applications under budget constraints, but with sparsely research exposure. This paper proposes a multi-task-oriented participant selection strategy to tackle the above mentioned challenge. The difference between data requirements of multiple tasks and data collection expectation of a set of vehicles are converted to a multi-aim optimization problem, and a greedy-algorithm-based participant selection strategy is designed to solve it. Real dataset based simulation show that under the same incentive costs condition, the proposed participant selection strategy can obtain more comprehensive sensory data than selecting vehicles randomly."}, "conf/ccis/ZhaoGWQ12": {"title": "A rate adaptive algorithm for HTTP streaming.", "url": "https://doi.org/10.1109/CCIS.2012.6664230", "year": "2012", "author": {"Yanan Zhao": "00/4709", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Recently, the traffic volume of HTTP streaming application is rapidly growing on the Internet. As an adaptive streaming technology, the most challenge of HTTP streaming technology is when and how to switch bitrates so that the user can get satisfactory experience. In this paper, we propose a novel Bitrates Adaptive HTTP Streaming (BAHS) algorithm. This algorithm uses application layer information, not needs to require information from transport layer, detecting network congestion and client buffer state to determine next media quality level. Simulation results show that the flexible BAHS algorithm can effectively combine real-time network state with client player buffer as well as control the frequency and total time of buffer overflow and underflow, prompting user experience."}, "conf/ccis/LiuWGQY12": {"title": "A hybrid model based on Kalman Filter and neutral network for traffic prediction.", "url": "https://doi.org/10.1109/CCIS.2012.6664231", "year": "2012", "author": {"Jianying Liu": "167/5781", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Hao Yang": "54/4089"}, "abstract": ""}, "conf/ccis/HuWGQC12": {"title": "BalanceFlow: Controller load balancing for OpenFlow networks.", "url": "https://doi.org/10.1109/CCIS.2012.6664282", "year": "2012", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:In the discussion about Future Internet, Software-Defined Networking (SDN), enabled by OpenFlow, is currently seen as one of the most promising paradigm. While the availability and scalability concerns rises as a single controller could be alleviated by using replicate or distributed controllers, there lacks a flexible mechanism to allow controller load balancing. This paper proposes BalanceFlow, a controller load balancing architecture for OpenFlow networks. By utilizing CONTROLLER X action extension for OpenFlow switches and cross-controller communication, one of the controllers, called super controller, can flexibly tune the flow-requests handled by each controller, without introducing unacceptable propagation latencies. Experiments based on real topology show that BalanceFlow can adjust the load of each controller dynamically."}, "conf/ccis/ChenGWQ12": {"title": "VNMC for network virtualization in OpenFlow network.", "url": "https://doi.org/10.1109/CCIS.2012.6664285", "year": "2012", "author": {"Yang Chen": "48/4792", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Network virtualization provides an efficient way to share physical network infrastructure so that multiple virtual slices can run concurrently. OpenFlow is a promising and successful future networking technology which enables network innovation efficiently. However, the existing network virtualization methods in OpenFlow network usually have limitations such as introducing a proxy, flow entry conflicts, lacking of extensibility. In this paper, we present VNMC, a Virtual Network Management Component for rapidly creating, configuring and managing virtual networks in OpenFlow network. It has the following features: VNMC is implemented in a single controller without a middle layer. VNMC provides bandwidth guarantee, topology isolation, flow isolation and control isolation. It resolves flow entry conflicts from different controllers using the multiple flow tables mechanism defined in the latest OpenFlow standard. It manages the virtual networks in a modular way, which brings great extensibility to add new functionalities to virtual networks."}, "conf/fskd/JiaLWGQ12": {"title": "A novel host mobility support method in IPv4/IPv6 network of RANGI architecture.", "url": "https://doi.org/10.1109/FSKD.2012.6233918", "year": "2012", "author": {"Yichen Jia": "116/8410", "Xuan Lu": "51/3865", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the growing demand of the host mobility, the problems of overloading of IP address semantics are becoming increasingly serious. People have figured out various ID/Locator split technologies to support host mobility. In fact, current network environment is still in mixed IPv4/IPv6 transition phase, but the existing technology for host mobility in this transition phase is not considered comprehensively. In this paper, we propose a novel method to support host mobility between IPv4 and IPv6 network, and give a detailed explanation through a new ID/Locator split architecture which called RANGI (Routing Architecture for the Next Generation Internet). There are two contributions in this method: First, it supports the host mobility in transition phase; second, it is like the host mobility means in IPv6, so it provides a good capacity of smooth transition from IPv4 to IPv6."}, "conf/fskd/MaDGWY12": {"title": "Optimal public transit path searching algorithm based on traffic condition.", "url": "https://doi.org/10.1109/FSKD.2012.6233939", "year": "2012", "author": {"Xia Ma": "37/7093", "Yu Ding": "77/6871", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Hao Yang": "54/4089"}, "abstract": " Abstract:Public transit path algorithm is the core of a public transportation query system. Providing travel plans with time information close to the actual situation will bring great convenience to passengers. An optimal public transit path algorithm is presented in this paper. It considers the impact of traffic situation on the bus, and factors such as transfer times, travel time, walking distance, and the priority of transfer stops. The algorithm is implemented and compared with existing public transportation query tools."}, "conf/globecom/WangYQG12": {"title": "Autonomicity design in OpenFlow based Software Defined Networking.", "url": "https://doi.org/10.1109/GLOCOMW.2012.6477681", "year": "2012", "author": {"Wendong Wang": "80/4406", "H. U. Yannan": "127/6295", "Xirong Que": "27/8431", "Xiangyang Gong": "04/8431"}, "abstract": " Abstract:Software Defined Networking (SDN) is a new area in network management. It is understood as using software to improve the network capabilities and intelligence. Autonomicity is one of proposed technologies, which also can improve network management capabilities. A scheme of the combination of OpenFlow based SDN and Autonomicity is proposed in this paper to introduce self-* attributes into OpenFlow Based SDN so that the network could be better controlled and operated efficiently."}, "conf/globecom/WangGQ11": {"title": "Context-aware autonomic QoS model for future Internet.", "url": "https://doi.org/10.1109/GLOCOMW.2011.6162534", "year": "2011", "author": {"Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the rapid expansion of Internet applications and network infrastructure, Internet is facing many technical challenges. Autonomicity is proposed as one of candidate technologies to solve the Internet management problems. In this paper, a context-aware autonomic QoS model is proposed to improve the Internet manageability. Some key design principles based on the EFIPSANS GANA reference model are introduced. The framework and function blocks of context-aware autonomic QoS model are described in detail. This design has been approved by the implementation of the self-* functionalities testbed."}, "conf/icns/YuanmingWXX08": {"title": "Initiator-Domain-Based SLA Negotiation for Inter-domain QoS-Service Provisioning.", "url": "https://doi.org/10.1109/ICNS.2008.43", "year": "2008", "author": {"Yuanming Cao": "13/8431", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": " Abstract:The problem of providing quality of service (QoS) applications across multi-domain through service level agreement (SLA) negotiation is addressed in this paper. Nowadays, the IP network which can only provide best effort services can not fulfil customers' QoS requirements, and SLA contract signed between service provider and service consumer is proposed to support QoS-based service offering. Service Provider (SP) separated from Network Provider (NP) acts as an independent entity in service provisioning, and needs to negotiate SLA with NP to attain network resource, which enables SP to provide QoS guaranteed services for customers. But in the current Internet, network domains are owned by different network operators and SP and customers may locate in different domains, which makes the SLA negotiation more complicated in QoS-Service provisioning. The initiator-domain-based SLA negotiation system is proposed to meet the negotiation problem."}, "conf/icc/WangLGC01": {"title": "SWFQ: a simple weighted fair queueing scheduling algorithm for high-speed packet switched network.", "url": "https://doi.org/10.1109/ICC.2001.936551", "year": "2001", "author": {"Chonggang Wang": "84/2428", "Keping Long": "53/6133", "Xiangyang Gong": "04/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:In this paper, we present an effective scheduling algorithm based on the RPS model, called simple weighted fair queueing (SWFQ). In SWFQ, computation of the system potential function does not require such division or multiplication operations as in MD-SCFQ. Compared with MD-SCFQ, SWFQ has lower complexity and can be easily implemented in chips. We verify the effectivity of proposed SWFQ through strict theoretical analysis."}, "conf/icon/WangLGC00": {"title": "Effective fairness queuing algorithms.", "url": "https://doi.org/10.1109/ICON.2000.875804", "year": "2000", "author": {"Chonggang Wang": "84/2428", "Keping Long": "53/6133", "Xiangyang Gong": "04/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:In this paper we present two effective fair queuing algorithms (EFQs), which achieves fairness properties and delay properties similar to WFQ (which is currently the better scheduling algorithm among others), and uses a system potential function of O(l) complexity. In EFQs, computation of system potential function does not require any division or multiplication operations such as in minimum delay-self clocked fair queuing (MD-SCFQ). Compared to MD-SCFQ, EFQs have lower complexity and can be easily implemented on chips. We verify the effectiveness of the proposed EFQs through theoretical analysis and give some simulation results."}, "journals/cbm/DongWGZYG22": {"title": "CRAUNet: A cascaded residual attention U-Net for retinal vessel segmentation.", "url": "https://doi.org/10.1016/j.compbiomed.2022.105651", "year": "2022", "author": {"Fangfang Dong": "29/7406", "Dengyang Wu": "325/7239", "Chenying Guo": "325/7284", "Shuting Zhang": "57/6197", "Bailin Yang": "40/6427", "Xiangyang Gong": "04/8431"}, "abstract": "Retinal vessels play an important role in judging many eye-related diseases, so accurate segmentation of retinal vessels has become the key to auxiliary diagnosis. In this paper, we present a Cascaded Residual Attention U-Net (CRAUNet) that can be regarded as a set of U-Nets, that allows coarse-to-fine representations. In the CRAUNet, we introduce a DropBlock regularization similar to the frequently-used dropout, which greatly reduces the overfitting problem. In addition, we propose a multi-scale fusion channel attention (MFCA) module to explore helpful information, and then merge this information instead of using a direct skip-connection. Finally, to prove the effectiveness of our method, we conduct extensive experiments on DRIVE and CHASE_DB1 datasets. The proposed CRAUNet achieves area under the receiver operating characteristic curve (AUC) of 0.9830 and 0.9865, respectively, for the two datasets. Compared to other state-of-the-art methods, the experimental results demonstrate that the performance of the proposed method is superior to that of others."}, "journals/corr/abs-2203-12672": {"title": "Deep Learning based Data Prefetching in CPU-GPU Unified Virtual Memory.", "url": "https://doi.org/10.48550/arXiv.2203.12672", "year": "2022", "author": {"Xinjian Long": "206/3728", "Xiangyang Gong": "04/8431", "Huiyang Zhou": "91/3111"}, "abstract": "\n      Abstract:  Unified Virtual Memory (UVM) relieves the developers from the onus of\nmaintaining complex data structures and explicit data migration by enabling\non-demand data movement between CPU memory and GPU memory. However, on-demand\npaging soon becomes a performance bottleneck of UVM due to the high latency\ncaused by page table walks and data migration over interconnect. Prefetching is\nconsidered a promising solution to this problem given its ability to leverage\nthe locality of program memory access patterns. However, existing\nlocality-based prefetching schemes can not handle all the situations. %Data\nstructures like arrays tend to be stored in contiguous blocks, and accessed\nrepeatedly. An ideal prefetcher should not only look at narrow regions of the\nrequested address space but also capture global context to deliver a good\nprediction of the memory access pattern.\nThis paper proposes a novel approach for page prefetching for UVM through\ndeep learning. We first show that a powerful Transformer learning model can\nprovide high accuracy for UVM page prefetching. We then perform analysis to\ninterpret this Transformer model and derive several insights that allow us to\ndesign a simpler model to match the unconstrained model's accuracy with orders\nof magnitude lower cost. We evaluate this simplified model on a set of 11\nmemory-intensive benchmarks from popular benchmark suites. Our solution\noutperforms the state-of-the-art UVM framework, improving the performance by\n10.89%, improving the device memory page hit rate by 16.98% (89.02% vs. 76.10%\nfor prior art), and reducing the CPU-GPU interconnect traffic by 11.05%.\nAccording to our proposed unified metric, which combines the accuracy,\ncoverage, and page hit rate, our solution is approaching the ideal prefetching\nscheme more than the state-of-the-art design (0.90 vs. 0.85, with the perfect\nprefetcher of 1.0).\n\n    "}, "journals/corr/abs-2204-02974": {"title": "An Intelligent Framework for Oversubscription Management in CPU-GPU Unified Memory.", "url": "https://doi.org/10.48550/arXiv.2204.02974", "year": "2022", "author": {"Xinjian Long": "206/3728", "Xiangyang Gong": "04/8431", "Huiyang Zhou": "91/3111"}, "abstract": "\n      Abstract:  This paper proposes a novel intelligent framework for oversubscription\nmanagement in CPU-GPU UVM. We analyze the current rule-based methods of GPU\nmemory oversubscription with unified memory, and the current learning-based\nmethods for other computer architectural components. We then identify the\nperformance gap between the existing rule-based methods and the theoretical\nupper bound. We also identify the advantages of applying machine intelligence\nand the limitations of the existing learning-based methods. This paper proposes\na novel intelligent framework for oversubscription management in CPU-GPU UVM.\nIt consists of an access pattern classifier followed by a pattern-specific\nTransformer-based model using a novel loss function aiming for reducing page\nthrashing. A policy engine is designed to leverage the model's result to\nperform accurate page prefetching and pre-eviction. We evaluate our intelligent\nframework on a set of 11 memory-intensive benchmarks from popular benchmark\nsuites. Our solution outperforms the state-of-the-art (SOTA) methods for\noversubscription management, reducing the number of pages thrashed by 64.4\\%\nunder 125\\% memory oversubscription compared to the baseline, while the SOTA\nmethod reduces the number of pages thrashed by 17.3\\%. Our solution achieves an\naverage IPC improvement of 1.52X under 125\\% memory oversubscription, and our\nsolution achieves an average IPC improvement of 3.66X under 150\\% memory\noversubscription. Our solution outperforms the existing learning-based methods\nfor page address prediction, improving top-1 accuracy by 6.45\\% (up to 41.2\\%)\non average for a single GPGPU workload, improving top-1 accuracy by 10.2\\% (up\nto 30.2\\%) on average for multiple concurrent GPGPU workloads.\n\n    "}, "journals/bmcmi/WenSLHG21": {"title": "Developing a model for estimating infarction onset time based on computed tomography radiomics in patients with acute middle cerebral artery occlusion.", "url": "https://doi.org/10.1186/s12880-021-00678-1", "year": "2021", "author": {"Xuehua Wen": "304/2650", "Zhenyu Shu": "22/298", "Yumei Li": "21/6248", "Xingfei Hu": "301/3094", "Xiangyang Gong": "04/8431"}, "abstract": ""}, "journals/rfc/rfc8991": {"title": "GeneRic Autonomic Signaling Protocol Application Program Interface (GRASP API).", "url": "https://doi.org/10.17487/RFC8991", "year": "2021", "author": {"Brian E. Carpenter": "c/BrianECarpenter", "Bing Liu 0006": "87/6277", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431"}, "abstract": ""}, "journals/access/LongGLQW20": {"title": "Toward OS-Level and Device-Level Cooperative Scheduling for Multitasking GPUs.", "url": "https://doi.org/10.1109/ACCESS.2020.2983731", "year": "2020", "author": {"Xinjian Long": "206/3728", "Xiangyang Gong": "04/8431", "Yaguang Liu": "60/8700", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:As one of the most popular accelerators, the graphics processing unit (GPU) has been extensively adopted throughout the world. With the burst of new applications and the growing scale of data, co-running applications on limited GPU resources has become increasingly important due to its dramatic improvement in overall system efficiency. Quality of service (QoS) support among concurrent general-purpose GPU (GPGPU) applications is currently one of the most trending research topics. Prior efforts have been focused on providing QoS support either with OS-level or device-level scheduling methods. Each of these scheduling methods possesses pros and cons and may be unable to independently cover all the scheduling cases. In this paper, we propose a cooperative QoS scheduling scheme (C-QoS) that consists of operating-system-level (OS-level) scheduling and device-level scheduling. Our proposed scheme can control the progress of a kernel and provide thorough QoS support for concurrent applications in multitasking GPUs. Due to the accurate resource management of the copy engine and execution engine, C-QoS achieves QoS goals 23.33% more often than state-of-the-art QoS support mechanisms. The results demonstrate that cooperative methods achieve 17.27% higher system utilization than uncooperative methods."}, "journals/tcsv/GuoGLWQ20": {"title": "EAAT: Environment-Aware Adaptive Transmission for Split-Screen Video Streaming.", "url": "https://doi.org/10.1109/TCSVT.2019.2955136", "year": "2020", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:With the tremendous growth of video contents and mobility demands, there is a need to develop more personalized video services. Split-screen services, such as picture in picture become more and more popular. Furthermore, the user's viewing environment affects the user's quality of experience (QoE). Therefore, video transmission of split-screen services face several major challenges, such as to quantify the impact of environmental factors on user's QoE; how to assess the user's QoE of the split-screen services; how to choose the bit-rate of each video stream to maximize user's QoE of the split-screen services. To address these challenges, in the paper, an environment-aware adaptive transmission (EAAT) scheme for split-screen video streaming is first presented. Then, we introduce a mathematical model for characterizing user's QoE to be affected by environmental factors in the proposed EAAT. In the model, the QoE of user's relationship with the viewing environment is proposed. Based on the model, a problem of maximizing user's QoE is formulated, and we develop a heuristic algorithm to solve the optimization problem. In addition, we conduct various trace-bandwidth experiments to rigorously evaluate the proposed EAAT scheme in different network environments, and show that EAAT can enrich the video quality while saving network resources."}, "journals/access/ZhangXGW19": {"title": "Mutual Information Maximization-Based Collaborative Data Collection With Calibration Constraint.", "url": "https://doi.org/10.1109/ACCESS.2019.2895375", "year": "2019", "author": {"Bo Zhang 0032": "36/2259-32", "Teng Xi": "176/0053", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406"}, "abstract": " Abstract:People pay greater attention to air quality which is closely related to their health, especially in developing countries. Air quality is a part of the Chinese weather forecast, and the government has developed air quality monitoring systems and built high-quality monitoring stations (HQMS). With the data from HQMS, many companies and research institutes demonstrate an accurate air pollution map on the Internet, which is valuable for many issues related to air quality, including exposure modeling and urban planning. Due to the high equipment and operating costs, the distribution of HQMS is too uneven and sparse to achieve a high-resolution air pollution map. Thus, people try to deploy a large number of high precision sensors in and around the city for detecting air pollution. However, these sensors require frequent calibrations with the HQMS to maintain data accuracy. On the other side, to reduce the cost of sensor deployment, people begin to use mobile sensors instead of fixed sensors, which make sensor route planning a very important issue. Nevertheless, existing works on the route planning of mobile sensors largely focus on data reconstruction, which either ignores calibration or views it as an independent problem. In this paper, we propose a novel scheme to improve the accuracy of data reconstruction, which jointly considers sensor calibration and data reconstruction in route planning for mobile sensors. We formulate a novel sensor route planning problem (SRPP) that aims to maximize the mutual information and guarantee the accuracy of measurements through the sensor calibration. We also propose a heuristic algorithm to solve the SRPP, which supports calibration between mobile sensors and HQMS in route planning. The extensive simulation results well justify the effectiveness of our approach that can reduce 83% root mean square error on average compared with the traditional approach."}, "journals/sensors/GuoGWQL19": {"title": "SASRT: Semantic-Aware Super-Resolution Transmission for Adaptive Video Streaming over Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.3390/s19143121", "year": "2019", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Jingyu Liu": "43/6883"}, "abstract": ""}, "journals/comcom/LiuLWGQC18": {"title": "USA: Faster update for SDN-based internet of things sensory environments.", "url": "https://doi.org/10.1016/j.comcom.2018.02.015", "year": "2018", "author": {"Tao Liu 0013": "43/656-13", "Chi Harold Liu": "45/4723", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": "Internet of Things (IoT) require ubiquitous and seamless network connectivity. Meanwhile, it also asks for effective service management, data transmission and analysis. Towards this end, software defined networks (SDN) technology is introduced as a key solution to enable IoT network management. When IoT requires an efficient forwarding policy reconfiguration as the response to the alteration of system requirement (e.g., network environment or user demand), SDN is able to adjust the configurations easily to meet its demand. Previous research efforts tried to complete the reconfiguration as quickly as possible, since the update speed is critical to the performance of network management. However, update time can be further reduced. In this paper, we propose a novel update mechanism, which is referred to as rule co-existence update. It is able to enlarge the solution space and obtain more individual solutions, without any negative effect to the packet headers or throughput of flows. Then, we propose a scheme called USA (i.e., Update Speed Accelerator), as a novel algorithm for network updates based on the above-mentioned rule co-existence, that accelerates the update of forwarding policy with spare rule space on current network switches for general IoT environments. Based on the obtained suboptimal greedy solution, USA shows a novel way for rule co-existence to accelerate the update of forwarding policies. It also proposes a simplified algorithm to ensure the forwarding correctness during the update process. Extensive simulation results show that USA can clearly reduce the update time for nearly half of policies in our experiments with few rule space overhead, which is less than 8% of all policies, and maximum update time is less than previous works when spare rule space is limited."}, "journals/ijdsn/0006TGQW18": {"title": "MCS-RF: mobile crowdsensing-based air quality estimation with random forest.", "url": "https://doi.org/10.1177/1550147718804702", "year": "2018", "author": {"Cheng Feng 0006": "76/3473-6", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Wendong Wang": "80/4406"}, "abstract": ""}, "journals/js/LiuLGW18": {"title": "Optimal Attitude Determination from Vector Sensors Using Fast Analytical Singular Value Decomposition.", "url": "https://doi.org/10.1155/2018/6308530", "year": "2018", "author": {"Zhuohua Liu": "133/4787", "Wei Liu": "49/3283", "Xiangyang Gong": "04/8431", "Jin Wu 0002": "18/1539-2"}, "abstract": ""}, "journals/js/LiuLGW18a": {"title": "Simplified Attitude Determination Algorithm Using Accelerometer and Magnetometer with Extremely Low Execution Time.", "url": "https://doi.org/10.1155/2018/8787236", "year": "2018", "author": {"Zhuohua Liu": "133/4787", "Wei Liu": "49/3283", "Xiangyang Gong": "04/8431", "Jin Wu 0002": "18/1539-2"}, "abstract": ""}, "journals/tbc/GuoGLWQ18": {"title": "An Optimized Hybrid Unicast/Multicast Adaptive Video Streaming Scheme Over MBMS-Enabled Wireless Networks.", "url": "https://doi.org/10.1109/TBC.2018.2832444", "year": "2018", "author": {"Jia Guo": "57/4142", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431"}, "abstract": " Abstract:Mobile multimedia services have been increasingly popular. However, radio resources are limited. The quality of experience of all users in wireless networks can be enriched by resource allocation, which is affected by many factors in current wireless networks. In this paper, we focus on a hybrid unicast-multicast (HUM) video streaming scheme, and develop an adaptive resource allocation framework for HUM by combining adaptive cooperative transmission and base station handoff. The optimization problem is formulated as a multi-dimensional, complexity-constrained nonlinear NP-hard problem. To solve the problem, a greedy algorithm and a genetic algorithm are proposed. Simulation results demonstrate that our scheme has superior performance than other transmission methods in the literature. The genetic algorithm has better performance, but the greedy algorithm can maintain better balance between performance and resource consumption."}, "journals/internet/LongGQWLJK17": {"title": "Autonomic Networking: Architecture Design and Standardization.", "url": "https://doi.org/10.1109/MIC.2017.3481338", "year": "2017", "author": {"Xinjian Long": "206/3728", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Wendong Wang": "80/4406", "Bing Liu 0006": "87/6277", "Sheng Jiang": "35/6161", "Ning Kong": "07/4165"}, "abstract": " Abstract:Autonomic networking is a promising solution to handle the ever-increasing management complexity of dynamic network environments. This article elaborates on two autonomic networking architectures and current standardization activities revolving around them."}, "journals/itiis/QiWGQ17": {"title": "Rules Placement with Delay Guarantee in Combined SDN Forwarding Element.", "url": "https://doi.org/10.3837/tiis.2017.06.004", "year": "2017", "author": {"Qinglei Qi": "160/4952", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431"}, "abstract": ""}, "journals/spic/ZhaoGLWQGC17": {"title": "QoE-driven optimization for cloud-assisted DASH-based scalable interactive multiview video streaming over wireless network.", "url": "https://doi.org/10.1016/j.image.2017.05.015", "year": "2017", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Yihua Guo": "132/8476", "Shiduan Cheng": "35/3871"}, "abstract": "In interactive multiview video streaming (IMVS), the viewers can periodically switch viewpoints. If the captured view is not available at the desired viewpoint, virtual views can be rendered from neighboring coded views using view synthesis techniques. Dynamic adaptive streaming over HTTP (DASH) is a new standard that allows to adjust the quality of video streaming based on the network condition. In this paper, an improved DASH-based IMVS framework is proposed. It has the following characteristics. First, virtual views could be adaptively generated at either the cloud-based server or the client in our scheme, depending on the network condition and the cost of the cloud. Second, scalable video coding (SVC) is used to improve the flexibility in our system. To optimize the Quality of Experience (QoE) of multiple clients in wireless scenario, we develop a cross-layer optimization scheme. We first propose a new cache management method to selectively store the video data according to SVC structure and the clients requesting condition. Next, a cross-layer scheduling scheme is proposed by considering the video rate adaptation and the wireless resource allocation. The optimization problem is shown to be equivalent to the Multiple Choice Knapsack (MCKP) problem. A dynamic programming method and a low-cost greedy method are developed to solve the problem. Simulations with the NS3 tool demonstrate the advantage of our proposed scheme over the existing approach that always uses client-based view synthesis and single-layer video coding."}, "journals/chinaf/HuWGQC15": {"title": "On the feasibility and efficacy of control traffic protection in software-defined networks.", "url": "https://doi.org/10.1007/s11432-015-5483-7", "year": "2015", "author": {"Yannan Hu": "133/3740", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": "Software Defined Networking (SDN) is an emerging networking paradigm that assumes a logically centralized control plane separated from the data plane. Despite all its advantages, separating the control and data planes introduces new challenges regarding resilient communications between the two. That is, disconnections between switches and their controllers could result in substantial packet loss and performance degradation. This paper addresses this challenge by studying the issue of control traffic protection in SDNs with arbitrary numbers of controllers. Specifically, we propose a control traffic protection scheme that combines both local rerouting and constrained reverse path forwarding protections, through which switches can locally react to failures and redirect the control traffic using standby backup forwarding options. Our goal is then to find a set of primary routes for control traffic, called protected control network, where as many switches as possible can benefit from the proposed protection scheme. We formulate the protected control network problem, prove its NP-hardness, and develop an algorithm that reconciles protectability and performance (e.g., switch-to-control latency). Through extensive simulations based on real topologies, we show that our approach significantly improves protectability of control traffic. The results should help further the process of deploying SDN in real-world networks."}, "journals/jss/WangTGQH15": {"title": "Software defined autonomic QoS model for future Internet.", "url": "https://doi.org/10.1016/j.jss.2015.08.016", "year": "2015", "author": {"Wendong Wang": "80/4406", "Ye Tian 0008": "32/5495-8", "Xiangyang Gong": "04/8431", "Qinglei Qi": "160/4952", "Yannan Hu": "133/3740"}, "abstract": "Software defined technology has gained enormous momentum in both industry and academia. It may change the existing information flow architecture, which centered at hardware, by granting more privileges to deploy third-party software with more flexible network control and management capabilities. However, how to provide intelligent QoS guarantee in future network is still a hot research issue. Based on top-down design strategy, in this paper, we propose a hierarchical autonomic QoS model by adopting software-defined technologies. In this model, the network is divided into: data-plane, control-plane and management-plane. Then the data-plane is sliced as multiple virtual networks with the dynamic resource allocation capabilities, in order to carry different services or applications. The control-plane is abstracted as resource control layer and service control layer for each virtual network respectively. The management-plane then constructs hierarchical autonomic control loops in terms of different services bearing virtual networks and the corresponding hierarchical control logic. With the hierarchical autonomic control loop and layered service management functions, this model can provide dynamic QoS guarantee to the underlying data networks. We further proposed a context-aware Collaborative Borrowing Based Packet-Marking (CBBPM) algorithm. As an important underlying QoS component in data-plane, CBBPM can be combined with other QoS components to provide some new QoS functions. Experiment comparisons between different QoS mechanisms demonstrate the effectiveness of our proposed hierarchical autonomic QoS model and the packet marking mechanism."}, "journals/tcsv/ZhaoGLWQC15": {"title": "QoE-Driven Cross-Layer Optimization for Wireless Dynamic Adaptive Streaming of Scalable Videos Over HTTP.", "url": "https://doi.org/10.1109/TCSVT.2014.2357094", "year": "2015", "author": {"Mincheng Zhao": "150/5528", "Xiangyang Gong": "04/8431", "Jie Liang 0001": "51/239-1", "Wendong Wang": "80/4406", "Xirong Que": "27/8431", "Shiduan Cheng": "35/3871"}, "abstract": " Abstract:Recently, Dynamic Adaptive Streaming over HTTP (DASH) has attracted significant attention. In this paper, we consider DASH-based transmission of scalable videos in wireless broadband access networks (e.g., long-term evolution and WiMAX), and propose three methods to enhance the quality of experience of wireless DASH users. First, we design an improved mapping scheme from scalable video coding layers to DASH layers that can provide the desired bitrates, enhance the video end-to-end throughput, and reduce the HTTP communication overhead. Second, we develop a DASH-friendly scheduling and resource allocation algorithm by integrating the DASH-based media delivery and the radio-level adaptation via a cross-layer approach. It utilizes the characteristics of video content and scalable video coding, and greatly reduces the possibility of video playback interruption by considering the client buffer status. The optimization problem is formulated as a mixed binary integer programming problem, and is solved by a subgradient method. Finally, a DASH proxy-based bitrate stabilization algorithm is proposed to improve the video playback smoothness that can achieve the desired tradeoff between playback quality and stability. Simulations with the Qualnet tool demonstrate that our schemes achieve better performances than other methods in the literature."}, "journals/ijdsn/DingWCGW13": {"title": "Moving Target Oriented Opportunistic Routing Algorithm in Vehicular Networks.", "url": "https://doi.org/10.1155/2013/692146", "year": "2013", "author": {"Yu Ding": "77/6871", "Wendong Wang": "80/4406", "Yong Cui 0001": "91/2346-1", "Xiangyang Gong": "04/8431", "Bai Wang 0001": "03/587-1"}, "abstract": ""}, "journals/tce/TianWGQM13": {"title": "An enhanced personal photo recommendation system by fusing contextual and textual features on mobile device.", "url": "https://doi.org/10.1109/TCE.2013.6490263", "year": "2013", "author": {"Ye Tian 0008": "32/5495-8", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Xirong Que": "27/8431", "Jian Ma 0001": "26/4870-1"}, "abstract": " Abstract:As a main means to record scene in personal daily life, personal photos convey high-level semantic information (e.g., who, what, when, where) of an activity user engaged in. Different from other information retrieval tasks, personal photo recommendation depends on the measure of activity relevancy which is implicitly embedded in photos. Spurred by this observation, an enhanced recommendation approach by fusing both contextual and textual features is proposed. First, contextual relevancy is incrementally refined with an enhanced temporal and spatial clustering method respectively. Second, textual similarity of photo annotations is calculated using WordNet to augment the activity relevancy. Third, a fuzzy decision based multi-criteria ranking algorithm i.e., Preference Ranking Organization Method of Enrichment Evaluation (PROMETHEE) is adopted to make recommendations when giving an entry photo. A prototype has been developed on mobile device to illustrate this concept. Experiment results on a real dataset which contains 10,827 photos collected from 50 volunteers during 12 months demonstrate that our approach is more accurate than traditional schemes."}, "journals/comcom/GongWC10": {"title": "A fast IPv6 packet classification algorithm based on efficient multi-bit selection.", "url": "https://doi.org/10.1016/j.comcom.2010.04.042", "year": "2010", "author": {"Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "Decision tree based schemes are widely used in designing high-speed packet classification algorithms. The primary objective is to construct a decision tree with minimal storage and searching time complexity. In this paper, we proposed a novel decision tree packet classification algorithm based on Efficient Multiple Bit Selection (EMBS). In the proposed algorithm, prefix fields are transformed to a set of independent bits; and multiple arbitrary bits are selected to cut nodes when building the decision tree. A Performance Estimate Function (PEF) and an efficient bit selecting algorithm are exploited to determine which bits should be selected to obtain an efficient decision tree with high performance. The proposed EMBS algorithm is capable of handling range match fields, and it is suitable for IPv6 packet classification as well as IPv4. Evaluation results show that EMBS provides a great improvement over recent decision tree based algorithms in both space requirement and searching performance."}, "journals/jcst/GongWC10": {"title": "ERFC: An Enhanced Recursive Flow Classification Algorithm.", "url": "https://doi.org/10.1007/s11390-010-9380-7", "year": "2010", "author": {"Xiangyang Gong": "04/8431", "Wendong Wang": "80/4406", "Shiduan Cheng": "35/3871"}, "abstract": "Packet classification on multi-fields is a fundamental mechanism in network equipments, and various classification solutions have been proposed. Because of inherent difficulties, many of these solutions scale poorly in either time or space as rule sets grow in size. Recursive Flow Classification (RFC) is an algorithm with a very high classifying speed. However, its preprocessing complexity and memory requirement are rather high. In this paper, we propose an enhanced RFC (ERFC) algorithm, in which a hash-based aggregated bit vector scheme is exploited to speed up its preprocessing procedure. A compressed and cacheable data structure is also introduced to decrease total memory requirement and improve its searching performance. Evaluation results show that ERFC provides a great improvement over RFC in both space requirement and preprocessing time. The search time complexity of ERFC is equivalent to that of RFC in the worst case; and its average classifying speed is improved by about 100%."}, "journals/ijdsn/LiuWGLCG09": {"title": "A Novel Group Management Protocol for IP Multicast (LW-IGMPv3).", "url": "https://doi.org/10.1080/15501320802533632", "year": "2009", "author": {"Jiwen Liu": "43/2983", "Wendong Wang": "80/4406", "Xiangyang Gong": "04/8431", "Hui Liu": "93/4010", "Wei Cao": "54/6265", "Xuesong Gao": "202/2854"}, "abstract": ""}}}