{"id": "96/10111", "name": "Xiao-Feng Du", "Article": {"conf/mmm/QuSLPD16": {"title": "Single Image Super-Resolution via Convolutional Neural Network and Total Variation Regularization.", "url": "https://doi.org/10.1007/978-3-319-27674-8_3", "year": "2016", "author": {"Yanyun Qu": "03/3500", "Cuiting Shi": "167/9602", "Junran Liu": "167/9624", "Liying Peng": "173/6742", "Xiao-Feng Du": "96/10111"}, "abstract": "We propose a super-resolution reconstruction model based on the fusion of convolutional neural networks and regularization constraints. Our model not only takes advantage of the convolutional neural network’s prominent capability for nonlinear mapping between low-resolution and high-resolution images, but also takes the image inherent tendency to have bountiful repeated structural information into accounts. We derive our total variation regularization constraints based on the image local similarity and non-local similarity. Through coalescence of convolutional nerual network and delicately devised adaptive regularization constraints, our model yields a state-of-the-art restoration quality from a single image. Besides, our system can be expanded to tackle more low-level vision problems as well.KeywordsConvolutional neural networkNonlocal constraintImage super resolutionSteering kernel constraint"}, "conf/icmlc/LuQDX11": {"title": "Text detection in images based on Multiple Kernel Learning.", "url": "https://doi.org/10.1109/ICMLC.2011.6017013", "year": "2011", "author": {"Shen Lu": "88/2983", "Yanyun Qu": "03/3500", "Xiao-Feng Du": "96/10111", "Yi Xie 0004": "51/4462-4"}, "abstract": " Abstract:Detecting text accurately is an essential requirement for text recognition. In this paper, we propose a method to automatically detect text information in images. We firstly find the candidates of text regions based on the analysis of connected components and extract textural features in these candidate regions. We apply Multiple Kernel Learning to train a classifier with an optimal combination of kernels. The classifier can be used to distinguish text from icons which might be included in region candidates. Our method has been successfully implemented in detecting text from the interface images of mobile phones. According to the experimental results, our method outperforms several typical SVM based methods."}}}