{"id": "98/3341-2", "name": "Xiaolong Zheng 0002", "Article": {"conf/icassp/DuZLM22": {"title": "Defending Against Universal Attack Via Curvature-Aware Category Adversarial Training.", "url": "https://doi.org/10.1109/ICASSP43922.2022.9746983", "year": "2022", "author": {"Peilun Du": "250/0521", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Adversarial training can defend against universal adversarial perturbation (UAP) by injecting corresponding adversarial samples during training. However, adversarial samples used by existing methods, such as UAP, inevitably include excessive perturbations related to other categories due to its inherent goal of universality. Training with them will cause more erroneous predictions with larger local positive curvature. In this paper, we propose a curvature-aware category adversarial training method to avoid excessive perturbations. We introduce the category-oriented adversarial masks that are synthesized with class distinctive momentum. Besides, we split the min-max optimization loops of adversarial training into two parallel processes to reduce the training cost. Experimental results on CIFAR-10 and ImageNet show that our method achieves better defense accuracy under UAP with less training cost than state-of-the-art baselines."}, "conf/icmcs/Du0Q0M22": {"title": "Towards Adversarial Robust Representation Through Adversarial Contrastive Decoupling.", "url": "https://doi.org/10.1109/ICME52920.2022.9859625", "year": "2022", "author": {"Peilun Du": "250/0521", "Xiaolong Zheng 0002": "98/3341-2", "Mengshi Qi": "191/2586", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Adversarial training can boost the robustness of the model by aligning discriminative features between natural and generated adversarial samples. However, the generated adversarial samples tend to have more features derived from changed patterns in other categories along with the training process, which prevents better feature alignment between natural and adversarial samples. Unfortunately, existing adversarial training methods ignore such dynamicity of generated adversarial samples. In this paper, we propose Adversarial Contrastive Decoupling (ACD) to filter the features derived from changed patterns. Specificity, we decouple the changed patterns from adversarial samples and then extract robust representations from remaining features. First, we introduce a decoupling module with a dynamic labeling strategy to explore the dynamicity of generated adversarial samples. Then, we propose a siamese network with contrastive learning mechanism to align remaining robust representations between adversarial and natural samples. Extensive experimental results demonstrate the superior performance of ACD over baselines."}, "conf/infocom/XiaZYLM22": {"title": "WiRa: Enabling Cross-Technology Communication from WiFi to LoRa with IEEE 802.11ax.", "url": "https://doi.org/10.1109/INFOCOM48880.2022.9796831", "year": "2022", "author": {"Dan Xia": "27/6461", "Xiaolong Zheng 0002": "98/3341-2", "Fu Yu": "12/5126", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technique that enables direct interconnection among incompatible wireless technologies. Recent work proposes CTC from IEEE 802.11b to LoRa but has a low efficiency due to their extremely asymmetric data rates. In this paper, we propose WiRa that emulates LoRa waveforms with IEEE 802.11ax to achieve an efficient CTC from WiFi to LoRa. By taking advantage of the OFDMA in 802.11ax, WiRa can use only a small Resource Unit (RU) to emulate LoRa chirps and set other RUs free for high-rate WiFi users. WiRa carefully selects the RU to avoid emulation failures and adopts WiFi frame aggregation to emulate the long LoRa frame. We propose a subframe header mapping method to identify and remove invalid symbols caused by irremovable subframe headers in the aggregated frame. We also propose a mode flipping method to solve Cyclic Prefix errors, based on our finding that different CP modes have different and even opposite impacts on the emulation of a specific LoRa symbol. We implement a prototype of WiRa on the USRP platform and commodity LoRa device. The extensive experiments demonstrate WiRa can efficiently transmit complete LoRa frames with the throughput of 40.037kbps and the symbol error rate (SER) lower than 0.1."}, "conf/infocom/YuZLM22": {"title": "LoRadar: An Efficient LoRa Channel Occupancy Acquirer based on Cross-channel Scanning.", "url": "https://doi.org/10.1109/INFOCOM48880.2022.9796845", "year": "2022", "author": {"Fu Yu": "12/5126", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:LoRa is widely deployed for various applications. Though the knowledge of the channel occupancy is the prerequisite of all aspects of network management, acquiring the channel occupancy for LoRa is challenging due to the large number of channels to be detected. In this paper, we propose LoRadar, a novel LoRa channel occupancy acquirer based on cross-channel scanning. Our in-depth study finds that Channel Activity Detection (CAD) in a narrow band can indicate the channel activities of wide bands because they have the same slope in the time-frequency domain. Based on our finding, we design the cross-channel scanning mechanism that infers the channel occupancy states of all the overlapping channels by the distribution of CAD results. We elaborately select and adjust the CAD settings to enhance the distribution features. We also design the pattern correction method to cope with distribution distortions. We implement LoRadar on commodity LoRa platforms and evaluate its performance on the indoor testbed and the outdoor deployed network. The experimental results show that LoRadar can achieve a detection accuracy of 0.99 and reduce the acquisition overhead by up to 0.90, compared to existing traversal-based methods."}, "conf/infocom/LiZWLM22": {"title": "PolarScheduler: Dynamic Transmission Control for Floating LoRa Networks.", "url": "https://doi.org/10.1109/INFOCOM48880.2022.9796656", "year": "2022", "author": {"Ruinan Li": "231/3443", "Xiaolong Zheng 0002": "98/3341-2", "Yuting Wang": "09/8269", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:LoRa is widely deploying in aquatic environments to support various Internet of Things applications. However, floating LoRa networks suffer from serious performance degradation due to the polarization loss caused by the swaying antenna. Existing methods that only control the transmission starting from the aligned attitude have limited improvement due to the ignorance of aligned period length. In this paper, we propose PolarScheduler, a dynamic transmission control method for floating LoRa networks. PolarScheduler actively controls transmission configurations to match polarization aligned periods. We propose a V-zone model to capture diverse aligned periods under different configurations. We also design a low-cost model establishment method and an efficient optimal configuration searching algorithm to make full use of aligned periods. We implement PolarScheduler on commercial LoRa platforms and evaluate its performance in a deployed network. Extensive experiments show that PolarScheduler can improve the packet delivery rate and throughput by up to 20.0% and 15.7%, compared to the state-of-the-art method."}, "conf/icdcs/YuLBHJGZ21": {"title": "BiCord: Bidirectional Coordination among Coexisting Wireless Devices.", "url": "https://doi.org/10.1109/ICDCS51616.2021.00037", "year": "2021", "author": {"Zihao Yu": "158/9996", "Pengyu Li": "25/8528", "Carlo Alberto Boano": "71/7545", "Yuan He 0004": "11/1735-4", "Meng Jin 0002": "33/6937-2", "Xiuzhen Guo": "188/8787", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:Cross-technology interference is a major threat to the dependability of low-power wireless communications. Due to power and bandwidth asymmetries, technologies such as Wi-Fi tend to dominate the RF channel and unintentionally destroy low-power wireless communications from resource-constrained technologies such as ZigBee, leading to severe coexistence issues. To address these issues, existing schemes make ZigBee nodes individually assess the RF channel's availability or let Wi-Fi appliances blindly reserve the medium for the transmissions of low-power devices. Without a two-way interaction between devices making use of different wireless technologies, these approaches have limited scenarios or achieve inefficient network performance. This paper presents BiCord, a bidirectional coordination scheme in which resource-constrained wireless devices such as ZigBee nodes and powerful Wi-Fi appliances coordinate their activities to increase coexistence and enhance network performance. Specifically, in BiCord, ZigBee nodes directly request channel resources from Wi-Fi devices, who then reserve the channel for ZigBee transmissions on-demand. This interaction continues until the transmission requirement of ZigBee nodes is both fulfilled and understood by Wi-Fi devices. This way, BiCord avoids unnecessary channel allocations, maximizes the availability of the spectrum, and minimizes transmission delays. We evaluate BiCord on off-the-shelf Wi-Fi and ZigBee devices, demonstrating its effectiveness experimentally. Among others, our results show that BiCord increases channel utilization by up to 50.6% and reduces the average transmission delay of ZigBee nodes by 84.2% compared to state-of-the-art approaches."}, "conf/infocom/WangZLM21": {"title": "PolarTracker: Attitude-aware Channel Access for Floating Low Power Wide Area Networks.", "url": "https://doi.org/10.1109/INFOCOM42981.2021.9488714", "year": "2021", "author": {"Yuting Wang": "09/8269", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Low Power Wide Area Networks (LPWAN) such as Long Range (LoRa) show great potential in emerging aquatic IoT applications. However, our deployment experience shows that the floating LPWAN suffer significant performance degradation, compared to the static terrestrial deployments. Our measurement results reveal the reason behind this is due to the polarization and directivity of the antenna. The dynamic attitude of a floating node incurs varying signal strength losses, which is ignored by the attitude-oblivious link model adopted in most of the existing methods. When accessing the channel at a misaligned attitude, packet errors can happen. In this paper, we propose an attitude-aware link model that explicitly quantifies the impact of node attitude on link quality. Based on the new model, we propose PolarTracker, a novel channel access method for floating LPWAN. PolarTracker tracks the node attitude alignment state and schedules the transmissions into the aligned periods with better link quality. We implement a prototype of PolarTracker on commercial LoRa platforms and extensively evaluate its performance in various real-world environments. The experimental results show that PolarTracker can efficiently improve the packet reception ratio by 48.8%, compared with ALOHA in LoRaWAN."}, "conf/mass/YinZD0M21": {"title": "Scaling Resilient Adversarial Patch.", "url": "https://doi.org/10.1109/MASS52906.2021.00034", "year": "2021", "author": {"Yunhong Yin": "309/0501", "Xiaolong Zheng 0002": "98/3341-2", "Peilun Du": "250/0521", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Deep neural networks are easily affected by adversarial patches, causing prediction errors. However, existing adversarial patches are trained with specific model-dataset pairs and only effective for the images with the predetermined size in the dataset. The semantic information of the patch will be distorted when scaling the image, which is a common preprocessing process in practical applications. In this paper, we propose SRA Patch (Scaling-Resilient Adversarial Patch), a new adversarial patch resilient to image scaling. Specifically, we generate the patch in a block-wise way and utilize the superpixel method to resist the loss of semantic information during scaling. Further, we introduce the ensemble model as a Black-Box indicator to address the noise space shrinking issue, which is caused by the small size and the block operation of SRA patch. Finally, we leverage Class Activation Mapping to extract the region with salient features as the final patch to improve the ratio of effective semantic features on the patch to remain during scaling. Extensive experiments have demonstrated that our SRA patch has much stronger attack capability and scaling robustness than existing methods."}, "conf/mass/WangZDLM21": {"title": "Occlusion Resilient Adversarial Attack for Person Re-identification.", "url": "https://doi.org/10.1109/MASS52906.2021.00071", "year": "2021", "author": {"Xinyu Wang": "68/1277", "Xiaolong Zheng 0002": "98/3341-2", "Peilun Du": "250/0521", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Deep learning-based person re-identification (Re-ID) methods have achieved the significant performance of matching person images across camera views, which plays an important role in the construction of the smart city. Recent works of adversarial attacks have explored the serious vulnerability of deep Re-ID systems. However, existing attacks are performed with idealized conditions and ignore the real-world environments, such as occlusion caused by walking habits. In this paper, we propose a two-stage method to perform an occlusion resilient adversarial attack for better evaluation of deep Re-ID systems. Specifically, we construct the occlusion template from the observation and statics of pedestrian walking habits. Then, we design a partition training strategy for a better combination of occluded and exposed adversarial patches. During the training, we introduce contextual loss to penalize the semantic distance of attacked images with the same identity. The extensive experiments on Market1501 demonstrate the performance of our method."}, "conf/secon/Cao00M21": {"title": "COFlood: Concurrent Opportunistic Flooding in Asynchronous Duty Cycle Networks.", "url": "https://doi.org/10.1109/SECON52354.2021.9491582", "year": "2021", "author": {"Zhichao Cao": "05/7548", "Xiaolong Zheng 0002": "98/3341-2", "Qiang Ma 0007": "m/QiangMa7", "Xin Miao": "62/4917"}, "abstract": " Abstract:For energy constrained wireless IoT nodes, their radios usually operate in duty cycle mode. With low maintenance and negotiation cost, asynchronous duty cycle radio management is widely adopted. To achieve fast network flooding is challenging in asynchronous duty cycle networks. Recently, concurrent flooding is a promising approach to improve the performance of network flooding. In concurrent flooding, a key challenge is how to select a set of concurrent senders to improve both flooding speed and energy efficiency. We observe that selecting neither large nor small number of concurrent senders can achieve the optimal performance in different deployments. In this paper, we propose COFlood (Concurrent Opportunistic Flooding), a practical and effective concurrent flooding protocol in asynchronous duty cycle networks. The basic idea is based on an energy-efficient flooding tree, COFlood opportunistically selects extra concurrent senders that can speed up network flooding. First, COFlood constructs an energy-efficient flooding tree in distributed manner. The non-leaf nodes are selected as senders and they can cover the entire network with low energy consumption. Moreover, we find that exploiting both early wakeup nodes and long lossy links can speed up the flooding tree based network flooding. Then, COFlood develops a light-weight method to select the nodes that meet the conditions of these two opportunities as opportunistic senders. We implement COFlood in TinyOS and evaluate it on two real testbeds. In comparison with state-of-the-art concurrent flooding protocol, completion time and energy consumption can be reduced by up to 35.3% and 26.6%."}, "conf/wasa/JiangLLZ21": {"title": "Deep Reinforcement Learning Based Intelligent Job Batching in Industrial Internet of Things.", "url": "https://doi.org/10.1007/978-3-030-86130-8_38", "year": "2021", "author": {"Chengling Jiang": "55/8909", "Zihui Luo": "214/2317", "Liang Liu 0001": "10/6178-1", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": "The ever-developing Industrial Internet of Things (IIoT) is promoting the transformation of traditional manufacturers to intelligent manufacturing. Intelligent job batching, as one of the important parts of intelligent production in IIoT, is desired to group jobs with similar features into one batch under the constraint of batch capacity while considering the manufacturing target. This work formulates the job batching problem as a Markov Decision Process and proposes a deep reinforcement learning (DRL) based method to achieve intelligent job batching. The job batching model is based on the pointer network. The convergence of the model under different parameters is analyzed, and the performance of the method is evaluated by comparing it with the manual result, K-means algorithm, and multiple meta-heuristic algorithms via real production data. Experiments show that the proposed method can produce better solution in terms of the feature difference within a batch and the total batch number, especially in large-scale manufacturing scenarios.KeywordsJob batchingDeep reinforcement learningIndustrial Internet of Things"}, "conf/globecom/YuZLM20": {"title": "RCTC: Rateless Cross-technology Communication.", "url": "https://doi.org/10.1109/GLOBECOM42002.2020.9322285", "year": "2020", "author": {"Fu Yu": "12/5126", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technique that enables the direct communication across incompatible wireless technologies. Without modifying any hardware, CTC establishes mutually sensible side channel by manipulating the packet transmissions and encodes information by constructing transmission patterns in terms of signal strength, packet interval, and etc. However, the transmission patterns are prone to the coexisting interference, leading to the unreliability of CTC. Most of the existing methods deal with the reliability problem by reactive retransmission of the corrupted packets, which incurs large delay. In this paper, we propose RCTC, a rateless-coding based CTC that proactively copes with the unreliability. Since the computation ability of low-power ZigBee nodes is limited, we carefully design the coding combination with proper degree distribution to balance the trade-off between reliability and decoding latency. We also propose a coding adaptation algorithm to adapt to the channel dynamics. We implement a prototype on commercial WiFi and ZigBee platforms. The experiment results show that RCTC can reduce the BER by up to 92.6%, compared to existing CTC methods."}, "conf/infocom/ZhangGJ0020": {"title": "Link Quality Estimation of Cross-Technology Communication.", "url": "https://doi.org/10.1109/INFOCOM41043.2020.9155437", "year": "2020", "author": {"Jia Zhang": "80/2266", "Xiuzhen Guo": "188/8787", "Haotian Jiang": "180/0691", "Xiaolong Zheng 0002": "98/3341-2", "Yuan He 0004": "11/1735-4"}, "abstract": " Abstract:Research on Cross-technology communication (CTC) has made rapid progress in recent years, but how to estimate the quality of a CTC link remains an open and challenging problem. Through our observation and study, we find that none of the existing approaches can be applied to estimate the link quality of CTC. Built upon the physical-level emulation, transmission over a CTC link is jointly affected by two factors: the emulation error and the channel distortion. We in this paper propose a new link metric called C-LQI and a joint link model that simultaneously takes into account the emulation error and the channel distortion in the process of CTC. We further design a light-weight link estimation approach to estimate C-LQI and in turn the PRR over the CTC link. We implement C-LQI and compare it with two representative link estimation approaches. The results demonstrate that C-LQI reduces the relative error of link estimation respectively by 46% and 53% and saves the communication cost by 90%."}, "conf/mobihoc/ZhengXGLHM20": {"title": "Portal: transparent cross-technology opportunistic forwarding for low-power wireless networks.", "url": "https://doi.org/10.1145/3397166.3409134", "year": "2020", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Dan Xia": "27/6461", "Xiuzhen Guo": "188/8787", "Liang Liu 0001": "10/6178-1", "Yuan He 0004": "11/1735-4", "Huadong Ma": "04/6217"}, "abstract": "\n\t\tOpportunistic forwarding seizes early forwarding opportunities in duty-cycled networks to reduce delay and energy consumption. But increasingly serious Cross-Technology Interference (CTI) significantly counteracts the benefits of opportunistic forwarding. Existing solutions try to reserve the channel for low-power networks by implicit avoidance or explicit coordination but ignore the potential of high-power CTI's superior capability. In this paper, we propose a new paradigm for low-power opportunistic forwarding in CTI environments. Instead of keeping high-power CTI devices silent, we directly involve them into the forwarding, as cross-technology forwarders. We design Portal to solve the challenges of realizing cross-technology opportunistic forwarding. To be transparent to the low-power networks, Portal adopts cross-technology rebroadcasting to enable the fast overhearing and forwarding of cross-technology data. To maximize the performance gain of using heterogeneous forwarders while minimizing the influence on legacy high-power traffic, we propose a post-forwarding forwarder selection and a traffic scheduling method. We also propose a feature-based ACK recognition method and a jamming-based ACK replying mechanism to forward the unreliable ACKs from asymmetric regions. Extensive experiments demonstrate that Portal not only avoids the CTI but also breaks through the existing performance limit.\n\t"}, "conf/msn/ZhangZLM20": {"title": "Multivariate and Multi-frequency LSTM based Fine-grained Productivity Forecasting for Industrial IoT.", "url": "https://doi.org/10.1109/MSN50589.2020.00058", "year": "2020", "author": {"Yan Zhang": "04/3348", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Thanks to Industrial Internet of Things (IIoT), traditional industry is transforming to the fine and flexible production. To comprehensively control the dynamic industrial processes that includes marketing and production, accurate productivity is a vital factor that can reduce the idle operation and excessive pressure of the equipment. Due to increasing requirements of flexible control desired by IIoT, the productivity forecast also demands finer granularity. However, due to the neglect of multiple related factors and the ignorance of the multi-frequency characteristics of productivity, existing methods fail to provide accurate fine-grained productivity forecasting service for IIoT. To fill this gap, we propose a multivariate and multi-frequency Long Short-Term Memory model (mmLSTM) to predict the productivity in the granularity of day. mmLSTM takes equipment status and order as new supporting factors and leverages a multivariate LSTM to model their relationship to productivity. mmLSTM also integrate a multi-level wavelet decomposition network to thoroughly capture the multi-frequency features of productivity. We apply the proposed method in a real-world steel factory and conduct a comprehensive evaluation of performance with the productivity data in nearly two years. The result shows that our method can effectively improve the prediction accuracy and granularity of industrial productivity."}, "conf/msn/LiHLZM20": {"title": "SDN Based Computation Offloading for Industrial Internet of Things.", "url": "https://doi.org/10.1109/MSN50589.2020.00072", "year": "2020", "author": {"Gen Li": "28/538", "Shutian Hua": "289/8441", "Liang Liu 0001": "10/6178-1", "Xiaolong Zheng 0002": "98/3341-2", "Huadong Ma": "04/6217"}, "abstract": " Abstract:As a new type of highly collaborative and shared intelligent network between producers and production environments, Industrial Internet of Things (IIOT) has been taken an important part of the fourth industrial revolution. IIOT generates large amounts of sensory data which need to be processed rapidly. However, the cloud-based data processing method consumes a long time and huge network overhead, which further affects the quality of service. On the other hand, the emerging edge computing also cannot process data efficiently because of limited compute and network resource. In this paper, we propose a four-layer network architecture based on SDN for the industrial internet of things scenario. Through effective transmission and computation coupling, the processing response efficiency is improved. We present a three-level computation offloading method to realize the optimization of network delay and power consumption. Theory and experiments show that the method proposed in this paper can effectively reduce the computation power consumption and response time."}, "conf/secon/WangZLM20": {"title": "CoHop: Quantitative Correlation based Channel Hopping for Low-power Wireless Networks.", "url": "https://doi.org/10.1109/SECON48991.2020.9158435", "year": "2020", "author": {"Yuting Wang": "09/8269", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Cross-Technology Interference (CTI) badly harms the transmission reliability for low-power networks such as ZigBee at 2.4GHz band. Though promising, channel hopping still faces challenges because the increasingly dense deployment of CTI leaves very few available channels. Selecting a good channel with the least overhead is crucial but challenging. Most of the existing works are heuristic methods that choose a channel far from the current one to avoid adjacent channels that may be correlatively interfered by CTI with a wider bandwidth such as WiFi. However, we observe that the correlated channels influenced by the same CTI source do not necessarily have the same channel qualities and even the opposite state, due to the uneven spectrum power density of CTI. Such channel opportunities are unexplored and wasted. In this paper, we propose CoHop, a quantitative correlation based channel hopping method for low-power wireless networks. We establish a quantitative model that describes the correlation of channel qualities to capture channel opportunities and calculate channel quality without probing, to reduce probing overhead. We implement CoHop on TinyOS and evaluate its performance in various environments. The experimental results show that CoHop can increase the Packet Reception Ratio (PRR) by 80%, compared with existing methods."}, "conf/secon/XiaZLWM20": {"title": "c-Chirp: Towards Symmetric Cross-technology Communication over Asymmetric Channels.", "url": "https://doi.org/10.1109/SECON48991.2020.9158411", "year": "2020", "author": {"Dan Xia": "27/6461", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Chaoyu Wang": "239/4819", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technique that enables direct interconnection among incompatible wireless technologies. However, CTC channels established by existing methods are inherently asymmetric because of either the one-way nature of emulation in physical-level CTC or the asymmetric communication range caused by the asymmetric transmission power. In this paper, we focus on establishing symmetric CTC over asymmetric CTC channels. The bottleneck is the short communication range from the low-power and narrow-band technology to the high-power and wide-band technology because the asymmetric bandwidth and transmission power lead to serious symbol distortions. To compensate the inevitable distortions, we take advantage of the channel asymmetry and construct chirps in WiFi Channel State Information (CSI) to enhance the patterns used for conveying data. In this way, we can extend the communication range from ZigBee to WiFi. We theoretically build the model of CSI chirp based CTC and design c-Chirp, a novel CTC from ZigBee to WiFi. Due to channel asymmetry and discreteness, the WiFi receiver can only observe partial and distorted CSI chirps. To cope with this issue, we design a matching based chirp decoding method as well as an adaptation algorithm to reliably decode the symbols. We conduct extensive experiments to evaluate c-Chirp. The results show that c-Chirp can achieve a 60m communication range from ZigBee to WiFi, which is 6× longer than ZigFi, an existing representative CTC from ZigBee to WiFi."}, "conf/secon/ZhuZLM20": {"title": "AirSync: Time Synchronization for Large-scale IoT Networks Using Aircraft Signals.", "url": "https://doi.org/10.1109/SECON48991.2020.9158433", "year": "2020", "author": {"Shaopeng Zhu": "195/5650", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:The prosperity of Internet of Things (IoT) brings forth the deployment of large-scale sensing systems such as smart cities. The distributed devices upload their local sensing data to the cloud and collaborate to fulfill the large-area tasks such as pollutant diffusion analysis and target tracking. To accomplish the collaboration, time synchronization is crucial. However, due to the long range and device heterogeneity, accurate time synchronization for a large-scale IoT network is challenging. Existing GPS or NTP solutions either require an outdoor environment or only have low and unstable accuracy. In this paper, we propose AirSync, a novel synchronization method that leverages the widely existed aircraft signals, ADS-B, to synchronize large-scale IoT networks with nodes even in indoor environments. But ADS-B messages have no time stamp and cannot provide a reference time. We leverage the continuity of aircraft movements to estimate the aircraft traveling time. Then devices that observe common aircraft moving segments can calculate their time offset. To obtain the time skew, we propose a combined aircraft linear regression method. We also design a transitive synchronization for devices that cannot observe common aircraft. We implement a prototype of AirSync and evaluate its performance in various real-world environments. The results show that AirSync can obtain the sub-ms accuracy."}, "conf/ewsn/WangGLLZJH19": {"title": "Poster: Online Learning for Reliable Packet-level Cross-Technology Communication.", "url": "https://dl.acm.org/citation.cfm?id=3324358", "year": "2019", "author": {"Weiguo Wang": "43/1941", "Xiuzhen Guo": "188/8787", "Long Liu": "82/5051", "Xiaoyue Lei": "238/9459", "Xiaolong Zheng 0002": "98/3341-2", "Meng Jin 0002": "33/6937-2", "Yuan He 0004": "11/1735-4"}, "abstract": "\n\t\tCross-Technology Communication (CTC) is an emerging technology to enable direct communication between devices that follow different wireless standards. However, channel dynamics may affect the performance of the existing CTC approaches. This work proposes an online learning framework for existing CTCs. In the framework, the decoders could update its parameters and adapt to dynamics environments. the evaluation shows that the framework can effectively reduce the SER.\n\t"}, "conf/ewsn/WangGLLZJH19a": {"title": "Poster: Dandelion: Design of An Online Large Scale LoRa Testbed.", "url": "https://dl.acm.org/citation.cfm?id=3324359", "year": "2019", "author": {"Weiguo Wang": "43/1941", "Xiuzhen Guo": "188/8787", "Long Liu": "82/5051", "Xiaoyue Lei": "238/9459", "Xiaolong Zheng 0002": "98/3341-2", "Meng Jin 0002": "33/6937-2", "Yuan He 0004": "11/1735-4"}, "abstract": "\n\t\tThis paper presents Dandelion1, a large-scale online LoRa testbed. Dandelion is an online platform, including large-scale LoRa nodes, gateways, central controller and web interfaces. It is designed to reduce the costs of deployment, maintenance and evaluation of LoRa network. Dandelion helps researchers to do experiment and collect data by providing online interface. Currently, there are 50 nodes in Dandelion, running for about 1 year to support LoRa network research.\n\t"}, "conf/ewsn/YangGZZLLJH19": {"title": "Poster: A Hierarchical VR Streaming System through a WiFi Connection.", "url": "https://dl.acm.org/citation.cfm?id=3324362", "year": "2019", "author": {"Songzhou Yang": "238/9450", "Junchen Guo": "220/7067", "Xiaolong Zheng 0002": "98/3341-2", "Xinpeng Zhang": "01/3442", "Chunya Liu": "228/6000", "Pengyu Li": "25/8528", "Meng Jin 0002": "33/6937-2", "Yuan He 0004": "11/1735-4"}, "abstract": "\n\t\tConsumer Virtual Reality (VR) has been widely used in various application areas, such as entertainment and medicine. In spite of the superb immersion experience, to enable high-quality VR on untethered mobile devices remains an extremely challenging task. The high bandwidth demands of VR streaming generally overburden a conventional wireless connection, which affects the user experience and in turn limits the usability of VR in practice. In this work, we propose a hierarchical VR streaming through a WiFi connection. This design stems from the insight that humans field of view (FoV) is hierarchical, so that different areas in the FoV can be served with VR content of different qualities. By exploiting the gaze tracking capacity of the VR devices, this system is able to accurately predict the users attention so that the streaming of hierarchical VR can be appropriately scheduled. In this way, our work significantly reduces the bandwidth cost while keeping high quality of user experience.\n\t"}, "conf/icpads/XiaZDWLM19": {"title": "Ground-Station Based Software-Defined LEO Satellite Networks.", "url": "https://doi.org/10.1109/ICPADS47876.2019.00102", "year": "2019", "author": {"Dan Xia": "27/6461", "Xiaolong Zheng 0002": "98/3341-2", "Pengrui Duan": "09/10696", "Chaoyu Wang": "239/4819", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Low Earth Orbit (LEO) satellite networks play an indispensable role in global communications. To cope with the dynamic nature of the LEO networks, a flexible management architecture that can provide low-latency configuration and routing services is desired. Recent advances of Software Defined Networks (SDN) inspire researches using geostationary satellites, GEO, as the controllers to build the SDN solutions for LEO satellite networks. However, GEO-based solutions inevitably face the bottleneck problem because all the routing requests have to be processed and forwarded by a limited number of GEO satellites. In this paper, we propose HTCA, a Hierarchical Terrestrial Controllers Architecture based on SDN that reuses the ground stations instead of dedicated GEO satellites to establish a more scalable control plane. But the limited coverage of a ground station brings about design challenges for consistent network management and seamless routing service. HTCA adopts an online network view integration method to support flexible and consistent management. A load-aware routing method is also designed for HTCA to provide seamless and low-latency routing service. The experiment results demonstrate that HTCA can achieve agile configuration and reduce the instruction update time by 86.87%, compared with the GEO-based solution."}, "conf/infocom/GuoH0YL19": {"title": "LEGO-Fi: Transmitter-Transparent CTC with Cross-Demapping.", "url": "https://doi.org/10.1109/INFOCOM.2019.8737659", "year": "2019", "author": {"Xiuzhen Guo": "188/8787", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Zihao Yu": "158/9996", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technique that enables direct communication across different wireless technologies. The state-of-the-art works in this area propose physical-level CTC, in which the transmitters emulate signals that follow the receiver's standard. Physical-level CTC means considerable processing complexity at the transmitter, which doesn't apply to the communication from a low-end transmitter to a high-end receiver, e.g. from ZigBee to WiFi. This paper presents transmitter-transparent cross-technology communication, which leaves the processing complexity solely at the receiver side and therefore makes a critical advance toward bidirectional high-throughput CTC. We implement our proposal as LEGO-Fi, the communication from ZigBee to WiFi. The key technique inside is cross-demapping, which stems from two key technical insights: (1) A ZigBee packet leaves distinguishable features when passing the WiFi modules. (2) Compared to ZigBee's simple encoding and modulation schemes, the rich processing capacity of WiFi offers extra flexibility to process a ZigBee packet. The evaluation results show that LEGO-Fi achieves a throughput of 213.6Kbps, which is respectively 13000× and 1200× faster than FreeBee and ZigFi, the two existing ZigBee-to-WiFi CTC approaches."}, "conf/secon/Wang00G19": {"title": "AdaComm: Tracing Channel Dynamics for Reliable Cross-Technology Communication.", "url": "https://doi.org/10.1109/SAHCN.2019.8824843", "year": "2019", "author": {"Weiguo Wang": "43/1941", "Xiaolong Zheng 0002": "98/3341-2", "Yuan He 0004": "11/1735-4", "Xiuzhen Guo": "188/8787"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technology to support direct communication between wireless devices that follow different standards. In spite of the many different proposals from the community to enable CTC, the performance aspect of CTC is an equally important problem but has seldom been studied before. We find this problem is extremely challenging, due to the following reasons: on one hand, a link for CTC is essentially different from a conventional wireless link. The conventional link indicators like RSSI (received signal strength indicator) and SNR (signal to noise ratio) cannot be used to directly characterize a CTC link. On the other hand, the indirect indicators like PER (packet error rate), which is adopted by many existing CTC proposals, cannot capture the short-term link behavior. As a result, the existing CTC proposals fail to keep reliable performance under dynamic channel conditions. In order to address the above challenge, we in this paper propose AdaComm, a generic framework to achieve self-adaptive CTC in dynamic channels. Instead of reactively adjusting the CTC sender, AdaComm adopts online learning mechanism to adaptively adjust the decoding model at the CTC receiver. The self-adaptive decoding model automatically learns the effective features directly from the raw received signals that are embedded with the current channel state. With the lossless channel information, AdaComm further adopts the fine tuning and full training modes to cope with the continuous and abrupt channel dynamics. We implement AdaComm and integrate it with two existing CTC approaches that respectively employ CSI (channel state information) and RSSI as the information carrier. The evaluation results demonstrate that AdaComm can significantly reduce the SER (symbol error rate) by 72.9% and 49.2%, respectively, compared with the existing approaches."}, "conf/secon/YangH019": {"title": "FoVR: Attention-based VR Streaming through Bandwidth-limited Wireless Networks.", "url": "https://doi.org/10.1109/SAHCN.2019.8824804", "year": "2019", "author": {"Songzhou Yang": "238/9450", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:Consumer Virtual Reality (VR) has been widely used in various application areas, such as entertainment and medicine. In spite of the superb immersion experience, to enable high-quality VR on untethered mobile devices remains an extremely challenging task. The high bandwidth demands of VR streaming generally overburden a conventional wireless connection, which affects the user experience and in turn limits the usability of VR in practice. In this paper, we propose FoVR, attention-based hierarchical VR streaming through bandwidth-limited wireless networks. The design of FoVR stems from the insight that human's vision is hierarchical, so that different areas in the field of view (FoV) can be served with VR content of different qualities. By exploiting the gaze tracking capacity of the VR devices, FoVR is able to accurately predict the user's attention so that the streaming of hierarchical VR can be appropriately scheduled. In this way, FoVR significantly reduces the bandwidth cost and computing cost while keeping high quality of user experience. We implement FoVR on a commercial VR device and evaluate its performance in various scenarios. The experiment results show that FoVR reduces the bandwidth cost by 88.9% and 76.2%, respectively compared to the original VR streaming and the state-of-the-art approach."}, "conf/ewsn/YuJ00G18": {"title": "Crocs: Cross-Technology Clock Synchronization for WiFi and ZigBee.", "url": "http://dl.acm.org/citation.cfm?id=3234865", "year": "2018", "author": {"Zihao Yu": "158/9996", "Chengkun Jiang": "193/6745", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Xiuzhen Guo": "188/8787"}, "abstract": ""}, "conf/icnp/JiangHJZG18": {"title": "Canon: Exploiting Channel Diversity for Reliable Parallel Decoding in Backscatter Communication.", "url": "https://doi.org/10.1109/ICNP.2018.00051", "year": "2018", "author": {"Chengkun Jiang": "193/6745", "Yuan He 0004": "11/1735-4", "Meng Jin 0002": "33/6937-2", "Xiaolong Zheng 0002": "98/3341-2", "Junchen Guo": "220/7067"}, "abstract": " Abstract:Backscatter communication, due to its low energy consumption, attract a broad range of applications. The throughput of such low-power communication is however limited. Parallel backscatter is deemed as a promising technique for improving the overall throughput by enabling concurrent transmissions of the backscattering tags. The state-of-the-art approaches for parallel backscatter assume that all the states of the collided signals are distinguishable in the In-phase and Quadrature (IQ) signal plane. In this paper, we disclose the superclustering phenomenon that makes the assumption untenable and significantly degrades the overall performance. Moreover, we observe that the indistinguishable states at different channels are not the same due to the intrinsic channel diversity. Motivated by the observation, we propose Canon, an approach that exploits the channel diversity of the backscatter tags for reliable parallel decoding. In Canon, we address two critical challenges: (i) designing the Multi-Carrier Backscatter (MCB) module to extract the collided signals simultaneously from multiple channels, (ii) designing the Multi-Channel Cluster Union (MCCU) algorithm to distinguish each state of the collided signals. The experiments demonstrate that Canon can achieve over 10 times higher throughput than the state-of-the-art approaches."}, "conf/infocom/00020G18": {"title": "StripComm: Interference-Resilient Cross-Technology Communication in Coexisting Environments.", "url": "https://doi.org/10.1109/INFOCOM.2018.8486374", "year": "2018", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Yuan He 0004": "11/1735-4", "Xiuzhen Guo": "188/8787"}, "abstract": " Abstract:Cross- Technology Communication (CTC) is an emerging technique to enable the direct communication among different wireless technologies. A main category of the existing proposals on CTC propose to modulate packets at the sender side, and demodulate them into 1 and 0 bits at the receiver side. The performance of those proposals is likely to degrade in a densely coexisting environment. Solely judged according to the received signal strength, a symbol 0 that is modulated as packet absence is generally indistinguishable from dynamic interference. In this paper, we propose StripComm, interference-resilient CTC in coexisting environments. A sender in StripComm adopts an interference-resilient coding scheme that contains both presence and absence of packets in one symbol. The receiver strips the interference from the interested signal by exploiting the self-similarity of StripComm signals. We prototype StripComm with commercial WiFi, ZigBee devices and a software radio platform. The theoretical and experimental evaluation demonstrate that StripComm offers a data rate up to 1.1K bps with a SER (Symbol Error Rate) lower than 0.01 and a data rate of 0.89K bps even against strong interference."}, "conf/infocom/Guo00YG18": {"title": "ZIGFI: Harnessing Channel State Information for Cross-Technology Communication.", "url": "https://doi.org/10.1109/INFOCOM.2018.8486364", "year": "2018", "author": {"Xiuzhen Guo": "188/8787", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Liangcheng Yu": "227/7188", "Omprakash Gnawali": "30/3112"}, "abstract": " Abstract:Cross-technology communication (CTC) is a technique that enables direct communication among different wireless technologies. Recent works in this area have made positive progress, but high-throughput CTC from ZigBee to WiFi remains an open problem. In this paper, we propose ZigFi, a novel CTC framework that enables direct communication from ZigBee to WiFi. Without impacting the ongoing WiFi transmissions, ZigFi carefully overlaps ZigBee packets with WiFi packets. Through experiments we show that Channel State Information (CSI) of the overlapped packets can be used to convey data from ZigBee to WiFi. Based on this finding, we propose a receiver-initiated protocol and translate the decoding problem into a problem of CSI classification with Support Vector Machine. We further build a generic model through experiments, which describes the relationship between the Signal to Interference and Noise Ratio (SINR) and the symbol error rate (SER). We implement ZigFi on commercial-off-the-shelf WiFi and ZigBee devices. We evaluate the performance of ZigFi under different experimental settings. The results demonstrate that ZigFi achieves a throughput of 215.9bps, which is 18X faster than the state-of-the-art."}, "conf/infocom/ZhengHJZL18": {"title": "RED: RFID-based Eccentricity Detection for High-speed Rotating Machinery.", "url": "https://doi.org/10.1109/INFOCOM.2018.8485873", "year": "2018", "author": {"Yilun Zheng": "207/1744", "Yuan He 0004": "11/1735-4", "Meng Jin 0002": "33/6937-2", "Xiaolong Zheng 0002": "98/3341-2", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Eccentricity detection is a crucial issue for highspeed rotating machinery, which concerns the stability and safety of the machinery. Conventional techniques in industry for eccentricity detection are mainly based on measuring certain physical indicators, which are costly and hard to deploy. In this paper, we propose RED, a non-intrusive, low-cost, and realtime RFID-based eccentricity detection approach. Differing from the existing RFID-based sensing approaches, RED utilizes the temporal and phase distributions of tag readings as effective features for eccentricity detection. RED includes a Markov chain based model called RUM, which only needs a few sample readings from the tag to make a highly accurate and precise judgement. We implement RED with commercial-of-the-shelf RFID reader and tags, and evaluate its performance across various scenarios. The overall accuracy is 93.59% and the detection latency is 0.68 seconds in average."}, "conf/ipsn/JiangHZL18": {"title": "Orientation-aware RFID tracking with centimeter-level accuracy.", "url": "https://doi.org/10.1109/IPSN.2018.00057", "year": "2018", "author": {"Chengkun Jiang": "193/6745", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:RFID tracking attracts a lot of research efforts in recent years. Most of the existing approaches, however, adopt an orientation-oblivious model. When tracking a target whose orientation changes, those approaches suffer from serious accuracy degradation. In order to achieve target tracking with pervasive applicability in various scenarios, we in this paper propose OmniTrack, an orientation-aware RFID tracking approach. Our study discovers the linear relationship between the tag orientation and the phase change of the backscattered signals. Based on this finding, we propose an orientation-aware phase model to explicitly quantify the respective impact of the read-tag distance and the tags orientation. OmniTrack addresses practical challenges in tracking the location and orientation of a mobile tag. Our experimental results demonstrate that OmniTrack achieves centimeterlevel location accuracy and has significant advantages in tracking targets with varing orientations, compared to the state-of-the-art approaches."}, "conf/sensys/HeGLLZZZJWLLYJG18": {"title": "IoT for the Power Industry: Recent Advances and Future Directions with Pavatar.", "url": "https://doi.org/10.1145/3274783.3275179", "year": "2018", "author": {"Yuan He 0004": "11/1735-4", "Junchen Guo": "220/7067", "Long Liu": "82/5051", "Haozhen Liu": "228/5927", "Xinpeng Zhang": "01/3442", "Qilong Zhao": "203/2297", "Xiaolong Zheng 0002": "98/3341-2", "Meng Jin 0002": "33/6937-2", "Ting Wang": "12/2633", "Chunya Liu": "228/6000", "Yao Luo": "124/9704", "Songzhen Yang": "228/5930", "Chengkun Jiang": "193/6745", "Xiuzhen Guo": "188/8787", "Zihao Yu": "158/9996"}, "abstract": "\n\t\tThe development of Internet-of-Things (IoT) technologies in recent years brings us unprecedented opportunities for innovations in the power industry. This demo abstract introduces our research and practice with Pavatar - IoT for the power industry. Pavatar includes a series of system deployments in the core sections of Global Energy Internet (GEI), for the purposes of automatic surveillance and remote diagnosis of ultra-high-voltage converter stations (UHVCSs). Pavatar incorporates technologies like lower-power or battery-free sensing, cross-technology communication, edge computing, machine learning, and enhances the user experience with 3D virtual reality. The deployed system significantly reduces the manpower cost and enhances the operational efficiency of the UHVCS.\n\t"}, "conf/icpads/GuoHZ17": {"title": "Pangu: Towards a Software-Defined Architecture for Multi-function Wireless Sensor Networks.", "url": "https://doi.org/10.1109/ICPADS.2017.00098", "year": "2017", "author": {"Junchen Guo": "220/7067", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:Software-defined networking (SDN) is deemed as a promising direction to offer generalizability of wireless sensor networks (WSN). To introduce SDN into WSNs, however, means a series of non-trivial challenges due to the wireless and ad-hoc nature of WSNs. In this paper, we present our study towards a software-defined architecture for multi-function wireless sensor networks. Our proposal called Pangu is built upon the opportunistic routing protocol stack and introduces the concept of modality properties of sensor nodes. It enables centralized network control over a WSN while preserving the flexibility of underlying ad-hoc routing. We tackle the critical problems of the architecture design by presenting three essential components of Pangu. Moreover, we implement Pangu on a real-world testbed and evaluate it with various experiments."}, "conf/infocom/GuoZH17": {"title": "WiZig: Cross-technology energy communication over a noisy channel.", "url": "https://doi.org/10.1109/INFOCOM.2017.8057108", "year": "2017", "author": {"Xiuzhen Guo": "188/8787", "Xiaolong Zheng 0002": "98/3341-2", "Yuan He 0004": "11/1735-4"}, "abstract": " Abstract:The proliferation of loT applications drives the need of ubiquitous connections among heterogeneous wireless devices. Cross-Technology Communication (CTC) is a significant technique to directly exchange information among heterogeneous devices that follow different standards. By exploiting a side-channel like frequency, amplitude or temporal modulation, the existing works enable CTC but have limited performance under channel noise. In this paper, we propose WiZig, a novel CTC technique that employs modulation techniques in both the amplitude and temporal dimensions to optimize the throughput over a noisy channel. We establish a theoretical model of the energy communication channel to clearly understand the channel capacity. We then devise an online rate adaptation algorithm to adjust the modulation strategy according to the channel condition. Based on the theoretical model, WiZig can accurately control the number of encoded energy amplitudes and the length of a receiving window, so as to optimize the CTC throughput. We implement a prototype of WiZig on a software radio platform and a commercial ZigBee device. The evaluation show that WiZig achieves a throughput of 153.85 bps with less than 1 % symbol error rate in a real environment. The results demonstrate that WiZig realizes efficient and reliable CTC under varied channel conditions."}, "conf/sensys/DimitrovZX17": {"title": "CAMDroid: An Adaptation Framework for Android Context-Aware Multitasking.", "url": "https://doi.org/10.1145/3144730.3144740", "year": "2017", "author": {"Kouemo Ngayo Anatoli Dimitrov": "214/8281", "Xiaolong Zheng 0002": "98/3341-2", "Fu Xiao": "91/8079"}, "abstract": "\n\t\tMobile phones have become an indispensable part of our daily life. For the sake of portability and energy conservation, battery-powered mobile phones have inherent features: small screens, short sessions, single window visible at one time, and variant connectivity. These features limit the user interaction of mobile phones to the foreground application on the small screen, hindering the interaction with background applications even when using mobile multitasking. To interact with background applications, users have to call one of them into foreground first. We believe such an interaction mechanism deprive the benefit of multitasking. The background application is more like \"holding\" than \"running\" in the background because they cannot access the external resources or interact with the users. In this paper, we propose CAMDroid, an architecture that involves human status into the loop of multitasking. CAMDroid brings context-awareness into the internal mobile OS and enhances the multitasking abilities of mobile phones by providing support to the interactions between users and the background applications. Therefore, CAMDroid improves the whole system performance, compared to the traditional Android OS without context-awareness.\n\t"}, "conf/icnp/CaoWLZ16": {"title": "Chase: Taming concurrent broadcast for flooding in asynchronous duty cycle networks.", "url": "https://doi.org/10.1109/ICNP.2016.7784410", "year": "2016", "author": {"Zhichao Cao": "05/7548", "Jiliang Wang": "75/3699", "Daibo Liu": "141/1957", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:Asynchronous duty cycle is widely used for energy constraint wireless nodes to save energy. The basic flooding service in asynchronous duty cycle networks, however, is still far from efficient due to severe packet collisions and contentions. We present Chase, an efficient and fully distributed concurrent broadcast layer for flooding in asynchronous duty cycle networks. The main idea of Chase is to meet the strict signal timing and strength requirements (e.g., Capture Effect) for concurrent transmission while reducing contentions and collisions. We propose a distributed random inter-preamble packet interval adjustment approach to constructively satisfy the requirements. Even when requirements cannot be satisfied due to physical constraints (e.g., the difference of signal strength is less than a 3 dB), we propose a light-weight signal pattern recognition based approach to identify such a circumstance and extend radio-on time for packet delivery. We implement Chase in TinyOS and TelosB platform and extensively evaluate its performance. The implementation does not have any specific requirement on the hardware and can be easily extended to other platforms. The evaluation results also show that Chase can significantly improve flooding efficiency in asynchronous duty cycle networks."}, "conf/icnp/JinHZFXXC16": {"title": "Smoggy-Link: Fingerprinting interference for predictable wireless concurrency.", "url": "https://doi.org/10.1109/ICNP.2016.7784420", "year": "2016", "author": {"Meng Jin 0002": "33/6937-2", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Dingyi Fang": "80/3909", "Dan Xu 0003": "16/3823-3", "Tianzhang Xing": "02/10522", "Xiaojiang Chen": "95/10521"}, "abstract": " Abstract:Operating in unlicensed ISM bands, ZigBee devices often yield poor throughput and packet reception ratio due to the interference from ever increasing wireless devices in 2.4 GHz band. Although there have been many efforts made for interference avoidance, they come at the cost of miscellaneous overhead, which oppositely hurts channel utilization. Our empirical results show that, a specific interference is likely to have different influence on different outbound links of a ZigBee sender, which indicates the chance of concurrent transmissions. Based on this insight, we propose Smoggy-Link, a practical protocol to exploit the potential concurrency for adaptive ZigBee transmissions under harsh interference. Smoggy-Link maintains an accurate link model to describe and trace the relationship between interference and link quality of the sender's outbound links. With such a link model, Smoggy-Link can obtain fine-grained spatiotemporal link information through a low-cost interference identification method. The link information is further utilized for adaptive link selection and intelligent transmission schedule. We implement and evaluate a prototype of our approach with TinyOS and TelosB motes. The evaluation results show that Smoggy-Link has consistent improvements in both throughput and packet reception ratio under interference from various interferer."}, "conf/infocom/ZhengWSZL16": {"title": "Smokey: Ubiquitous smoking detection with commercial WiFi infrastructures.", "url": "https://doi.org/10.1109/INFOCOM.2016.7524399", "year": "2016", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Jiliang Wang": "75/3699", "Longfei Shangguan": "91/10470", "Zimu Zhou": "133/3824", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Even though indoor smoking ban is being put into practice in civilized countries, existing vision or sensor-based smoking detection methods cannot provide ubiquitous smoking detection. In this paper, we take the first attempt to build a ubiquitous passive smoking detection system, which leverages the patterns smoking leaves on WiFi signals to identify the smoking activity even in the non-line-of-sight and through-wall environments. We study the behaviors of smokers and leverage the common features to recognize the series of motions during smoking, avoiding the target-dependent training set to achieve the high accuracy. We design a foreground detection based motion acquisition method to extract the meaningful information from multiple noisy subcarriers even influenced by posture changes. Without requirements of target's compliance, we leverage the rhythmical patterns of smoking to reduce the detection false positives. We prototype Smokey with the commodity WiFi infrastructure and evaluate its performance in real environments. Experimental results show Smokey is accurate and robust in various scenarios."}, "conf/icnp/LiuHCHJZ15": {"title": "COF: Exploiting Concurrency for Low Power Opportunistic Forwarding.", "url": "https://doi.org/10.1109/ICNP.2015.13", "year": "2015", "author": {"Daibo Liu": "141/1957", "Mengshu Hou": "19/9487", "Zhichao Cao": "05/7548", "Yuan He 0004": "11/1735-4", "Xiaoyu Ji 0001": "39/1697-1", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:Due to the constraint of energy resource, the radio of sensor nodes usually works in a duty-cycled mode. Since the sleep schedules of nodes are unsynchronized, a sender has to send preambles to coordinate with its receiver(s). In such contexts, opportunistic forwarding, which takes the earliest forwarding opportunity instead of a deterministic forwarder, shows great advantage in utilizing channel resource. The multiple forwarding choices with temporal and spatial diversity increase the chance of collision tolerance in concurrent transmissions, potentially enhancing end-to-end network performance. However, the current channel contention mechanism based on collision avoidance is too conservative to exploit concurrency. To address this problem, we propose COF, a practical protocol to exploit the potential Concurrency for low power Opportunistic Forwarding. COF determines whether a node should concurrently transmit or not, by incorporating: (1) a distributed and light-weight link quality measurement scheme for concurrent transmission and (2) a synthetic method to estimate the benefit of potential concurrency opportunity. COF can be easily integrated into the conventional unsynchronized sender-initiated protocols. We evaluate COF on a 40-node testbed. The results show that COF can reduce the end-to-end delay by up to 41% and energy consumption by 18.9%, compared with the state-of-the-art opportunistic forwarding protocol."}, "conf/icpp/WangZMCLL15": {"title": "Connecting the Dots: Reconstructing Network Behavior with Individual and Lossy Logs.", "url": "https://doi.org/10.1109/ICPP.2015.26", "year": "2015", "author": {"Jiliang Wang": "75/3699", "Xiaolong Zheng 0002": "98/3341-2", "XuFei Mao": "26/775", "Zhichao Cao": "05/7548", "Daibo Liu": "141/1957", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:In distributed networks such as wireless ad hoc networks, local and lossy logs are often available on individual nodes. We propose REFILL, which analyzes lossy and unsynchronized logs collected from individual nodes and reconstructs the network behaviors. We design an inference engine based on protocol semantics to abstract states on each node. Further we leverage inherent and implicit event correlations in and between nodes to connect interference engines and analyze logs from different nodes. Based on unsynchronized and incomplete logs, REFILL can reconstruct network behavior, recover the network scenario and understand what has happened in the network. We show that the result of REFILL can be used to guide protocol design, network management, diagnosis, etc. We implement REFILL and apply it to a large-scale wireless sensor network project. REFILL provides a detailed per-packet tracing information based on event flows. We show that REFILL can reveal and verify fundamental issues, like locating packet loss positions and root causes. Further, we present implications and demonstrate how to leverage REFILL to enhance network performance."}, "conf/sensys/ShangguanZZYLH15": {"title": "ShopMiner: Mining Customer Shopping Behavior in Physical Clothing Stores with COTS RFID Devices.", "url": "https://doi.org/10.1145/2809695.2809710", "year": "2015", "author": {"Longfei Shangguan": "91/10470", "Zimu Zhou": "133/3824", "Xiaolong Zheng 0002": "98/3341-2", "Lei Yang 0025": "50/2484-25", "Yunhao Liu": "27/2403", "Jinsong Han": "96/6606"}, "abstract": "\n\t\tShopping behavior data are of great importance to understand the effectiveness of marketing and merchandising efforts. Online clothing stores are capable capturing customer shopping behavior by analyzing the click stream and customer shopping carts. Retailers with physical clothing stores, however, still lack effective methods to identify comprehensive shopping behaviors. In this paper, we show that backscatter signals of passive RFID tags can be exploited to detect and record how customers browse stores, which items of clothes they pay attention to, and which items of clothes they usually match with. The intuition is that the phase readings of tags attached on desired items will demonstrate distinct yet stable patterns in the time-series when customers look at, pick up or turn over desired items. We design ShopMiner,, a framework that harnesses these unique spatial-temporal correlations of time-series phase readings to detect comprehensive shopping behaviors. We have implemented a prototype of ShopMiner, with a COTS RFID reader and four antennas, and tested its effectiveness in two typical indoor environments. Empirical studies from two-week shopping-like data show that ShopMiner, could achieve high accuracy and efficiency in customer shopping behavior identification.\n\t"}, "conf/huc/ShangguanYZZWL14": {"title": "CrossNavi: enabling real-time crossroad navigation for the blind with commodity phones.", "url": "https://doi.org/10.1145/2632048.2632083", "year": "2014", "author": {"Longfei Shangguan": "91/10470", "Zheng Yang 0002": "59/5806-2", "Zimu Zhou": "133/3824", "Xiaolong Zheng 0002": "98/3341-2", "Chenshu Wu": "28/10471", "Yunhao Liu": "27/2403"}, "abstract": "\n\t\tCrossroad is among the most dangerous parts outside for the visually impaired people. Numerous studies have exploited navigating systems for the visually impaired community, providing services ranging from block detection, route planning to realtime localization. However, none of them have addressed the safety issue in crossroad and integrated three key factors necessary for a practical crossroad navigation system: detecting the crossroad, locating zebra patterns, and guiding the user within zebra crossing when passing the road. Our CrossNavi application responds to these needs, providing an integrated crossroad navigation service that incorporates all the essential functionalities mentioned above. The overall service is fulfilled by the collaboration of built-in sensors on commodity phones, and requires minimal human participation. We describe the technical aspects of its design, implementation, interface, and further improvements to make the system practical on a wider basis. Experimental results from three visually impaired volunteers show that the system exhibits promising behavior in both urban and rural areas.\n\t"}, "conf/sensys/ZhengCWHL14": {"title": "ZiSense: towards interference resilient duty cycling in wireless sensor networks.", "url": "https://doi.org/10.1145/2668332.2668334", "year": "2014", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Zhichao Cao": "05/7548", "Jiliang Wang": "75/3699", "Yuan He 0004": "11/1735-4", "Yunhao Liu": "27/2403"}, "abstract": "\n\t\tTo save energy, wireless sensor networks often run in a low duty cycle mode, where the radios of sensor nodes are scheduled between ON and OFF states. For nodes to communicate with each other, Low Power Listening (LPL) and Low Power Probing (LPP) are two types of rendezvous mechanisms. Nodes with LPL or LPP rely on signal strength or probe packets to detect potential transmissions, and then keep the radio-on for communications. Unfortunately, in many cases, signal strength and probe packets are susceptible to interference, resulting in undesirable radio on time when the signal strength of interference is above a threshold or a probe packet is interfered. To address the issue, we propose ZiSense, an energy efficient rendezvous mechanism which is resilient to interference. Instead of checking the signal strength or decoding the probe packets, ZiSense detects the existence of ZigBee transmissions and wakes up nodes accordingly. On sensor nodes with limited information and resource, we carefully study and extract short-term features purely from the time-domain RSSI sequence, and design a rule-based approach to efficiently identify the existence of ZigBee. We theoretically analyze the benefit of ZiSense in different environments and implement a prototype in TinyOS with TelosB motes. We examine ZiSense performance under controlled interference and office environments. The evaluation results show that, compared with state-of-the-art rendezvous mechanisms, ZiSense significantly reduces the energy consumption.\n\t"}, "conf/mass/ZhengWDHL13": {"title": "Survival of the Fittest: Data Dissemination with Selective Negotiation in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/MASS.2013.79", "year": "2013", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Jiliang Wang": "75/3699", "Wei Dong 0001": "92/748-1", "Yuan He 0004": "11/1735-4", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Data dissemination is a building block of wireless sensor networks (WSNs). In order to guarantee the reliability, many existing works rely on a negotiation scheme, making senders and receivers negotiate the schedule of transmissions through a three-way handshake procedure. According to our observation, however, negotiation incurs long dissemination time and seriously defers the network wide convergence. On the other hand, the flooding approach, which is conventionally considered to be inefficient and energy-consuming, may facilitate data dissemination if appropriately designed. This motivates us to pursue a delicate tradeoff between negotiation and flooding in the data dissemination process. In this paper, we propose SurF (Survival of the Fittest), a data dissemination protocol which selectively adopts negotiation and leverages flooding opportunistically. How to capture and utilize the opportunities when negotiation should be used is a challenging issue. SurF incorporates a time-reliability model to estimate the time efficiencies of the two schemes (flooding vs. negotiation) and dynamically selects the fittest one to facilitate the dissemination process. We implement SurF based on TinyOS 2.1.1 and evaluate its performance with 40 TelosB nodes. The results show that SurF, while retaining the dissemination reliability, reduces the dissemination time by 40% in average, compared with the state-of-the-art protocols."}, "journals/ton/WangZLM22": {"title": "PolarTracker: Attitude-Aware Channel Access for Floating Low Power Wide Area Networks.", "url": "https://doi.org/10.1109/TNET.2022.3154937", "year": "2022", "author": {"Yuting Wang": "09/8269", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Low Power Wide Area Networks (LPWAN) such as Long Range (LoRa) show great potential in emerging aquatic IoT applications. However, our deployment experience shows that the floating LPWAN suffers significant performance degradation, compared to the static terrestrial deployments. Our measurement results reveal the reason behind this is the polarization and directivity of the antenna. The dynamic attitude of a floating node incurs varying signal strength losses, which is ignored by the attitude-oblivious link model adopted in most of the existing methods. When accessing the channel at a misaligned attitude, packet errors can happen. In this paper, we propose an attitude-aware link model that explicitly quantifies the impact of node attitude on link quality. Based on the new model, we propose \nPolarTracker\n, a novel channel access method for floating LPWAN. \nPolarTracker\n tracks the node attitude alignment state and schedules the transmissions into the aligned periods with better link quality. To support concurrent access of multiple LoRa nodes, an attitude-based slotted-ALOHA protocol is proposed to reduce collision. We implement a prototype of \nPolarTracker\n on commercial LoRa platforms and extensively evaluate its performance in various real-world environments. The experimental results show that \nPolarTracker\n can efficiently improve the packet reception ratio by 50.6%, compared with ALOHA in LoRaWAN."}, "journals/tosn/ZhangGJZH22": {"title": "Link Quality Estimation of Cross-Technology Communication: The Case with Physical-Level Emulation.", "url": "https://doi.org/10.1145/3482527", "year": "2022", "author": {"Jia Zhang": "80/2266", "Xiuzhen Guo": "188/8787", "Haotian Jiang": "180/0691", "Xiaolong Zheng 0002": "98/3341-2", "Yuan He 0004": "11/1735-4"}, "abstract": "Research on cross-technology communication (CTC) has made rapid progress in recent years. While the CTC links are complex and dynamic, how to estimate the quality of a CTC link remains an open and challenging problem. Through our observation and study, we find that none of the existing approaches can be applied to estimate the link quality of CTC. Built upon the physical-level emulation, transmission over a CTC link is jointly affected by two factors: the emulation error and the channel distortion. Furthermore, the channel distortion can be modeled and observed through the signal strength and the noise strength. We, in this article, propose a new link metric called C-LQI and a joint link model that simultaneously takes into account the emulation error and the channel distortion in the In-phase and Quadrature (IQ) domain. We accurately describe the superimposed impact on the received signal. We further design a lightweight link estimation approach including two different methods to estimate C-LQI and in turn the packet reception rate (PRR) over the CTC link. We implement C-LQI and compare it with two representative link estimation approaches. The results demonstrate that C-LQI reduces the relative estimation error by 49.8% and 51.5% compared with s-PRR and EWMA, respectively."}, "journals/iotj/GuoHZYL21": {"title": "LEGO-Fi: Transmitter-Transparent CTC With Cross-Demapping.", "url": "https://doi.org/10.1109/JIOT.2021.3054669", "year": "2021", "author": {"Xiuzhen Guo": "188/8787", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Zihao Yu": "158/9996", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technique that enables direct communication across different wireless technologies. The state-of-the-art works in this area propose physical-level CTC, in which the transmitters emulate signals that follow the receiver's standard. Physical-level CTC means considerable processing complexity at the transmitter, which does not apply to the communication from a low-end transmitter to a high-end receiver. This article proposes LEGO-Fi, which supports the CTC from ZigBee to WiFi and Bluetooth to WiFi. LEGO-Fi is a transmitter-transparent CTC technique, which leaves the processing complexity solely at the receiver side and therefore, makes a critical advance toward bidirectional high-throughput CTC. The key technique inside is cross-demapping, which stems from two key technical insights: 1) a ZigBee/Bluetooth packet leaves distinguishable features when passing the WiFi modules and 2) compared to ZigBee's/Bluetooth's simple encoding and modulation schemes, the rich processing capacity of WiFi offers extra flexibility to process a ZigBee/Bluetooth packet. The evaluation results show that LEGO-Fi achieves a throughput of 213.6 Kb/s in practice, which is, respectively, 13000×, 1200×, and 7.5× faster than FreeBee, ZigFi, and SymBee, the three existing ZigBee-to-WiFi CTC approaches. For the CTC from Bluetooth to WiFi, LEGO-Fi achieves a throughput of 904.1 Kb/s."}, "journals/iotj/ZhangZWZY21": {"title": "WiCrowd: Counting the Directional Crowd With a Single Wireless Link.", "url": "https://doi.org/10.1109/JIOT.2020.3047868", "year": "2021", "author": {"Lei Zhang 0024": "64/5666-24", "Yueqiang Zhang": "126/0810", "Beibei Wang 0001": "20/3346-1", "Xiaolong Zheng 0002": "98/3341-2", "Liu Yang": "27/3367"}, "abstract": " Abstract:Wi-Fi-based crowd counting is predominant because of its noninvasive and ubiquitous advantages. However, the existing Wi-Fi-based crowd counting systems have the constraint that there is always a maximum number of people counted. In order to address this issue, a Wi-Fi-based cross-environment crowd counting system, which has the capability of both estimating the walking direction and crowd counting by only one single link, called WiCrowd is proposed. WiCrowd relaxes the restriction of people number counted and demonstrates its extraordinary robustness when the environment changes. The signal change trends of the people flow are theoretically analyzed and people flow moving direction is inferred. The unique features using the eigenvalue of the convariance matrix of amplitude and phase are derived to effectively detect prominent signal changes led by the crowd movement near LoS. By adopting the augmented feature representations, the robustness of WiCrowd is improved when the environment changes. The experimental results in a typical indoor environment demonstrate the superior performance of WiCrowd. This system achieves 87.4%, 85.8%, and 79.4% recognition accuracy for the flow movement direction estimation, respectively, and 82.4% and 81.6% of the overall cross-environment accuracy for the number of subjects counted in the people flow."}, "journals/iotj/GaoLZZM21": {"title": "Federated Sensing: Edge-Cloud Elastic Collaborative Learning for Intelligent Sensing.", "url": "https://doi.org/10.1109/JIOT.2021.3053055", "year": "2021", "author": {"Yujia Gao": "236/3081", "Liang Liu 0001": "10/6178-1", "Xiaolong Zheng 0002": "98/3341-2", "Chi Zhang": "91/195", "Huadong Ma": "04/6217"}, "abstract": " Abstract:The advancements of AI and the exponential growth of sensory data are unlocking a wave of intelligent sensing applications. To overcome the shortcoming of centralized learning and local training, Google proposes federated learning that allows users to collectively reap the benefits of shared models trained from decentralized data. However, directly applying federated learning to intelligent sensing applications faces two deficiencies: 1) omitting personalities of local models and 2) high latency. Aiming at these limitations, in this article, we propose a new framework, Federated Sensing, to enable edge-cloud elastic collaborative learning from decentralized sensory data. We design an elastic local update algorithm that can train the personalized models by setting specific updating weights for each node based on the difference between the global and local model. Our algorithm takes both the global consistency and the personalities of the local models. We further propose an n-softsync model aggregation method that significantly reduces training time by combining the synchronous and asynchronous aggregations. Extensive experiments are conducted on two real-world data sets of air quality from Beijing and Los Angeles. Compared with existing federated learning techniques, our framework improves the model performance at least by 2.61% and 18.8% in two data sets, respectively. Besides, it reduces the cloud idle time to 25.5% of the total time, which verifies the advantages of our method in terms of both model performance and training overhead."}, "journals/tmc/JiangHZL21": {"title": "OmniTrack: Orientation-Aware RFID Tracking With Centimeter-Level Accuracy.", "url": "https://doi.org/10.1109/TMC.2019.2949412", "year": "2021", "author": {"Chengkun Jiang": "193/6745", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:RFID tracking attracts a lot of research efforts in recent years. Most of the existing approaches, however, adopt an orientation-oblivious model. When tracking a target whose orientation changes, those approaches suffer from serious accuracy degradation. In order to achieve target tracking with pervasive applicability in various scenarios, in this article, we propose OmniTrack, an orientation-aware RFID tracking approach. Our study presents a generic model that discribes the linear relationship between the tag orientation and the phase change of the backscattered signals. Based on this finding, we propose an orientation-aware phase model to explicitly quantify the respective impact of the read-tag distance and the tag's orientation. OmniTrack addresses practical challenges in tracking the location and orientation of a mobile tag. Our experimental results demonstrate that OmniTrack achieves centimeter-level location accuracy and has significant advantages in tracking targets with varing orientations, compared to the state-of-the-art approaches."}, "journals/tmc/HeZJYZL21": {"title": "RED: RFID-Based Eccentricity Detection for High-Speed Rotating Machinery.", "url": "https://doi.org/10.1109/TMC.2019.2962770", "year": "2021", "author": {"Yuan He 0004": "11/1735-4", "Yilun Zheng": "207/1744", "Meng Jin 0002": "33/6937-2", "Songzhen Yang": "228/5930", "Xiaolong Zheng 0002": "98/3341-2", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Eccentricity detection is a crucial issue for high-speed rotating machinery, which concerns the stability and safety of the machinery. Conventional techniques in industry for eccentricity detection are mainly based on measuring certain physical indicators, which are costly and hard to deploy. In this paper, we propose RED, a non-intrusive, low-cost, and real-time RFID-based eccentricity detection approach. Differing from the existing RFID-based sensing approaches, RED utilizes the temporal and phase distributions of tag readings as effective features for eccentricity detection. RED includes a Markov chain based model called RUM, which only needs a few sample readings from the tag to make a highly accurate and precise judgement. The design of RED further addresses practical issues, such as parameterizing the RUM model, making it robust to dynamic and noisy environments, and considering how the doppler shift may affect our system. We implement RED with COTS RFID reader and tags, and evaluate its performance across various scenarios. The overall accuracy is 93.6 percent and the detection latency is 0.68 seconds in average."}, "journals/tmc/JinHZFXXC21": {"title": "Exploiting Interference Fingerprints for Predictable Wireless Concurrency.", "url": "https://doi.org/10.1109/TMC.2020.2978205", "year": "2021", "author": {"Meng Jin 0002": "33/6937-2", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Dingyi Fang": "80/3909", "Dan Xu 0003": "16/3823-3", "Tianzhang Xing": "02/10522", "Xiaojiang Chen": "95/10521"}, "abstract": " Abstract:Operating in unlicensed ISM bands, ZigBee devices often yield poor performance due to the interference from ever increasing wireless devices in the 2.4 GHz band. Our empirical results show that, a specific interference is likely to have different influence on different outbound links of a ZigBee sender, which indicates the chance of concurrent transmissions. Based on this insight, we propose Smoggy-Link, a practical protocol to exploit the potential concurrency for adaptive ZigBee transmissions under harsh interference. Smoggy-Link maintains an accurate link model to quantify and trace the relationship between interference and link qualities of the sender's outbound links. With such a link model, Smoggy-Link can translate low-cost interference information to the fine-grained spatiotemporal link state. The link information is further utilized for adaptive link selection and intelligent transmission schedule. We implement and evaluate a prototype of our approach with TinyOS and TelosB motes. The evaluation results show that Smoggy-Link has consistent improvements in both throughput and packet reception ratio under interference from various interferers."}, "journals/ton/XiaZLWM21": {"title": "c-Chirp: Towards Symmetric Cross-Technology Communication Over Asymmetric Channels.", "url": "https://doi.org/10.1109/TNET.2021.3061083", "year": "2021", "author": {"Dan Xia": "27/6461", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Chaoyu Wang": "239/4819", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Cross-Technology Communication (CTC) is an emerging technique that enables direct interconnection among incompatible wireless technologies. However, CTC channels are inherently asymmetric because of either the one-way nature of emulation or the asymmetric communication range caused by the asymmetric transmission power. In this paper, we focus on establishing symmetric CTC over asymmetric CTC channels. The bottleneck is the short communication range from the low-power and narrow-band technology to the high-power and wide-band technology. To compensate the inevitable distortions, we take advantage of the channel asymmetry and construct chirps in WiFi Channel State Information (CSI) to extend the communication range from ZigBee to WiFi. We build the theoretical model of CSI chirp based CTC and design c-Chirp, a novel CTC from ZigBee to WiFi. Due to channel asymmetry and discreteness, the WiFi receiver can only observe partial and distorted CSI chirps. To cope with this issue, we design a matching based chirp decoding method as well as an adaptation algorithm to reliably decode the symbols. We further extend c-Chirp to one-to-multiple concurrent transmission scenario. The evaluation results show that c-Chirp can achieve a communication range of 60m, which is 6× longer than ZigFi, an existing representative CTC from ZigBee to WiFi."}, "journals/tosn/MaCGZ21": {"title": "BOND: Exploring Hidden Bottleneck Nodes in Large-scale Wireless Sensor Networks.", "url": "https://doi.org/10.1145/3439956", "year": "2021", "author": {"Qiang Ma 0007": "m/QiangMa7", "Zhichao Cao": "05/7548", "Wei Gong 0001": "11/3249-1", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": "In a large-scale wireless sensor network, hundreds and thousands of sensors sample and forward data back to the sink periodically. In two real outdoor deployments GreenOrbs and CitySee, we observe that some bottleneck nodes strongly impact other nodes’ data collection and thus degrade the whole network performance. To figure out the importance of a node in the process of data collection, system manager is required to understand interactive behaviors among the parent and child nodes. So we present a management tool BOND (BOttleneck Node Detector), which explains the concept of Node Dependence to characterize how much a node relies on each of its parent nodes, and also models the routing process as a Hidden Markov Model and then uses a machine learning approach to learn the state transition probabilities in this model. Moreover, BOND can predict the network dataflow if some nodes are added or removed to avoid data loss and flow congestion in network redeployment. We implement BOND on real hardware and deploy it in an outdoor network system. The extensive experiments show that Node Dependence indeed help to explore the hidden bottleneck nodes in the network, and BOND infers the Node Dependence with an average accuracy of more than 85%."}, "journals/tosn/WangZLM21": {"title": "CoHop: Quantitative Correlation-based Channel Hopping for Low-power Wireless Networks.", "url": "https://doi.org/10.1145/3440248", "year": "2021", "author": {"Yuting Wang": "09/8269", "Xiaolong Zheng 0002": "98/3341-2", "Liang Liu 0001": "10/6178-1", "Huadong Ma": "04/6217"}, "abstract": "Cross-Technology Interference (CTI) badly harms the transmission reliability for low-power networks such as ZigBee at 2.4-GHz band. Though promising, channel hopping still faces challenges because the increasingly dense deployment of CTI leaves very few available channels. Selecting a good channel with the least overhead is crucial but challenging. Most of the existing works are heuristic methods that choose a channel far from the current one to avoid adjacent channels that may be correlatively interfered by CTI with a wider bandwidth such as WiFi. However, we observe that the correlated channels influenced by the same CTI source do not necessarily have the same channel qualities and even the opposite state, due to the uneven spectrum power density of CTI. Such channel opportunities are unexplored and wasted. In this article, we propose CoHop, a quantitative correlation-based channel hopping method for low-power wireless networks. We establish a quantitative model that describes the correlation of channel qualities to capture channel opportunities and calculate channel quality without probing, to reduce probing overhead. The probing sequence is optimized based on the Pearson Correlation Coefficient and the prediction-based probing algorithm. We implement CoHop on TinyOS and evaluate its performance in various environments. The experimental results show that CoHop can increase the Packet Reception Ratio by 80%, compared with existing methods."}, "journals/sensors/GavalasSCCZ20": {"title": "Wireless Systems and Networks in the IoT.", "url": "https://doi.org/10.3390/s20082279", "year": "2020", "author": {"Damianos Gavalas": "41/308", "Modestos Stavrakis": "93/5391", "Periklis Chatzimisios": "45/1358", "Zhichao Cao": "05/7548", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": ""}, "journals/tist/ZhangZZ20": {"title": "WiSign: Ubiquitous American Sign Language Recognition Using Commercial Wi-Fi Devices.", "url": "https://doi.org/10.1145/3377553", "year": "2020", "author": {"Lei Zhang 0024": "64/5666-24", "Yixiang Zhang": "83/9921", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": "In this article, we propose WiSign that recognizes the continuous sentences of American Sign Language (ASL) with existing WiFi infrastructure. Instead of identifying the individual ASL words from the manually segmented ASL sentence in existing works, WiSign can automatically segment the original channel state information (CSI) based on the power spectral density (PSD) segmentation method. WiSign constructs a five-layer Deep Belief Network (DBN) to automatically extract the features of isolated fragments, and then uses the Hidden Markov Model (HMM) with Gaussian mixture and Forward-Backward algorithm to recognize sign words. In order to further improve the accuracy, WiSign also integrates the language model N-gram, which uses the grammar rules of ASL to calibrate the recognized results of sign words. We implement a prototype of WiSign with commercial WiFi devices and evaluate its performance in real indoor environments. The results show that WiSign achieves satisfactory accuracy when recognizing ASL sentences that involve the movements of the head, arms, hands, and fingers."}, "journals/ton/GuoHZYG20": {"title": "ZigFi: Harnessing Channel State Information for Cross-Technology Communication.", "url": "https://doi.org/10.1109/TNET.2019.2962707", "year": "2020", "author": {"Xiuzhen Guo": "188/8787", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2", "Liangcheng Yu": "227/7188", "Omprakash Gnawali": "30/3112"}, "abstract": " Abstract:Cross-technology communication (CTC) is a technique that enables direct communication among different wireless technologies. Recent works in this area have made substantial progress, but CTC from ZigBee to WiFi remains an open problem. In this paper, we propose ZigFi, a novel CTC framework that enables communication from ZigBee to WiFi. ZigFi carefully overlaps ZigBee packets with WiFi packets. Through experiments we show that Channel State Information (CSI) of the overlapped packets can be used to convey data from ZigBee to WiFi. Based on this finding, we propose a receiver-initiated protocol and translate the decoding problem into a problem of CSI classification with Support Vector Machine. We further build a generic model through experiments, which describes the relationship between the Signal to Interference and Noise Ratio (SINR) and the symbol error rate (SER). Moreover, we extend ZigFi to multiple-to-one concurrent transmissions. We implement ZigFi on commercial-off-the-shelf WiFi and ZigBee devices. We evaluate the performance of ZigFi under different experimental settings. The results demonstrate that ZigFi achieves a throughput of 215.9bps, which is 18X faster than the state of the arts."}, "journals/ton/GuoHZ20": {"title": "WiZig: Cross-Technology Energy Communication Over a Noisy Channel.", "url": "https://doi.org/10.1109/TNET.2020.3013921", "year": "2020", "author": {"Xiuzhen Guo": "188/8787", "Yuan He 0004": "11/1735-4", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:The proliferation of IoT applications brings the demand of ubiquitous connections among heterogeneous wireless devices. Cross-Technology Communication (CTC) is a significant technique to directly exchange data among heterogeneous devices that follow different standards. By exploiting a side-channel like frequency, amplitude, or temporal modulation, the existing works enable CTC but have limited performance under channel noise. In this article, we propose WiZig, a novel CTC technique from WiFi to ZigBee that employs modulations in both the amplitude and temporal dimensions to optimize the throughput over a noisy channel. We establish a theoretical model of the energy communication channel to clearly understand the channel capacity. We then devise an online rate adaptation algorithm to adjust the modulation strategy according to the channel condition. Based on the theoretical model, WiZig controls the number of encoded energy amplitudes and the length of a receiving window, so as to optimize the CTC throughput. We implement a prototype of WiZig on a software radio platform and a commercial ZigBee device. The evaluation shows that WiZig achieves a throughput of 153.85bps with less than 1% symbol error rate in a real environment."}, "journals/spm/HeGZ18": {"title": "From Surveillance to Digital Twin: Challenges and Recent Advances of Signal Processing for Industrial Internet of Things.", "url": "https://doi.org/10.1109/MSP.2018.2842228", "year": "2018", "author": {"Yuan He 0004": "11/1735-4", "Junchen Guo": "220/7067", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:With the recent advances in the Internet of Things (IoT), the significance of information technologies to modern industry is upgraded from purely providing surveillance-centric functions to building a comprehensive information framework of the industrial processes. Innovative techniques and concepts emerge under such circumstances, e.g., digital twin, which essentially involves data acquisition, human-machine-product interconnection, knowledge discovery and generation, and intelligent control, etc. Signal processing techniques are crucial to the aforementioned procedures but face unprecedented challenges when they are applied in the complex industrial environments. In this article, we survey the promising industrial applications of IoT technologies and discuss the challenges and recent advances in this area. We also share our early experience with Pavatar, a real-world industrial IoT system that enables comprehensive surveillance and remote diagnosis for ultrahigh-voltage converter station (UHVCS). Potential research challenges in building such a system are also categorized and discussed to illuminate the future directions."}, "journals/tcom/ZhengCWHL17": {"title": "Interference Resilient Duty Cycling for Sensor Networks Under Co-Existing Environments.", "url": "https://doi.org/10.1109/TCOMM.2017.2692758", "year": "2017", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Zhichao Cao": "05/7548", "Jiliang Wang": "75/3699", "Yuan He 0004": "11/1735-4", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:To save energy, wireless sensor networks often run in a low-duty-cycle mode, where the radios of sensor nodes are scheduled between ON and OFF states. For nodes to communicate with each other, low power listening (LPL) and low power probing (LPP) are two types of rendezvous mechanisms. Nodes with LPL or LPP rely on signal strength or probe packets to detect potential transmissions, and then keep the radio-ON for communications. Unfortunately, in co-existing environments, signal strength and probe packets are susceptible to interference, resulting in undesirable radio ON time when the signal strength of interference is above a threshold or a probe packet is interfered. To address the issue, we propose ZiSense, a low duty cycling mechanism resilient to interference. Instead of checking the signal strength or decoding the probe packets, ZiSense detects the ZigBee signals and wakes up nodes accordingly. On sensor nodes with limited information and resource, we carefully study and extract short-term features purely from the time-domain RSSI sequence, and design a rule-based approach to efficiently identify the existence of ZigBee. We theoretically analyze the benefit of ZiSense in different environments and implement a prototype in TinyOS with TelosB motes. We examine ZiSense performance under controlled interference and office environments. The evaluation results show that, compared with the state-of-the-art rendezvous mechanisms, ZiSense significantly reduces the energy consumption."}, "journals/ton/ZhouSZYL17": {"title": "Design and Implementation of an RFID-Based Customer Shopping Behavior Mining System.", "url": "https://doi.org/10.1109/TNET.2017.2689063", "year": "2017", "author": {"Zimu Zhou": "133/3824", "Longfei Shangguan": "91/10470", "Xiaolong Zheng 0002": "98/3341-2", "Lei Yang 0025": "50/2484-25", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Shopping behavior data is of great importance in understanding the effectiveness of marketing and merchandising campaigns. Online clothing stores are capable of capturing customer shopping behavior by analyzing the click streams and customer shopping carts. Retailers with physical clothing stores, however, still lack effective methods to comprehensively identify shopping behaviors. In this paper, we show that backscatter signals of passive RFID tags can be exploited to detect and record how customers browse stores, which garments they pay attention to, and which garments they usually pair up. The intuition is that the phase readings of tags attached to items will demonstrate distinct yet stable patterns in a time-series when customers look at, pick out, or turn over desired items. We design ShopMiner, a framework that harnesses these unique spatial-temporal correlations of time-series phase readings to detect comprehensive shopping behaviors. We have implemented a prototype of ShopMiner with a COTS RFID reader and four antennas, and tested its effectiveness in two typical indoor environments. Empirical studies from two-week shopping-like data show that ShopMiner is able to identify customer shopping behaviors with high accuracy and low overhead, and is robust to interference."}, "journals/ton/CaoLWZ17": {"title": "Chase: Taming Concurrent Broadcast for Flooding in Asynchronous Duty Cycle Networks.", "url": "https://doi.org/10.1109/TNET.2017.2712671", "year": "2017", "author": {"Zhichao Cao": "05/7548", "Daibo Liu": "141/1957", "Jiliang Wang": "75/3699", "Xiaolong Zheng 0002": "98/3341-2"}, "abstract": " Abstract:Asynchronous duty cycle is widely used for energy constraint wireless nodes to save energy. The basic flooding service in asynchronous duty cycle networks, however, is still far from efficient due to severe packet collisions and contentions. We present Chase, an efficient and fully distributed concurrent broadcast layer for flooding in asynchronous duty cycle networks. The main idea of Chase is to meet the strict signal time and strength requirements (e.g., Capture Effect) for concurrent broadcast while reducing contentions and collisions. We propose a distributed random inter-preamble packet interval adjustment approach to constructively satisfy the requirements. Even when requirements cannot be satisfied due to physical constraints (e.g., the difference of signal strength is less than a 3 dB), we propose a lightweight signal pattern recognition-based approach to identify such a circumstance and extend radio-on time for packet delivery. We implement Chase in TinyOS with TelosB nodes and extensively evaluate its performance. The implementation does not have any specific requirement on the hardware and can be easily extended to other platforms. The evaluation results also show that Chase can significantly improve flooding efficiency in asynchronous duty cycle networks."}, "journals/ton/ZhengWSZL17": {"title": "Design and Implementation of a CSI-Based Ubiquitous Smoking Detection System.", "url": "https://doi.org/10.1109/TNET.2017.2752367", "year": "2017", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Jiliang Wang": "75/3699", "Longfei Shangguan": "91/10470", "Zimu Zhou": "133/3824", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:Even though indoor smoking ban is being put into practice in civilized countries, existing vision or sensor-based smoking detection methods cannot provide ubiquitous detection service. In this paper, we take the first attempt to build a ubiquitous passive smoking detection system, Smokey, which leverages the patterns smoking leaves on WiFi signal to identify the smoking activity even in the non-line-of-sight and through-wall environments. We study the behaviors of smokers and leverage the common features to recognize the series of motions during smoking, avoiding the target-dependent training set to achieve the high accuracy. We design a foreground detection-based motion acquisition method to extract the meaningful information from multiple noisy subcarriers even influenced by posture changes. Without the requirement of target's compliance, we leverage the rhythmical patterns of smoking to detect the smoking activities. We also leverage the diversity of multiple antennas to enhance the robustness of Smokey. Due to the convenience of integrating new antennas, Smokey is scalable in practice for ubiquitous smoking detection. We prototype Smokey with the commodity WiFi infrastructure and evaluate its performance in real environments. Experimental results show Smokey is accurate and robust in various scenarios."}, "journals/mis/ZhangZTXCFLGC16": {"title": "Privacy Leakage in Mobile Sensing: Your Unlock Passwords Can Be Leaked through Wireless Hotspot Functionality.", "url": "https://doi.org/10.1155/2016/8793025", "year": "2016", "author": {"Jie Zhang 0028": "84/6889-28", "Xiaolong Zheng 0002": "98/3341-2", "Zhanyong Tang": "38/7487", "Tianzhang Xing": "02/10522", "Xiaojiang Chen": "95/10521", "Dingyi Fang": "80/3909", "Rong Li": "00/3887", "Xiaoqing Gong": "03/7484", "Feng Chen 0002": "21/3047-2"}, "abstract": ""}, "journals/tc/ZhengWDHL16": {"title": "Bulk Data Dissemination in Wireless Sensor Networks: Analysis, Implications and Improvement.", "url": "https://doi.org/10.1109/TC.2015.2435778", "year": "2016", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Jiliang Wang": "75/3699", "Wei Dong 0001": "92/748-1", "Yuan He 0004": "11/1735-4", "Yunhao Liu": "27/2403"}, "abstract": " Abstract:To guarantee reliability, bulk data dissemination relies on the negotiation scheme in which senders and receivers negotiate transmission schedule through a three-way handshake procedure. However, we find negotiation incurs a long dissemination time and seriously defers the network-wide convergence. On the other hand, the flooding approach, which is conventionally considered inefficient and energy-consuming, can facilitate bulk data dissemination if appropriately incorporated. This motivates us to pursue a delicate tradeoff between negotiation and flooding in the bulk data dissemination. We propose SurF (Survival of the Fittest), a bulk data dissemination protocol which adaptively adopts negotiation and leverages flooding opportunistically. SurF incorporates a time-reliability model to estimate the time efficiencies (flooding versus negotiation) and dynamically selects the fittest one to facilitate the dissemination process. We implement SurF in TinyOS 2.1.1 and evaluate its performance with 40 TelosB nodes. The results show that SurF, while retaining the dissemination reliability, reduces the dissemination time by 40 percent in average, compared with the state-of-the-art protocols."}, "journals/jcst/ZhengW14": {"title": "A Survey on Data Dissemination in Wireless Sensor Networks.", "url": "https://doi.org/10.1007/s11390-014-1443-8", "year": "2014", "author": {"Xiaolong Zheng 0002": "98/3341-2", "Meng Wan": "53/2729"}, "abstract": "Wireless sensor networks (WSNs) have been applied in a variety of application areas. Most WSN systems, once deployed, are intended to operate unattended for a long period. During the lifetime, it is necessary to fix bugs, reconfigure system parameters, and upgrade the software in order to achieve reliable system performance. However, manually collecting all nodes back and reconfiguring through serial connections with computer is infeasible since it is labor-intensive and inconvenient due to the harsh deploying environments. Hence, data dissemination over multi-hop is desired to facilitate such tasks. This survey discusses the requirements and challenges of data dissemination in WSNs, reviews existing work, introduces some relevant techniques, presents the metrics of the performance and comparisons of the state-of-the-art work, and finally suggests the possible future directions in data dissemination studies. This survey elaborates and compares existing approaches of two categories: structure-less schemes and structure-based schemes, classified by whether or not the network structure information is used during the disseminating process. In existing literatures, different categories have definite boundary and limited analysis on the trade-off between different categories. Besides, there is no survey that discusses the emerging techniques such as Constructive Interference (CI) while these techniques have the chance to change the framework of data dissemination. In a word, even though many efforts have been made, data dissemination in WSNs still needs some more work to embrace the new techniques and improve the efficiency and practicability further."}}}