{"id": "13/174", "name": "Xiao-Rui Wang", "Article": {"conf/bmei/JinLZWZLZ17": {"title": "Research of deep sea disposable profile channel modeling.", "url": "https://doi.org/10.1109/CISP-BMEI.2017.8302135", "year": "2017", "author": {"Xiang-Yu Jin": "215/7633", "Hong-Zhi Li": "23/8579", "Mei Zhou": "51/1772", "Xiao-Rui Wang": "13/174", "Yu Zheng": "87/1585"}, "abstract": " Abstract:XCTD is the abbreviation of the Expendable Conductivity-Temperature-Depth profiler. As one of typical products of the deep-sea abandoned profiler, it had been developed successfully and rapidly in recent years. Considering the influence of cost, work environment or other factors, the transmission line uses a double-stranded enameled wire to transmit data signal in XCTD measurement system. Because of the constraint of the real-time change of channel impedance parameters and the interference of complex ocean noise, the measured data can not transfer to receiving terminal effectively. So how can we make sure that the data signal reliably transfers in the channel at high transmission frequency is one of the key problems of the development of XCTD technology. Firstly, the paper analyzes the transmission characteristic of XCTD channel by establishing the optimized circuit model of XCTD channel, then, the XCTD channel lab model is built to simulate the data transmission process of XCTD underwater measurement. And according to the frequency sweeping method, the LABVIEW platform and data acquisition card is used to get the channel amplitude frequency and phase frequency characteristics at fixed depth. Finally, the three spline interpolation algorithm is used to fit the channel transfer function, and the transmission characteristics of the channel are optimized. It provides a new solution for the research of channel characteristics and the accurate transmission of data."}, "journals/icl/ZhengGLWZ19": {"title": "Design of Algorithm for Multicarrier Modulation to Improve Transmission Performance of Inductive Coupling Temperature-Salinity-Depth Chain.", "url": "https://doi.org/10.1109/LCOMM.2019.2911676", "year": "2019", "author": {"Yu Zheng": "87/1585", "Xing-Xin Guo": "243/1038", "Hong-Zhi Li": "23/8579", "Xiao-Rui Wang": "13/174", "Xiao-Yang Zhang": "53/10027"}, "abstract": " Abstract:The inductive coupling temperature-salinity-depth chain uses seawater as a medium, where the transmission of electrical signals has multipath effect in infinite seawater. When the transmission frequency is increased, multipath delay spreads, inter code crosstalk, and selective fading of the received signals will be enhanced. In this letter, the finite-element simulation and numerical calculation are used to determine the key parameters, such as the number of paths, time delay, and channel attenuation factor. A multipath mathematical model of a long-distance inductively coupled channel based on electric current communication is established. Finally, an algorithm for multicarrier modulation, suitable for the channel, is proposed. The simulation results show that the proposed algorithm for multicarrier modulation can effectively resist multipath fading and improve system transmission performance."}, "journals/amc/LiuW12": {"title": "A convergence improvement factor and higher-order methods for solving nonlinear equations.", "url": "https://doi.org/10.1016/j.amc.2012.01.064", "year": "2012", "author": {"Xi-Lan Liu": "87/6433", "Xiao-Rui Wang": "13/174"}, "abstract": "A convergence improvement factor is introduced for solving nonlinear equations so as to increase the efficiency of iterative methods. Many well known iterative methods are covered."}, "journals/ijautcomp/ChenZQCWL12": {"title": "All-optical quantitative framework for bioluminescence tomography with non-contact measurement.", "url": "https://doi.org/10.1007/s11633-012-0618-4", "year": "2012", "author": {"Xue-Li Chen": "233/7854", "Heng Zhao": "43/5290", "Xiaochao Qu": "23/9252", "Duofang Chen": "84/9253", "Xiao-Rui Wang": "13/174", "Jimin Liang": "14/905"}, "abstract": "In this contribution, we present an all-optical quantitative framework for bioluminescence tomography with non-contact measurement. The framework is comprised of four indispensable steps: extraction of the geometrical structures of the subject, light flux reconstruction on arbitrary surface, calibration and quantification of the surface light flux and internal bioluminescence reconstruction. In particular, the geometrical structures are retrieved using a completely optical method and captured under identical viewing conditions with the bioluminescent images. As a result, the proposed framework avoids the utilization of computed tomography or magnetic resonance imaging to provide the geometrical structures. On the basis of experimental measurements, we evaluate the performance of the proposed all-optical quantitative framework using a mouse shaped phantom. Preliminary result reveals the potential and feasibility of the proposed framework for bioluminescence tomography."}, "journals/ijautcomp/HouZQCWL12": {"title": "Two-stage source reconstruction algorithm for bioluminescence tomography using hybrid FEM.", "url": "https://doi.org/10.1007/s11633-012-0638-0", "year": "2012", "author": {"Yanbin Hou": "99/9251", "Heng Zhao": "43/5290", "Xiaochao Qu": "23/9252", "Duofang Chen": "84/9253", "Xiao-Rui Wang": "13/174", "Jimin Liang": "14/905"}, "abstract": "A two-stage source reconstruction algorithm for bioluminescence tomography (BLT) is developed using hybrid finite element method (FEM). The proposed algorithm takes full advantages of linear and quadratic FEMs, which can be used to localize and quantify bioluminescent source accurately. In the first stage, a large permissible region is roughly determined and then iteratively evolved to reduce matrix dimension using efficient linear FEM. In the final stage, high-convergence quadratic FEM is applied to improve reconstruction result. Both numerical simulation and physical experiment are performed to evaluate the proposed algorithm. The relevant results demonstrate that quantitative reconstruction can be well achieved in terms of computation efficiency, source position, power density, and total power when compared with previous studies."}, "journals/jcam/LiuW11": {"title": "Modifications of higher-order convergence for solving nonlinear equations.", "url": "https://doi.org/10.1016/j.cam.2011.04.039", "year": "2011", "author": {"Xi-Lan Liu": "87/6433", "Xiao-Rui Wang": "13/174"}, "abstract": "In [Liang Fang, Guoping He, Some modifications of Newton’s method with higher-order convergence for solving nonlinear equations, J. Comput. Appl. Math. 228 (2009) 296–303], the authors pointed out that the iteration constructed in [Y.M. Ham, C.B. Chun and S.G. Lee, Some higher-order modifications of Newton’s method for solving nonlinear equations, J. Comput. Appl. Math. 222 (2008) 477–486] failed when p=2. They gave some counterexamples and obtained a modified result. However, they did not show the essential reason which leads to the incorrect result. In this paper, we shall show that reason and present more general results than the above-mentioned papers."}, "journals/inffus/YangZWL08": {"title": "A novel similarity based quality metric for image fusion.", "url": "https://doi.org/10.1016/j.inffus.2006.09.001", "year": "2008", "author": {"Cui Yang": "21/4447", "Jian-Qi Zhang": "76/3994", "Xiao-Rui Wang": "13/174", "Xin Liu": "76/1820"}, "abstract": "A novel objective quality metric for image fusion is presented. The interest of our metric lies in the fact that the redundant regions and the complementary/conflicting regions are treated respectively according to the structural similarity between the source images. The experiments show that the proposed measure is consistent with human visual evaluations and can be applied to evaluate image fusion schemes that are not performed at the same level."}}}