{"id": "10/575", "name": "Xiaoyuan Fu", "Article": {"conf/pdcat/FuWQLL17": {"title": "Tax-Based Mechanisms for Resource Scaling-Out of Stream Big Data Analytics.", "url": "https://doi.org/10.1109/PDCAT.2017.00018", "year": "2017", "author": {"Xiaoyuan Fu": "10/575", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951", "Tonghong Li": "98/4254"}, "abstract": " Abstract:Cloud-based big data platforms provide physical resources for a variety of applications to analyze all forms of data. For the stream big data analytics, a participated task always needs to scale out resources when its input data increases steeply. Typically, the resource scaling out can be achieved by increasing the parallelism degree of the platform based on the experience. However, the resource scaling-out of each task produces additional cost not only from itself but also from other competitive tasks, which brings about great challenges to ensure the efficient utilization of resources. To solve this problem systematically, we consider the resource scaling-out problem as a non-cooperative game and formulate a total cost model including a risk function and a task execution time function. The total cost of resource scaling-out reflects the influence of topology structure for the benefit of a participated task. Hence, two economic classic tax-based incentive policies: Pivotal Mechanism and Externality Mechanism are applied, to stimulate the participation of tasks. We make simulations in different scenarios including node degree and different characteristics of tasks. The simulations results show that our resource scaling-out mechanism can achieve a better performance close to social optimality."}, "journals/jsac/NingSFYQWLH22": {"title": "Following the Correct Direction: Renovating Sparsified SGD Towards Global Optimization in Distributed Edge Learning.", "url": "https://doi.org/10.1109/JSAC.2021.3118396", "year": "2022", "author": {"Wanyi Ning": "311/3670", "Haifeng Sun 0001": "00/11044-1", "Xiaoyuan Fu": "10/575", "Xiang Yang": "56/5739", "Qi Qi 0001": "80/6406-1", "Jingyu Wang 0001": "37/2749-1", "Jianxin Liao": "60/4951", "Zhu Han 0001": "83/514"}, "abstract": " Abstract:Distributed edge learning collaborates powerful edge devices to train a shared global model. Since the frequent communication between the server and workers is very expensive, it is desired to accelerate the learning process. The gradient sparsification is an efficient method that only uploads a small subset of gradient elements. However, most existing works neglect the distributed nature of local datasets, and consequently the local gradients uploaded by edge devices cannot follow the global correct optimization direction well, which results in the loss of accuracy. In this paper, we propose a new gradient sparsification with a renovating mechanism, called Global Renovating Stochastic Gradient Descent (GRSGD). GRSGD utilizes the previous-round global gradient to estimate the current global one and renovates the current zero-sparsified local gradients. It mitigates the communication overhead while making the convergence direction of training closer to the global optimization, accelerating the distributed edge learning process. We provide a theoretical convergence guarantee for our algorithm based on the non-convex assumption, which better fits most deep learning problems. With extensive experiments in PyTorch, we show that GRSGD effectively accelerates the learning process with a smaller communication cost and a faster convergence rate on most training tasks. For example, on ImageNet MnasNet, GRSGD cuts down the gradient size from 8.47MB to 2.13MB while achieving 9.6%+ higher accuracy."}, "journals/iotj/YuanFLLLY21": {"title": "GraphComm: Efficient Graph Convolutional Communication for Multiagent Cooperation.", "url": "https://doi.org/10.1109/JIOT.2021.3097947", "year": "2021", "author": {"Quan Yuan 0004": "29/5782-4", "Xiaoyuan Fu": "10/575", "Ziyan Li": "236/7682", "Guiyang Luo": "187/6958", "Jinglin Li": "45/10335", "Fangchun Yang": "06/5366"}, "abstract": " Abstract:Artificial intelligence-empowered smart things (e.g., robots, autonomous vehicles, and unmanned aerial vehicles) have been transforming the world. The “brains” of smart things can be abstracted as the agents or cybertwins residing on end devices and edge servers. The next-generation communication networks (i.e., 6G) will become the nervous system for these agents and natively support multiagent cooperation. By sharing local observations and intentions via communication channels, the agents could better understand the environments and make right decisions. Due to the limited channel bandwidth, the communication is considered as a bottleneck of multiagent cooperation. In this article, we propose a graph convolutional communication method (GraphComm) for multiagent cooperation to relive the bottleneck. Specifically, a variational information bottleneck is used to encode the observations and intentions compactly. Furthermore, a graph information bottleneck with the attention-based neighbor sampling mechanism is utilized to improve the effectiveness and robustness of the multiround communication process. The experimental results show that GraphComm can improve the effectiveness, robustness, and efficiency of communication in multiagent cooperative tasks as compared to baseline methods."}, "journals/tvt/FuYWQL20": {"title": "Performance Optimization for Blockchain-Enabled Distributed Network Function Virtualization Management and Orchestration.", "url": "https://doi.org/10.1109/TVT.2020.2985581", "year": "2020", "author": {"Xiaoyuan Fu": "10/575", "F. Richard Yu": "16/6654", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951"}, "abstract": " Abstract:Distributed network function virtualization management and orchestration (NFV-MANO) offers a flexible way to manage and orchestrate diversified network services in large-scale Internet of vehicles (IoV). However, it is challenging to manage different services and resources in distributed NFV due to the difficulties of reliable message synchronization among multiple MANO systems. Recently, blockchain technology has emerged to solve the trust and security problems for the interconnections of multiple MANO systems. Moreover, multi-access edge computing (MEC) has become a prospective paradigm shift from the centralized cloud due to its advantages of completing tasks near users. In this work, we propose a blockchain-enabled distributed NFV framework to reach consensus among multiple MANO systems where the computation tasks of the blockchain are processed with MEC. The consensus procedures of MANO systems and blockchain nodes are explained in detail and the representation of the blockchain throughput is given. The blockchain throughput is the number of transactions a blockchain system can handle per second, which is an important evaluation indicator for the performance of a blockchain system. We make decisions for the primary node selection, the MANO system selection and the edge server selection for reaching consensus. Moreover, the blockchain throughput, the processing delay of computation tasks of blockchain and operational costs are jointly considered in the problem formulation. A dueling deep reinforcement learning approach is applied to solve this problem. Simulation results show the effectiveness of the proposed scheme."}, "journals/twc/FuYWQL20": {"title": "Dynamic Service Function Chain Embedding for NFV-Enabled IoT: A Deep Reinforcement Learning Approach.", "url": "https://doi.org/10.1109/TWC.2019.2946797", "year": "2020", "author": {"Xiaoyuan Fu": "10/575", "F. Richard Yu": "16/6654", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951"}, "abstract": " Abstract:The Internet of things (IoT) is becoming more and more flexible and economical with the advancement in information and communication technologies. However, IoT networks will be ultra-dense with the explosive growth of IoT devices. Network function virtualization (NFV) emerges to provide flexible network frameworks and efficient resource management for the performance of IoT networks. In NFV-enabled IoT infrastructure, service function chain (SFC) is an ordered combination of virtual network functions (VNFs) that are related to each other based on the logic of IoT applications. However, the embedding process of SFC to IoT networks is becoming a big challenge due to the dynamic nature of IoT networks and the abundance of IoT terminals. In this paper, we decompose the complex VNFs into smaller virtual network function components (VNFCs) to make more effective decisions since VNF nodes and IoT network devices are usually heterogeneous. In addition, a deep reinforcement learning (DRL) based scheme with experience replay and target network is proposed as a solution that can efficiently handle complex and dynamic SFC embedding scenarios in IoT. Our simulations consider different types of IoT network topologies. The simulation results present the efficiency of the proposed dynamic SFC embedding scheme."}, "journals/ahswn/FuWQL19": {"title": "Incentive Mechanisms for Big Data Analytics in the Internet of Things (IoT).", "url": "https://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-45-number-1-2-2019/ahswn-45-1-p-93-115/", "year": "2019", "author": {"Xiaoyuan Fu": "10/575", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951"}, "abstract": ""}, "journals/cm/FuYWQL19": {"title": "Service Function Chain Embedding for NFV-Enabled IoT Based on Deep Reinforcement Learning.", "url": "https://doi.org/10.1109/MCOM.001.1900097", "year": "2019", "author": {"Xiaoyuan Fu": "10/575", "F. Richard Yu": "16/6654", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951"}, "abstract": " Abstract:It is challenging to efficiently manage different resources in the IoT. Recently, Network function virtualization has attracted attention because of its prospect to achieve efficient resource management for IoT. In NFV-enabled IoT infrastructure, a service function chain (SFC) is composed of an ordered set of virtual network functions (VNFs) that are connected based on the business logic of service providers. However, the inefficiency of the SFC embedding process is one major problem due to the dynamic nature of IoT networks and the abundance of IoT terminals. In this article, we decompose the complex VNFs into smaller VNF components (VNFCs) to make more effective decisions since VNF nodes and physical network devices are usually heterogeneous. In addition, a deep reinforcement learning (DRL)-based scheme with experience replay and target network is proposed as a solution that can efficiently handle complex and dynamic SFC embedding scenarios. Simulation results present the efficient performance of the proposed DRL-based dynamic SFC embedding scheme."}, "journals/grid/FuWQLL18": {"title": "Incentive Mechanisms for Resource Scaling-out Game of Stream Big Data Analytics.", "url": "https://doi.org/10.1007/s10723-018-9458-y", "year": "2018", "author": {"Xiaoyuan Fu": "10/575", "Jingyu Wang 0001": "37/2749-1", "Qi Qi 0001": "80/6406-1", "Jianxin Liao": "60/4951", "Tonghong Li": "98/4254"}, "abstract": "For stream big data analytics, a participated task always needs to scale out resources when its input data increases steeply. Typically, the resource scaling-out can be achieved by increasing the parallelism degree of the platform based on the experience. However, the resource scaling-out of each task produces additional cost not only from itself but also from other competitive tasks, which brings about great challenges to ensure the efficient utilization of resources. To solve it systematically, we consider the resource scaling-out as a non-cooperative game and formulate a total cost model including a risk function and a task execution time function. The total cost of resource scaling-out reflects the influence of topology structure for the benefit of a participated task. Then we introduce the concept of price of anarchy (POA) to this game and get its upper bounds under specific conditions to describe the efficiency loss of Nash equilibrium. Hence, two economic classic tax-based incentive policies: Pivotal Mechanism and Externality Mechanism are applied, to stimulate the participation of tasks. We make simulations in different scenarios including node degree and different characteristics of tasks. The simulations results show the influence of the topological structure and interdependent relationships of tasks for resource scaling-out game in the proposed scenarios and that the incentive mechanisms can effectively improve the performance of resource scaling-out."}, "journals/jcc/ZhengMCXF97": {"title": "Topological studies on IRC paths of X+H2XH+H reactions.", "url": "https://doi.org/10.1002/(SICI)1096-987X(19970715)18:9<1167::AID-JCC5>3.0.CO;2-P", "year": "1997", "author": {"Shijun Zheng": "54/5028", "Lingpeng Meng": "27/2234", "Xinhua Cai": "11/428", "Zhenfeng Xu": "47/2979", "Xiaoyuan Fu": "10/575"}, "abstract": ""}}}