{"id": "54/3298", "name": "Xingquan Zuo", "Article": {"conf/ccoms/ZhangZXHZ21": {"title": "Base Station Network Traffic Prediction Approach Based on LMA -DeepAR.", "url": "https://doi.org/10.1109/ICCCS52626.2021.9449212", "year": "2021", "author": {"Jiachen Zhang": "99/389", "Xingquan Zuo": "54/3298", "Mingying Xu": "289/1484", "Jing Han": "90/2562", "Baisheng Zhang": "00/4111"}, "abstract": " Abstract:Accurate network traffic prediction of base station cell is very vital for the expansion and reduction of wireless devices in base station cell. The burst and uncertainty of base station cell network traffic makes the network traffic nonlinear and nonstationary, which brings challenges to the long-term prediction of network traffic. In this paper, the traffic model LMA-DeepAR for base station network is established based on DeepAR. Acordding to the distribution characteristics of network traffic, this paper proposes an artificial feature sequence calculation method based on local moving average (LMA). The feature sequence is input into DeepAR as covariant, which makes the statistical characteristics of network traffic near a period of time in the past be considered when updating parameters, and the interference of non-stationary network traffic on model training will be reduced. Experimental results show that the proposed prediction approach (LMA-DeepAR) outperforms other methods in the overall long-term prediction performance and stability of multi cell network traffic."}, "conf/cec/HuWZ19": {"title": "An Ant Colony Optimization based Approach to Adjust Public Transportation Network.", "url": "https://doi.org/10.1109/CEC.2019.8790117", "year": "2019", "author": {"Wei Hu": "52/173", "Chunlu Wang": "16/2615", "Xingquan Zuo": "54/3298"}, "abstract": " Abstract:Planning public transportation network plays an important role in improving operational efficiency and service level. There are numerous literature on the planning of public transportation network; however, most of those works aim to plan the entire network. For big cities, planning the entire network is infeasible because it is impossible to replace the existing network with a whole new one. In this paper, we propose an ant colony optimization (ACO) based approach to adjust existing bus lines in the transportation network. ACO is used to adjust the existing bus lines one by one. To make ants in ACO able to plan new bus lines similar to existing ones, some pheromone is put on the routes of existing bus lines. As we concern the performance of the entire network, an evaluation function is devised to evaluate a bus line's route found by ACO using the performance of entire network. A penalty mechanism is introduced into the approach to avoid generating infeasible bus lines. The approach is applied to problem instances in literature as well as a real-world problem. Experimental results show that the proposed method can achieve satisfactory bus lines with low transfer rate and high direct rate."}, "conf/gecco/GuoWZ19": {"title": "A genetic algorithm based column generation method for multi-depot electric bus vehicle scheduling.", "url": "https://doi.org/10.1145/3319619.3321991", "year": "2019", "author": {"Congcong Guo": "214/3257", "Chunlu Wang": "16/2615", "Xingquan Zuo": "54/3298"}, "abstract": "\n\t\tIn this paper, we study a multi-depot electric bus vehicle scheduling problem (MD-EVSP) and propose a genetic algorithm based column generation approach (GA-CG) for it. In GA-CG, a column refers to a driving plan of a vehicle. CG first generates a set of candidate columns. Then, a GA is used to select a subset of candidate columns from the column set to form the final solution. Experiments show that GA-CG can effectively solve MD-EVSP and runs much fast than branch and price algorithm.\n\t"}, "conf/gecco/GaoZBZ19": {"title": "A memetic algorithm to optimize bus timetable with unequal time intervals.", "url": "https://doi.org/10.1145/3319619.3326844", "year": "2019", "author": {"Pengfei Gao": "147/0949", "Xingquan Zuo": "54/3298", "Qiang Bian": "49/5110", "Xinchao Zhao": "53/6264"}, "abstract": "\n\t\tAn appropriate bus timetable is vital for bus enterprises to improve service quality and save operational cost. Most existing literature on bus timetable optimization divide a whole day into several periods and assume that departure time intervals are the same for each period. As passengers' flow varies over time in a period, giving the same time interval for each period cannot really meet the demand of passengers. In this paper, we study the optimization of bus timetable with unequal time intervals. Aiming at characteristics of this problem, a memetic algorithm is devised that combines a genetic algorithm with elite strategy and a local search. To handle infeasible solutions, a repair method is proposed to repair solutions that do not meet the constraint. A new metric reflecting the degree of bus carrying capability matching passengers' need is introduced. The metric together with passengers' waiting time is used to evaluate a bus timetable. Experiments show that compared to the actually used timetables, timetables optimized by the proposed approach are able to save about 4.54-12.84% cost and 11.87-37.76% passengers' waiting time.\n\t"}, "conf/swarm/ZhaoLHCZ19": {"title": "Second Order Differential Evolution for Constrained Optimization.", "url": "https://doi.org/10.1007/978-3-030-26369-0_36", "year": "2019", "author": {"Xinchao Zhao": "53/6264", "Jia Liu": "49/1245", "Junling Hao": "150/2639", "Jiaqi Chen": "24/7389", "Xingquan Zuo": "54/3298"}, "abstract": "In this paper, second order differential evolution (SODE) algorithm is considered to solve the constrained optimization problems. After offspring are generated by the second order differential evolution, the ε constrained method is chosen for selection in this paper. In order to show that second order differential vector is better than differential vector in solving constrained optimization problems, differential evolution (DE) with the ε constrained method is used for performance comparison. The experiments on 12 test functions from IEEE CEC 2006 demonstrate that second order differential evolution shows better or at least competitive performance against DE when dealing with constrained optimization problems.\nKeywordsConstrained optimizationEvolutionary algorithmDifferential evolutionSODE"}, "conf/bic-ta/QiuZ18": {"title": "Barebones Particle Swarm Optimization with a Neighborhood Search Strategy for Feature Selection.", "url": "https://doi.org/10.1007/978-981-13-2829-9_5", "year": "2018", "author": {"Chenye Qiu": "08/10014", "Xingquan Zuo": "54/3298"}, "abstract": "Feature selection is a vital step in many machine learning and data mining tasks. Feature selection can reduce the dimensionality, speed up the learning process, and improve the performance of the learning models. Most of the existing feature selection methods try to find the best feature subset according to a pre-defined feature evaluation criterion. However, in many real-world datasets, there may exist many global or local optimal feature subsets, especially in the high-dimensional datasets. Classical feature selection methods can only obtain one optimal feature subset in a run of the algorithm and they cannot locate multiple optimal solutions. Therefore, this paper considers feature selection as a multimodal optimization problem and proposes a novel feature selection method which integrates the barebones particle swarm optimization (BBPSO) and a neighborhood search strategy. BBPSO is a simple but powerful variant of PSO. The neighborhood search strategy can form several steady sub-swarms in the population and each sub-swarm aims at finding one optimal feature subset. The proposed approach is compared with four PSO based feature selection methods on eight UCI datasets. Experimental results show that the proposed approach can produce superior feature subsets over the comparative methods.KeywordsFeature selectionMultimodal optimizationBarebones particle swarm optimizationNeighborhood search strategy"}, "conf/bic-ta/ShiWZZ18": {"title": "A Multiobjective Genetic Algorithm Based Dynamic Bus Vehicle Scheduling Approach.", "url": "https://doi.org/10.1007/978-981-13-2829-9_15", "year": "2018", "author": {"Hongyi Shi": "81/887", "Chunlu Wang": "16/2615", "Xingquan Zuo": "54/3298", "Xinchao Zhao": "53/6264"}, "abstract": "Bus vehicle scheduling is very vital for bus companies to reduce operation cost and guarantee quality of service. Urban roads are easily blocked due to bad weather, such that it is significant to study the bus vehicle scheduling problem under traffic congestion caused by bad weather. In this paper, a dynamic bus vehicle scheduling approach is proposed, which consists of two parts: (1) generate a set of candidate vehicle blocks once the road is blocked; (2) adopt the non-dominated sorting genetic algorithm combined with a departure time adjusting process to select a subset of vehicle blocks from the candidate blocks set to form a vehicle scheduling scheme. Experiments show that our approach can significantly improve quality of service compared to the manual vehicle scheduling scheme.KeywordsBus vehicle schedulingDynamic vehicle schedulingMulti-objective genetic algorithmUrban bus scheduling"}, "conf/bic-ta/WanZS18": {"title": "A Decomposition Based Multiobjective Evolutionary Algorithm for Dynamic Overlapping Community Detection.", "url": "https://doi.org/10.1007/978-981-13-2829-9_31", "year": "2018", "author": {"Xing Wan": "08/4578", "Xingquan Zuo": "54/3298", "Feng Song": "33/10218"}, "abstract": "Dynamic and overlapping are common features of community structures of many real world complex networks. There are few studies on detecting dynamic overlapping communities, but those studies consider only single optimization objective. In practice, it is necessary to evaluate the community detection by multiple metrics to reflect different aspects of a community structure. In this paper, we propose a multi-objective evolutionary algorithm based approach for the problem of dynamic overlapping community detection, with consideration of three optimization objectives: partition density (D), the extended modularity (EQ), and the community smoothing (NMILFK). The dynamic overlapping network is regarded as a set of network snapshots. The multi-objective evolutionary algorithm based on decomposition (MOEA/D) is used to detect the communities for each snapshot. Experiments show that our approach can find uniformly distributed Pareto solutions for the problem and outperforms those comparative approaches.KeywordsMulti-objective evolutionaryCommunity detectionOverlappingDynamic"}, "conf/case/YuZZW18": {"title": "Hybridizing tabu search with mathematical programming for solving a single row layout problem.", "url": "https://doi.org/10.1109/COASE.2018.8560503", "year": "2018", "author": {"Meng Yu": "13/2440", "Xingquan Zuo": "54/3298", "Xinchao Zhao": "53/6264", "Chunlu Wang": "16/2615"}, "abstract": " Abstract:Single row layout problem is widely implemented in manufacturing systems. In this paper, we study a single row layout problem with consideration of additional clearances between adjacent facilities. The additional clearance is used to store work in process and allow technician access to the side of the facility and may be shared by any two adjacent facilities. A hybrid solution approach that integrates a tabu search with a mathematical programming is proposed to address it. The purpose of tabu search is to optimize the sequence of facilities and mathematical programming is used to find the optimal additional clearances. The hybrid approach is applied to a number of problem instances involving a range of facilities. Experimental results show that the hybrid approach can find the optimal solutions for most of small-size problem instances and good quality solutions for large-size problem instances."}, "conf/icnc/ZhaoLCCGZ18": {"title": "Inner Product Based Particle Swarm Optimization.", "url": "https://doi.org/10.1109/FSKD.2018.8686896", "year": "2018", "author": {"Xinchao Zhao": "53/6264", "Jia Liu": "49/1245", "Jiaqi Chen": "24/7389", "Min Chen": "50/6996", "Sai Guo": "204/8240", "Xingquan Zuo": "54/3298"}, "abstract": " Abstract:Standard Particle Swarm Optimization (SPSO)is a well-known and very competitive swarm optimization approach, which is designed by Particle Swarm Central. In all PSO variants, the relative position relation between the individual and the global optimal position has important influences on the performance of algorithms. In this paper, an alternative Standard Particle Swarm Optimization (SPSO 2007)is proposed, which is based on the inner product of difference vectors. One particle will confuse which solution it should learn from when the global best and the personal best positions have comparable attractions to different directions during its velocity updating process. Even the oscillation phenomenon will appear that the global best solution draws the particle close to it at one generation and the personal best solution draws the particle back to it at next generation. In order to overcome this phenomenon particle adopts different velocity update strategies when the angle between difference vectors is either acute or obtuse of two directions in this paper. Two difference vectors refer to the current particle to the global and the personal best solutions. The vector level and the component level inner product based PSOs are proposed, denoted as IPSPSO2007V and IPSPSO2007C respectively. They are analyzed firstly and then compared with SPSO2007 with IEEE CEC2015 benchmarks, which indicate that two inner product based PSOs show promising performance."}, "conf/bic-ta/LiZWZ17": {"title": "A Recommendation Approach Based on Latent Factors Prediction of Recurrent Neural Network.", "url": "https://doi.org/10.1007/978-981-10-7179-9_34", "year": "2017", "author": {"Ruihong Li": "90/3204", "Xingquan Zuo": "54/3298", "Pan Wang": "36/3184", "Xinchao Zhao": "53/6264"}, "abstract": "Recommender systems have received much attention due to their wide applications. Current recommender approaches typically recommend items to user based on the rating prediction. However, the predicted ratings cannot truly reflect users interests on items because the rating prediction is usually based on history data and does not consider the effect of time factor on uses interests (behaviors). In this paper, we propose a recommendation approach combining the matrix factorization and a recurrent neural network. In this approach, all the items rated by a user are considered as time series data. The matrix factorization is used to obtain latent vectors of those items. The recurrent neural network is taken as a time series prediction model and trained by the latent vectors of historical items, and then the trained model is used to predict the latent vector of the item to be recommended. Finally, a recommendation list is formed by mapping the latent vector into a set of items. Experimental results show that the proposed approach is able to produce an effective recommend list and outperforms those comparative approaches.KeywordsRecommender systemsMatrix factorizationRecurrent neural networkLatent factor"}, "conf/seal/XuLZZ17": {"title": "Conservatism and Adventurism in Particle Swarm Optimization Algorithm.", "url": "https://doi.org/10.1007/978-3-319-68759-9_84", "year": "2017", "author": {"Guangzhi Xu": "59/9588", "Rui Li 0043": "96/4282-43", "Xinchao Zhao": "53/6264", "Xingquan Zuo": "54/3298"}, "abstract": "Particle Swarm Optimization (PSO) is a widely used optimization algorithm in industrial and academic fields. In this paper, three improved PSO variants are proposed. The main ideas of them are that a coefficient v is added to control the velocity augment of particles to the new position on different dimension. The first one is under the guidance of conservatism which is an inspiration of Differential Evolution (DE), namely, particles preserve more information from their previous positions and move in a smaller search space. This algorithm shows that particles are possible to escape from the current neighborhood and for promising search area if they take more previous information. The second one is guided by adventurism for better exploration, which means a larger search space to particles. The third one can be considered as a compromise between conservatism and adventurism. This algorithm shows that a balanced cooperation with a little conservative in more adventures will make PSO more competitive. Experimental results show that the proposed strategies of all the three algorithms are effective based on CEC2015 benchmarks. All of them are better than the traditional PSOs and the third improved variant performs better than all the other competitors.KeywordsConservatism principleAdventurism principleCompromise principleParticle swarm optimization"}, "conf/ssci/WangZGLZL17": {"title": "A multiobjective genetic algorithm based hybrid recommendation approach.", "url": "https://doi.org/10.1109/SSCI.2017.8285336", "year": "2017", "author": {"Pan Wang": "36/3184", "Xingquan Zuo": "54/3298", "Congcong Guo": "214/3257", "Ruihong Li": "90/3204", "Xinchao Zhao": "53/6264", "Chaomin Luo": "84/5963"}, "abstract": " Abstract:Personalized recommendation approaches have received much attention over the years. In this paper, we propose a hybrid recommendation approach that integrates an item-based collaborative filtering, a user-based collaborative filtering and a matrix factorization method. The approach considers the two objectives of recommendation's accuracy and diversity simultaneously. First, a set of items is created separately by each of the three methods. Then, items produced by the three methods are combined into a set of candidate items. Finally, a multiobjective genetic algorithm is adopted to choose a set of Pareto recommendation lists from the set. Experimental results show that the proposed approach is very effective and is able to produce better Pareto solutions than those comparative approaches."}, "conf/swarm/ZhaoLZT17": {"title": "Elite-Leading Fireworks Algorithm.", "url": "https://doi.org/10.1007/978-3-319-61824-1_54", "year": "2017", "author": {"Xinchao Zhao": "53/6264", "Rui Li 0043": "96/4282-43", "Xingquan Zuo": "54/3298", "Ying Tan 0002": "68/6102-2"}, "abstract": "Fireworks algorithm (FWA) is effective to solve optimization problems as a swarm intelligence algorithm. In this paper, the elite-leading fireworks algorithm (ELFWA) is proposed based on dynamic search in fireworks algorithm (dynFWA), which is an important improvement of FWA. In dynFWA firework is separated to two group: core-firework (CF) and non-core fireworks (non-CFs). This paper takes some beneficial information from non-CFs to reinforce the local search effect of CF. Random reinitialization and elite-leading operator are used to maintain the diversity of the non-CFs, which play an important role in global search. Based on the CEC2015 benchmark functions suite, ELFWA has a very competitive performance when comparing with state-of-the-art fireworks algorithms, such as dynFWA, dynFWACM and eddynFWA.KeywordsFireworks algorithmElite-leading operatorRandom reinitialization"}, "conf/bic-ta/ZhaoLZLL16": {"title": "Differential Evolution Algorithm with the Second Order Difference Vector.", "url": "https://doi.org/10.1007/978-981-10-3614-9_27", "year": "2016", "author": {"Xinchao Zhao": "53/6264", "Dongyue Liu": "187/9497", "Xingquan Zuo": "54/3298", "Huiping Liu": "32/4712", "Rui Li 0043": "96/4282-43"}, "abstract": "DE is challenging to maintain a balance between exploration and exploitation behaviors, and also the neighborhood and direction information of the difference vector is not completely utilized. In this paper, a completely novel DE variant, SODE, is proposed with the second order difference information, which is introduced to DE for even more fully utilizing the heuristic direction information. The second order difference information also enriches the neighborhood structure and enlarges the neighborhood domain with more heuristic information. Preliminary experimental results show that SODE is better than, or at least comparable to, the classical first order DE algorithms in terms of convergence performance and accuracy.KeywordsDifferential evolutionSecond order DEDifference vector"}, "conf/cec/ZhaoLLAZ16": {"title": "New modified bare-bones particle swarm optimization.", "url": "https://doi.org/10.1109/CEC.2016.7743824", "year": "2016", "author": {"Xinchao Zhao": "53/6264", "Huiping Liu": "32/4712", "Dongyue Liu": "187/9497", "Wenbao Ai": "65/7261", "Xingquan Zuo": "54/3298"}, "abstract": " Abstract:Bare-bones Particle Swarm Optimization (BPSO) is a simplified PSO variant, which has shown potential performance on many multimodal optimization problems. However, BPSO is also possible to be trapped into local optima for high-dimensional and complicated optimization problems. In order to enhance the performance of BPSO, this paper presents a modified BPSO, called NMBPSO. It combined the ideas of the traditional PSO and a modified BPSO to improve the capacity of balancing exploration and exploitation during the search process. To verify the effect and benefit of the proposed algorithm, a set of well known benchmark functions are employed and compared against some competitive PSO variants. Experiment results indicate that NMBPSO performs better than the traditional PSO, BPSO and a modified BPSO algorithm."}, "conf/cec/MaZHGWZ16": {"title": "A MOEA/D based approach for hospital department layout design.", "url": "https://doi.org/10.1109/CEC.2016.7743872", "year": "2016", "author": {"Yanmei Ma": "190/2515", "Xingquan Zuo": "54/3298", "Xuewen Huang": "190/2710", "Fulai Gu": "190/2620", "Chunlu Wang": "16/2615", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:Although there exist numerous literatures on facility layout in manufacturing systems, studies on department layout in hospitals are relatively scarce. In this paper, we proposed a MOEA/D based approach for a hospital department layout problem, where three objectives are simultaneously optimized, namely patient flow cost, the closeness of departments and rearrangement cost. A constraint handling technology is introduced to deal with infeasible solutions. Experiments show that the proposed approach is able to get satisfactory Pareto solutions with lower patients' flow cost and the closeness compared to the original layout, and that the optimized layouts decrease the patients' move time, thereby improving quality of service."}, "conf/swarm/XuZLZ16": {"title": "Predicting Virtual Machine's Power via a RBF Neural Network.", "url": "https://doi.org/10.1007/978-3-319-41009-8_40", "year": "2016", "author": {"Hao Xu": "43/6008", "Xingquan Zuo": "54/3298", "Chuanyi Liu": "18/4018", "Xinchao Zhao": "53/6264"}, "abstract": "Data centers are growing rapidly in recent years. Data centers consume a huge amount of power, therefore how to save power is a key issue. Accurately predicting the power of virtual machine (VM) is significant to schedule VMs in different physical machines (PMs) to save power. Current researches rarely consider the impact of workload on this prediction. This paper studies the power prediction of VM under the multi-VM environment, with consideration of the impact of PMs’ workload. A RBF neural network approach is proposed to predict the VM’s power. Experiments show that the proposed approach is effective for VM’s power prediction and can achieve average error less than 2 %, which is smaller than those of comparative models.KeywordsVirtual machineNeural networkPower prediction"}, "conf/cec/TangZWZ15": {"title": "A MOEA/D based approach for solving robust double row layout problem.", "url": "https://doi.org/10.1109/CEC.2015.7257126", "year": "2015", "author": {"Lingling Tang": "31/10049", "Xingquan Zuo": "54/3298", "Chunlu Wang": "16/2615", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:In this paper, we propose a robust double row layout problem (RDRLP), where the material flow between any two machines may vary in different periods. A MOEA/D based solution approach is proposed to solve it. First, MOEA/D is used to find a collection of non-dominated machine sequences. Then, for each found machine sequence, MOEA/D is used to produce a set of non-dominated solutions. Finally, the final set of Pareto solutions is constructed from all the produced non-dominated solutions. The crowding-distance calculation is added to the procedure of updating the elite population to make nondominated solutions distributed uniformly. An integer coding and a real-valued coding with their corresponding crossover and mutation operators are presented. This approach is applied to a number of problem instances with 10-35 facilities and 3-5 periods. Experimental results show that the approach is able to effectively solve this problem."}, "conf/cec/YuZM14": {"title": "A tabu search heuristic for the single row layout problem with shared clearances.", "url": "https://doi.org/10.1109/CEC.2014.6900353", "year": "2014", "author": {"Meng Yu": "13/2440", "Xingquan Zuo": "54/3298", "Chase C. Murray": "133/2338"}, "abstract": " Abstract:The single row layout problem is a common and well-studied practical facility layout problem. The problem seeks the arrangement of a fixed number of facilities along one row that minimizes the objective of total material handling cost. In this paper, a single row layout problem with shared clearance between facilities is proposed. The shared additional clearance may be considered on one or both sides of each facility. To solve this problem tabu search is combined with a heuristic rule to solve problems of realistic size. Tabu search is used to find the sequence of facilities while the heuristic rule is determines the additional clearance for each facility. The proposed solution approach is applied to several problem instances involving 10, 20 and 30 facilities, and is compared against a popular mathematical programming solver (CPLEX). Computational results show that our approach is able to obtain high quality solutions and outperforms CPLEX under limited computational time for problems of realistic sizes."}, "conf/cec/WangZZ14": {"title": "Solving dynamic double-row layout problem via an improved simulated annealing algorithm.", "url": "https://doi.org/10.1109/CEC.2014.6900352", "year": "2014", "author": {"Shengli Wang": "135/0300", "Xingquan Zuo": "54/3298", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:Double-row layout problem (DRLP) is a new problem proposed in 2010. Different from single or multi-row layout problems, DRLP needs to determine not only the sequence of machines on both rows but also the exact location of each machine. Aiming at the dynamic environment of product processing in practice, in this paper we study DRLP under dynamic environment and propose a dynamic double-row layout problem (DDRLP) where the material flows may change over time. A mixed-integer programming model is established for the DDRLP. An improved simulated annealing (ISA) algorithm is proposed to for this problem. To represent a feasible solution, a mixed coding scheme is suggested to express the sequence of facilities and the exact location of each facility. Five operators are devised to make the ISA able to effectively solve this problem. Experiment results show that the proposed algorithm is able to find the optimal solutions for small size problem instances and outperform an exact approach (CPLEX) under limited run time for large size instances."}, "conf/icsi/ZhaoZ14": {"title": "A Very Fast Convergent Evolutionary Algorithm for Satisfactory Solutions.", "url": "https://doi.org/10.1007/978-3-319-11857-4_29", "year": "2014", "author": {"Xinchao Zhao": "53/6264", "Xingquan Zuo": "54/3298"}, "abstract": "As we know, genetic algorithm converges slowly. It is a natural contradiction when the situation appears with expensive objective function evaluating and satisfactory solutions being adequate. In this paper, a very fast convergent evolutionary algorithm (VFEA) is proposed with inner-outer hypercone crossover, problem dependent and search status involved mutation (PdSiMu). The offsprings produced by hypercone crossover are allowed to be outside the hypercone generated by rotating the parents around their bisectrix. PdSiMu utilizes the problem and evolving information quickly. VFEA is experimentally compared with five competitors based on ten classic 30 dimensional benchmarks. Experimental results indicate that VFEA can reach the accuracy of 10− 4 − 10− 1 for all the benchmarks within 1500 function evaluations. VFEA arrives significantly better performance than all its competitors with higher solution accuracy and stronger robustness.KeywordsVery fast evolutionary algorithmhypercone crossoverPdSiMunumerical optimization"}, "conf/swarm/ZhangZ13": {"title": "Deadline Constrained Task Scheduling Based on Standard-PSO in a Hybrid Cloud.", "url": "https://doi.org/10.1007/978-3-642-38703-6_24", "year": "2013", "author": {"Guoxiang Zhang": "61/7763", "Xingquan Zuo": "54/3298"}, "abstract": "Public cloud providers provide Infrastructure as a Service (IaaS) to remote users. For IaaS providers, how to schedule tasks to meet peak demand is a big challenge. Previous researches proposed purchasing machines in advance or building cloud federation to resolve this problem. However, the former is not economic and the latter is hard to be put into practice at present. In this paper, we propose a hybrid cloud architecture, in which an IaaS provider can outsource its tasks to External Clouds (ECs) without establishing any agreement or standard when its local resources are not sufficient. The key issue is how to allocate users’ tasks to maximize its profit while guarantee QoS. The problem is formulated as a Deadline Constrained Task Scheduling (DCTS) problem which is resolved by standard particle swarm optimization (PSO), and compared with an exact approach (CPLEX). Experiment results show that Standard-PSO is very effective for this problem.KeywordsIaaS cloudtask schedulinghybrid cloudStandard-PSO"}, "conf/cec/ShuiZC12": {"title": "A cultural clonal selection algorithm based fast vehicle scheduling approach.", "url": "https://doi.org/10.1109/CEC.2012.6256624", "year": "2012", "author": {"Xinguo Shui": "117/4760", "Xingquan Zuo": "54/3298", "Cheng Chen": "10/217"}, "abstract": " Abstract:Vehicle scheduling problem is very important for public transport management of bus companies. Given a bus timetable, the problem is to assign vehicles according to the timetable to minimize some optimization objectives. In this paper, a cultural clonal selection algorithm based approach is proposed to automatically obtain a vehicle scheduling solution. Firstly a set of candidate blocks is generated using initial start times. Then a cultural clonal selection algorithm is proposed to choose the best subset of blocks from the block set as a scheduling solution. An initial start time based antibody encoding scheme is suggested, which has the advantages of short coding and low complexity of decoding. An objective function is designed to maximize the occurrences of start times in the final solution. An adjusting strategy for departure times of vehicles is designed to improve the final solution. The proposed approach is applied to a real-world vehicle scheduling problem of the Bus Company of Xi'an city in China to evaluate its effectiveness. Experimental results show that the approach can quickly generate reasonable scheduling solutions, which fulfill the practical vehicle scheduling demands."}, "conf/cec/XiaoZ12": {"title": "Multi-DEPSO: A DE and PSO based hybrid algorithm in dynamic environments.", "url": "https://doi.org/10.1109/CEC.2012.6256178", "year": "2012", "author": {"Li Xiao": "14/5505", "Xingquan Zuo": "54/3298"}, "abstract": " Abstract:A new hybrid algorithm based on Differential Evolution (DE) and Particle Swarm Optimization (PSO) is proposed in this paper for dynamic optimization problems. The multi-population strategy is used to enhance the diversity and keeps each subpopulation on a different peak, and then a hybrid operator based on DE and PSO (DEPSO) is designed to find and track the optima for each subpopulation. Using DEPSO operator, each individual in subpopulations is sequentially carried out DE and PSO operations. An exclusion scheme is proposed which integrates the distance based exclusion scheme with hill-valley function. The algorithm is applied to Moving Peaks Benchmark (MPB) problem. Experimental results show that it is significantly better in terms of averaged offline error than other state-of-the-art algorithms."}, "conf/smc/QiuWZF11": {"title": "A Bayesian regularized neural network approach to short-term traffic speed prediction.", "url": "https://doi.org/10.1109/ICSMC.2011.6084006", "year": "2011", "author": {"Chenye Qiu": "08/10014", "Chunlu Wang": "16/2615", "Xingquan Zuo": "54/3298", "Binxing Fang": "87/254"}, "abstract": " Abstract:Short term traffic speed prediction is very important in intelligent transportation systems. Neural networks have been widely used for traffic speed prediction. However, the classical neural network usually lacks satisfactory generalization ability, which usually results in an imprecise prediction of traffic speed. Regularization is an essential technique to improve the generalization ability of neural network. Regularization is realized by adding a weight decay function to the energy function of the neural network. One of the key problems of the regularization technique is how to decide the parameter of the weight decay function. In this paper, the Bayesian technique is used to optimize these regularization parameters and a Bayesian regularized neural network (BRNN) used for traffic speed prediction is proposed. The speed prediction model was validated by the real-world traffic speeds of the Hangzhou city collected from the floating car system. The experimental results show that the proposed method is able to improve the generalization ability of neural networks, and can achieve better prediction results than several traditional prediction models."}, "conf/swarm/JiaZW11": {"title": "A PSO- Based Robust Optimization Approach for Supply Chain Collaboration with Demand Uncertain.", "url": "https://doi.org/10.1007/978-3-642-21515-5_21", "year": "2011", "author": {"Yutian Jia": "10/9687", "Xingquan Zuo": "54/3298", "Jianping Wu": "82/4905"}, "abstract": "A robust optimization approach is proposed to solve the problem of supply chain collaboration under a demand uncertain environment. The proposed approach is universal and able to adapt to various demand models. First, the uncertain demand is described by a set of sampling sequences, and the total cost of supply chain is calculated based on these sequences to evaluate a collaboration scheme. Then a particle swarm optimization (PSO) is employed to find the optimal collaboration scheme which leads to a minimum total cost of supply chain. Numerical experiments show that the proposed approach can produce a robust solution that is insensible to the effect of demand uncertainty.KeywordsSupply chain collaborationRobust optimizationParticle swarm optimization"}, "conf/ijcnn/QiuZWWZ10": {"title": "An urban traffic speed fusion method based on principle component analysis and neural network.", "url": "https://doi.org/10.1109/IJCNN.2010.5596868", "year": "2010", "author": {"Chenye Qiu": "08/10014", "Xingquan Zuo": "54/3298", "Chunlu Wang": "16/2615", "Jianping Wu": "82/4905", "Tianle Zhang": "84/1905"}, "abstract": " Abstract:Real-time traffic speed is an important element for Intelligent Transportation Systems (ITS). Getting accurate road speed is very important for transportation service and management systems. Floating car system based on traces of GPS positions is an effective way to gather accurate real-time traffic speed information of a road network. But sometimes the real-time traffic speed information may get lost unexpectedly due to device faults or storage problems. In engineering practice, the historical speed is used to make up the missing real-time speed, but this method cannot estimate the missing speed accurately. Until now, to the best of our knowledge, there is no research on dealing with the missing floating car speed data. In this paper, we propose a novel urban speed fusion method based on principle component analysis (PCA) and neural network (NN) to fuse the speeds of correlated road sections to get the missing speed of the target road section. The floating car data of the Hangzhou city were used to test our method. The experimental results demonstrate that our method outperforms other methods."}, "conf/gecco/Zuo07": {"title": "Robust scheduling method based on workflow simulation model and biological immune principle.", "url": "https://doi.org/10.1145/1276958.1277001", "year": "2007", "author": {"Xingquan Zuo": "54/3298"}, "abstract": "\n\t\tA robust scheduling method is proposed to solve uncertain scheduling problems. A set of workflow simulation models is used to model the uncertain scheduling environment, and a robust scheduling scheme is obtained by an immune algorithm to make it has good performances for each model in the model set.\n\t"}, "journals/asc/WanZZ22": {"title": "A differential evolution algorithm combined with linear programming for solving a closed loop facility layout problem.", "url": "https://doi.org/10.1016/j.asoc.2022.108725", "year": "2022", "author": {"Xing Wan": "08/4578", "Xingquan Zuo": "54/3298", "Xinchao Zhao": "53/6264"}, "abstract": "Closed loop layout problem (CLLP) is an important class of design problems encountered in flexible manufacturing system. It is to determine the locations of manufacturing cells along a closed material handling loop. Existing studies on CLLPs typically ignore clearances between adjacent cells and do not optimize the dimension of the closed loop. However, separating adjacent cells with suitable clearances may achieve a better solution with lower material flow cost, and optimizing cell sequence and the dimension of closed loop simultaneously can also improve the solution quality. In this paper, a mixed integer programming formulation (MIP) is established for the CLLP. Then, based on the formulation, a hybrid approach combining an improved differential evolution algorithm and an exact approach (iDE-EA) is proposed to solve the CLLP. The iDE with a hybrid coding is utilized to optimize the dimension of closed loop and the placement sequence of cells simultaneously. The EA is to determine the exact location of each cell (i.e., the clearance between each pair of adjacent cells). iDE-EA is verified on 10 problem instances, and experiments show that iDE-EA improves upon the best-known material handling cost by 0–9.97% compared against the traditional differential evolution algorithm and three state-of-the-art approaches. In addition, using EA to further optimize clearances among cells in the solution obtained by iDE can achieve a more competitive layout in most cases."}, "journals/ijpr/WanZLZ22": {"title": "A hybrid multiobjective GRASP for a multi-row facility layout problem with extra clearances.", "url": "https://doi.org/10.1080/00207543.2020.1847342", "year": "2022", "author": {"Xing Wan": "08/4578", "Xingquan Zuo": "54/3298", "Xiaodong Li 0001": "50/3993-1", "Xinchao Zhao": "53/6264"}, "abstract": ""}, "journals/asc/WangGZ21": {"title": "Solving multi-depot electric vehicle scheduling problem by column generation and genetic algorithm.", "url": "https://doi.org/10.1016/j.asoc.2021.107774", "year": "2021", "author": {"Chunlu Wang": "16/2615", "Congcong Guo": "214/3257", "Xingquan Zuo": "54/3298"}, "abstract": "Electric vehicles are increasingly applied in bus enterprises due to their advantages of environmental protection and low cost. Although there exist many studies on fuel vehicle scheduling, there still lack studies on electric vehicle scheduling in public transit. In this paper, we study a multi-depot electric vehicle scheduling problem (MD-EVSP) in public transit and propose a genetic algorithm based column generation approach (GA-CG) for MD-EVSP. A column refers to the route of a vehicle. First, a heuristic is devised to create a set of initial columns. Then, starting from the initial columns, the column generation approach with a label correcting algorithm is used to generate a set of candidate columns. Finally, a genetic algorithm is devised to select a subset of columns from the column set to construct the final solution. A solution coding scheme is designed to represent a subset of columns, that is, a candidate solution to MD-EVSP. An elite strategy is integrated into the genetic algorithm to improve the global search capability. GA-CG is applied to a real-world problem with three bus lines in Qingdao, China. Experiments show that compared with the branch and price (BP) algorithm and the manual scheduling scheme, GA-CG can effectively solve the problem and its computational time is about 40 times shorter than the BP algorithm."}, "journals/ieeejas/WangZ21": {"title": "An Effective Cloud Workflow Scheduling Approach Combining PSO and Idle Time Slot-Aware Rules.", "url": "https://doi.org/10.1109/JAS.2021.1003982", "year": "2021", "author": {"Yun Wang": "36/3235", "Xingquan Zuo": "54/3298"}, "abstract": " Abstract:Workflow scheduling is a key issue and remains a challenging problem in cloud computing. Faced with the large number of virtual machine (VM) types offered by cloud providers, cloud users need to choose the most appropriate VM type for each task. Multiple task scheduling sequences exist in a workflow application. Different task scheduling sequences have a significant impact on the scheduling performance. It is not easy to determine the most appropriate set of VM types for tasks and the best task scheduling sequence. Besides, the idle time slots on VM instances should be used fully to increase resources' utilization and save the execution cost of a workflow. This paper considers these three aspects simultaneously and proposes a cloud workflow scheduling approach which combines particle swarm optimization (PSO) and idle time slot-aware rules, to minimize the execution cost of a workflow application under a deadline constraint. A new particle encoding is devised to represent the VM type required by each task and the scheduling sequence of tasks. An idle time slot-aware decoding procedure is proposed to decode a particle into a scheduling solution. To handle tasks' invalid priorities caused by the randomness of PSO, a repair method is used to repair those priorities to produce valid task scheduling sequences. The proposed approach is compared with state-of-the-art cloud workflow scheduling algorithms. Experiments show that the proposed approach outperforms the comparative algorithms in terms of both of the execution cost and the success rate in meeting the deadline."}, "journals/kbs/LiZZYY21": {"title": "Memetic algorithm with non-smooth penalty for capacitated arc routing problem.", "url": "https://doi.org/10.1016/j.knosys.2021.106957", "year": "2021", "author": {"Rui Li 0043": "96/4282-43", "Xinchao Zhao": "53/6264", "Xingquan Zuo": "54/3298", "Jianmei Yuan": "293/2555", "Xin Yao": "202/9077"}, "abstract": "The capacitated arc routing problem (CARP) has attracted much attention during last decades due to its wide applications. However, the existing research methods still have a little potential to make full use of the characteristics of CARP. This paper aims to mine the essential characteristics of arc routing problem that node routing problem does not have. Based on the observation on characteristics of arc routing instances, smooth condition is proposed and constructed as a rule to divide the link between two tasks into smooth link and non-smooth link. Then smooth degree is defined to measure the influence of non-smooth links on solution and a small smooth degree means the better quality for a solution. The effect of smooth degree is verified through simulation comparison on several instance sets, which indicates that there is a positive correlation between smooth degree and the total cost of a solution. Non-smooth penalty is used to drive the non-smooth solution to smooth and to improve its total cost. Then non-smooth penalty is inserted into path-scanning variants and new construction algorithms are obtained. A partial reconstruction method (PRM) is designed using these construction algorithms as an alternative kernel method. In order to further reduce the routes number, a reinsert method (RiM) is proposed. Combining these two methods with traditional local search algorithms, a memetic algorithm with non-smooth penalty (MANSP) is proposed which is originated from the initial observation on the essential characteristics of arc routing problem. Extensive experiments on smooth degree, penalty factor, and comparison with state-of-the-art algorithms show that the proposed strategies are effective and the proposed algorithm MANSP performs very competitive."}, "journals/soco/ZhaoFHZZ21": {"title": "Neighborhood opposition-based differential evolution with Gaussian perturbation.", "url": "https://doi.org/10.1007/s00500-020-05425-2", "year": "2021", "author": {"Xinchao Zhao": "53/6264", "Shuai Feng": "77/5196", "Junling Hao": "150/2639", "Xingquan Zuo": "54/3298", "Yong Zhang 0016": "66/4615-16"}, "abstract": "Opposition-based learning (OBL) is an effective strategy to enhance many optimization methods among which opposition-based differential evolution (ODE) is one of the successful variants. However, ODE is a strict point-to-point algorithm, which may cause those opposite solutions to be ignored who are close to, however, have a gap to more promising solutions in the neighborhood. It usually provides a relatively narrow search channel for the candidate solutions and cannot maintain well population diversity. Hence, it is necessary to broaden the search neighborhood of the opposite solutions to increase the possibility of seeking out an even better solution. Thus, a new approach, GODE, is proposed to implement a Gaussian perturbation operation around the opposite point to expand its search neighborhood. Three different self-adaptive standard deviation models are then proposed and compared in the Gaussian perturbation strategy. Subsequently, a multi-stage perturbation strategy with different sized neighborhood is adopted to balance exploration and exploitation during different evolutionary stages. GODE is firstly compared with DE and ODE on CEC2014 benchmark suite with dimension of 30, 50 and 100. Many recent state-of-the-art algorithms using OBL strategy are further conducted comparison with GODE. The experimental results and statistical comparison analysis demonstrated that GODE has better or equal competitive performance against the classical and recent competitors."}, "journals/tcyb/ZuoLZLWZ21": {"title": "MOEA/D With Linear Programming for Double Row Layout Problem With Center-Islands.", "url": "https://doi.org/10.1109/TCYB.2019.2937115", "year": "2021", "author": {"Xingquan Zuo": "54/3298", "Xueqing Liu": "92/1399", "Qingfu Zhang 0001": "98/1240", "Weiping Li": "77/4748", "Xing Wan": "08/4578", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:Facility layout problems (FLPs) in hospitals are typically to arrange facilities or rooms along both sides of a corridor to minimize some objectives. In a hospital, very often there are center-islands to decrease the flow cost among facilities or rooms. However, these islands have not been considered before. In this article, we propose an FLP with center-islands that involves two parallel rows and center-islands. A mixed-integer program formulation is established for modeling it. A methodology for combining a multiobjective evolutionary algorithm based on decomposition (MOEA/D) and linear program is proposed to solve this problem. MOEA/D optimizes the sequence of facilities on two rows and center-islands while the linear program is embedded into MOEA/D to optimize the exact locations of center-islands. A tabu search with a local search is also integrated into MOEA/D to enhance its search capability. Experiments show that our proposed methodology can effectively solve the problem."}, "journals/tits/LuoZKYLZMZ21": {"title": "Fine-Grained Service-Level Passenger Flow Prediction for Bus Transit Systems Based on Multitask Deep Learning.", "url": "https://doi.org/10.1109/TITS.2020.3002772", "year": "2021", "author": {"Dan Luo": "03/142", "Dong Zhao 0001": "63/550-1", "Qixue Ke": "237/5325", "Xiaoyong You": "305/5781", "Liang Liu 0001": "10/6178-1", "Desheng Zhang": "15/8612", "Huadong Ma": "04/6217", "Xingquan Zuo": "54/3298"}, "abstract": " Abstract:Bus services play a crucial role in urban transit. It is significant to achieve the fine-grained service-level passenger flow prediction (SPFP), namely to predict the total number of passengers for each service of each bus line passing through each station during the next short-term interval. However, it faces great challenges due to complex factors including inter-station and inter-line spatial dependencies, intra-station and inter-service temporal dependencies, and internal/external influences. To address these challenges, we propose a multitask deep-learning (MDL) approach, called \nMDL-SPFP\n, to jointly predict the arriving bus service flow, line-level on-board passenger flow and line-level boarding/alighting passenger flow by leveraging well-designed deep neural networks called \nARM\n. The MDL framework can mutually reinforce the prediction of each type of flow, and finally integrate the outputs to achieve the fine-grained service-level prediction. The ARM network combines three modules, Attention mechanism, Residual block and Multi-scale convolution, to well capture various complex non-linear spatio-temporal dependencies and influence factors. Extensive experiments based on a large-scale realistic bus operation dataset are conducted to confirm that our MDL-SPFP approach outperforms 10 state-of-the-art baselines, and improves 22.39% accuracy than the best baseline."}, "journals/corr/abs-2103-14362": {"title": "Base Station Network Traffic Prediction Approach Based on LMA-DeepAR.", "url": "https://arxiv.org/abs/2103.14362", "year": "2021", "author": {"Jiachen Zhang": "99/389", "Xingquan Zuo": "54/3298", "Mingying Xu": "289/1484", "Jing Han": "90/2562", "Baisheng Zhang": "00/4111"}, "abstract": "\n      Abstract:  Accurate network traffic prediction of base station cell is very vital for\nthe expansion and reduction of wireless devices in base station cell. The burst\nand uncertainty of base station cell network traffic makes the network traffic\nnonlinear and non-stationary, which brings challenges to the long-term\nprediction of network traffic. In this paper, the traffic model LMA-DeepAR for\nbase station network is established based on DeepAR. Acordding to the\ndistribution characteristics of network traffic, this paper proposes an\nartificial feature sequence calculation method based on local moving average\n(LMA). The feature sequence is input into DeepAR as covariant, which makes the\nstatistical characteristics of network traffic near a period of time in the\npast be considered when updating parameters, and the interference of\nnon-stationary network traffic on model training will be reduced. Experimental\nresults show that the proposed prediction approach (LMA-DeepAR) outperforms\nother methods in the overall long-term prediction performance and stability of\nmulti cell network traffic.\n\n    "}, "journals/corr/abs-2107-07066": {"title": "Deep Reinforcement Learning based Dynamic Optimization of Bus Timetable.", "url": "https://arxiv.org/abs/2107.07066", "year": "2021", "author": {"Guanqun Ai": "297/4528", "Xingquan Zuo": "54/3298", "Gang chen": "297/4810", "Binglin Wu": "195/7481"}, "abstract": "\n      Abstract:  Bus timetable optimization is a key issue to reduce operational cost of bus\ncompanies and improve the service quality. Existing methods use exact or\nheuristic algorithms to optimize the timetable in an offline manner. In\npractice, the passenger flow may change significantly over time. Timetables\ndetermined in offline cannot adjust the departure interval to satisfy the\nchanged passenger flow. Aiming at improving the online performance of bus\ntimetable, we propose a Deep Reinforcement Learning based bus Timetable dynamic\nOptimization method (DRL-TO). In this method, the timetable optimization is\nconsidered as a sequential decision problem. A Deep Q-Network (DQN) is employed\nas the decision model to determine whether to dispatch a bus service during\neach minute of the service period. Therefore, the departure intervals of bus\nservices are determined in real time in accordance with passenger demand. We\nidentify several new and useful state features for the DQN, including the load\nfactor, carrying capacity utilization rate, and the number of stranding\npassengers. Taking into account both the interests of the bus company and\npassengers, a reward function is designed, which includes the indicators of\nfull load rate, empty load rate, passengers' waiting time, and the number of\nstranding passengers. Building on an existing method for calculating the\ncarrying capacity, we develop a new technique to enhance the matching degree at\neach bus station. Experiments demonstrate that compared with the timetable\ngenerated by the state-of-the-art bus timetable optimization approach based on\na memetic algorithm (BTOA-MA), Genetic Algorithm (GA) and the manual method,\nDRL-TO can dynamically determine the departure intervals based on the real-time\npassenger flow, saving 8$\\%$ of vehicles and reducing 17$\\%$ of passengers'\nwaiting time on average.\n\n    "}, "journals/evi/ZhaoGZP20": {"title": "Guest editorial on S.I.: Bio-inspired computing: theories and application.", "url": "https://doi.org/10.1007/s12065-020-00369-w", "year": "2020", "author": {"Xinchao Zhao": "53/6264", "Maoguo Gong": "80/3438", "Xingquan Zuo": "54/3298", "Linqiang Pan": "88/1941"}, "abstract": ""}, "journals/swevo/WangSZ20": {"title": "A multi-objective genetic algorithm based approach for dynamical bus vehicles scheduling under traffic congestion.", "url": "https://doi.org/10.1016/j.swevo.2020.100667", "year": "2020", "author": {"Chunlu Wang": "16/2615", "Hongyi Shi": "81/887", "Xingquan Zuo": "54/3298"}, "abstract": "Bus vehicle scheduling is very vital for bus companies to reduce operation cost and guarantee quality of service. Many big cities face the problem of traffic congestion, which leads to the planed vehicle scheduling scheme becoming infeasible. It is significant to study bus vehicle scheduling approaches under uncertain environments, such as traffic congestion. In this paper, a bus vehicle scheduling approach is proposed to handle the traffic congestion. It consists of three phases: firstly, a set of candidate vehicle blocks is generated once traffic congestion happens. Secondly, a non-dominated sorting genetic algorithm is adopted to select a subset of vehicle blocks from the set of candidate blocks to generate a set of Non-dominated solutions. Finally, a departure time adjustment procedure is applied to the Non-dominated solutions to further improve the quality of solutions. Experiments on a real-world bus line show that the proposed approach is able to dynamically generate scheduling schemes and significantly improve the quality of service compared to the comparative approaches."}, "journals/swevo/WanZS20": {"title": "Solving dynamic overlapping community detection problem by a multiobjective evolutionary algorithm based on decomposition.", "url": "https://doi.org/10.1016/j.swevo.2020.100668", "year": "2020", "author": {"Xing Wan": "08/4578", "Xingquan Zuo": "54/3298", "Feng Song": "33/10218"}, "abstract": "Dynamic and overlapping are two common features of community structures for many real world complex networks. Although there are few studies on detecting dynamic overlapping communities, all those studies only consider a single optimization objective. In practice, it is necessary to evaluate the community detection by multiple metrics to reflect different aspects of a community structure and those metrics may conflict with each other. In this paper, we propose a multi-objective approach based on decomposition for the problem of dynamic overlapping community detection, with consideration of three optimization objectives: partition density (D), extended modularity (EQ), and improved mutual information (NMILFK). The dynamic overlapping network can be regarded as a set of network snapshots. The multi-objective evolutionary algorithm based on decomposition (MOEA/D) is used to detect the communities for each snapshot. To improve the search efficiency, the dynamic optimization technique and a dynamic resource allocation strategy are introduced into the approach. Experiments show that our approach can find uniformly distributed Pareto solutions for the problem and outperforms those comparative approaches."}, "journals/caaitrit/ZhaoGZP19": {"title": "Guest Editorial: Advances in Bio-inspired Heuristics for Computing.", "url": "https://doi.org/10.1049/trit.2019.0053", "year": "2019", "author": {"Xinchao Zhao": "53/6264", "Maoguo Gong": "80/3438", "Xingquan Zuo": "54/3298", "Linqiang Pan": "88/1941"}, "abstract": ""}, "journals/caaitrit/ZhaoLZ19": {"title": "Advances on QoS-aware web service selection and composition with nature-inspired computing.", "url": "https://doi.org/10.1049/trit.2019.0018", "year": "2019", "author": {"Xinchao Zhao": "53/6264", "Rui Li 0043": "96/4282-43", "Xingquan Zuo": "54/3298"}, "abstract": ""}, "journals/tase/ZuoGZYZ19": {"title": "A Three-Stage Approach to a Multirow Parallel Machine Layout Problem.", "url": "https://doi.org/10.1109/TASE.2018.2866377", "year": "2019", "author": {"Xingquan Zuo": "54/3298", "Shubing Gao": "233/2026", "MengChu Zhou": "73/1446", "Xin Yang 0016": "44/1152-16", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:Facility layout is vital to save operational cost and enhance production efficiency. Multirow layout is a common pattern in practical manufacturing environment. Although parallel machines are frequently implemented in practice to enhance productivity, there lacks any in-depth study on multirow layout problem with parallel machines. In this paper, its mathematical programming formulation is established to minimize material flow cost. A three-stage approach is proposed to solve it. First, a Monte Carlo heuristic is devised to optimize the sequence of machines on multiple rows. Second, a linear program is used to determine the optimal exact location of each machine. Finally, an exchange heuristic is adopted to reassign material flows among parallel machines in different machine groups. An iterative optimization strategy is suggested to execute the three stages repeatedly to improve the solution quality. This approach is applied to a number of problem instances and compared against others. The experimental results show that it is able to effectively solve this new problem and significantly decrease material flow cost. Note to Practitioners-Multirow layout is common in practical manufacturing systems in which parallel machines are often used to improve productivity, shorten production time, and guarantee some flexibility. This paper studies a multirow parallel machine layout problem that involves machine groups, each of which contains parallel machines. Solving it is to locate all machines at multiple parallel rows to minimize material flow cost. It is challenging because one needs to decompose material flows and determine exact locations of machines simultaneously. A three-stage approach is proposed to do so. It is applied to many problem instances. The results demonstrate that it works well for such layout problems with parallel machines."}, "journals/tase/ZuoLHZCZL19": {"title": "Optimizing Hospital Emergency Department Layout via Multiobjective Tabu Search.", "url": "https://doi.org/10.1109/TASE.2018.2873098", "year": "2019", "author": {"Xingquan Zuo": "54/3298", "Bin Li": "89/6764", "Xuewen Huang": "190/2710", "MengChu Zhou": "73/1446", "Chunyang Cheng": "244/1912", "Xinchao Zhao": "53/6264", "Zhishuo Liu": "173/1036"}, "abstract": ""}, "journals/caaitrit/ZhaoXLZ17": {"title": "Second-order DE algorithm.", "url": "https://doi.org/10.1049/trit.2017.0006", "year": "2017", "author": {"Xinchao Zhao": "53/6264", "Guangzhi Xu": "59/9588", "Dongyue Liu": "187/9497", "Xingquan Zuo": "54/3298"}, "abstract": ""}, "journals/candie/WangJZM17": {"title": "Two-layer simulated annealing and tabu search heuristics for a vehicle routing problem with cross docks and split deliveries.", "url": "https://doi.org/10.1016/j.cie.2017.07.031", "year": "2017", "author": {"Junling Wang": "27/1438", "Arun Kumar Ranganathan Jagannathan": "206/9410", "Xingquan Zuo": "54/3298", "Chase C. Murray": "133/2338"}, "abstract": "Cross docking plays an increasingly important role in improving the efficiency of large-scale distribution networks. Unlike traditional warehouses, cross docks hold little or no inventory. Instead, goods from incoming trucks are unloaded and immediately transferred through the cross dock to outgoing trucks. Thus, cross docks serve to reduce inventory holding costs and shorten lead times from suppliers to retailers. However, to fully realize these benefits, trucks must be effectively coordinated at each cross dock. Such coordination brings a challenging extension to vehicle routing problems. In this paper a new vehicle routing problem with cross docks and split deliveries is proposed. A mixed-integer linear programming formulation is established for this problem, along with solution methodologies combining a constructive heuristic with two-layer simulated annealing and tabu search. The constructive heuristic creates a solution which is further improved by two-layer variants of simulated annealing or tabu search. The first layer optimizes the allocation of trucks to cross docks while the second layer optimizes the visitation order to suppliers and retailers for trucks assigned to each cross dock. Experimental results demonstrate that the proposed approach effectively solves large-size problems within a reasonable computational time."}, "journals/nc/ZhaoLHLZ17": {"title": "Semi-self-adaptive harmony search algorithm.", "url": "https://doi.org/10.1007/s11047-017-9614-5", "year": "2017", "author": {"Xinchao Zhao": "53/6264", "Zhaohua Liu": "88/8621", "Junling Hao": "150/2639", "Rui Li 0043": "96/4282-43", "Xingquan Zuo": "54/3298"}, "abstract": "This paper proposes a semi-self-adaptive harmony search algorithm (SSaHS) with the self-adaptive adjustment of the bandwidth and the elitist learning strategy of particle swarm optimization. SSaHS employs a self-adaptive adjusting strategy for with the difference between the maximum and minimum components in the harmony memory as the bandwidth. It can dynamically adjust the bandwidth for the specific problem to strengthen local exploitation ability and improve the accuracy of optimization results. Comparison results show that the semi-self-adaptive harmony search algorithm can find better solutions when comparing with both basic harmony search algorithm and several enhanced harmony search algorithms, including an improved harmony search, a global-best harmony search and a novel global harmony search."}, "journals/ijon/ZhaoLHZY16": {"title": "Clustering and pattern search for enhancing particle swarm optimization with Euclidean spatial neighborhood search.", "url": "https://doi.org/10.1016/j.neucom.2015.07.025", "year": "2016", "author": {"Xinchao Zhao": "53/6264", "Wenqiao Lin": "137/9708", "Junling Hao": "150/2639", "Xingquan Zuo": "54/3298", "Jianhua Yuan": "236/2882"}, "abstract": "There are many well-known particle swarm optimization (PSO) algorithms which consider ring/star/von Neumann et al. topological neighborhood and scarcely aim at Euclidean spatial neighborhood structure. k-Nearest Neighbors (k-NN) is a kind of clustering method to find the necessary representatives among a group of objects efficiently. Pattern search (PS) is a successful derivative-free coordinate search method for global optimization. All these observations inspire the innovative ideas to propose an enhanced particle swarm optimization algorithm (pkPSO). Particles efficiently explore for the promising areas and solutions with clustering on the Euclidean spatial neighborhood structure. Particle swarm continuously exploits at the just found promising areas with PS strategy at the latter stage of optimization. The cooperative effect of k-NN and PS strategies is firstly verified. Based on classical, rotated and shifted benchmarks, extensive experimental comparisons indicate that pkPSO has a competitive performance when comparing with the well-known PSO variants and other evolutionary algorithms."}, "journals/asc/ShuiZCS15": {"title": "A clonal selection algorithm for urban bus vehicle scheduling.", "url": "https://doi.org/10.1016/j.asoc.2015.07.001", "year": "2015", "author": {"Xinguo Shui": "117/4760", "Xingquan Zuo": "54/3298", "Cheng Chen": "10/217", "Alice E. Smith": "95/6081"}, "abstract": "The bus vehicle scheduling problem addresses the task of assigning vehicles to cover the trips in a timetable. In this paper, a clonal selection algorithm based vehicle scheduling approach is proposed to quickly generate satisfactory solutions for large-scale bus scheduling problems. Firstly, a set of vehicle blocks (consecutive trips by one bus) is generated based on the maximal wait time between any two adjacent trips. Then a subset of blocks is constructed by the clonal selection algorithm to produce an initial vehicle scheduling solution. Finally, two heuristics adjust the departure times of vehicles to further improve the solution. The proposed approach is evaluated using a real-world vehicle scheduling problem from the bus company of Nanjing, China. Experimental results show that the proposed approach can generate satisfactory scheduling solutions within 1 min."}, "journals/asc/WangZLZL15": {"title": "Solving dynamic double row layout problem via combining simulated annealing and mathematical programming.", "url": "https://doi.org/10.1016/j.asoc.2015.08.023", "year": "2015", "author": {"Shengli Wang": "135/0300", "Xingquan Zuo": "54/3298", "Xueqing Liu": "92/1399", "Xinchao Zhao": "53/6264", "Jianqiang Li 0002": "08/2185-2"}, "abstract": "Double row layout problem (DRLP) is to allocate facilities on two rows separated by a straight aisle. Aiming at the dynamic environment of product processing in practice, we propose a dynamic double-row layout problem (DDRLP) where material flows change over time in different processing periods. A mixed-integer programming model is established for this problem. A methodology combining an improved simulated annealing (ISA) with mathematical programming (MP) is proposed to resolve it. Firstly, a mixed coding scheme is designed to represent both of sequence of facilities and their exact locations. Secondly, an improved simulated annealing algorithm is suggested to produce a solution to DDRLP. Finally, MP is used to improve this solution by determining the optimal exact location for each facility. Experiments show that this methodology is able to obtain the optimal solutions for small size problems and outperforms an exact approach (CPLEX) for problems of realistic size."}, "journals/ijsir/CaoZ15": {"title": "Supply Chain Inventory Coordination under Uncertain Demand via Combining Monte Carlo Simulation and Fitness Inheritance PSO.", "url": "https://doi.org/10.4018/ijsir.2015010101", "year": "2015", "author": {"Heting Cao": "164/4715", "Xingquan Zuo": "54/3298"}, "abstract": ""}, "journals/tits/ZuoCTZ15": {"title": "Vehicle Scheduling of an Urban Bus Line via an Improved Multiobjective Genetic Algorithm.", "url": "https://doi.org/10.1109/TITS.2014.2352599", "year": "2015", "author": {"Xingquan Zuo": "54/3298", "Cheng Chen": "10/217", "Wei Tan 0001": "73/6520-1", "MengChu Zhou": "73/1446"}, "abstract": " Abstract:It is complex and difficult to perform the vehicle scheduling of urban bus lines, which is important to reduce the operational cost and improve the quality of public transportation services. One has to assign vehicles to cover a set of trips contained in a timetable while minimizing multiple objectives that may conflict with each other. Existing approaches combine these objectives in a weighted fashion to form a single objective and then use a single-objective optimization approach to solve it. However, they can only produce one solution, and it is not easy to assign a proper weight for each objective to obtain a superior solution that can balance different objectives. In this paper, a methodology is presented to create a set of Pareto solutions for this problem. First, a set of candidate vehicle blocks is generated. Then, multiple block subsets are selected from this candidate set by an improved multiobjective genetic algorithm combined with a departure-time adjustment procedure to obtain multiple Pareto solutions. To encode a solution, we propose a coding scheme that has a relatively short coding length and low decoding complexity. This approach is applied to a real-world vehicle scheduling problem of a bus line in Nanjing, China. Experiments show that this approach is able to quickly produce satisfactory Pareto solutions that outperform the actually used experience-based solution."}, "journals/aai/QiuWFZ14": {"title": "A Multiobjective Particle Swarm Optimization-Based Partial Classification for Accident Severity Analysis.", "url": "https://doi.org/10.1080/08839514.2014.923166", "year": "2014", "author": {"Chenye Qiu": "08/10014", "Chunlu Wang": "16/2615", "Binxing Fang": "87/254", "Xingquan Zuo": "54/3298"}, "abstract": ""}, "journals/ieicet/WangQZL14": {"title": "An Accident Severity Classification Model Based on Multi-Objective Particle Swarm Optimization.", "url": "https://doi.org/10.1587/transinf.2014EDP7069", "year": "2014", "author": {"Chunlu Wang": "16/2615", "Chenye Qiu": "08/10014", "Xingquan Zuo": "54/3298", "Chuanyi Liu": "18/4018"}, "abstract": ""}, "journals/soco/ZuoX14": {"title": "A DE and PSO based hybrid algorithm for dynamic optimization problems.", "url": "https://doi.org/10.1007/s00500-013-1153-0", "year": "2014", "author": {"Xingquan Zuo": "54/3298", "Li Xiao": "14/5505"}, "abstract": "Many real world optimization problems are dynamic in which the fitness landscape is time dependent and the optima change over time. Such problems challenge traditional optimization algorithms. For such problems, optimization algorithms not only have to find the global optimum but also need to closely track its trajectory. In this paper, a new hybrid algorithm integrating a differential evolution (DE) and a particle swarm optimization (PSO) is proposed for dynamic optimization problems. Multi-population strategy is adopted to enhance the diversity and try to keep each subpopulation on a different peak in the fitness landscape. A hybrid operator combining DE and PSO is designed, in which each individual is sequentially carried out DE and PSO operations. An exclusion scheme is proposed that integrates the distance based exclusion scheme with the hill-valley function to track the adjacent peaks. The algorithm is applied to the set of benchmark functions used in CEC 2009 competition for dynamic environment. Experimental results show that it is more effective in terms of overall performance than other comparative algorithms."}, "journals/tase/ZuoTL14": {"title": "Cigarette Production Scheduling by Combining Workflow Model and Immune Algorithm.", "url": "https://doi.org/10.1109/TASE.2012.2227728", "year": "2014", "author": {"Xingquan Zuo": "54/3298", "Wei Tan 0001": "73/6520-1", "Huiping Lin": "28/7827"}, "abstract": " Abstract:Cigarette production scheduling is vital in improving production efficiency and reducing supply delay. In this paper, a workflow model combined with an immune algorithm is proposed to solve this problem for improving production efficiency. First, the problem is formulated as a mixed-integer quadratically constrained programming model. Afterwards, the problem is transformed into a workflow resource allocation one. Based on this model, an immune algorithm is presented to find a set of activity priorities that are combined with dispatching rules to allocate resources. Activity priorities are represented by antibodies and evaluated by simulation runs on the workflow model. The proposed approach is applied to several production scheduling instances, and results are compared with other approaches. Experiments show that the result from the proposed approach is substantially better than those obtained from other approaches. It is demonstrated that our approach can effectively reduce production tardiness and improve efficiency."}, "journals/tase/ZuoZT14": {"title": "Self-Adaptive Learning PSO-Based Deadline Constrained Task Scheduling for Hybrid IaaS Cloud.", "url": "https://doi.org/10.1109/TASE.2013.2272758", "year": "2014", "author": {"Xingquan Zuo": "54/3298", "Guoxiang Zhang": "61/7763", "Wei Tan 0001": "73/6520-1"}, "abstract": " Abstract:Public clouds provide Infrastructure as a Service (IaaS) to users who do not own sufficient compute resources. IaaS achieves the economy of scale by multiplexing, and therefore faces the challenge of scheduling tasks to meet the peak demand while preserving Quality-of-Service (QoS). Previous studies proposed proactive machine purchasing or cloud federation to resolve this problem. However, the former is not economic and the latter for now is hardly feasible in practice. In this paper, we propose a resource allocation framework in which an IaaS provider can outsource its tasks to External Clouds (ECs) when its own resources are not sufficient to meet the demand. This architecture does not require any formal inter-cloud agreement that is necessary for the cloud federation. The key issue is how to allocate users' tasks to maximize the profit of IaaS provider while guaranteeing QoS. This problem is formulated as an integer programming (IP) model, and solved by a self-adaptive learning particle swarm optimization (SLPSO)-based scheduling approach. In SLPSO, four updating strategies are used to adaptively update the velocity of each particle to ensure its diversity and robustness. Experiments show that, SLPSO can improve a cloud provider's profit by 0.25%-11.56% compared with standard PSO; and by 2.37%-16.71% for problems of nontrivial size compared with CPLEX under reasonable computation time."}, "journals/tase/ZuoMS14": {"title": "Solving an Extended Double Row Layout Problem Using Multiobjective Tabu Search and Linear Programming.", "url": "https://doi.org/10.1109/TASE.2014.2304471", "year": "2014", "author": {"Xingquan Zuo": "54/3298", "Chase C. Murray": "133/2338", "Alice E. Smith": "95/6081"}, "abstract": " Abstract:Facility layout problems have drawn much attention over the years, as evidenced by many different versions and formulations in the manufacturing context. This paper is motivated by semiconductor manufacturing, where the floor space is highly expensive (such as in a cleanroom environment) but there is also considerable material handling amongst machines. This is an integrated optimization task that considers both material movement and manufacturing area. Specifically, a new approach combining multiobjective tabu search with linear programming is proposed for an extended double row layout problem, in which the objective is to determine exact locations of machines in both rows to minimize material handling cost and layout area where material flows are asymmetric. First, a formulation of this layout problem is established. Second, an optimization framework is proposed that utilizes multiobjective tabu search and linear programming to determine a set of non-dominated solutions, which includes both sequences and positions of machines. This framework is applied to various manufacturing situations, and compared with an exact approach and a popular multiobjective genetic algorithm optimization algorithm. Experimental results show that the proposed approach is able to obtain sets of Pareto solutions that are far better than those obtained by the alternative approaches."}, "journals/ijcisys/QiuWZ13": {"title": "A novel multi-objective particle swarm optimization with ", "url": "https://doi.org/10.1080/18756891.2013.805584", "year": "2013", "author": {"Chenye Qiu": "08/10014", "Chunlu Wang": "16/2615", "Xingquan Zuo": "54/3298"}, "abstract": ""}, "journals/isci/ZuoMW09": {"title": "A robust scheduling method based on a multi-objective immune algorithm.", "url": "https://doi.org/10.1016/j.ins.2009.06.003", "year": "2009", "author": {"Xingquan Zuo": "54/3298", "Hongwei Mo": "68/6839", "Jianping Wu": "82/4905"}, "abstract": "A robust scheduling method is proposed to solve uncertain scheduling problems. An uncertain scheduling problem is modeled by a set of workflow models, and then a scheduling scheme (solution) of the problem can be evaluated by workflow simulations executed with the workflow models in the set. A multi-objective immune algorithm is presented to find Pareto optimal robust scheduling schemes that have good performance for each model in the set. The two optimization objectives for scheduling schemes are the indices of the optimality and robustness of the scheduling results. An antibody represents a resource allocation scheme, and the methods of antibody coding and decoding are designed to deal with resource conflicts during workflow simulations. Experimental tests show that the proposed method can generate a robust scheduling scheme that is insensitive to uncertain scheduling environments."}}}