{"id": "35/2502", "name": "Xiuqin Lin", "Article": {"conf/fskd/XiaoSWLC15": {"title": "Resource prediction based on program granularity combined with data purification.", "url": "https://doi.org/10.1109/FSKD.2015.7382361", "year": "2015", "author": {"Ding Xiao": "76/2094", "Bingqing Shang": "174/3751", "Bin Wu 0001": "98/4432-1", "Xiuqin Lin": "35/2502", "Kesheng Chen": "174/4055"}, "abstract": " Abstract:Resource prediction is the basis of resource allocation and task scheduling in cloud platform. Different from previous research which takes a server as the research object, we mainly study resource prediction based on program granularity and provide a resource prediction model. A program will cost Central Processing Unit (CPU), memory and I/O when it is executing. To predict these three kinds of resources, the Static Data of Servers (CPU main frequency, the number of CPU cores, etc.), the Static Data of Programs (Time Complexity, Space Complexity, etc.), and the Dynamic Data of Programs (CPU utilization, memory utilization, I/O) are collected. PauTa Criterion is used to purify the dataset in order to ensure the accuracy of resource prediction. Then a Back Propagation Neural Network (BPNN) predicts the resource. The momentum factor is added in a BPNN to improve the rate of convergence. In our experiments, different datasets are used to test the accuracy of our model, and the results show that the resource prediction model has a good performance."}, "conf/mobserv/ShiWL15": {"title": "A Latent Group Model for Group Recommendation.", "url": "https://doi.org/10.1109/MobServ.2015.41", "year": "2015", "author": {"Jing Shi": "92/4638", "Bin Wu 0001": "98/4432-1", "Xiuqin Lin": "35/2502"}, "abstract": " Abstract:Increasingly, thousands of mobile services are provided by mobile Internet service portals. In order to push information that users may fond of, recommender system is needed. In some circumstances, recommendation to groups is necessary, e.g., Recommending movies to a group of friends. In reality, users are in some hidden social network, which can be viewed as groups. So group recommendation is proposed. Time efficiency is a key problem in mobile group recommendation. Research on group recommendation have concentrated on two approaches: aggregating members' ratings into a group profile and aggregating users' recommendations into a group recommendation list. This paper proposes a latent group model LGM, based on the assumption that users are influenced implicitly by some latent factors. LGM presents a novel route to detect groups by taking latent factors into account and makes users' profiles exist in latent factor format. Then users' latent factor profiles are aggregated into a group profile and multiplying method is used for group recommendation. This paper compares LGM with two approaches proposed before in efficiency and accuracy. It achieves better efficiency and accuracy for group recommendation on Movie Lens dataset."}, "conf/asunam/LiLWS14": {"title": "Location inference using microblog text and friendships.", "url": "https://doi.org/10.1109/ASONAM.2014.6921674", "year": "2014", "author": {"Chuanyang Li": "153/2819", "Xiuqin Lin": "35/2502", "Bin Wu 0001": "98/4432-1", "Chuan Shi": "64/3041"}, "abstract": " Abstract:In this paper, we proposed a novel scheme to infer user's location using microblog text and friendships, without known geo information. The major part of our research is identifying local words, words that associated with some particular location. With local words we identified, we use conditional random fields (CRF), to detect location specific microblog. Then we can estimate the most possible location of a user. And we take advantage of users' friendships to improve the result. Another key feature of our approach is that we consider timeliness of local words, as some local words are descriptions of local events and they are only associated with location during a certain period of time. Experimental evidence suggests that our algorithm works well in practice and outperforms the existing algorithms for estimating the location of microblog users."}, "conf/icpads/TaoWL14": {"title": "Budgeted mini-batch parallel gradient descent for support vector machines on Spark.", "url": "https://doi.org/10.1109/PADSW.2014.7097914", "year": "2014", "author": {"Hang Tao": "162/0684", "Bin Wu 0001": "98/4432-1", "Xiuqin Lin": "35/2502"}, "abstract": " Abstract:Mini-batch gradient descent (MBGD) is an attractive choice for support vector machines (SVM), because processing part of examples at a time is advantageous when disposing large data. Similar to other SVM learning algorithms, MBGD is vulnerable to the curse of kernelization when equipped with kernel functions, which results in unbounded linear growth in model size and update time with data size. This paper presents a budgeted mini-batch parallel gradient descent algorithm (BMBPGD) for large-scale kernel SVM training which can run efficiently on Apache Spark. Spark is a fast and general engine for large-scale data processing which is originally intended to deal with iterative algorithms. BMBPGD algorithm has constant space and time complexity per update. It uses removal budget maintenance method to keep the number of support vectors (SVs). The experiment results show that BMBPGD achieves higher accuracy than SVMWithSGD algorithm in MLlib on Spark environment, and it takes much shorter time than LibSVM."}, "conf/bigdataconf/YinWL13": {"title": "A unified framework for predicting attributes and links in social networks.", "url": "https://doi.org/10.1109/BigData.2013.6691748", "year": "2013", "author": {"Xusen Yin": "139/4194", "Bin Wu 0001": "98/4432-1", "Xiuqin Lin": "35/2502"}, "abstract": " Abstract:Node attributes and their associated links are two crucial components of user profiling in social networks. Recently, several research works show that both attributes and links are partially predictable by various classification methods. However, most of these works suffer from an isolation of attributes and links. In this paper, we propose a novel unified framework to predict attributes and links simultaneously, by a two-layer artificial neural network that encodes them in the same network. We obtain a better predictive accuracy on both attributes and links than the previous state-of-the-art methods, tested on different real-world datasets. Our results show that we can discover much more useful information in the whole social networks than in node attributes or their associated links alone."}, "conf/ccis/LinDY12": {"title": "The simple optimization of WLC algorithm based on LVS cluster system.", "url": "https://doi.org/10.1109/CCIS.2012.6664412", "year": "2012", "author": {"Xiuqin Lin": "35/2502", "Zhonghan Du": "193/2109", "Juan Yang": "22/815"}, "abstract": " Abstract:Linux Virtual Server (LVS) cluster technology is commonly used to provide highperformance web service. In LVS cluster, WLC scheduling algorithm is often adopted and has good effect. Based on the WLC scheduling algorithm, this paper presents a kind of simple optimization method by using server's performance indexes to calculate server's weight. The performance of the LVS cluster can be effectively improved by the optimized method."}, "conf/isctcs/XinHLW12": {"title": "A P2P Reputation Model Based on P2P File-Sharing Behavioral Characteristics.", "url": "https://doi.org/10.1007/978-3-642-35795-4_47", "year": "2012", "author": {"Chao Xin": "81/10644", "Hui-jun Han": "222/0344", "Xiuqin Lin": "35/2502", "Gengyu Wei": "06/8388"}, "abstract": "In recent years, P2P networks have become a focus in the industry. The P2P network is open and anonymous, providing the opportunity for false documents, malicious attacks and other malicious acts, so its trust and security issues have emerged. Building reputation model in the P2P network environment is an effective way to solve these problems, but traditional reputation model neglect the difference of pollution files. The more popular of pollution file, the more damage it will bring to P2P network. Tosolve this problem, a P2P reputation model based on P2P file-sharing behavioral characteristics is proposed. By analyzing the P2P file-sharing behavioral characteristics, determine the file’s propagation degree. Usethe file’s propagation degreeto calculate the files’ evaluation value and nodes’ reputation value.By this means, increase the reliability of the reputation model, so as toimprove the P2P network security.KeywordsP2P networkreputation modelfile-sharing behavioral characteristicsnetwork security"}, "conf/ccis/LinYXP11": {"title": "A method for improving information synchronization mechanism in Eucalyptus.", "url": "https://doi.org/10.1109/CCIS.2011.6045058", "year": "2011", "author": {"Xiuqin Lin": "35/2502", "Xiaowei Yan": "07/1397", "Liutong Xu": "47/5193", "Xinyang Piao": "193/2579"}, "abstract": " Abstract:Cloud computing is a fusion of network technology and traditional computer technology. It aims to deliver the powerful computing capability to end users through the advanced business model such as SaaS, PaaS, and IaaS. IaaS can provide a convenient, flexible and pay-per-use infrastructure for PaaS and SaaS. This paper is focused on Eucalyptus - a famous open source IaaS platform. After a brief introduction to the Eucalyptus, a detailed analysis about information synchronization mechanism shows some issues of information synchronization mechanism. According to the specific scenes, we have given a reasonable solution. With this solution, Eucalyptus can automatically restore to the state before when physical machine reboot for some reason and Eucalyptus can support live migration and dynamic adjustment of the virtual machine resources. At the end of the paper, experiments show the effect of the improvement on the Eucalyptus."}, "conf/fskd/LinZW11": {"title": "The clustering algorithm for Chinese texts based on Lingo.", "url": "https://doi.org/10.1109/FSKD.2011.6019740", "year": "2011", "author": {"Xiuqin Lin": "35/2502", "Qianhao Zhang": "10/10132", "Gengyu Wei": "06/8388"}, "abstract": " Abstract:This paper presents a novel Chinese text clustering algorithm, named C-Lingo (Chinese Lingo), which improves the performance of Lingo Algorithm to replace the singular value decomposition (SVD) by non-negative matrix factorization (NMF). In the C-Lingo algorithm functions of the segmentation of Chinese word and the removal of stop words are added in order to process the web page with Chinese text. The evaluation results show that the C-Lingo algorithm has got better performances."}, "conf/fskd/LinWW11": {"title": "A complementary method to determine semantic orientations of words based on WordNet.", "url": "https://doi.org/10.1109/FSKD.2011.6019841", "year": "2011", "author": {"Xiuqin Lin": "35/2502", "Wenhao Wang": "57/9813", "Bin Wu 0001": "98/4432-1"}, "abstract": " Abstract:Semantic orientations of words is an important part in the sentiment analysis. Several methods for polarity detection of words were briefly introduced in this paper. We focused on WordNet-based methods and analyzed a classic one. In order to overcome shortage of this method, we proposed a complementary method with the help of “second level synonym”. The evaluation in the end of this paper showed that our complementary method was effective."}, "conf/icls/ZhangJKDPLLSWH08": {"title": "Designing and assessing modeling and visualization technologies (MVT) enhanced learning.", "url": "https://repository.isls.org/handle/1/3281", "year": "2008", "author": {"Baohui Zhang": "52/2937", "Michael J. Jacobson": "21/3477", "Beaumie Kim": "93/3462", "Feng Deng": "14/358", "Suneeta Pathak": "92/8892", "Hans G. Lossman": "60/10724", "Xiuqin Lin": "35/2502", "Pratim Sengupta": "90/9735", "Uri Wilensky": "75/4723", "Kenneth E. Hay": "13/1222"}, "abstract": ""}, "conf/icce/ZhouWL06": {"title": "Experimental Researches on Development of Pupils' Advanced Cognitions in PRIME Environments.", "url": "http://www.booksonline.iospress.nl/Content/View.aspx?piid=2243", "year": "2006", "author": {"Yueliang Zhou": "80/1769", "Lianghui Wang": "02/4412", "Xiuqin Lin": "35/2502"}, "abstract": ""}}}