{"id": "33/8493", "name": "Xuejing Kang", "Article": {"conf/aaai/TangKLLM22": {"title": "Transfer Learning for Color Constancy via Statistic Perspective.", "url": "https://ojs.aaai.org/index.php/AAAI/article/view/20135", "year": "2022", "author": {"Yuxiang Tang": "264/5178", "Xuejing Kang": "33/8493", "Chunxiao Li": "30/1926", "Zhaowen Lin": "65/10473", "Anlong Ming": "52/3276"}, "abstract": "Color Constancy aims to correct image color casts caused by scene illumination. Recently, although the deep learning approaches have remarkably improved on single-camera data, these models still suffer from the seriously insufficient data problem, resulting in shallow model capacity and degradation in multi-camera settings. In this paper, to alleviate this problem, we present a Transfer Learning Color Constancy (TLCC) method that leverages cross-camera RAW data and massive unlabeled sRGB data to support training. Specifically, TLCC consists of the Statistic Estimation Scheme (SE-Scheme) and Color-Guided Adaption Branch (CGA-Branch). SE-Scheme builds a statistic perspective to map the camera-related illumination labels into camera-agnostic form and produce pseudo labels for sRGB data, which greatly expands data for joint training. Then, CGA-Branch further promotes efficient transfer learning from sRGB to RAW data by extracting color information to regularize the backbone's features adaptively. Experimental results show the TLCC has overcome the data limitation and model degradation, outperforming the state-of-the-art performance on popular benchmarks. Moreover, the experiments also prove the TLCC is capable of learning new scenes information from sRGB data to improve accuracy on the RAW images with similar scenes.\n\t\t\t\t"}, "conf/ijcai/ZhangKM22": {"title": "Domain Adversarial Learning for Color Constancy.", "url": "https://doi.org/10.24963/ijcai.2022/236", "year": "2022", "author": {"Zhifeng Zhang": "03/2567", "Xuejing Kang": "33/8493", "Anlong Ming": "52/3276"}, "abstract": ""}, "conf/iccv/FengSZLZFWLKM21": {"title": "MT-ORL: Multi-Task Occlusion Relationship Learning.", "url": "https://doi.org/10.1109/ICCV48922.2021.00923", "year": "2021", "author": {"Panhe Feng": "254/2722", "Qi She": "171/7773", "Lei Zhu": "99/549", "Jiaxin Li": "69/327", "Lin Zhang": "37/1629", "Zijian Feng": "45/10114", "Changhu Wang": "30/3393", "Chunpeng Li": "78/5072", "Xuejing Kang": "33/8493", "Anlong Ming": "52/3276"}, "abstract": " Abstract:Retrieving occlusion relation among objects in a single image is challenging due to sparsity of boundaries in image. We observe two key issues in existing works: firstly, lack of an architecture which can exploit the limited amount of coupling in the decoder stage between the two subtasks, namely occlusion boundary extraction and occlusion orientation prediction, and secondly, improper representation of occlusion orientation. In this paper, we propose a novel architecture called Occlusion-shared and Path-separated Network (OPNet), which solves the first issue by exploiting rich occlusion cues in shared high-level features and structured spatial information in task-specific low-level features. We then design a simple but effective orthogonal occlusion representation (OOR) to tackle the second issue. Our method surpasses the state-of-the-art methods by 6.1%/8.3% Boundary-AP and 6.5%/10% Orientation-AP on standard PIOD/BSDS ownership datasets. Code is available at https://github.com/fengpanhe/MT-ORL."}, "conf/iccv/ZhuSLLK0W21": {"title": "Unifying Nonlocal Blocks for Neural Networks.", "url": "https://doi.org/10.1109/ICCV48922.2021.01207", "year": "2021", "author": {"Lei Zhu": "99/549", "Qi She": "171/7773", "Duo Li": "46/277", "Yanye Lu": "173/2256", "Xuejing Kang": "33/8493", "Jie Hu 0019": "90/5064-19", "Changhu Wang": "30/3393"}, "abstract": " Abstract:The nonlocal-based blocks are designed for capturing long-range spatial-temporal dependencies in computer vision tasks. Although having shown excellent performance, they still lack the mechanism to encode the rich, structured information among elements in an image or video. In this paper, to theoretically analyze the property of these nonlocal-based blocks, we provide a new perspective to interpret them, where we view them as a set of graph filters generated on a fully-connected graph. Specifically, when choosing the Chebyshev graph filter, a unified formulation can be derived for explaining and analyzing the existing nonlocal-based blocks (e.g., nonlocal block, nonlocal stage, double attention block). Furthermore, by concerning the property of spectral, we propose an efficient and robust spectral nonlocal block, which can be more robust and flexible to catch long-range dependencies when inserted into deep neural networks than the existing nonlocal blocks. Experimental results demonstrate the clear-cut improvements and practical applicabilities of our method on image classification, action recognition, semantic segmentation, and person re-identification tasks. Code are available at https://github.com/zh460045050/SNL_ICCV2021."}, "conf/icpr/ZhangKM20": {"title": "BP-net: deep learning-based superpixel segmentation for RGB-D image.", "url": "https://doi.org/10.1109/ICPR48806.2021.9412929", "year": "2020", "author": {"Bin Zhang": "13/5236", "Xuejing Kang": "33/8493", "Anlong Ming": "52/3276"}, "abstract": " Abstract:In this paper, we propose a deep learning-based su-perpixel segmentation algorithm for RGB-D image. The proposed deep neural network called BP-net is composed of boundary detection network (B-net) that exploits multiscale information from depth image to extract the geometry edge of objects, and pixel labeling network (P-net) that extracts pixel features and generates superpixels. A boundary pass filter is proposed to combine the edge information and pixel features and ensures superpixels adhere better to geometry edges. To generate regular superpixels, we design a loss function which takes the shape regularity error and superpixel accuracy into account. In addition, for providing reasonable initial seeds, a new seeds initialization strategy is proposed, in which the density of seeds is investigated from a 2-manifolds space to reduce the number of superpixels that cover multiple objects in the region of rich texture. Experimental results demonstrate that our algorithm outperforms the existing state-of-the-art algorithms in terms of accuracy and shape regularity on the RGB-D dataset."}, "conf/hpcc/QiHLYK19": {"title": "2D Henon-Chebyshev Chaotic Map for Image Encryption.", "url": "https://doi.org/10.1109/HPCC/SmartCity/DSS.2019.00114", "year": "2019", "author": {"Fei Qi 0003": "59/985-3", "Sijiang Huang": "245/6116", "Tong Li": "29/3826", "Haotian Yang": "153/8953", "Xuejing Kang": "33/8493"}, "abstract": " Abstract:Chaotic systems is widely employed in image encryption on account of its momentous properties including nonperiodicity, ergodicity, randomness and initial state sensitivity. However, some chaos-based cryptosystems still exhibit security problems due to the weak performance of their applied chaotic maps. To address those problems, a new two-dimensional HenonChebyshev map (2D-HCM) is first proposed in this paper. It is generated by connecting Henon map and Chebyshev map where the output of one map is used to adapt the input of the others. It results in a better chaotic performance in 2D-HCM, including better chaotic behaviors, higher chaotic index, wider chaotic range and finer ergodicity than other extant chaotic maps. Using the 2D-HCM, we further design an image encryption algorithm. The proposed algorithm disorganize the pixel positions of the input plain image with random sequence generated by 2D-HCM, and then convert it into DNA-planes using DNA operation rules. Finally, the cipher image is acquired by employing the newly defined DNA-level 2D cellular automata (DNA-CA) to update the DNA-planes in each iteration where 2D-HCM produces the rule number sequences applied in the update. Our scheme has proven to be highly efficient and secure by the experimental results and security analysis."}, "conf/icassp/DuanMZK19": {"title": "A Novel Super-resolution Method Based on Patch Reconstruction with Simk Clustering and Nonlinear Mapping.", "url": "https://doi.org/10.1109/ICASSP.2019.8683656", "year": "2019", "author": {"Peiqi Duan": "214/9772", "Anlong Ming": "52/3276", "Xuesong Zhang": "85/2286", "Xuejing Kang": "33/8493"}, "abstract": " Abstract:In this paper, we propose a patch-wise super-resolution (SR) method that combines an external-sample classification tree and a nonlinear-mapping learning stage to simultaneously guarantees reconstruction quality and speed at the stage of patch representation and mapping. We use the low-resolution (LR) to high-resolution (HR) mapping kernel of each patch-pair sample (called SIMK) to complete classification by binary tree branching and provide reasonable training sets for mapping-learning. Then a high accuracy but low cost lightweight network is learned for each tree node to choose the reasonable branch path for the testing LR patches. In the mapping-learning stage, the nonlinear mapping for each class is represented as a full-connected network, which provides satisfying generalization ability for LR patch reconstruction. Comparing with state-of-the-art methods, our approach achieves real-time (>24fps) SR of realistic vision and high quality for different upscaling factors."}, "conf/icassp/Zhang0MKA19": {"title": "Spatio-spectral Modulation Using a Binary Photomask for Compressive Chromotomography.", "url": "https://doi.org/10.1109/ICASSP.2019.8682609", "year": "2019", "author": {"Xuesong Zhang": "85/2286", "Jing Jiang 0017": "68/1974-17", "Anlong Ming": "52/3276", "Xuejing Kang": "33/8493", "Gonzalo R. Arce": "78/1427"}, "abstract": " Abstract:Recent advances in compressive spectral imagers have demonstrated the potential of spatio-spectral modulation (SSM) for improved reconstruction performance. Existing SSM techniques, however, use either a color filter array or a complex optical arrangement, both of which can only provide limited modulation bandwidth in the spectral dimension. This paper proposes a practical SSM method to help address the \"missing cone\" problem of chromo-tomography. A high-resolution binary coded aperture is used to modulate the dispersed images, which in the Fourier domain fulfills a 3D convolution of the probed spectrum with the aperture's wide spectrum. This spectrum spreading process facilitates the compressed sensing strategy determined by the Fourier Slice Theorem and we demonstrate the advantages of the proposed approach with numerical experiments."}, "conf/icip/YeZKM19": {"title": "Adaptive Occlusion Boundary Extraction for Depth Inference.", "url": "https://doi.org/10.1109/ICIP.2019.8803427", "year": "2019", "author": {"Lizhu Ye": "254/2716", "Lei Zhu": "99/549", "Xuejing Kang": "33/8493", "Anlong Ming": "52/3276"}, "abstract": " Abstract:In this paper, we propose an adaptive occlusion boundary extraction method for depth inference based on an adaptive segmentation and classification. First, an Adaptive DRW is proposed to generate more precise seeds and adaptive segmentation results, which can improve the feature quality and lower the boundary imbalance degree. Then, to deal with the imbalanced classification, we design a cost-sensitive boosting method-Adaptive AdaCost to better classify the imbalanced boundary, which can further improve overall performance and lower the cumulative misclassification cost and cost upper bound. Benefited from our Adaptive DRW and AdaCost, we extract more reliable and precise occlusion boundaries and use them for depth inference. The experiment results demonstrate that the combination of our Adaptive DRW and Adaptive AdaCost can produce more precise occlusion boundaries, and the depth inference result with our occlusion boundaries can be greatly improved."}, "conf/igta/YangLHQK19": {"title": "A Novel Multi-image Encryption Algorithm Based on the RDFrMT and Cascaded Phase Retrieval.", "url": "https://doi.org/10.1007/978-981-13-9917-6_48", "year": "2019", "author": {"Haotian Yang": "153/8953", "Tong Li": "29/3826", "Sijiang Huang": "245/6116", "Fei Qi 0003": "59/985-3", "Xuejing Kang": "33/8493"}, "abstract": "In this paper, a multi-image encryption method is presented by using the Random Discrete Fractional Mellin Transform (RDFrMT) and the cascaded phase retrieval algorithm (PRA). Firstly, we define the RDFrMT and discuss its properties including nonlinear, multi-parameter, and randomness. Then, based on the RDFrMT, a cascaded multiple-image encryption scheme is proposed. In our algorithm, an image generated by logistic map is transformed to the RDFrMT domain, and the resulting image is fed into the PRA. This nonlinear process makes our cryptosystem robust for potential attacks and ensures its security. Thereafter, the output is cut based on the Hamming distance and the keys are related to multiple input images, which makes our cryptosystem has distinct security level for different images. We repeat the above steps and get a cascaded encryption scheme. Numerical simulations demonstrate the security and feasibility of the proposed scheme.KeywordsMultiple-image encryptionPhase retrievalRandom Discrete Fractional Mellin Transform"}, "conf/igta/LvWDK19": {"title": "A Novel Image Super-Resolution Method Based on Cross Classification Trees and Cascaded Network.", "url": "https://doi.org/10.1007/978-981-13-9917-6_52", "year": "2019", "author": {"Yuan Lv": "137/3610", "Ziqi Wang": "38/8097", "Peiqi Duan": "214/9772", "Xuejing Kang": "33/8493"}, "abstract": "In this paper, we propose an efficient and high-quality super-resolution method by combining Cross Classification Trees (CCTs)-based sample classification rule and Deep Forest mapping relationship. Firstly, we use a number of mapping kernels to divide sample space into overlapping subspaces and use decision trees to realize the classification function. In this process, the CCTs are used to classify samples, which can remarkably improve the coverage rate of the sample subspaces and increase the classification accuracy. Then, for each leaf node of CCTs, a Cascade Network (CN) is learned, which simultaneously uses priori and posteriori information to map low-resolution (LR) image patches to high-resolution (HR) image patches for each subspace. This is an ensemble approach in a data-dependent way with a larger sample and fewer hyper-parameters. Extensive experiment results demonstrate that the proposed method achieves better performance and costs less time.KeywordsImage super-resolutionDecision treesCross Classification TreeRandom forestMachine learning"}, "conf/accv/ZhuKMZ18": {"title": "Dynamic Random Walk for Superpixel Segmentation.", "url": "https://doi.org/10.1007/978-3-030-20876-9_34", "year": "2018", "author": {"Lei Zhu": "99/549", "Xuejing Kang": "33/8493", "Anlong Ming": "52/3276", "Xuesong Zhang": "85/2286"}, "abstract": "In this paper, we present a novel Random Walk model called Dynamic Random Walk (DRW) for superpixel segmentation. The proposed DRW adds a new type of node called dynamic node to enrich the features of labels and reduce redundant calculation. By greedily optimizing the Weighted Random Walk Entropy (WRWE), our DRW can consider the features of both seed nodes and dynamic nodes, which enhances the boundary adherence. In addition, a new seed initialization strategy, which can evenly distribute seed nodes in both 2D and 3D space, is proposed to extend our DRW for superpixel segmentation. With this strategy, our DRW can generate superpixels in only one iteration without updating seed nodes. The experiment results show that our DRW is faster than existing RW models, and better than the state-of-the-art superpixel segmentation algorithms in both efficiency and the performance."}, "conf/icpr/DuanMKY18": {"title": "A New Single Image Super-resolution Method Using SIMK-based Classification and ISRM Technique.", "url": "https://doi.org/10.1109/ICPR.2018.8546087", "year": "2018", "author": {"Peiqi Duan": "214/9772", "Anlong Ming": "52/3276", "Xuejing Kang": "33/8493", "Chao Yao": "99/6747"}, "abstract": " Abstract:Single image super-resolution (SR) technique is widely used to estimate high-resolution (HR) images from low-resolution (LR) ones. As a research hotspot, many example-based SR methods achieve superior results by learning class-mapping-kernels from classified external LR-HR patch-pair samples. However, in these methods, the classification of samples is generally based on the features of LR patch, and the interference of ill-samples to learn class-mapping-kernels is ignored as well. In this paper, we propose a new SR method with Sample Individual Mapping-Kernel (SIMK) based classification and Ill-Sample Removal Mechanism (ISRM) in learning LR-HR mapping. In the proposed sample classification, we use the SIMK feature which is the LR-to-HR mapping kernel of each sample, to classify samples and obtain more reasonable sample sets for mapping-learning. To prevent overfitting and reduce the complexity of SIMK-based-classification, samples are pre-categorized by relative pixel values of LR patch. In the mapping-learning process, the ill-samples which are far away from the classification center are removed to improve the validity of class-mapping-kernels. In addition, for each testing LR patch, the optimal class is assigned reasonably based on a probabilistic decision model learned from Naive Bayes Classifier. Comparing with state-of-the-art methods, our SR method achieves both visual and performance improvement."}, "conf/igta/HuKGL18": {"title": "A Novel Image Encryption Scheme Based on Hidden Random Disturbance and Feistel RPMPFrHT Network.", "url": "https://doi.org/10.1007/978-981-13-1702-6_25", "year": "2018", "author": {"Guozhen Hu": "224/4666", "Xuejing Kang": "33/8493", "Zihui Guo": "224/4662", "Xuanshu Luo": "224/4632"}, "abstract": "In this paper, we propose a novel image encryption scheme based on hidden random disturbance and Feistel RPMPFrHT network, which can improve some common defects of the transform-based methods. At first, we hide some distractive information into the plain image without enlarging the size of the image, which can greatly improve the ability to resist chosen plaintext attack. Then we put the image into Feistel RPMPFrHT network to transform it into two different fractional domain and we will obtain the merits of robustness to noise and data loss. At last we homogenize the numerical distribution and rearrange the pixels by plain-image-dependent chaotic sequences to hide the special statistical characteristics of the image, which can increase the plaintext sensitivity. Simulation results have proved that our proposed encryption scheme shows good performance on most general tests and it makes a great improvement compared with existing image encryption schemes in transform domain.KeywordsImage encryptionRandom disturbanceFeistel networkFractional Hartley transform"}, "conf/igta/SunMYK18": {"title": "Fall Detection System Based on Mobile Robot.", "url": "https://doi.org/10.1007/978-981-13-1702-6_26", "year": "2018", "author": {"Pengfei Sun": "88/6707", "Anlong Ming": "52/3276", "Chao Yao": "99/6747", "Xuejing Kang": "33/8493"}, "abstract": "This paper proposed an accurate fall detection algorithm based on the feature of whole human body. The feature is extracted from convolutional neural network. The implementation of algorithm is integrated into a hardware system based on a visual mobile robot platform. To ensure the robustness and flexibility of algorithm in actual situation, a set of systemic strategies was applied on mobile robot. Finally, sufficient experiments on public dataset were conduct on our algorithm. Moreover, in a real indoor scene, experiment results proved the efficiency and precision of the designed fall detection system.KeywordsFall detectionConvolutional neural networkMobile robotDeep learning"}, "conf/icip/KangHYD17": {"title": "Double random scrambling encoding in the RPMPFrHT domain.", "url": "https://doi.org/10.1109/ICIP.2017.8297106", "year": "2017", "author": {"Xuejing Kang": "33/8493", "Zhao Han": "11/8592", "Aiwei Yu": "214/9390", "Peiqi Duan": "214/9772"}, "abstract": " Abstract:In this paper, a novel method of digital image encryption based on the reality-preserving multiple parameter fractional Hartley transform (RPMPFrHT) is proposed. Firstly, we define an RPMPFrHT that make sure the output of cryptosystem is real-value. Then, based on random address sequences generated by coupled logistic function, we propose the double random scrambling encoding scheme which scrambled an image in the spatial domain and the RPMPFrHT domain respectively. Our method can encrypt an original image into noise-like picture with real-value which is convenient for storage and transmission. Numerical simulations have been performed and demonstrated that the proposed image encryption method is effective and sensitive to keys. Moreover, some potential attacks have also been performed to verify the robustness of the proposed method."}, "conf/bic-ta/ZhangKDCF10": {"title": "A kind of service-aware computing method for Web-based mobile application with uncertainty.", "url": "https://doi.org/10.1109/BICTA.2010.5645176", "year": "2010", "author": {"De-gan Zhang": "42/2112", "Xuejing Kang": "33/8493", "Wenbo Dai": "71/8492", "Ying Chen": "21/5521", "Moaty Fayek": "83/10862"}, "abstract": ""}, "conf/fskd/ZhangLKCD10": {"title": "A new clustering classification approach based on FCR.", "url": "https://doi.org/10.1109/FSKD.2010.5569153", "year": "2010", "author": {"De-gan Zhang": "42/2112", "Weiwei Liu": "54/6677", "Xuejing Kang": "33/8493", "Ying Chen": "21/5521", "Wenbo Dai": "71/8492"}, "abstract": " Abstract:A new clustering classification approach based on fuzzy closeness relationship (FCR) is studied in this paper. As we know, fuzzy clustering classification is one of important and valid methods to knowledge discovery. One of problems in fuzzy clustering classification is to determine a certain fuzzy sample classification in given limited sample space. Another is its validity, that is to say, if the sample is resemble in sample space, its fuzzy type will be resemble too. In our research, firstly, using triangle arithmetic operator and triangle transference, we extend fuzzy equivalence relationship to fuzzy closeness relationship, and cluster. Secondly, importing fuzzy coverage based on fuzzy closeness relationship, we judge resemble type of resemble sample. Thirdly, we introduce the clustering classification method based on fuzzy closeness relationship and fuzzy coverage. The method can overcome information more loss in fuzzy equivalence. Finally, we test its feasibility. The approach is applied to knowledge discovery for risk prediction of electronic commerce market, good result has been gotten."}, "journals/spic/KangDX22": {"title": "Single image super-resolution based on mapping-vector clustering and nonlinear pixel-reconstruction.", "url": "https://doi.org/10.1016/j.image.2021.116501", "year": "2022", "author": {"Xuejing Kang": "33/8493", "Peiqi Duan": "214/9772", "Ruyu Xu": "309/3575"}, "abstract": "Single image super-resolution (SR) aims to estimate high-resolution (HR) images from low-resolution (LR) ones with high reconstruction quality and low time cost. In this paper, we propose a new pixel-wise SR method by combining a classification tree of external samples and a learning stage of nonlinear pixel-reconstruction mapping-kernels. To obtain more reasonable sample sets for mapping-learning, we classify external samples by clustering the mapping-vector of LR-HR patch pairs based on fractional-norm. Then, a decision-tree branched by lightweight networks is learned to choose one reasonable class for each testing LR patch. In our mapping-learning stage, pixel-wise nonlinear mappings are represented as several full connected networks, which can provide satisfying generalization ability for LR patch reconstruction. Therefore, our method can simultaneously guarantee the reconstruction quality and execution speed at the stage of sample representation and mapping. Experiment results demonstrate the effectiveness of our approach on quantitative visual quality assessment and time cost."}, "journals/tip/ZhuKYM22": {"title": "Explored Normalized Cut With Random Walk Refining Term for Image Segmentation.", "url": "https://doi.org/10.1109/TIP.2022.3162475", "year": "2022", "author": {"Lei Zhu": "99/549", "Xuejing Kang": "33/8493", "Lizhu Ye": "254/2716", "Anlong Ming": "52/3276"}, "abstract": " Abstract:The Normalized Cut (NCut) model is a popular graph-based model for image segmentation. But it suffers from the excessive normalization problem and weakens the small object and twig segmentation. In this paper, we propose an Explored Normalized Cut (ENCut) model that establishes a balance graph model by adopting a meaningful-loop and a k-step random walk, which reduces the energy of small salient region, so as to enhance the small object segmentation. To improve the twig segmentation, our ENCut model is further enhanced by a new Random Walk Refining Term (RWRT) that adds local attention to our model with the help of an un-supervising random walk. Finally, a move-making based strategy is developed to efficiently solve the ENCut model with RWRT. Experiments on three standard datasets indicate that our model can achieve state-of-the-art results among the NCut-based segmentation models."}, "journals/ijon/LiKZYFM21": {"title": "HDNet: Hybrid Distance Network for semantic segmentation.", "url": "https://doi.org/10.1016/j.neucom.2021.03.044", "year": "2021", "author": {"Chunpeng Li": "78/5072", "Xuejing Kang": "33/8493", "Lei Zhu": "99/549", "Lizhu Ye": "254/2716", "Panhe Feng": "254/2722", "Anlong Ming": "52/3276"}, "abstract": "Semantic segmentation is currently solved as a pixel-wise labeling task, which predicts the label of each pixel based on its features. However, current methods isolate the relations of points in a feature map and cause the discontinuous segmentation results. In order to solve this problem, we propose a Hybrid Distance Network to measure the distance from two aspects. First, the Hybrid Distance Relation is proposed to model the relations between a point and its context regions to capture contexts in a feature map by an elegant combination of positional distance and high-dimension feature distance. Then, a Location Aware Attention module is proposed to efficiently sample the contexts by the positional distance and produces sparse Hybrid Distance Relations. It synthesizes the different contexts of each point and generates position-wise attention value to compact object-level representation. During the training step, High-dimension Feature Distance loss is also presented as an auxiliary loss to compact category-level representation in feature space. Experiments show that the proposed HDNet achieves state-of-the-art performance with interpretability and efficiency on three challenging semantic segmentation benchmarks: Pascal Context, ADE20K, and COCO Stuff 10 K."}, "journals/staeors/GaoTK21": {"title": "Weak Target Detection in the Presence of Sea Clutter Using Radon-Fractional Fourier Transform Canceller.", "url": "https://doi.org/10.1109/JSTARS.2021.3078723", "year": "2021", "author": {"Chang Gao": "11/8376", "Ran Tao 0003": "99/955-3", "Xuejing Kang": "33/8493"}, "abstract": "Topic: Target Detection and Recognition from Remote Sensing Data"}, "journals/corr/abs-2108-02451": {"title": "Unifying Nonlocal Blocks for Neural Networks.", "url": "https://arxiv.org/abs/2108.02451", "year": "2021", "author": {"Lei Zhu": "99/549", "Qi She": "171/7773", "Duo Li": "46/277", "Yanye Lu": "173/2256", "Xuejing Kang": "33/8493", "Jie Hu 0019": "90/5064-19", "Changhu Wang": "30/3393"}, "abstract": "\n      Abstract:  The nonlocal-based blocks are designed for capturing long-range\nspatial-temporal dependencies in computer vision tasks. Although having shown\nexcellent performance, they still lack the mechanism to encode the rich,\nstructured information among elements in an image or video. In this paper, to\ntheoretically analyze the property of these nonlocal-based blocks, we provide a\nnew perspective to interpret them, where we view them as a set of graph filters\ngenerated on a fully-connected graph. Specifically, when choosing the Chebyshev\ngraph filter, a unified formulation can be derived for explaining and analyzing\nthe existing nonlocal-based blocks (e.g., nonlocal block, nonlocal stage,\ndouble attention block). Furthermore, by concerning the property of spectral,\nwe propose an efficient and robust spectral nonlocal block, which can be more\nrobust and flexible to catch long-range dependencies when inserted into deep\nneural networks than the existing nonlocal blocks. Experimental results\ndemonstrate the clear-cut improvements and practical applicabilities of our\nmethod on image classification, action recognition, semantic segmentation, and\nperson re-identification tasks.\n\n    "}, "journals/corr/abs-2108-05722": {"title": "MT-ORL: Multi-Task Occlusion Relationship Learning.", "url": "https://arxiv.org/abs/2108.05722", "year": "2021", "author": {"Panhe Feng": "254/2722", "Qi She": "171/7773", "Lei Zhu": "99/549", "Jiaxin Li": "69/327", "Lin Zhang": "37/1629", "Zijian Feng": "45/10114", "Changhu Wang": "30/3393", "Chunpeng Li": "78/5072", "Xuejing Kang": "33/8493", "Anlong Ming": "52/3276"}, "abstract": "\n      Abstract:  Retrieving occlusion relation among objects in a single image is challenging\ndue to sparsity of boundaries in image. We observe two key issues in existing\nworks: firstly, lack of an architecture which can exploit the limited amount of\ncoupling in the decoder stage between the two subtasks, namely occlusion\nboundary extraction and occlusion orientation prediction, and secondly,\nimproper representation of occlusion orientation. In this paper, we propose a\nnovel architecture called Occlusion-shared and Path-separated Network (OPNet),\nwhich solves the first issue by exploiting rich occlusion cues in shared\nhigh-level features and structured spatial information in task-specific\nlow-level features. We then design a simple but effective orthogonal occlusion\nrepresentation (OOR) to tackle the second issue. Our method surpasses the\nstate-of-the-art methods by 6.1%/8.3% Boundary-AP and 6.5%/10% Orientation-AP\non standard PIOD/BSDS ownership datasets. Code is available at\nthis https URL.\n\n    "}, "journals/spic/KangG20": {"title": "A new color image encryption scheme based on DNA encoding and spatiotemporal chaotic system.", "url": "https://doi.org/10.1016/j.image.2019.115670", "year": "2020", "author": {"Xuejing Kang": "33/8493", "Zihui Guo": "224/4662"}, "abstract": "In this paper, a new color image encryption scheme based on DNA operations and spatiotemporal chaotic system is presented. Firstly, to hide the distribution information of the plain image, we convert the plain image into three DNA matrices based on the DNA random encoding rules. Then, the DNA matrices are combined into a new matrix and is permutated by a scramble matrix generated by mixed linear-nonlinear coupled map lattices (MLNCML) system. In which, the key streams are associated with the secret keys and plain image, which can ensure our cryptosystem plain-image-dependent and improve the ability to resist known-plaintext or chosen-plaintext attacks. Thereafter, to resist statistical attacks, the scrambled matrix is decomposed into three matrices and diffused by DNA deletion-insertion operations. Finally, the three matrices are decoded based on DNA random decoding rules and recombined to three channels of the cipher image. Simulation results demonstrate that the proposed image cryptosystem has good security and can resist various potential attacks."}, "journals/spl/MaTLK20": {"title": "Fractional Power Spectrum and Fractional Correlation Estimations for Nonuniform Sampling.", "url": "https://doi.org/10.1109/LSP.2020.2997561", "year": "2020", "author": {"Jinming Ma": "86/2114", "Ran Tao 0003": "99/955-3", "Yongzhe Li": "149/0049", "Xuejing Kang": "33/8493"}, "abstract": " Abstract:This letter proposes new estimations of fractional power spectral density (FrPSD) and fractional correlation function (FrCF) for nonuniform sampling of random signals with non-stationarity and limited bandwidths in the fractional Fourier domain. Unlike previous works, the developed FrPSD and FrCF estimations are capable of dealing with unknown sampling instants. In order to obtain them, we first formulate approximations of FrCF and FrPSD making use of uniform sampling instants. Then we convert the approximate FrPSD to a fractional filtered version of the FrPSD for the original random signal, which does not rely on the sampling instants. With such operations, we propose the FrPSD estimation to cancel the bias of FrPSD approximation by means of a fractional inverse filtering and thereby obtain a high accuracy of it. The FrCF estimation is proposed to be the inverse fractional Fourier transform of the FrPSD, and it serves as the fractional interpolation of the previously obtained approximation of the FrCF. Simulation results show the effectiveness of the proposed estimation methods."}, "journals/tip/KangZM20": {"title": "Dynamic Random Walk for Superpixel Segmentation.", "url": "https://doi.org/10.1109/TIP.2020.2967583", "year": "2020", "author": {"Xuejing Kang": "33/8493", "Lei Zhu": "99/549", "Anlong Ming": "52/3276"}, "abstract": " Abstract:In this paper, we propose a novel random walk model, called Dynamic Random Walk (DRW), which adds a new type of dynamic node to the original RW model and reduces redundant calculation by limiting the walk range. To solve the seed-lacking problem of the proposed DRW, we redefine the energy function of the original RW and use the first arrival probability among each node pair to avoid the interference for each partition. Relaxation of our DRW is performed with the help of a greedy strategy and the Weighted Random Walk Entropy(WRWE) that uses the gradient feature to approximate the stationary distribution. The proposed DRW not only can enhance the boundary adherence but also can run with linear time complexity. To extend our DRW for superpixel segmentation, a seed initialization strategy is proposed. It can evenly distribute seeds in both 2D and 3D space and generate superpixels in only one iteration. The experimental results demonstrate that our DRW is faster than existing RW models and better than the state-of-the-art superpixel segmentation algorithms with respect to both efficiency and segmentation effects."}, "journals/tsp/MaTLK20": {"title": "Fractional Spectrum Analysis for Nonuniform Sampling in the Presence of Clock Jitter and Timing Offset.", "url": "https://doi.org/10.1109/TSP.2020.3007360", "year": "2020", "author": {"Jinming Ma": "86/2114", "Ran Tao 0003": "99/955-3", "Yongzhe Li": "149/0049", "Xuejing Kang": "33/8493"}, "abstract": " Abstract:This paper focuses on analyzing the fractional spectrum of nonuniform sampling which is affected by clock jitter and timing offset. Both cases of single-channel and recurrent samplings with limited bandwidth in the fractional Fourier domain are considered, for which we study two types of discrete-time fractional Fourier transforms (DTFrFTs). For the first-type DTFrFTs, we perform their statistical analyses, and meanwhile establish relationships between the fractional spectra of the input and output signals of non-ideal single/multi-channel analog-to-digital converter. Such relationships indicate that the statistical mean of each fractional spectrum contains periodic replicas of the spectrum for the input signal, and these replicas are particularly modulated by the characteristic function of the perturbations introduced by the clock jitter. Moreover, we interpret the first-type DTFrFTs from the perspective of linear frequency modulation signal decomposition for nonuniform sampling. The second-type DTFrFTs serve as approximate DTFrFTs, and they especially deal with the general situation when the nonuniform sampling instants are unknown. To this end, we study modified forms of the first-type DTFrFTs with known inputs in kernels, based on which the statistical mean of the approximate fractional spectra for both cases are derived. Then we compensate the fractional spectrum bias with high accuracy by developing optimal filters that minimize the mean square error between the original and the compensated fractional spectra for both cases. Different from single-channel sampling, the compensation for recurrent sampling involves an additional step before optimal filtering, which gives better accuracy. Simulation results show that the proposed methods outperform existing methods."}, "journals/access/KangLZJ19": {"title": "Homogenized Chebyshev-Arnold Map and its Application to Color Image Encryption.", "url": "https://doi.org/10.1109/ACCESS.2019.2930183", "year": "2019", "author": {"Xuejing Kang": "33/8493", "Xuanshu Luo": "224/4632", "Xuesong Zhang": "85/2286", "Jing Jiang": "68/1974"}, "abstract": " Abstract:In this paper, we propose a homogenized Chebyshev-Arnold map (HCAM) by homogenizing the linear coupling of Chebyshev map and Arnold map. The proposed HCAM has complex dynamical behaviors and can avoid the problems of the original Chebyshev map when used in image encryption. Based on the HCAM, we present a color image encryption algorithm that contains confusion and diffusion processes. In the confusion stage, we use the random chaotic matrix transform (RCMT) to randomize the shifting steps, which can eliminate the regular pattern of the original CMT and enhance the security level. In the diffusion stage, we use a SHA-512- and SHA-384-based fast pixel substitution scheme to perform the bit-level exclusive-or operation, which can obtain outstanding self-adaptiveness and high efficiency. The experimental results and security analysis demonstrate that the proposed algorithm has high level of security and robust to the potential attacks."}, "journals/sigpro/SuTK19": {"title": "Analysis and comparison of discrete fractional fourier transforms.", "url": "https://doi.org/10.1016/j.sigpro.2019.01.019", "year": "2019", "author": {"Xinhua Su": "147/5127", "Ran Tao 0003": "99/955-3", "Xuejing Kang": "33/8493"}, "abstract": "The fractional Fourier transform (FRFT) is a powerful tool for time-varying signal analysis. There exist various discrete fractional Fourier transforms (DFRFTs); in this paper, we systematically analyze and compare the main DFRFT types: sampling-type DFRFTs and eigenvector decomposition-type DFRFTs. First, for the existing sampling-type DFRFTs, we perform concrete analyses and comparisons of their applicable conditions and then establish their equivalence relationship. Then, for various eigenvector decomposition-type DFRFTs, their common mechanisms are extracted and thus they are effectively classified. In addition, as the extended version of DFRFTs, discrete counterparts of the linear canonical transform (LCT) and simplified FRFT (SFRFT) are summarized and classified. Our work is instructive for research about the choice of a more appropriate DFRFT in different applications, which is also supported by simulation experiments. Finally, for the DFRFT, DLCT and DSFRFT, two applications regarding detection for chirp signals and optical imaging are investigated to intuitively analyze their differences."}, "journals/staeors/ZhaoTKL19": {"title": "Hierarchical-Biased Random Walk for Urban Remote Sensing Image Segmentation.", "url": "https://doi.org/10.1109/JSTARS.2019.2905352", "year": "2019", "author": {"Xudong Zhao 0003": "02/735-3", "Ran Tao 0003": "99/955-3", "Xuejing Kang": "33/8493", "Wei Li 0032": "64/6025-32"}, "abstract": " Abstract:Random walk (RW) technique, with benefit of handling complicated boundaries, has recently drawn increasing attention in image segmentation. In this paper, RW is employed for urban remote sensing image segmentation. To deal with the complex spatial distribution with heterogeneous structures, a novel hierarchical-biased RW (HBRW) method is proposed. Firstly, edge regions extracted by fractional differential are combined with histograms to obtain plentiful features. Then, Dirichlet process mixture model is used to generate hierarchical global prior distribution and local seeds, which substitute manual scribbles. Moreover, the proposed model can adapt to different resolution segmentation tasks through adjusting the concentration parameter. Final segmentation output is obtained by biased RW. Experimental results on urban high-resolution remote sensing images demonstrate that the proposed algorithm achieves better performance than other state-of-the-art algorithms."}, "journals/tcsv/KangMT19": {"title": "Reality-Preserving Multiple Parameter Discrete Fractional Angular Transform and Its Application to Color Image Encryption.", "url": "https://doi.org/10.1109/TCSVT.2018.2851983", "year": "2019", "author": {"Xuejing Kang": "33/8493", "Anlong Ming": "52/3276", "Ran Tao 0003": "99/955-3"}, "abstract": " Abstract:In this paper, we first define a reality-preserving multiple parameter fractional angular transform (RPMPDFrAT), which is a useful tool for image encryption. Then, we propose a new color image encryption algorithm based on the defined RPMPDFrAT. The encryption process consists of two phases: encryption in the spatial domain and RPMPDFrAT domain. In the spatial domain, three color components of the plain image are mapped by dual cylindrical transform, which can nonlinearly hide the original color information. Then, the intermediate output is scrambled by a coupled logistic map to reduce the correlation of adjacent pixels and uniformly distribute the image energy of different color components. Thereafter, the scrambled image is transformed by the proposed RPMPDFrAT, which can ensure that we obtain the real-value output. Finally, a process similar to the spatial domain is performed in the RPMPDFrAT domain to further improve the security of the cryptosystem. Numerical simulations are performed and demonstrate that the proposed image encryption algorithm is effective and sensitive to keys. Moreover, some potential attacks are tested to verify the robustness of the proposed method, and the performance of our method outperforms previously published ones."}, "journals/tcsv/KangT19": {"title": "Color Image Encryption Using Pixel Scrambling Operator and Reality-Preserving MPFRHT.", "url": "https://doi.org/10.1109/TCSVT.2018.2859253", "year": "2019", "author": {"Xuejing Kang": "33/8493", "Ran Tao 0003": "99/955-3"}, "abstract": " Abstract:To ensure the confidentiality of color images during their storage or transmission on insecure networks, a number of encryption methods based on fractional transforms have been proposed and widely investigated. However, most of their outputs are complex values that are inconvenient for record and transmission. Also, those methods always deal with a whole color component with the same fractional-order and ignore the textural features that are contained in different image parts. In this paper, we first define a reality-preserving multiple-parameter fractional Hartley transform (RPMPFRHT), whose output is real value, and then a novel color image encryption method is proposed that divides the RGB components into different blocks and uses a constructed pixel scrambling operator to mix and hide the original color information. The outputs are transformed to different RPMPFRHT domains and further scrambled by a non-adjacent coupled map lattices system. Numerical simulations are performed to demonstrate that the proposed encryption algorithm is feasible, secure, sensitive to keys, and robust to potential attacks."}, "journals/tcsv/SuWKT19": {"title": "Nonconvex Truncated Nuclear Norm Minimization Based on Adaptive Bisection Method.", "url": "https://doi.org/10.1109/TCSVT.2018.2878803", "year": "2019", "author": {"Xinhua Su": "147/5127", "Yilun Wang": "80/7412", "Xuejing Kang": "33/8493", "Ran Tao 0003": "99/955-3"}, "abstract": " Abstract:The explosive growth in high-dimensional visual data requires effective regularization techniques to utilize the underlying low-dimensional structure. We consider low-rank matrix recovery, and many existing approaches are based on the nuclear norm regularization. Recently, truncated nuclear norm (TNNR) has been proposed to achieve a better approximation to the rank function than that of the traditional nuclear norm. TNNR was defined by the nuclear norm by subtracting the sum of the largest r singular values. However, the estimation of r is not trivial. In addition, the original algorithm based on TNNR only considers the matrix completion cases and requires double loops, which is not quite computationally efficient. Correspondingly, in this paper, we propose the adaptive bisection method to adaptively estimate r, which can efficiently reduce the cost of computation. Moreover, to further accelerate computing, we apply iteratively reweighted nuclear norm to solve the nonconvex TNNR directly, and the convergence can also be guaranteed. Finally, we extend the applications of TNNR from the matrix completion problems to the general low-rank matrix recovery. Extensive experiments validate the superiority of the proposed algorithm over the state-of the-art methods."}, "journals/tsp/KangTZ16": {"title": "Multiple-Parameter Discrete Fractional Transform and its Applications.", "url": "https://doi.org/10.1109/TSP.2016.2544740", "year": "2016", "author": {"Xuejing Kang": "33/8493", "Ran Tao 0003": "99/955-3", "Feng Zhang 0011": "48/1294-11"}, "abstract": " Abstract:In recent years, several special multiple-parameter discrete fractional transforms (MPDFRTs) have been proposed, and their advantages have been demonstrated in the fields of communication systems and information security. However, the general theoretical framework of MPDFRTs has not yet been established. In this paper, we propose two separate theoretical frameworks called the type I and II MPDFRT that can include existing multiple-parameter transforms as special cases. The properties of the type I and II MPDFRT have been analyzed in detail and their high-dimensional operators have been defined. Under the theoretical frameworks, we can construct new types of transforms that may be useful in signal processing and information security. Finally, we perform two applications about image encryption and image feature extraction in the type I and II MPDFRT domain. The simulation results demonstrate that the typical transforms constructed under the proposed theoretical frameworks yield promising results in these applications."}, "journals/spl/KangZT15": {"title": "Multichannel Random Discrete Fractional Fourier Transform.", "url": "https://doi.org/10.1109/LSP.2015.2402395", "year": "2015", "author": {"Xuejing Kang": "33/8493", "Feng Zhang 0011": "48/1294-11", "Ran Tao 0003": "99/955-3"}, "abstract": " Abstract:We propose a multichannel random discrete fractional Fourier transform (MRFrFT) with random weighting coefficients and partial transform kernel functions. First, the weighting coefficients of each channel are randomized. Then, the kernel functions, selected based on a choice scheme, are randomized using a group of random phase-only masks (RPOMs). The proposed MRFrFT can be carried out both electronically and optically, and its main features and properties have been given. Numerical simulation about one-dimensional signal demonstrates that the MRFrFT has an important feature that the magnitude and phase of its output are both random. Moreover, the MRFrFT of two-dimensional image can be viewed as a security enhanced image encryption scheme due to the large key space and the sensitivity to the private keys."}, "journals/ejasp/ZhangKW12": {"title": "A novel image de-noising method based on spherical coordinates system.", "url": "https://doi.org/10.1186/1687-6180-2012-110", "year": "2012", "author": {"De-gan Zhang": "42/2112", "Xuejing Kang": "33/8493", "Jinghui Wang": "18/7759"}, "abstract": ""}, "journals/jsw/ZhangZZKQ11": {"title": "A New Dynamic Method of Machine Learning From Transition Examples.", "url": "https://doi.org/10.4304/jsw.6.10.2064-2067", "year": "2011", "author": {"Xiao-dan Zhang": "19/3763", "De-gan Zhang 0001": "42/2112-1", "Dexin Zhao": "75/6090", "Xuejing Kang": "33/8493", "Xiao-Dong Qiao": "70/10363"}, "abstract": ""}}}