{"id": "181/2323-4", "name": "Yan Sun 0004", "Article": {"conf/cscwd/QiHSL22": {"title": "A Knowledge Graph-Based Abstractive Model Integrating Semantic and Structural Information for Summarizing Chinese Meetings.", "url": "https://doi.org/10.1109/CSCWD54268.2022.9776298", "year": "2022", "author": {"Peng Qi": "59/9474", "Zhen Huang": "22/3870", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:With the rapid increase of users, online meeting platforms have accumulated massive meeting transcripts. However, it is still a challenge for users to quickly master the chief information and manage the meetings, despite there are already some useful text summarization models. In this paper, a Knowledge Graph-based Meeting Summarization Framework is proposed to tackle this challenge. First, a two-layers meeting domain Knowledge Graph is developed to integrate more information of meetings. Based on which, an encoder-decoder architecture is utilized to summarize meetings. For encoding meetings, a structural-level and semantic-level embedding strategy is considered, concretely, the Knowledge Graph is embedded to obtain the structural information, an interaction intention recognition model and a two-level transformer mechanism are devised to get the semantic information. Finally, the structural information and semantic information are combined and fed into the decoding network to generate meeting summaries. Extensive experiments on the Chinese meeting dataset show that our summarization framework outperforms other state-of-the-art models."}, "conf/cscwd/HuangQS22": {"title": "A Novel Fault Detection Algorithm Based on the Single Indicator Data.", "url": "https://doi.org/10.1109/CSCWD54268.2022.9776156", "year": "2022", "author": {"Yunjian Huang": "321/4824", "Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:With the rapid development of Server Cluster System technologies, more and more services and tasks are deployed on the Server Cluster Systems. Despite its convenience, a large number of services are mixed together and affect each other, which brings great difficulties to the detection of equipment fault and causes great losses. Nowadays, artificial intelligence for IT operations (AIOps), which utilizes data analysis and machine learning to improve the operation quality of Server Clusters, has been proposed to solve this problem. However, the existing solutions of AIOps cannot be applied to different scenarios. Therefore, in this paper, we propose a novel fault detection method for single indicators which is adaptive to various scenes. To enrich the representation of data, we first propose an interval-volatility-rate method to extract the context features of data in a fixed interval. Based on this, the convolutional neural network and long short-term memory network are employed to get the locally spatial features and temporal features of data. After that, the spatial features and temporal features are combined and input to an MLP network to perform the fault prediction. Additionally, a k − σ principle is designed to promote the sensitivity of fault detection. Experimental results show that our method outperforms other competitive models and has better scalability."}, "conf/cscwd/SiQXS22": {"title": "QianXun: A Novel Enterprise File Search Framework.", "url": "https://doi.org/10.1109/CSCWD54268.2022.9776101", "year": "2022", "author": {"Chun Si": "321/5129", "Peng Qi": "59/9474", "Hongjia Xue": "321/5012", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:With the deepening of the digital transformation, enterprises have accumulated plenty of electronic files. For users, how to quickly find their desired files from the massive resources is a big challenge, which is also a critical concern for enterprises. Although a series of enterprise search engines have emerged in the market, there is a lack of search systems for enterprise files. In this paper, we design a novel enterprise file search framework, named QianXun, which supports searching in both Chinese and English. By introducing technologies such as automatic text summarization, online file previewing, and Knowledge Graph-enhanced search, our proposed framework improves the efficiency of file search as well as the user experience, which is of great significance to enterprises."}, "conf/cbd/TianQX021": {"title": "C-BERTT: A BERT-based Model For Extractive Summarization Of Chinese Online Judge Questions.", "url": "https://doi.org/10.1109/CBD54617.2021.00030", "year": "2021", "author": {"Song Tian": "20/10644", "Peng Qi": "59/9474", "Hongjia Xue": "321/5012", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Nowadays, the Online Judge system has been an increasingly important tool for promoting users’ algorithm skills. However, the questions of Online Judge systems are usually described with much redundant information, which is inconvenient for users to understand the description of questions quickly. Therefore, we propose an extractive summarization model to help users understand the questions. We first design a Chinese sentence segmentation method that considers the priorities of symbols, based on which we conduct a summarization dataset by utilizing the lexrank method with manual interventions. After that, we propose a BERT-based model to extract summarizations for questions. Our model considers both sentence-level and word-level features of question descriptions. Experiments on our dataset show that the proposed model achieves a better performance than baselines."}, "conf/cbd/LiQMS21": {"title": "An Automatic Question Classification Model Based on Solving Programs for Online Judge Platforms.", "url": "https://doi.org/10.1109/CBD54617.2021.00036", "year": "2021", "author": {"Qi Li": "181/2688", "Peng Qi": "59/9474", "JiangSong Min": "325/7622", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Nowadays, online judge platforms are popular among programming learners. However, the questions of online judge platforms are usually arranged randomly and without regard to their knowledge relations, which makes it inefficient for users to learn to program. To solve this issue, we develop an automatic question classification model based on the knowledge points of question-solving programs. First, the question-solving programs are processed to abstract syntax trees. Based on the abstract syntax trees, three different sampling schemes are designed to extract token sequences while preserving semantic and structural information of programs. Then, the token sequences are input into Word2Vec for learning program representations. After that, the TextCNN is adopted to generate significant program features from program representations. Finally, the program features are merged and input to a linear classifier for classifying predictions. Experimental results show that our model can effectively preserve the semantic and structural features of programs, and our model performs better than other competing methods in the question classifying task."}, "conf/globecom/0002LSO20": {"title": "Value-driven Cache Replacement Strategy in Mobile Edge Computing.", "url": "https://doi.org/10.1109/GLOBECOM42002.2020.9348106", "year": "2020", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:The mobile edge computing greatly reduces the transmission delay by offloading computing job to the base station, which is closer to the user. It solves the problem of high delay in cloud computing. Since the edge server has limited resources, improving the efficiency of computation offloading becomes a problem that needs to be addressed. Considering the data is reusable, it is a feasible solution to use the cache to improve the efficiency of computation offloading. In order to make the cache better serve the computation offloading process, we must design a reasonable cache replacement strategy. The traditional cache replacement strategy only considers the cache hit ratio, but ignores the cache value. It is not applicable to the edge computing process. In this paper, a new cache replacement strategy is proposed for the cache replacement problem in mobile edge computing, which is more suitable for computation offloading process. First, we define the cache value based on the priority of computing job. Then, we define the problem of maximizing the cache value in mobile edge computing as a multiobjective optimization problem. Finally, in order to find a suitable Pareto solution, we propose a cache replacement strategy based on the ideal point method. The experimental results show that the proposed algorithm results are significantly better than the existing competitive cache replacement methods."}, "conf/icc/YangLSO20": {"title": "Energy-efficient Collaborative Offloading for Multiplayer Games with Cache-Aided MEC.", "url": "https://doi.org/10.1109/ICC40277.2020.9148751", "year": "2020", "author": {"Xuemei Yang": "82/1133", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:Nowadays mobile multiplayer games have been an usual recreation, however energy-limited mobile devices confine the game running time. Noticing the component-based multiplayer game is a loosely coupled application whose components are nearly always required among players in one or more rounds, we study the collaboration of players to develop an energy-efficient offloading scheme. We formulate a 0-1 integer nonlinear programming problem to minimize the overall energy cost on player side under time-delay constraint. The problem is intractable to find the optimal solution, thus we propose a heuristic Two-phase Greedy-based Collaborative Offloading Algorithm (TGCOA) for the objective of cost minimization, while including more energy savings for low-energy players. In each round, we preferentially cache components saving more energy per data size for subsequent rounds, then preferentially offload components saving more energy for current round. Meanwhile, we always assign valid player with highest remaining energy to the uploading tasks. Simulations show that the energy cost ratios of our proposal are significantly down by 1.55% to 99.62% compared to four competing methods under different cache limitations and repeatability factors. Meanwhile, our proposal enables a 6.00% to 14.80% lower energy cost proportion for low-energy players compared to the four methods."}, "conf/iwcmc/ZhaoQQS20": {"title": "A Novel Image Classification Model Jointing Attention and ResNet for Scratch.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148279", "year": "2020", "author": {"Shuaifei Zhao": "271/5751", "Lichen Qiu": "271/5676", "Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:In recent years, Scratch has been widely used in helping teenagers learn to program. Before programming with Scratch, users usually need to select a background image with a proper style to set the environment of role activities and emotional tone of works. In order to make the image styles rich and diverse, users can use the fast neural style transfer method to generate the image. However, when users use this method, they are usually puzzled with the optional styles, which makes it a common phenomenon that the contents of transformed images do not match the chosen styles. To resolve this problem, we design a novel image classification model to help recognize the scene of the image, which can guide users to select optional styles for the image. First, we improve the residual network with two attention modules and reconstruct the residual module structure, which improves the accuracy of model classification. Then, we propose a self-adjusting learning rate module, which can accelerate the convergence of the model and reduce fluctuations of the loss function. The experiment results show that our model outperforms other classic image classification methods in classifying the background image of Scratch. The classification accuracy on the testset reaches 98%."}, "conf/iwcmc/JiangYQS20": {"title": "Adapting to User Interest Drifts for Recommendations in Scratch.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148105", "year": "2020", "author": {"Youhua Jiang": "271/5307", "Siyi Yan": "271/5169", "Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Scratch is a popular programming platform with plenty of learning resources. However, it is quite difficult for users to find suitable resources. In this paper, in order to provide the resources which the users require, we propose a Scratch Recommendation Framework Adaptive to User Interest Drifts (SRFA-UID). First, a user interest drifts model is designed, which adopts the time decay factor and the weights of operation behaviors to track users' dynamic interest. Then, on the basis of users' current and historical interest, we calculate their combined user similarity. Next, we present a novel two-hop-algorithm to update users' friend community. Considering the preferences of the whole friend community, the Computational Thinking (CT) skills of users and the impact factors of items, we put forward a recommendation function to obtain items that are related to users. For an item, the function can calculate its F value to determine if we can recommend it to the users. Experimental results show that SRFA-UID performs better than other state-of-the-art methods in the Scratch dataset."}, "conf/iwcmc/TangWQS20": {"title": "A Neural Network-based Sentiment Analysis Scheme for Tang Poetry.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148542", "year": "2020", "author": {"Yongrui Tang": "271/5416", "Xumei Wang": "271/5356", "Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Poetry is a very popular literary form. Currently, its sentiment analysis is one of the hottest research trends. However, there are few relevant studies focusing on the sentiment analysis of ancient Chinese poetry, especially for Tang Poetry. In this paper, we propose a deep learning-based method to solve the above problem. Specifically, we combine Convolutional Neural Network and Gate Recurrent Unit to better extract the characteristics of Tang poetry. In addition, considering the special structural characteristics of Tang poetry, a multi-channel processing model is used to reshape the feature vector of sentences. Finally, in order to verify the rationality and superiority of the proposed methods, we construct a dataset by labeling more than 2500 representative Tang poems. The experimental results prove that our scheme has a higher accuracy rate, up to 64%, compared against three other competing methods."}, "conf/iwcmc/HanZRS20": {"title": "A Game Battle Platform based on Web-API for Artificial Intelligence Education.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148114", "year": "2020", "author": {"Xiaofei Han": "271/5775", "Junwei Zou": "48/8378", "Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:The potential for computer games as a tool for AI research and education continues to blossom. The game battle platform provides a place for students to learn artificial intelligence theory and practice artificial intelligence algorithms. However, the existing platforms perform poorly in terms of possessing high concurrency, debugging bot and supporting Scratch language. In order to resolve these problems, this paper first presents a web-API battle mechanism using Websocket protocol. It increases the number of concurrent matches on servers. Next, we give an offline battle tool to make it easier to debug and test bots for users. In addition, the special environment is introduced to support programming bots in Scratch. Finally, we conduct the comparison experiment between the proposed mechanism and traditional battle methods. The results show that it supports higher concurrency and reduces CPU usage by 40%."}, "conf/iwcmc/GaoQQS20": {"title": "A Novel Music Emotion Recognition Model for Scratch-generated Music.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148471", "year": "2020", "author": {"Zijing Gao": "271/5821", "Lichen Qiu": "271/5676", "Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:In recent years, Scratch has been a popular programming platform for young children. To help children express emotions for projects, Scratch provides children with a music module to create desirable background music. However, in Scratch, there is not a tool helping recognize the emotion of music. Besides, as Scratch-generated music differs from regular music, existing music emotion recognition models perform poor in Scratch-generated music. To overcome it, in this paper, we propose a novel music emotion recognition model for Scratch-generated music. First, we build a Scratch-generated dataset by the main melody extraction algorithm. Then, for each music, we extract their underlying features and input them to the CNN module. After that, the features learned by CNN are input to RNN to get the final classification results. In our model, the CNN module can learn the important features of music while RNN can learn the sequential features. The experimental results show that the proposed model performs better than traditional music emotion recognition models."}, "conf/iwcmc/XuFQS20": {"title": "An Automatic Analysis Tool Based on Computational Thinking for BlockPy Programs.", "url": "https://doi.org/10.1109/IWCMC48107.2020.9148514", "year": "2020", "author": {"Can Xu": "33/965", "Zhiyong Feng": "09/9454", "Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:BlockPy is a block-based program language which has both block-based interface and traditional text-based interface. It fills the gap between block-based programming and language coding. But there is little work that focuses on the Computational Thinking(CT) evaluation of BlockPy programs. In this paper, we design and implement a BlockPy Analysis Tool to assess the CT skills of BlockPy programs automatically. We use Python's built-in AST module to analyse each node in the abstract syntax tree(AST) of each BlockPy program. Then, considering the characteristics of Python language, we propose a new CT Evaluation Criteria based on Scratch Analysis Tool(SAT). Under the guidance of the CT Evaluation Criteria, we propose a detailed scoring program to analyze each node of the program and get the CT score. Experimental results show the superiority of our tool compared with other analysis tools."}, "conf/icce-tw/LiuSR19": {"title": "A Pattern Similarity-based User Behavior Analysis System for Scratch.", "url": "https://doi.org/10.1109/ICCE-TW46550.2019.8991897", "year": "2019", "author": {"Pai Liu": "169/2508", "Yan Sun 0004": "181/2323-4", "Wei Ren": "92/5008"}, "abstract": " Abstract:Scratch is a visual programming language used by youth and has received widespread attention of education field. Different from the process data in a project, the time series data (TSD) is comprised by the multiple projects of a user from a longer time span, which contributes to the analysis of user behavior patterns and improvement of programming habits. However, there is little work focusing on this field. In this paper, we first design a prototype system collecting and processing TSD from Scratch platform. Then an analysis scheme based on pattern similarity is proposed to obtain user behavior patterns and differences. Additionally, we summarize their common type and characteristics through clustering. Finally, the experimental results demonstrate the feasibility and effectiveness of our claim."}, "conf/icce-tw/PengSR19": {"title": "A Multi-dimensional Dataset Construction Strategy for Scratch.", "url": "https://doi.org/10.1109/ICCE-TW46550.2019.8991986", "year": "2019", "author": {"Cong Peng": "35/408", "Yan Sun 0004": "181/2323-4", "Wei Ren": "92/5008"}, "abstract": " Abstract:Scratch is a widely used visual programming language in education field. However, the current dataset about Scratch is coarse and incomplete, which incurs the poor analysis results. In this paper, we propose a multi-dimensional dataset construction strategy to resolve this problem. It mainly includes the user and project data, which are extracted from the Scratch platform. Additionally, we utilize Scratch Analysis Tool to obtain the computing thinking scores and static data. Then a multidimensional data model is devised to store the required data. Finally, the experimental results show our strategy can provide the effective data basis for programming research, and further facilitate the computer education."}, "conf/iwcmc/Liu0L19": {"title": "An ANTLR-based Feature Extraction and Detection System for Scratch.", "url": "https://doi.org/10.1109/IWCMC.2019.8766735", "year": "2019", "author": {"Pai Liu": "169/2508", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:Scratch, a visual programming language used by youth, has received widespread attention of education field. Quality Hound is an effective tool to detect the features of Scratch. However, its detection rules are not sufficiently complete, which incurs incomprehensive results. In this paper, we propose an ANTLR-based feature extraction and detection system to solve this problem. Specifically, nine novel programming feature detection rules are abstracted and applied in our model. The experimental results show our system can effectively extract programming features from projects and provide feedback for students and teachers."}, "conf/iwcmc/ChangSWG18": {"title": "Scratch Analysis Tool(SAT): A Modern Scratch Project Analysis Tool based on ANTLR to Assess Computational Thinking Skills.", "url": "https://doi.org/10.1109/IWCMC.2018.8450296", "year": "2018", "author": {"Zhong Chang": "225/8564", "Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:With the introduction of computer programming in schools around the world, Scratch has risen in prominence for its thinkable, meaningful and social. Aiming to assessing the Computational Thinking skills of a Scratch program, we design and implement a new Scratch program analysis tool based on ANTLR. To solve some flaws (e.g., high failure rate and low efficiency) in Dr. Scratch which is the most relevant tool to assess Computational Thinking skills of Scratch programs, we choose the recognition tool ANTLR to design the system module and the assessing flow. And then, we customize more than 200 lexical and syntax parser rules in ANTLR. Furthermore, we expand the grading standard of assessing Computational Thinking skills in Dr. Scratch. Some fundamental concepts in Computer Science, such as stack, queue and recursion method, are involved in our grading standard. Experiment results show the performance (e.g., success rate, execution time) of SAT is superior to that of Dr. Scratch."}, "conf/bigcom/Xie0L17": {"title": "Secured Data Storage Scheme Based on Block Chain for Agricultural Products Tracking.", "url": "https://doi.org/10.1109/BIGCOM.2017.43", "year": "2017", "author": {"Chao Xie": "04/5576", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:The Internet of Things technology has been widely used in the quality tracking of agricultural products, however, the safety of storage for tracked data is still a serious challenge. Recently, with the expansion of blockchain technology applied in cross-industry field, the unchangeable features of its stored data provide us new vision about ensuring the storage safety for tracked data. Unfortunately, when the blockchain technology is directly applied in agricultural products tracking and data storage, it is difficult to automate storage and obtain the hash data stored in the blockchain in batches base on the identity. Addressing this issue, we propose a double-chain storage structure, and design a secured data storage scheme for tracking agricultural products based on blockchain. Specifically, the chained data structure is utilized to store the blockchain transaction hash, and together with the chain of the blockchain to form a double-chain storage, which ensures the data of agricultural products will not be maliciously tampered or destructed. Finally, in the practical application system, we verify the correctness and security of the proposed storage scheme."}, "conf/globecom/RenSWO17": {"title": "A Hash-Based Distributed Storage Strategy of FlowTables in SDN-IoT Networks.", "url": "https://doi.org/10.1109/GLOCOM.2017.8254507", "year": "2017", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:Nowadays the integration of IoT and SDN has been a research hotspot which attracts significant attention. However, as resources are relatively limited in IoT, direct application of SDN will cause some challenges, one of them is that IoT forwarding nodes cannot store massive complex FlowTables like a traditional OpenFlow switch. To solve the problem, this paper proposes a hash-based distributed storage strategy. Specifically, we present a multi-dimension selection method to decide the optimum distributed storage location. And then a hash space is formed by using the content of data flow in IoT, it is the basis of FlowTables deployment and data forwarding in distributed storage. Moreover, we introduce a new FlowTables search mechanism which is built on the principle of the binary tree. Experimental results demonstrate that our strategy efficiently improves the FlowTables storage capacity with small performance loss in IoT."}, "conf/icc/GuoSWOL17": {"title": "Monitoring the status of iBeacons with crowd sensing.", "url": "https://doi.org/10.1109/ICC.2017.7997400", "year": "2017", "author": {"Yingying Guo": "51/7390", "Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882", "Wei-Tsong Lee": "76/2345"}, "abstract": " Abstract:Since Apple introduced the iBeacons in Worldwide Developers Conference (WWDC) 2013, the iBeacon has been rapidly accepted and generalized in the market. For the deployed iBeacons, it is necessary to monitor their status. In this paper, we design a crowd sensing based monitoring framework which combines the moving and static schemas of participants to monitor the real status of iBeacons. In such a system, the inaccuracy and conflict of the collected signal information, commonly caused by the error rate of participants or the differences of sensing context, have received more and more attention. Estimating the real status of iBeacons according to the uploaded signal information becomes a big challenge for our monitoring system. Towards this end, we propose a context-aware estimation approach in this paper. We first model the effects of sensing context, and then propose an iterative method to infer the error rate of participants and estimate the real status of iBeacons with high precision. Our method is tested via extensive simulations, and verified by our monitoring system which has been applied in the teaching building. The results demonstrate that the proposed estimation approach outperforms recent popular three-estimates algorithm and OtO EM algorithm. At last, we develop the review mechanism, which ensures the efficiency of our monitoring system."}, "conf/iwcmc/GuoSW17": {"title": "Robust estimation based crowd sensing enhancement for iBeacon map construction.", "url": "https://doi.org/10.1109/IWCMC.2017.7986265", "year": "2017", "author": {"Yingying Guo": "51/7390", "Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992"}, "abstract": " Abstract:For crowd sensing applications, the inaccuracy and conflict of the reported samples, commonly caused by untrained participants and heterogeneous mobile devices, have received more and more attention. Given this, constructing a high-quality radio map of iBeacons via crowd sensing is very challenging. In this paper, we resort to the family of robust estimation and design a robust radio map construction scheme, named by RrMCS, to enhance the quality of iBeacon map construction via crowd sensing. For heterogeneous devices, we use a linear robust estimation technique to map the signal strength scanned by different users into a uniform space. Moreover, we alleviate the negative influence of outliers and detect the abnormal participants by utilizing the multivariate robust statistics on the signal information uploaded by different users. Finally, we implement an Android-based system for constructing the iBeacon radio map and conduct extensive experiments under indoor environment. The experimental results validate the enhancement of the constructed iBeacon radio map by the proposed RrMCS."}, "conf/ucami/WangLS17": {"title": "IOT Service Recommendation Strategy Based on Attribute Relevance.", "url": "https://doi.org/10.1007/978-3-319-67585-5_4", "year": "2017", "author": {"Pingquan Wang": "174/4942", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": "In this article, we research on the service recommendation strategy in the IoT. The user attribute similarity and the attribute correlation of user and device service are computed, and the recommendation system is recommended based on the calculation results. In order to solve the cold start problem, we propose the tensor linear regression model. The experiment results show the recommendation strategy was effective.KeywordsIoTService recommendationAttribute relevanceTensorCold start"}, "conf/bigcom/LiLSL16": {"title": "Similarity Search Algorithm over Data Supply Chain Based on Key Points.", "url": "https://doi.org/10.1007/978-3-319-42553-5_1", "year": "2016", "author": {"Peng Li": "83/6353", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Xinming Li": "145/0602"}, "abstract": "In this paper, we target at similarity search among data supply chains, which plays essential role in optimizing the chain and extending its value. This problem is very challenging for application-oriented data supply chains because the high complexity of data supply chain makes the computation of similarity extremely complex and inefficiency. In this paper, we propose a feature space representation model based on key points, which can extract the key features from sub-sequences of the original data supply chain and simplify the original data supply chain into a feature vector form. Then, we formulate the similarity computation of key points based on the multi-scale features. Further, we propose an improved hierarchical clustering algorithm for similarity search over data supply chains. The main idea is to separate sub-sequences into disjoint groups such that each-group meets one specific clustering criteria, and thus the cluster containing the query object is the similarity search result. The experimental results show that the proposed approach is both effective and efficient for data supply chain retrieval.KeywordsData supply chainSimilarity searchFeature spaceHierarchical clustering"}, "conf/icc/GuoSLWO16": {"title": "Accurate indoor localization with crowd sensing.", "url": "https://doi.org/10.1109/ICC.2016.7510872", "year": "2016", "author": {"Yingying Guo": "51/7390", "Yan Sun 0004": "181/2323-4", "Yatao Li": "98/4958", "Tin Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:Indoor localization is an important primitive that can enable many ubiquitous computing applications. This paper improves the scheme of landmark and inertial navigation through crowd sensing to address reliable and accurate indoor localization. The location of landmark can calibrate the location of user and inertial navigation can optimize the location of landmark in turn. In this work, we define the landmark as certain characteristic structure with Beacon. To tackle the challenges of misjudgment of landmarks and variability in user walking profiles, we have developed algorithms for reliable detection of landmarks and personalization of step length with the aid of crowd sensing. We have built an indoor localization system integrating these modules and an indoor floor map, which can be further improved with more users using our system. We demonstrate for the first time a meter-level indoor localization system that is self-improving, user adaptive, and easy to deploy. Extensive experiments on users with smartphone devices, with over 37 subjects walking over an aggregate distance of over 20 kilometers were carried out. Evaluation results show that our system can achieve a mean accuracy of 2m initially and 1m with the calibration of landmarks in a 39m × 21m testing area."}, "conf/iwcmc/GuoLS16": {"title": "Accurate indoor localization based on crowd sensing.", "url": "https://doi.org/10.1109/IWCMC.2016.7577143", "year": "2016", "author": {"Yingying Guo": "51/7390", "Yatao Li": "98/4958", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Indoor localization is an important primitive that can enable many ubiquitous computing applications. In this paper, we choose the iBeacon as landmark and improve the localization scheme of iBeacon and inertial navigation through crowd sensing. Specifically, we use crowd sensing to design a parameter learning algorithm for device diversity. Furthermore, we take advantage of crowd sensing to collect the correction information of iBeacon about inertial navigation, which can optimize the step length estimation and direction inference. We demonstrate for the first time a meter-level indoor localization system that is self-improving, user adaptive, and inclusive to diversity. Extensive experiments on users with mobile devices, with over 37 subjects walking over an aggregate distance of over 10 kilometers were carried out. Evaluation results show that the accuracy is within 2m in a 39m×21m testing area."}, "conf/msn/SunLS16": {"title": "Privacy-Preserving Recoverable Photo Sharing in Mobile Social Network.", "url": "https://doi.org/10.1109/MSN.2016.033", "year": "2016", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:It is common to take photos and share them by smartphone in mobile social network at present, but the sharer may need to mask partial areas of the photo to avoid leaking the privacy. Reversible image mosaic can mask the privacy very well. However, there is little discussion on how to effectively control and safely store the mosaic information for recovering. In this paper, we first propose a prediction algorithm of reversible image mosaic size (PARIMoS), which can calculate the maximum number of mosaic blocks according to the image quality of non-mosaic area and the recovery quality of mosaic required by user. And then, we propose an efficient and reliable generating algorithm of reversible image mosaic (GAoRIM). In GAoRIM, we compress the secret information of the mosaic area with twice-run-length-encoding and then store the compressed result in special non-mosaic areas of image separately. Therefore, it can ensure reliable recovery even the image is partly stained, and hardly change the roughness of non-mosaic area. The experiment results show that the biggest change of average roughness in the non-mosaic area is less than 0:5%. Comparing with the similar algorithms, on average, the amount of data protected by GAoRIM is at least 8:70% higher than theirs while the peak signal noise ratio (PSNR) of stego image without mosaic is similar to theirs."}, "conf/globecom/GuoSWO15": {"title": "Context-Aware Estimation Approach Based on Participatory Sensing.", "url": "https://doi.org/10.1109/GLOCOM.2014.7417626", "year": "2015", "author": {"Yingying Guo": "51/7390", "Yan Sun 0004": "181/2323-4", "Tin Yu Wu": "44/3992", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:In participatory sensing applications, the inaccuracy and conflict of the reported data, commonly caused by the error rate of participants or the differences of observation context, have received more and more attention. Estimating the real status of facilities according to observations becomes a big challenge for participatory sensing. Towards this end, we propose a context-aware estimation approach based on participatory sensing in this paper. We first model the effects of observation context, and then propose an iterative method to infer the error rate of participants and estimate the real status with high precision. Our method is verified using a public facilities monitoring application in our campus, and tested via extensive simulations. The results demonstrate that the proposed method outperforms recent popular three-estimates algorithm and OtO EM algorithm."}, "conf/icpads/WangLS15": {"title": "A Habit-Based SWRL Generation and Reasoning Approach in Smart Home.", "url": "https://doi.org/10.1109/ICPADS.2015.101", "year": "2015", "author": {"Pingquan Wang": "174/4942", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:In this paper, we propose a habit-based SWRL generation and reasoning approach in smart home. Definition and recognition of habits of daily living can provide humanized smart home for assisted living application, especially for people with memory deficits. This paper presents Recognizing Habit of Daily Living(RHDL) by discovering and monitoring smart home context information. The habit and habit association of using electrical appliances are defined explicitly for the first time. The generation rules between habit/complex habit and SWRL are designed, and the reasoning is based on the Semantic Web Rule Language(SWRL). The ontology model for the RHDL is designed and the prototype system of RHDL is implemented using protege and Jess tools."}, "conf/apweb/SunY14": {"title": "A Security Routing Mechanism against Sybil Attacks in Mobile Social Networks.", "url": "https://doi.org/10.1007/978-3-319-11119-3_30", "year": "2014", "author": {"Yan Sun 0004": "181/2323-4", "Lihua Yin": "07/7486"}, "abstract": "Mobile social networks (MSNs) are a kind of delay tolerant network that consists of lots of mobile nodes with social characteristics. Recently, many social-aware algorithms have been proposed to address routing problems in MSNs. However, it also brings more security and privacy concerns. In this paper, we discuss a specific type of Sybil attack in MSNs, which few researches has been focused on. We proposed a security mechanism to detect Sybil nodes and eliminate them to ensure the routing security while routing forwarding. It needs to cooperate by two sides, which is, respectively measuring distance in client side and eliminating Sybil nodes in server side. We also demonstrate the solution is correct and analyze its energy costs.KeywordsSybil AttacksMobile Social NetworksRouting Security"}, "conf/iih-msp/WangSL14": {"title": "Service Conflict Detection and Avoidance Based on Scene with Urgency Degree.", "url": "https://doi.org/10.1109/IIH-MSP.2014.192", "year": "2014", "author": {"Xukai Wang": "160/1881", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:Service conflict is an essential issue in smart home automation, which causes the service execution inefficient and inconvenient. In this paper, we propose a conflict detection and avoidance schema based on scene with urgency degree. First, we classify services into five categories. Users can customize their specific scene using different categories of services which can be set with their own urgency degree. Second, we propose a formal service model, ETA, which includes environment variable, trigger and actuator to describe each service. In the design phase of a scene, we use ETA model to detect conflict among the services with same urgency degree. While in the execution phase of a scene, it is effective to avoid service conflict by using its higher urgency degree to choose which service can be executed properly."}, "conf/iih-msp/LiuSL14": {"title": "Security Analysis for UHF RFID Tags.", "url": "https://doi.org/10.1109/IIH-MSP.2014.196", "year": "2014", "author": {"Xinwei Liu": "46/391", "Yan Sun 0004": "181/2323-4", "Jie Liu": "03/2134"}, "abstract": " Abstract:With RFID applications being used more widely, their security risks are growing. Especially, there are many threats in the security of tags in RFID system. Due to their physical structure, plenty of vulnerabilities exist in memory bank and simple communication protocols. In this paper, we analyze the vulnerabilities of memory banks, detail the treats of the vulnerabilities in the cases of different numbers of tags and different distances between tags and readers. Finally we design attack cases to verify the vulnerabilities in reading and writing operation of tags."}, "conf/infocom/SunYL14": {"title": "Defending sybil attacks in mobile social networks.", "url": "https://doi.org/10.1109/INFCOMW.2014.6849206", "year": "2014", "author": {"Yan Sun 0004": "181/2323-4", "Lihua Yin": "07/7486", "Wenmao Liu": "62/9032"}, "abstract": " Abstract:Mobile social networks (MSNs) are a kind of delay tolerant network that consists of lots of mobile nodes with social characteristics. Recently, many social-aware algorithms have been proposed to address routing problems in MSNs. However, it also brings more security and privacy concerns. In this paper, we discuss a specific type of Sybil attack in MSNs, which few researches has been focused on. We proposed a security mechanism to detect Sybil nodes and eliminate them to ensure the routing security while routing forwarding. It needs to cooperate by two sides, which is, respectively measuring distance in client side and eliminating Sybil nodes in server side. We also demonstrate the solution is correct and analyze its energy costs."}, "conf/ancs/LiuGYS13": {"title": "Balancing authentication and location privacy in cooperative authentication.", "url": "https://doi.org/10.1109/ANCS.2013.6665181", "year": "2013", "author": {"Licai Liu": "139/1793", "Yunchuan Guo": "22/7487", "Lihua Yin": "07/7486", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:In MANET, the cooperative authentication mechanism requires the cooperation of the neighbor nodes and significantly enhances the authentication probability. However, it exposes location privacy of neighbor nodes and is costly. How to balance the authentication and location privacy is a key issue. In this paper, we use game theory to analyze the behavior of neighbor nodes in cooperative authentication and gain the optimal strategy. Every node seeks to obtain most reward at least location privacy loss and cost. We first build the static game with complete information and obtain two pure-strategy and one mixed-strategy Nash equilibria. These equilibria can be used efficiently to balance authentication and location privacy. Then, we build the static game with incomplete information and obtain the Bayesian Nash equilibria."}, "conf/cyberc/SunYL13": {"title": "Towards a Trusted Mobile RFID Network Framework.", "url": "https://doi.org/10.1109/CyberC.2013.18", "year": "2013", "author": {"Yan Sun 0004": "181/2323-4", "Lihua Yin": "07/7486", "Licai Liu": "139/1793"}, "abstract": " Abstract:Although the mobile RFID system has various applications in Internet of Things(IoT), it has a limited communication range and raises some serious privacy and security problems. To improve the issuers above, we propose a new mobile RFID network framework based on security and privacy protection. In the framework, we design a Reader Network using ad hoc mechanism, that readers with short communication range could extend their communication distance for meeting more application service requirement. Meanwhile, we introduce TPM(Trusted Platform Module) to reader node to ensure the security and privacy of node and give the detailed trusted and privacy mechanisms based on TPM. These mechanisms ensure the node secure and privacy."}, "conf/icpads/SunYX13": {"title": "Privacy Vulnerability Analysis on Routing in Mobile Social Networks.", "url": "https://doi.org/10.1109/ICPADS.2013.82", "year": "2013", "author": {"Yan Sun 0004": "181/2323-4", "Lihua Yin": "07/7486", "Shuang Xin": "145/0636"}, "abstract": " Abstract:Mobile social networks (MSNs) are a kind of delay tolerant network that consists of lots of mobile nodes with social characteristics. Recently, many social-aware algorithms have been proposed to address routing problems in MSNs. Because of the social properties introduced to routing, this results in node privacy disclosure. In this paper, analyzing social-based routing strategies, we propose a privacy attack tree model taking all the possible attack on social-based routing into account. This model describes all of the possibilities and approaches of privacy disclosure, and quantifies their the occurrence probability."}, "conf/msn/LuoLS13": {"title": "Efficient Sleep Scheduling for Avoiding Inter-Cluster Interference in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/MSN.2013.16", "year": "2013", "author": {"Hong Luo 0001": "67/876-1", "Jianming Liao": "140/8505", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Clustering sensor nodes is an effective method for achieving high energy efficiency and flexible data aggregation in wireless sensor networks. However, scheduling all clusters to avoid the inter-cluster interference and meanwhile send all observation to the sink quickly is a difficult problem. In this paper, we use interference graph to model the inter-cluster collision problem and propose an efficient sleep scheduling mechanism in the clustered wireless sensor networks. We firstly divide the clusters into layers, then transform the cluster-tree network into the interference graph of clusters, and thereby divide all clusters on one layer into different independent sets. All clusters in the same independent set can work simultaneously without interference, while all independent sets are scheduled one by one for collision-free. To reduce the total delay of data report in the whole network, we propose three kinds of rules to sort the independent sets. Simulation and analysis show that the degree-based sorting rule works best. The practical experiments also verify this conclusion."}, "conf/dcoss/ZhaoMSLL12": {"title": "Adaptive Synchronization Control with Multi-level Buffer in Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.1109/DCOSS.2012.25", "year": "2012", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Liang Liu 0001": "10/6178-1"}, "abstract": " Abstract:In Wireless Multimedia Sensor Networks (WMSNs), data fusion and collaborative in-network processing operations often require effective multimedia synchronization control. Extensive researches have been done in the traditional networks. Most of these works assume that there exists a powerful synchronization controller in the network. However, for WMSNs, the in-network processing of the multimedia content is usually performed based on the resource-constrained sensors. Traditional synchronization control algorithms fail to run on the low-end hardware platform. In this paper, we propose an adaptive synchronization control scheme with multi-level buffer to address this problem. Main contributions of this paper are as follows. (i) To overcome the resource constraint of WMSNs, we perform the synchronization control in a distributed way by combining the sensors in the stream transmission path. (ii) By evaluating the current network state, we adjust the level number of the buffer adaptively to balance the delay and delay jitter. (iii) Through analyzing the buffer state of each level, we propose an efficient packet scheduling scheme to reduce the delay jitter actively. (iv) We implement the proposed scheme and verify its effectiveness in our practical WMSNs platform. The experiment results show that the proposed scheme can maintain the streams synchronization effectively with the low-end sensors."}, "conf/msn/LuoLS11": {"title": "Semantics-Based Service Mining Method in Wireless Sensor Networks.", "url": "https://doi.org/10.1109/MSN.2011.69", "year": "2011", "author": {"Hong Luo 0001": "67/876-1", "Lei Liu": "21/2715", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Wireless Sensor Networks are attracting lots of attention for its broad application areas, and hence the services provided by WSNs become much more diverse. But with the development of in-depth applications, service discovery and composition are challenges to the end users. Service mining is a new technique in Internet which can discover new composite services from the abundantly existing services in Internet to meet the users' needs. However, those service mining methods are not practical in the energy-exhausted and application-oriented WSNs. In this paper, we develop a semantics-based service mining method for WSNs, to provide users with interesting composite services. In this method, services are combined and recommended to users actively according to the calculation of service similarity and an up datable semantic database. By the results of service similarity, useless compositions are filtered out so that energy consumption on service flooding can be reduced. The update strategy of semantic database is also given out, by which the composite services can keep up with time and be more applicative. The benefits of the proposed method are that all operations such as calculating, filtering, and updating are simple enough and can be performed at broker nodes."}, "conf/wowmom/ZhaoMSL11": {"title": "Distributed audio synchronization scheme using audio endpoint inWASNs.", "url": "https://doi.org/10.1109/WoWMoM.2011.5986385", "year": "2011", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": " Abstract:In Wireless Audio Sensor Networks (WASNs), many applications such as target tracking, data fusion and localization, often require precise synchronization among audio streams. Extensive researches have been done under the assumption that wireless channel is well enough and the cluster head is power supplied. However, these conditions can not be satisfied in many applications. When audio event occurs, the burst of data is usually coupled with a high packet loss rate. Besides, the cluster head is usually battery-powered, especially in the wild environment. In this paper, we propose a distributed audio synchronization scheme to address these challenges. By dynamically detecting the endpoint of the audio streams and marking the start point of the audio synchronization obviously at the reporting sensor, we can eliminate the sound propagation delay effectively and synchronize the audio streams precisely even under the high packet loss rate. Moreover, by handling the synchronization task in a distributed way, we can lighten the burden of the cluster head and prolong the lifetime of the whole network greatly. To improve the flexibility of the scheme, we also propose a self-adaptive algorithm which can adjust the parameters of the synchronization according to the network condition. Experimentally, we show that the proposed scheme can synchronize the audio streams under different conditions with low energy cost."}, "conf/wowmom/ZhaoMSLM11": {"title": "Enhanced surveillance platform with low-power wireless audio sensor networks.", "url": "https://doi.org/10.1109/WoWMoM.2011.5986188", "year": "2011", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "XuFei Mao": "26/775"}, "abstract": " Abstract:Video surveillance system, which can provide real-time display of the monitored scene and video playback, has been employed in many areas including: commercial security, accident investigation, law enforcement and emergency response. However, audio which carries important information not available in video is usually not taken seriously and used effectively. In this paper, we develop an enhanced surveillance platform by introducing the low-power wireless audio sensor networks (WASNs). We can obtain more comprehensive and precise monitoring without the limitation of the line-of-sight and lighting condition. Moreover, this platform is designed and built for providing key support to varieties of applications. This article describes the platform architecture, including design, implementation, and performance. We describe the audio sensor platform which can deliver high-quality audio over sensor network by multi-hops with low power requirement. In addition, we present the multimedia synchronization mechanism in the heterogeneous network which is the foundation of applications in the proposed platform. Our experiments include an in-depth analysis of the bottlenecks within the platform as well as measurements for the various components."}, "conf/icdcs/LuoWSML10": {"title": "Adaptive Sampling and Diversity Reception in Multi-hop Wireless Audio Sensor Networks.", "url": "https://doi.org/10.1109/ICDCS.2010.32", "year": "2010", "author": {"Hong Luo 0001": "67/876-1", "Jinge Wang": "70/5470", "Yan Sun 0004": "181/2323-4", "Huadong Ma": "04/6217", "Xiang-Yang Li 0001": "l/XiangYangLi"}, "abstract": " Abstract:Wireless Audio Sensor Networks (WASNs) can provide event detection, object tracking and audio stream monitoring through cooperative audio sensor nodes. Extensive researches have focused on sound detection and source localization, but little work is on the monitoring and recovery of audio stream. To clearly reconstruct the real-time audio stream from WASNs, both the quantity and quality of samples provided by sensor nodes should be carefully considered. In this work, we propose a novel approach termed \"adaptive sampling and diversity reception\", which can significantly reduce the energy consumption of network while maintaining high accuracy of audio stream. On one hand, by selectively picking sampling nodes and adaptively adjusting their sampling rates, sufficient samples arrive at the fusion node for high recovering fidelity. On the other hand, through Maximal-Ratio-Combining(MRC)-like signal fusion scheme at the fusion node, the signal-to-noise ratio (SNR) of combined audio is further improved. Meanwhile, we propose a heuristic algorithm of sampling rate assignment which can select a set of optimal sampling nodes and hence minimize the energy consumption on data transmission. Analytically and experimentally, we show that the proposed scheme can improve the signal recovering fidelity tremendously with low energy cost."}, "conf/icpads/ZhaoMLS10": {"title": "Adaptive Audio Synchronization Scheme Based on Feedback Loop with Local Clock in Wireless Audio Sensor Networks.", "url": "https://doi.org/10.1109/ICPADS.2010.21", "year": "2010", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Wireless Audio Sensor Networks (WASNs) can provide event detection, object tracking and emergency response through cooperative audio sensor nodes. Effective collaboration of audio sensors requires precise synchronization among audio streams. Some researches have been done on the timestamp mechanism based on time synchronization ignoring propagation delay and many other researches have focused on the synchronization of simple gunshot or scream. However, for the synchronization of intermittent and fluctuating audio stream, there still exists many challenges. In this paper, we propose an effective audio synchronization scheme which can synchronize the intermittent audio streams adaptively while maintain low energy cost. On one hand, we obtain audio synchronization without global clock which save energy tremendously. On the other hand, by introducing a feedback loop mechanism, we can keep a high audio synchronization fidelity even when the audio source moves around and the sound strength varies with time. Furthermore, we discuss the extension for flexibility and scalability of this scheme when there exist several sound sources simultaneously or the audio source moves among clusters. Through experiments on a WASNs platform and simulations, we show that the proposed scheme is desirable to guarantee the accuracy of audio synchronization in practical environment with low energy cost."}, "conf/euc/WangSM08": {"title": "Analysis of Data Delivery Delay in Acoustic Sensor Networks.", "url": "https://doi.org/10.1109/EUC.2008.21", "year": "2008", "author": {"Chao Wang": "188/7759", "Yan Sun 0004": "181/2323-4", "Huadong Ma": "04/6217"}, "abstract": " Abstract:Acoustic sensor networks can provide rich multimedia information, which doubtlessly benefit a plethora of data hungry applications such as environment monitoring, health care, emergency response, and security surveillance. In this paper, we study the data unit delivery process of cluster head by developing a discrete-time Markov chain model and a M/G/1 queue model, based on a single-hop cluster-based sensor networks architecture. Our analysis shows how arrival rate and the number of sensor nodes influence mean waiting time and how many sensor nodes that a cluster head can support. The result of our study can be used to guide the design of real-time acoustic wireless sensor networks system."}, "conf/middleware/SunM06": {"title": "AuViM: a middleware for audio/video sensor networks.", "url": "https://doi.org/10.1145/1176866.1176873", "year": "2006", "author": {"Yan Sun 0004": "181/2323-4", "Huadong Ma": "04/6217"}, "abstract": "\n\t\tAudio/video sensor networks can provide rich multimedia information, which doubtlessly benefits a plethora of data hungry applications such as environment monitoring, health care, emergency response, and video security. In this paper, we propose an Audio/Video sensor networks middleware AuViM to satisfy user's various QoS requirements flexibly. The components of AuViM can be flexibly deployed on each type of node. Moreover, we describe two kinds of basic working modes - location-centric one and interested data-centric one. In particular, the QoS tree is introduced to help users to customize individual QoS requirements. Finally, we describe a typical application case to show that our AuViM can not only flexibly meet user's QoS requirements, but also support the realization of audio/video sensor networks applications effectively.\n\t"}, "journals/apin/QiSLG22": {"title": "Scratch-Rec: a novel Scratch recommendation approach adapting user preference and programming skill for enhancing learning to program.", "url": "https://doi.org/10.1007/s10489-021-02970-7", "year": "2022", "author": {"Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": "Among teenagers, online programming learning platforms, such as Scratch, have obtained promising achievements for guiding beginners. However, with the ever-growing number of users, there is an urgent issue that learners are confused by the massive amounts of programming resources and cannot find projects that fulfill their tastes and programming skills. To tackle this issue, we propose Scratch-Rec, which is a novel Scratch recommendation model considering programming preferences and programming skills, to help users find suitable programming resources. In Scratch-Rec, we first design a project embedding scheme to convert projects into vectors that preserve source code features and semantic features. Based on the embeddings, we propose a water wave diffusion model to analyze users’ diverse preferences and aggregate their programming preferences along links in a user-project interaction graph. To track the evolving programming skills of users, we advance a programming skill learning model that combines long-short term memory networks (LSTM) with an attention network. LSTM models the time-dependency programming skills while the attention network weighs the importance of projects. Then, users’ programming preferences and programming skills are merged and input to multilayer perceptron neural networks for final probability predictions. Extensive experiments on the Scratch dataset show that Scratch-Rec performs better than other state-of-the-art models in recommending programming projects."}, "journals/ijis/QiWSL22": {"title": "ScratchGAN: Network representation learning for scratch with preference-based generative adversarial nets.", "url": "https://doi.org/10.1002/int.22730", "year": "2022", "author": {"Peng Qi": "59/9474", "Yilei Wang": "37/4826", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ijis/QiSL22": {"title": "Scratch-RL: A preference-driven adversarial reinforcement reasoning framework over knowledge graphs for explainable recommendation of Scratch.", "url": "https://doi.org/10.1002/int.22931", "year": "2022", "author": {"Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/tetc/QiSLG22": {"title": "Scratch-DKG: A Framework for Constructing Scratch Domain Knowledge Graph.", "url": "https://doi.org/10.1109/TETC.2020.2996710", "year": "2022", "author": {"Peng Qi": "59/9474", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:With the rapid development of programming platforms, how to utilize the tremendous amount of data produced by the platforms, such as Scatch, has been a big challenge to researchers. The growing data is not only huge, but also heterogeneous and diverse, leading that the existing tools cannot effectively extract valuable information. In this article, considering particular features of Scratch data, we propose an effective framework about constructing a Scratch Domain Knowledge Graph (Scratch-DKG). Our framework includes four modules which are designed to process the semi-structured data, users profile data, projects data and programming knowledge points, respectively. For webpages, we design a template-based wrapper method to extract triples from the semi-structured data. As for users profile data, we improve DeepDive, which is a useful tool to extract information but with the problem of wrong labeling, to extract knowledge triples by the proposed Secondary Labeling Algorithm. For projects data, we propose an advanced keywords extraction method (S-TextRank) to extract keywords triples. For programming knowledge points, we develop a frequently contiguous block combinations mining algorithm to extract the potential domain information of Scratch. Finally, extensive experiments are carried out to evaluate the performance of our proposed methods. The experimental results show that, compared to other competing methods, our proposal can extract more correct and comprehensive Scratch triples."}, "journals/tetc/ChaiSLG22": {"title": "DWES: A Dynamic Weighted Evaluation System for Scratch based on Computational Thinking.", "url": "https://doi.org/10.1109/TETC.2020.3044588", "year": "2022", "author": {"Xiaolin Chai": "305/2325", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Scratch is a programming environment, which is widely adopted as the first language to enter the programming world. Since Scratch projects are rich in multimedia resources, it can be time-consuming to judge them by hand, requiring manual execution with the understanding of each project. Auto-judgment tools come into being, they can rapidly evaluate the project in some way. Unfortunately, the existing tools are too rigid and they ignore the diversity of Scratch projects. To address this issue, we propose a new dynamic weighted evaluation system (DWES). First, we define a new computational thinking (CT) evaluation criteria from eight aspects. Second, based on the proposed criteria, we present an analysis tool that automatically assesses the CT skills of the learners’ projects. Third, considering the characteristics of projects, we dynamically adjust the evaluation results according to types, so that a single standard is no longer applied roughly to all. This process is data-driven, we consider the CT performance and scripts of projects. We prove the rationality of the evaluation criteria from the aspect of program complexity. Through the correlation analysis between DWES CT scores and experts’ ratings, we find that compared with Dr. Scratch, the correlation coefficient has increased."}, "journals/tnse/RenSLG22": {"title": "A Demand-Driven Incremental Deployment Strategy for Edge Computing in IoT Network.", "url": "https://doi.org/10.1109/TNSE.2021.3120270", "year": "2022", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Edge Computing brings great opportunities to enable the Internet of Things (IoT) vision. But the physical edge server deployment problem still poses a major challenge, which dramatically affects the service ability and service cost of edge computing. Previous work mostly assume that the edge servers are installed at one time. However, due to ever-increasing services, limited budget and evolving techniques, it is more reasonable to deploy edge servers in a gradual fashion. In this paper, we propose a demand-driven incremental deployment strategy (DDID) to resolve this problem. First, a novel demand model is designed to quantify the rigid and non-rigid demand of IoT services for edge computing. Then, we formulate the edge server multi-period deployment problem as a bi-level integer linear program model. The lower-level placement is to minimize the overall deployment cost throughout a planning horizon. We adopt a subgradient optimization with Lagrangian dual to solve this subproblem. In the upper-level allocation, due to the capacity limitation, we adopt a best-effort tuning scheme to prioritize the high demand services with multiple objectives. This subproblem is addressed by an improved MOEA/D (Multi-objective Evolutionary Algorithm Based on Decomposition). Finally, we evaluate the DDID in synthetic topologies. Experimental results show that, compared to the one-time deployment method, it reduces the deployment cost by 18% on average with acceptable service ability loss for edge computing."}, "journals/iotj/YangLSZG21": {"title": "Coalitional Game-Based Cooperative Computation Offloading in MEC for Reusable Tasks.", "url": "https://doi.org/10.1109/JIOT.2021.3064186", "year": "2021", "author": {"Xuemei Yang": "82/1133", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Junwei Zou": "48/8378", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Mobile-edge computing (MEC) has been a promising solution for Internet-of-Things (IoT) applications to obtain latency reduction and energy savings. In view of the loosely coupled application, multiple devices can use the same task code and different input parameters to obtain diverse results. This motivates us to study the cooperation between devices for eliminating the repeated data transmission. Leveraging coalitional game theory, we formalize the cooperative offloading process of a reusable task into a coalitional game to maximize the cost savings. In particular, we first propose an efficient coalitional game-based cooperative offloading (CGCO) algorithm for the single-task model, and then expand it into a CGCO-M algorithm for the multiple-task model with jointly applying a two-stage flow shop scheduling approach, which helps to obtain an optimal task schedule. It is proved that our CGCO and CGCO-M can achieve the Nash-stable solution with convergence guarantee, and CGCO can obtain an optimal solution. The simulations show that CGCO is equal to the optimal exhaustive search (ES) method and CGCO-M is close to ES in terms of cost ratios. Cost ratios of CGCO and CGCO-M are significantly down by 41.08% and 83.70% compared to local executions, respectively. Meanwhile, CGCO-M obtains 41.46% and 89.74% reductions when reuse factors are 0.1 and 1, which means CGCO-M can save more cost with higher reuse density."}, "journals/tnsm/RenSLG21": {"title": "SILedger: A Blockchain and ABE-based Access Control for Applications in SDN-IoT Networks.", "url": "https://doi.org/10.1109/TNSM.2021.3093002", "year": "2021", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:The Software Defined Network in Internet of Things (SDN-IoT) is enjoying growing popularity due to its flexibility, automaticity and programmability. However, there is still a lack of proper permission management on SDN-IoT applications (SIApps), especially when the SIApp’s required northbound interfaces are located in multiple heterogeneous controllers without mutual trust. Existing access control methods are usually based on centralized models, proprietary controllers, trusting conditions or manual operations. It can incur unnecessary performance degradation and poor scalability. To solve this problem, this paper proposes a SIApps’ ledger (SILedger), an open, trusted, and decentralized access control mechanism based on blockchain and attribute-based encryption (ABE). It can not only support effective authorization of SIApps in heterogeneous and untrusted SDN-IoT control domains, but also record all interactions between SIApps and resources, and thus facilitate SIApps further charging, analysis and audit. The main idea is that the SIApps are authorized using access tokens encrypted by ABE, and these tokens are seen as the currency of blockchain to be distributed. Specifically, we re-design blockchain transaction, token encryption, token initialization and token update schemes to achieve cross-domain, fine-grained and flexible SIApps’ permission management. In order to mitigate the delay and complexity problem of blockchain and ABE, we devise an access control framework that separates authorization from call process of SIApps. Finally, we perform security analysis and implement a FISCO-BCOS-based prototype for SILedger. The experimental results show that it can provide effective access control for SIApps with negligible overheads."}, "journals/sensors/WeiLS20": {"title": "Mobility-Aware Service Caching in Mobile Edge Computing for Internet of Things.", "url": "https://doi.org/10.3390/s20030610", "year": "2020", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": ""}, "journals/sj/WeiLSO20": {"title": "Cache-Aware Computation Offloading in IoT Systems.", "url": "https://doi.org/10.1109/JSYST.2019.2903293", "year": "2020", "author": {"Hua Wei 0002": "01/6961-2", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:In the Internet of Things (IoT) environment, due to the limited computing power of terminal equipment, edge-cloud computing is a good solution for sharing the computation resources. Terminals can offload partial computations to the edge servers for energy saving and reduce the data transmission delays since the edge servers are usually deployed near the terminal devices. However, in the existing solutions, there is still a lot of unnecessary data transmission when the data used in the offloading jobs of several terminals are related. Adding a shareable cache to the edge server and allowing different computing jobs to share the related data can further reduce the data transmission cost and job delay. In this paper, we study the computation offloading method with cached data and propose a novel cache-aware computation offloading strategy for edge-cloud computing in IoT. First, we formulize the cache-aware computation offloading location problem, our goal is to minimize the equivalent weighted response time of all jobs with computing power and cache capacity constraints. Then, we derive the global optimum solution based on transforming the problem to the transportation problem. Next, since the terminal device is difficult to obtain global status information, we propose an online computation offloading strategy, which is convenient in practical deployment. Finally, experiments show that our online offloading strategy approximates the global optimal solution and it reduces the weighted response time by about 26.13% on average compared to other competing algorithms."}, "journals/access/SunLS19": {"title": "Data Hiding for Ensuring the Quality of the Host Image and the Security of the Message.", "url": "https://doi.org/10.1109/ACCESS.2019.2907530", "year": "2019", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Concealing a message in the APPn markers of a JPEG image not only protects the security of the message but also induces no change to the quality of the image. However, from the existing literature, whether it is a plaintext message or a ciphertext message hidden in APPn, it is easy for an attacker to identify the confidentiality of the hidden message, which is not conducive to the security of the message. Inspired by the natural language processing (NLP) and format-preserving encryption (FPE), this paper proposes a data hiding method, which is focused on the quality assurance of the host image and the concealment of the plain text having complete semantics based on the NLP and FPE. This method first uses the NLP and FPE to identify and encrypt the sensitive words in the plain text and then hides the ciphertext text with the plaintext style in the APPn of a JPEG image after replacing the plaintext words with the ciphertext words that have the plaintext style. The experimental results confirm that the structure, size, and quality of the host image do not show any changes before or after the data hiding and the recovered host image is also identical to its original appearance. In addition, the strategy that the semantic similarity is regulated autonomously by the user also makes it possible to obtain the ideal ciphertext words with very low similarity. Moreover, more than 80% of the ciphertext texts have reasonable semantics. Compared with the existing literature, our algorithm has a better performance."}, "journals/access/SunLS19a": {"title": "Progressive Image Restoration Based on CP-ABE With Constant-Size Ciphertext and Constant Bilinear Calculation.", "url": "https://doi.org/10.1109/ACCESS.2019.2952640", "year": "2019", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4"}, "abstract": " Abstract:Sharing photos on an open social platform with one-to-many features increases the leakage risk of information of the shared photos. Ciphertext-policy attribute-based encryption (CP-ABE) is a one-to-many public key cryptosystem, and its access policy can be set by data owners. Therefore, if we share the protected image on the social platform and encrypt the restoration parameters of the shared image with CP-ABE, then only the accessor whose attribute set satisfies the access policy of CP-ABE can decrypt the ciphertext corresponding to his/her attribute level and then restore the image with the corresponding sharpness level. Consequently, image information protection is realized in a one-to-many scenario. However, for the existing CP-ABE, only when further shortening its ciphertext, reducing the number of bilinear pairing calculations during decryption, and ensuring flexible access policies is it beneficial for CP-ABE to be widely used in popular smart terminals that can run social software. Furthermore, existing algorithms for restoring images also have room for improvement in terms of time and space requirements. For this reason, we propose a progressive image restoration strategy based on the improved CP-ABE in this paper. For the improvement of CP-ABE, we design a new encryption scheme to achieve a shorter constant-size ciphertext, construct an auxiliary function to help the independent authority centers generate private keys for users in new ways, design a decryption algorithm with only one bilinear pairing calculation, and provide the update algorithms for attribute revocation. Subsequently, we build a distributed CP-ABE based on our improved CP-ABE, and the correctness and security of the proposed CP-ABE algorithm are also proven. In addition, we follow the tree access policy to support the access policy, including AND, OR, NOT and threshold operations simultaneously, to adapt to the requirement of some user attributes that undergo frequent changes. Moreover, b..."}, "journals/iotj/RenSLG19": {"title": "BLLC: A Batch-Level Update Mechanism With Low Cost for SDN-IoT Networks.", "url": "https://doi.org/10.1109/JIOT.2018.2868708", "year": "2019", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:Software defined networks have been a driving force of the Internet of Things (IoT) advancement in the devices management and network control. One of the important challenges remaining to be resolved is how to safely complete the network update with low resources' consumption. In this paper, we propose a new batch-level update mechanism with low cost (BLLC) to solve this problem. Its main idea is to bundle control commands and update networks from the destination to the source of new flows. Specifically, we first build update trees for all new flows according to the network states and consistency properties. Then, the new rules in an update tree are packaged into a single control packet (UBCP). Furthermore, a virtual destination-based algorithm is devised to minimize the number of finally formed UBCPs. The generated UBCPs will successively pass all IoT nodes to be updated, and instruct them to apply the required operations. If the control channel is wireless, we introduce a cooperative transmission mechanism to enhance the reliability of the UBCPs' forwarding. Finally, we evaluate our scheme by comprehensive experiments. The results show that the BLLC reduces the link cost by 68% on the average with a slight performance loss in the update time."}, "journals/iotj/RenSLG19a": {"title": "A Novel Control Plane Optimization Strategy for Important Nodes in SDN-IoT Networks.", "url": "https://doi.org/10.1109/JIOT.2018.2888504", "year": "2019", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:One of the crucial technologies for future Internet of Things (IoT) is software defined networks, which provides a centralized and programmable control ability for operators. However, the current single control plane deployed on the remote IoT gateway may incur a bottleneck with the continuous growth of IoT devices and applications. In this paper, we propose a two-level hierarchy (the master and slave) control framework to resolve this problem. Additionally, a novel slave controller placement strategy (SCPS) is presented to further optimize the control performance. In SCPS, we first design a synthetic IoT node importance assessment model based on an improved analytic hierarchy process and fuzzy integral. It considers the device attributes, service attributes, and control frequency. Then we formulate the slave controller placement as a binary integer program problem. It is solved by a modified binary particle swarm optimization algorithm to optimize the control delay and control cost of critical IoT nodes. Finally, we carry out extensive experiments to evaluate the performance of our strategy. The results show that, compared to other competing methods, it approximately reduces the control delay of important IoT nodes by 30.56%."}, "journals/sj/RenSLO19": {"title": "A New Scheme for IoT Service Function Chains Orchestration in SDN-IoT Network Systems.", "url": "https://doi.org/10.1109/JSYST.2019.2921786", "year": "2019", "author": {"Wei Ren": "92/5008", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:With the rapid development of novel techniques like software-defined networks and network function virtualization, the newer concept-service function chains (SFCs)-can be applied in the Internet of Things (IoT) to promote its further advancements. However, due to the unique characteristics and requirements of the IoT, the current optimization methods cannot be directly used to implement IoT service function chains (IoTSFCs). In this paper, we present a novel orchestration scheme to resolve this problem. It contains two steps: compose and place IoTSFCs. In the composition stage, a multicriterion-based arrangement algorithm is designed to determine the order of involved IoT network functions. Moreover, we modify a traditional SFC definition language to describe the composed IoTSFCs. In the placement stage, we formulate this subproblem as a mixed-integer linear programming model. Then, a genetic-algorithm-based heuristic method and a tradeoff mechanism are used to solve it. Finally, we conduct extensive numerical simulations to evaluate the performance of the proposed scheme. The results show that it can approximately reduce the control latency by 50% and the bandwidth consumption by 40% on average."}, "journals/ahswn/SunLSO18": {"title": "Reversible Image Mosaic Technology Providing Large Protection Size and High Image Quality.", "url": "https://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-42-number-3-4-2018/ahswn-42-3-4-p-259-293/", "year": "2018", "author": {"Huaibo Sun": "176/5763", "Hong Luo 0001": "67/876-1", "Yan Sun 0004": "181/2323-4", "Mohammad S. Obaidat": "91/2882"}, "abstract": ""}, "journals/cma/WuTLS18": {"title": "Rogue waves for a variable-coefficient Kadomtsev-Petviashvili equation in fluid mechanics.", "url": "https://doi.org/10.1016/j.camwa.2017.12.021", "year": "2018", "author": {"Xiao-Yu Wu": "179/4370", "Bo Tian": "19/1603", "Lei Liu": "21/2715", "Yan Sun 0004": "181/2323-4"}, "abstract": "Under investigation in this paper is a variable-coefficient Kadomtsev–Petviashvili equation in fluid mechanics, which describes the shallow-water waves with the weak nonlinearity and dispersion. Employing the Kadomtsev–Petviashvili hierarchy reduction, we obtain the rogue-wave solutions in terms of the Gramian. Periodic, cubic- and s-shaped line rogue waves are presented with different forms of the dispersion coefficient. The second-order rogue waves and multi-rogue waves are also graphically discussed. It is observed that only parts of the second-order rogue wave approach the constant background, and the other parts move to the far distance with the undiminished amplitudes. The multi-rogue waves describe the interaction of several first-order rogue waves. We plot the interactions of two periodic, cubic- and s-shaped line rogue waves. The lump wave, which propagates stably in all directions, is also depicted."}, "journals/cma/YinTCLS18": {"title": "Numerical solutions of a variable-coefficient nonlinear Schrödinger equation for an inhomogeneous optical fiber.", "url": "https://doi.org/10.1016/j.camwa.2018.06.025", "year": "2018", "author": {"Hui-Min Yin": "179/4328", "Bo Tian": "19/1603", "Jun Chai": "64/7601", "Lei Liu": "21/2715", "Yan Sun 0004": "181/2323-4"}, "abstract": "This paper investigates a variable-coefficient nonlinear Schrödinger equation for an inhomogeneous optical fiber. Numerical one- and two-solitonic envelopes of the electrical field via the fourth-order split-step Runge–Kutta, split-step Fourier and Runge–Kutta methods with equal grids in the τ axis and equal grids in the ξ axis are graphically presented, respectively, where τ and ξ represent the retarded time and normalized distance along the fiber. 2-norm of the relative errors between the analytical solutions under the Painlevé integrability condition and numerical solutions are given, where the CPU time is also shown. Relative errors and CPU time of the numerical one- and two-soliton solutions with equal grids in the ξ axis are bigger than those with equal grids in the τ axis, which does not mean that the results with equal grids in the ξ axis are infeasible. Compared with the numerical solutions with equal grids in the τ axis, those with equal grids in the ξ axis are closer to the analytical solutions without the Painlevé integrability condition. With respect to the relative errors and CPU time, one could choose the split-step Fourier method to derive the numerical one-soliton solutions, while the numerical two-soliton solutions are gotten with the RK method. The attenuation coefficient makes the amplitudes of the solitons decrease, the group velocity dispersion coefficient leads to the periodic solitons, while the effect of the attenuation coefficient is more obvious than that of the nonlinearity parameter. Effects of ηR,1 and ηI,1 on the solitonic weak interaction between the two solitons are investigated: Solitonic weak interaction between the two solitons enhances with ηR,1 and ηI,1 increasing, where ηR,1 and ηI,1 are the frequencies of the two solitons."}, "journals/cma/YuanTLCS18": {"title": "Semi-rational solutions for the (3+1)-dimensional Kadomtsev-Petviashvili equation in a plasma or fluid.", "url": "https://doi.org/10.1016/j.camwa.2018.08.059", "year": "2018", "author": {"Yu-Qiang Yuan": "204/3276", "Bo Tian": "19/1603", "Lei Liu": "21/2715", "Han-Peng Chai": "226/8640", "Yan Sun 0004": "181/2323-4"}, "abstract": "In this paper, we investigate the (3+1)-dimensional Kadomtsev–Petviashvili equation in a plasma or fluid. For the amplitude of the electrostatic wave potential in the plasma or shallow-water wave in the fluid, via the Kadomtsev–Petviashvili hierarchy reduction, we obtain the semi-rational solutions in determinant form for such an equation. Interactions between the first-order lump (or rogue wave) and soliton are illustrated. We find that the lump arises and then separates from the soliton on the x–y and x–z planes; and that the rogue wave possesses a line profile and arises from the soliton (or constant background) on the y–z plane, where x, y and z are the scaled spatial coordinates. Interactions between the two lumps (or rogue waves) and two solitons are presented. Interactions between the second-order lump (or rogue wave) and one soliton are also presented."}, "journals/sj/LinWSXO18": {"title": "A TAS-Model-Based Algorithm for Rule Redundancy Detection and Scene Scheduling in Smart Home Systems.", "url": "https://doi.org/10.1109/JSYST.2017.2771349", "year": "2018", "author": {"Zhaowen Lin": "65/10473", "Tin-Yu Wu": "44/3992", "Yan Sun 0004": "181/2323-4", "Jie Xu 0038": "37/5126-38", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:In smart home systems, users enjoy the comfort and convenience by rule subscription and execution. However, with the increase in the complex and the number of rules, there is an increased risk of redundancy within the process of rule customization and execution. Obviously, redundancy will add weight to the system, affect the administrative operation, and reduce the system efficiency. To address the above-mentioned issues, a formal model Trigger-Actuator-Status for rules is devised. Such rules are defined as a tuple, which contains triggers, actuators, and states. Then, rules are processed with the methods of classification, combination, and analytics to generate redundant types so as to describe the redundancy relationship among rules. After that, a redundancy detection algorithm is proposed according to the determined relationship. Besides, in order to eliminate and avoid the occurrence of redundancy, redundancy for scenarios based on rule redundancy is detected and solved. The experimental results show that the proposed scheme can provide more accurate classification results and identify part or full redundancy within and among rules. Meanwhile, our scheme enables redundancy elimination in the phase of rule setting and scenario setup as well as redundancy avoidance in the stage of rule execution and scenario start-up, which significantly reduces the number of rules to greatly enhance the efficiency of the systems."}, "journals/tetc/SunWLG17": {"title": "A Rule Verification System for Smart Buildings.", "url": "https://doi.org/10.1109/TETC.2016.2531288", "year": "2017", "author": {"Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992", "Xinming Li": "145/0602", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:As an important component of Internet of Things (IoT), wireless sensor-actuator networks can significantly improve the practicality and flexibility of smart building systems. In smart building systems, services, stored as rules, are achieved by rule analyzing and executing. However, the irrational contents of rules and the conflicts among rules may bring confusion and maloperation in the system. To verify the correctness of rules, we propose a lightweight rule verification and resolution framework which mainly include: 1) a rule verification system for content anomaly detection and rule conflict detection by using domain knowledge and probability analysis and 2) a quick resolution strategy for rule conflicts based on conflict-scenario-analysis. This framework can balance the verification quality with speed and guarantee that the rule system performs appropriately. Moreover, in order to reduce the comparison in rule verification, we apply a tree structure to store the building structure hierarchically and bind every rule to one node in the location tree. This way, the position information of a rule can be extracted, and the verification efficiency can be improved. The experimental results show that our proposed framework and strategies can perform efficiently and flexibly in a smart building system."}, "journals/sj/SunWLO16": {"title": "Multilayered Impact Evaluation Model for Attacking Missions.", "url": "https://doi.org/10.1109/JSYST.2014.2344048", "year": "2016", "author": {"Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992", "Xinwei Liu": "46/391", "Mohammad S. Obaidat": "91/2882"}, "abstract": " Abstract:In practical application scenarios, direct attacking on a target system to test the impact of attack methods may expose an attacker's intent and result in the difficulty in evaluating the attack method. Therefore, it is essential to design a controllable target range for testing and evaluating the attack impact. In this paper, we construct an attack test platform in order to evaluate the attack impact from different attack tools or the combinations of these attack tools. According to “vulnerability-asset-service-mission” (VASM) relationship, we design a multilayered evaluation model VASM, which includes a four-layer information structure: vulnerability layer, asset layer, service layer, and mission layer, from bottom to top. Considering that each asset may have one or more vulnerabilities, we score the attack impact on each asset based on attack probability and vulnerability and calculate the operational capacity of an asset after an attack. Since services may be provided jointly by one or more assets, we calculate the attack impact on services utilizing the dependencies among assets. The attack impact can be transmitted layer by layer from bottom to top through the dependencies among nodes. Finally, we can obtain the attack impact on missions. We use an actual logistics management and tracking system as the target range and verify the effectiveness and validity of our evaluation model, i.e., VASM, on goods delivery. Experimental results show that VASM cannot only assess the attack impact directly but also conform to the actual situations accurately."}, "journals/wicomm/GuoSLG16": {"title": "Accurate indoor localization based on crowd sensing.", "url": "https://doi.org/10.1002/wcm.2733", "year": "2016", "author": {"Yingying Guo": "51/7390", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Nadra Guizani": "144/7266"}, "abstract": ""}, "journals/ahswn/SunWL15": {"title": "Distributed Rule System for Smart Building.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-29-number-1-4-2015/ahswn-29-1-4-p-1-29/", "year": "2015", "author": {"Yan Sun 0004": "181/2323-4", "Ruosi Wang": "145/0607", "Xinming Li": "145/0602"}, "abstract": ""}, "journals/percom/SunWMC15": {"title": "Modeling and verifying EPC network intrusion system based on timed automata.", "url": "https://doi.org/10.1016/j.pmcj.2015.06.007", "year": "2015", "author": {"Yan Sun 0004": "181/2323-4", "Tin-Yu Wu": "44/3992", "Xiaoqiong Ma": "172/0612", "Han-Chieh Chao": "c/HanChiehChao"}, "abstract": "Nowadays, the EPC network has been gradually popularized to manufacturing intelligent, retailing and logistics. Due to the widespread use of EPC networks, the security problem therefore, becomes particularly important. In order to obtain the proper defense strategy, we propose a modeling method for EPC network intrusion system. First, we describe the network entities in EPC network, and classify them into detected network entities and attacked network entities. Then, we analyze the intrusion for EPC network, and categorize the existing attack methods for EPC network into two categories: atomic attacks and combined attacks. The atomic attacks include vulnerability detection, attack execution, and attack decision. Based on timed automata, we introduce the formal description of the network environment into the modeling of EPC network intrusion system, and thus construct an intrusion model which gives a formal description of attacks. Our intrusion model can represent the time properties, constraints of network environment and intrusion behaviors. Finally, we verify the correctness of our proposed model in terms of the model checking tool UPPAAL, and compare it with other typical attacking models to show the comprehensiveness and integrity of our proposed model. Besides, we change the value of clock parameter, gain the durations of different intrusion actions and use these data to set the defense strategy."}, "journals/tc/SunWZG15": {"title": "Efficient Rule Engine for Smart Building Systems.", "url": "https://doi.org/10.1109/TC.2014.2345385", "year": "2015", "author": {"Yan Sun 0004": "181/2323-4", "Tin Yu Wu": "44/3992", "Guotao Zhao": "97/1764", "Mohsen Guizani": "15/1123"}, "abstract": " Abstract:In smart building systems, the automatic control of devices relies on matching the sensed environment information to customized rules. With the development of wireless sensor and actuator networks (WSANs), low-cost and self-organized wireless sensors and actuators can enhance smart building systems, but produce abundant sensing data. Therefore, a rule engine with ability of efficient rule matching is the foundation of WSANs based smart building systems. However, traditional rule engines mainly focus on the complex processing mechanism and omit the amount of sensing data, which are not suitable for large scale WSANs based smart building systems. To address these issues, we build an efficient rule engine. Specifically, we design an atomic event extraction module for extracting atomic event from data messages, and then build a β-network to acquire the atomic conditions for parsing the atomic trigger events. Taking the atomic trigger events as the key set of MPHF, we construct the minimal perfect hash table which can filter the majority of the unused atomic event with O(1) time overhead. Moreover, a rule engine adaption scheme is proposed to minimize the rule matching overhead. We implement the proposed rule engine in a practical smart building system. The experimental results show that the rule engine can perform efficiently and flexibly with high data throughput and large rule set."}, "journals/thms/SunWLL15": {"title": "Conflict Detection Scheme Based on Formal Rule Model for Smart Building Systems.", "url": "https://doi.org/10.1109/THMS.2014.2364613", "year": "2015", "author": {"Yan Sun 0004": "181/2323-4", "Xukai Wang": "160/1881", "Hong Luo 0001": "67/876-1", "Xiang-Yang Li 0001": "l/XiangYangLi"}, "abstract": " Abstract:Smart building systems can provide flexible and configurational sensing and controlling operations according to users' requirements. As the number and the complexity of service rules customized by users have significantly increased, there is an increasing danger of conflict during the interaction process between users and the system. To address this issue, we propose a new rule conflict detection scheme tailored for the smart building system. First, we present a formal rule model UTEA based on User, Triggers, Environment entities, and Actuators. This model can handle not only controlled devices with discrete status but also real-valued environmental data such as temperature and humidity. In addition, this model takes multiple users with different authorities into account. Second, we define 11 rule relations and further classify conflicts into five categories. Third, we implement a rule storage system for detecting conflicts and design a conflict detection algorithm, which can detect the conflict between two rules as well as cycle conflict/multicross contradiction among multiple rules. We evaluated our scheme in a real smart building system with more than 30 000 service rules. The experiment results show that our scheme improves the performance in terms of error/missed-detection rates and running time."}, "journals/ahswn/SunTL14": {"title": "Advanced Gateway Based on FPGA for Smart Home.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-22-number-1-2-2014/ahswn-22-1-2-p-135-156/", "year": "2014", "author": {"Yan Sun 0004": "181/2323-4", "Shaoju Tang": "159/2447", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ahswn/ZhaoMSL14": {"title": "A Distributed Audio Synchronization Scheme for Wireless Audio Sensor Networks.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-22-number-3-4-2014/ahswn-22-3-4-p-231-257/", "year": "2014", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/puc/SunYLX14": {"title": "Toward inference attacks for k-anonymity.", "url": "https://doi.org/10.1007/s00779-014-0787-y", "year": "2014", "author": {"Yan Sun 0004": "181/2323-4", "Lihua Yin": "07/7486", "Licai Liu": "139/1793", "Shuang Xin": "145/0636"}, "abstract": " Current research still cannot effectively prevent an inference attacker from inferring privacy information for k-anonymous data sets. To solve the issue, we must first study all kinds of aggressive reasoning behaviors and process for the attacker thoroughly. Our work focuses on describing comprehensively the inference attack and analyzing their privacy disclosures for k-anonymous data sets. In this paper, we build up a privacy inference graph based on attack graph theory, which is an extension of attack graph. The privacy inference graph describes comprehensively the inference attack in k-anonymous databases by considering attacker background knowledge and external factors. In the privacy inference graph, we introduce a concept of valid inference path to analyze the privacy disclosures in face of inference attack. According to both above, we design an algorithm to compute the n-valid inference paths. These paths can deduce some privacy information resulting in privacy disclosure. Moreover, we study the optimal privacy strategies to resist inference attack by key attribute sets and valid inference paths in the attack graph. An approximate algorithm is designed to obtain the approximate optimal privacy strategy set. At last, we prove the correctness in theory and analyze the performance of the approximate algorithm and their time complexity."}, "journals/ahswn/ZhaoMSL13": {"title": "A Distributed Audio Synchronization Scheme for Wireless Audio Sensor Networks.", "url": "http://www.oldcitypublishing.com/journals/ahswn-home/ahswn-issue-contents/ahswn-volume-19-number-3-4-2013/ahswn-19-3-4-p-213-239/", "year": "2013", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ijdsn/SunCL13": {"title": "Adaptive Scheduling and Routing Scheme for Delay Guarantee in Wireless Sensor Networks.", "url": "https://doi.org/10.1155/2013/801758", "year": "2013", "author": {"Yan Sun 0004": "181/2323-4", "Cong Chen": "81/3425", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/ijdsn/ZhaoMSL12": {"title": "Design and Implementation of Enhanced Surveillance Platform with Low-Power Wireless Audio Sensor Network.", "url": "https://doi.org/10.1155/2012/854325", "year": "2012", "author": {"Guotao Zhao": "97/1764", "Huadong Ma": "04/6217", "Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1"}, "abstract": ""}, "journals/tdsc/SunLD12": {"title": "A Trust-Based Framework for Fault-Tolerant Data Aggregation in Wireless Multimedia Sensor Networks.", "url": "https://doi.org/10.1109/TDSC.2012.68", "year": "2012", "author": {"Yan Sun 0004": "181/2323-4", "Hong Luo 0001": "67/876-1", "Sajal K. Das 0001": "d/SajalKDas"}, "abstract": " Abstract:For wireless multimedia sensor networks (WMSNs) deployed in noisy and unattended environments, it is necessary to establish a comprehensive framework that protects the accuracy of the gathered multimedia information. In this paper, we jointly consider data aggregation, information trust, and fault tolerance to enhance the correctness and trustworthiness of collected information. Based on the multilayer aggregation architecture of WMSNs, we design a trust-based framework for data aggregation with fault tolerance with a goal to reduce the impact of erroneous data and provide measurable trustworthiness for aggregated results. By extracting statistical characteristics from different sources and extending Josang's trust model, we propose how to compute self-data trust opinion, peer node trust opinion, and peer data trust opinion. According to the trust transfer and trust combination rules designed in our framework, we derive the trust opinion of the sink node on the final aggregated result. In particular, this framework can evaluate both discrete data and continuous media streams in WMSNs through a uniform mechanism. Results obtained from both simulation study and experiments on a real WMSN testbed demonstrate the validity and efficiency of our framework, which can significantly improve the quality of multimedia information as well as more precisely evaluate the trustworthiness of collected information."}, "journals/ijdsn/SunML10": {"title": "A Self-Adaptive QoS Guarantee Scheme for Multimedia Sensor Networks.", "url": "https://doi.org/10.1155/2010/316342", "year": "2010", "author": {"Yan Sun 0004": "181/2323-4", "Huadong Ma": "04/6217", "Liang Liu 0001": "10/6178-1"}, "abstract": ""}}}