{"id": "06/6785-15", "name": "Yang Zhang 0015", "Article": {"conf/imis/WangC021": {"title": "An ELF Recovery Method for Linux Malicious Process Detection.", "url": "https://doi.org/10.1007/978-3-030-79728-7_28", "year": "2021", "author": {"Zheng Wang": "181/2834", "Baojiang Cui": "22/1154", "Yang Zhang 0015": "06/6785-15"}, "abstract": "In recent years, malicious attacks against cloud hosts and IoT devices have become more frequent. New types of ransomware and mining viruses have brought a huge threat to Internet security. Traditional static detection methods cannot effectively deal with No-File malware, and the detection methods based on behavior characteristics are difficult to identify the owner of malicious samples. Compared the binary file extracted from process memory with library sample file can detect the malicious process accurately. we retain the dynamic characteristics based on network characteristics in consideration of the time cost of static detection. In this paper, we implemented a prototype system. We selected six typical Linux malicious samples for experiments. By setting similar thresholds, we can accurately screen out malicious processes. The ELF recovery degree of the samples is all above 98%. This technology can be applied to internal memory forensics in the future and can also help combat Internet crimes."}, "conf/icws/ZhangC20": {"title": "Event Detection on Monitoring Internet of Things Services by Fusing Multiple Observations.", "url": "https://doi.org/10.1109/ICWS49710.2020.00068", "year": "2020", "author": {"Yang Zhang 0015": "06/6785-15", "Bo Cheng 0001": "05/2700-1"}, "abstract": " Abstract:Ensuring an information fabric safe is critical and mandatory. For its related Internet of Things (IoT) service system running on the open Internet, existing monitoring methods may fail due to only inspecting softwares, and the physical system may not be able to be protected. In this paper, a protection framework is provided to protect the physical system with the IoT services as a controlling means, which involves: multiple observation sources to get the inconsistent and untrusted observation knowledge, extracting true traces from the former, and checking properties for the physical system with considering adversarial environments. A novel certainty measure scheme is proposed to evaluate the service trace by fusing different observations."}, "conf/icsoc/ShiZJHWLC18": {"title": "Using Machine Learning to Provide Differentiated Services in SDN-like Publish/Subscribe Systems for IoT.", "url": "https://doi.org/10.1007/978-3-030-03596-9_39", "year": "2018", "author": {"Yulong Shi": "02/7088", "Yang Zhang 0015": "06/6785-15", "Hans-Arno Jacobsen": "j/HansArnoJacobsen", "Bo Han": "241/0472", "Mengxi Wei": "133/8682", "Runyuan Li": "229/3567", "Junliang Chen": "63/6051"}, "abstract": "At present, most publish/subscribe systems assume that all participants have the same Quality of Service (QoS) requirements. However, in many real-world IoT service scenarios, different users may have different delay requirements. How to provide differentiated services has become an urgent problem. The rise of Software Defined Networking (SDN) provides endless possibilities for meeting customized services due to greater programmability. In this paper, we first propose two new methods to predict the queuing delay of switches. One is an improvement of the traditional Random Early Detection (RED) algorithm; the other is a machine learning method using the eXtreme Gradient Boosting (XGBoost) model. Then we describe an SDN-like publish/subscribe system architecture and priority queues supported by OpenFlow switches to realize differentiated services. In order to guarantee QoS, we present a two-layer queue management mechanism based on user requirements. In the end, we compare our delay prediction methods with the RED method and verify the effectiveness of the two-layer queue management mechanism. Experimental results show that our solution is effective.KeywordsPublish/SubscribeSoftware Defined NetworkingQuality of ServiceQueue managementMachine learning"}, "conf/icws/ZhangDSCC17": {"title": "A Cross-Layer Security Solution for Publish/Subscribe-Based IoT Services Communication Infrastructure.", "url": "https://doi.org/10.1109/ICWS.2017.68", "year": "2017", "author": {"Yang Zhang 0015": "06/6785-15", "Li Duan": "72/6473", "Chang-Ai Sun": "205/8837", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:The publish/subscribe paradigm can be used to build IoT service communication infrastructure owing to its loose coupling and scalability. Its features of decoupling among event producers and event consumers make IoT services collaborations more real-time and flexible, and allow indirect, anonymous and multicast IoT service interactions. However, in this environment, the IoT service cannot directly control the access to the events. This paper proposes a cross-layer security solution to address the above issues. The design principle of our security solution is to embed security policies into events as well as allow the network to route events according to publishers' policies and requirements. This solution helps to improve the system's performance, while keeping features of IoT service interactions and minimizing the event visibility at the same time. Experimental results show that our approach is effective."}, "conf/icws/WangZC17": {"title": "Pursuing Differentiated Services in a SDN-Based IoT-Oriented Pub/Sub System.", "url": "https://doi.org/10.1109/ICWS.2017.118", "year": "2017", "author": {"Yali Wang": "01/773", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Software-defined networking (SDN) is a promising future network architecture which introduces new dimensionsin flexibility and adaptability to cope with different Quality of service (QoS) metrics, such as latency constraint, loss rate, etc. In this paper, we provide differentiated Services for flows of a topic-oriented publish/subscribe system to address some of the QoS guarantee issues, by leveraging multi-priority queue functions of SDN. Flows are bifurcated into multi-priority queues in terms of packet properties such as delay and reliability requirements. An active feedback-based queue management mechanism is responsible for ensuring bounded queueing delays for those higher priority queues, and a mapping method accounts for mapping time-constrained flows to different priority queues. The Experiments verify the effectiveness of the queue mechanism and flow scheduling."}, "conf/iotdcc/ZhangC17": {"title": "Modeling virtual channel to enforce runtime properties for IoT services.", "url": "https://doi.org/10.1145/3018896.3025150", "year": "2017", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": "\n\t\tEnsuring an industrial information infrastructure in a secure and safe state is a critical and mandatory requirement. Existing execution monitoring technologies do not work well to protect physical systems, especially when these supervisory control systems are open via the Internet, and the \"inside\" malwares may compromise and subvert the monitoring mechanism itself. In this paper, we propose an isolation-based solution to enforce property policies for runtime IoT services. We firstly address the issue of isolation-based service trace observation by establishing and modeling a virtual channel. We then address the issue of isolation-based policy enforcement by dealing with the incompleteness and inconsistency of trace knowledge observed in the virtual channel. Finally, physical systems are introduced into our runtime monitors, where the controllability of IoT services is discussed as an example of service property enforcement. We make some experiments to show our idea.\n\t"}, "conf/IEEEscc/DuanZCLCC16": {"title": "Model-Based Minimum Privacy Disclosure Recommendation for Authorization Policies.", "url": "https://doi.org/10.1109/SCC.2016.59", "year": "2016", "author": {"Li Duan": "72/6473", "Yang Zhang 0015": "06/6785-15", "Shiping Chen 0001": "65/287", "Xuan Liu 0008": "13/5407-8", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:This paper presents a privacy disclosure recommendation approach based on a privacy cost model. The approach involves selecting appropriate credentials or attributes from users, and automatically building a new credential to fulfill service's authorization policies. The recommendation principles consider three aspects: (1) the selected user's attributes in the new credential satisfy the requested service's authorization policy, (2) hiding user's credentials and attributes to keep private during the request procedure, and (3) the total privacy cost of users is minimum. In addition, an automated tool is designed and implemented to derive a new credential. The correctness of our approach is demonstrated and validated by a practical case. Experimental results and complexity analysis show that our approach is efficient."}, "conf/IEEEscc/ZhangC16": {"title": "Knowledge-Learning Service Construction Based on Events.", "url": "https://doi.org/10.1109/SCC.2016.94", "year": "2016", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Automatically constructing a composite service from a set of basic services is not desirable in practice because the composition assumption often over-simplifies the realistic constraints and states. We try to propose a stepwise methodology to step-by-step construct a composite service, where the event-driven principle and process declaration principle are used to realize process flexibility, and user knowledge aggregation way is adopted to clarify users' demands and intents. For modeling services with flexibility, service decoupling feature based on events is utilized to decouple different parts of a business process, and to independently define process fragments. Process coordination logic among different process fragments is extracted as independent building blocks such that its enactment can be adapted at run-time. Thus, we get a method to model, deploy and run declarative business processes based on events. At run-time, we propose a service construction assistant to learn the complex relation between user clicks and service quality."}, "conf/IEEEscc/DuanCZLLLC15": {"title": "Automated Policy Combination for Data Sharing across Multiple Organizations.", "url": "https://doi.org/10.1109/SCC.2015.39", "year": "2015", "author": {"Li Duan": "72/6473", "Shiping Chen 0001": "65/287", "Yang Zhang 0015": "06/6785-15", "Chunhong Liu": "74/8350", "Dongxi Liu": "18/477", "Ren Ping Liu": "70/4241", "Junliang Chen": "63/6051"}, "abstract": " Abstract:During business consolidation, multiple organizations need to share data for common interests. However, these organizations may apply different or even conflicting policies, on account of different rules and rule combining algorithms chosen by them. Thus, it is necessary to combine policies from multiple organizations into a global one to manage the access to the shared data. Existing policy combining approaches are unable to automatically combine policies into a global one. In this paper, we propose an approach to address the issue of multiple policies combination. Its key idea is to first decompose the rules in each policy into various classes, and then combine the rules of the corresponding classes to a global compact policy. The latter ensures compliance with each of the original policies at the syntax and semantic levels. To validate our approach, we provide a proof-of-concept implementation of the automated policy combination."}, "conf/icmla/ShuSZWZC15": {"title": "Integrating Active Learning with Supervision for Crowdsourcing Generalization.", "url": "https://doi.org/10.1109/ICMLA.2015.13", "year": "2015", "author": {"Zhenyu Shu": "22/298", "Victor S. Sheng": "36/4372", "Yang Zhang 0015": "06/6785-15", "Dianhong Wang": "95/4369", "Jing Zhang 0015": "05/3499-15", "Heng Chen": "00/890"}, "abstract": " Abstract:With various online crowdsourcing platforms, it is easy to collect multiple labels for the same examples from the crowd. Consensus integration algorithms can infer the estimated ground truths from the multiple label sets of these crowdsourcing datasets. However, it couldn't be avoided that these integrated (estimated) labels still contain noises. In order to further improve the performance of a model learned from data with these integrated labels, we propose an active learning framework to further improve the data quality, such that to improve the model quality, through acquiring limited true labels from experts (the oracle). We further investigate two active learning strategies in terms of two uncertainty measures (i.e., CLUE and MUE) within the active learning framework. From our experimental results on eight simulation crowdsourcing datasets and four real-world crowdsourcing datasets with three popular consensus integration algorithms, we draw several conclusions as follows. (i) Our active learning framework with the input from the oracle significantly improves the generalization ability of the model learned from crowdsourcing data. (ii) Our two active learning strategies outperform a random active learning strategy."}, "conf/icws/ZhangC15": {"title": "A Hybrid Complex Event Service Based on IoT Resource Models.", "url": "https://doi.org/10.1109/ICWS.2015.88", "year": "2015", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Traditional Complex Event systems (CEP) did not consider the computation requirements of continuous dynamic behavior such as differential equations. In addition, the event composition rules were predefined before the CEP engine began working. The rule defining task is error-prone and cumbersome. In this paper, therefore, a hybrid complex event service is proposed, which deals with not only discrete events but also continuous behavior computation based on IoT (Internet of Things) resource models. In order to satisfy the real-time constraints of processing IoT events, a divide-and-conquer principle is adopted, where we give a combination theorem such that different events can be processed on different IoT resources and then these processed results can be combined to derive complex events. Based on the formal IoT resources and event knowledge, we define interest goals to direct event composition without enumerating event relation to define event composition rules. We finally present event composition algorithms and evaluation to show our idea."}, "conf/IEEEscc/ZhangDC14": {"title": "Event-Driven SOA for IoT Services.", "url": "https://doi.org/10.1109/SCC.2014.88", "year": "2014", "author": {"Yang Zhang 0015": "06/6785-15", "Li Duan": "72/6473", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Although lots of IoT (Internet of Things) applications have been developed, the systematic method to construct IoT services is still obscure. In this paper, an Event-driven Service-oriented Architecture (EDSOA) for IoT services is discussed, where distributed events act as a primary mechanism for each IoT service to share independent meaningful events, to express its requirements and capabilities, and to decouple itself from other services. Such distributed events however do not provide powerful expressiveness to describe business logic in SOA because business activities are not completely independent each other. To fill the gap, we propose an information-centric session mechanism to describe service behavior working upon distributed events, called event session. This paper also discusses how to build an Event-driven SOA infrastructure, where we can use resource information to create IoT services, use independent and shared events to run the IoT services, and use event session to coordinate the IoT services. Some applications and experiments are given to show concept proof for such event-driven SOA."}, "conf/icdcsw/ZhangC13": {"title": "Data-Centric Access Control with Confidentiality for Collaborating Smart Grid Services Based on Publish/Subscribe Paradigm.", "url": "https://doi.org/10.1109/ICDCSW.2013.36", "year": "2013", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the smart grid coming near, its information systems become more and more open with services as building blocks. Different smart grid services in different control centers collaborate to realize the real-time control and protection of power systems. The publish/subscribe paradigm makes smart grid service collaborations more real-time and flexible because of the space, time and control decoupling of event producer and consumer, which can be used to establish an appropriate communication infrastructure. Unfortunately, a publish/ subscribe-based smart grid service does not know who consumes its events, and consumers do not know who produces the events either. In this environment, the smart grid service cannot directly control access because of anonymous and indirect service interactions. To address the above issues, this paper at first describes the service communication foundation for smart grid services, and then defines their security model supporting data-centric methodology. Based on such model, underpinning network capabilities can be integrated to help smart grid services control access. The key point in our access control solution is to preserve the service interaction characteristics of the publish/subscribe-based smart grid services: anonymous, multicast and session-control. So two special kinds of event types are used to accomplish authorization request and granting with being consistent with the publish/subscribe paradigm. Attaching policy method is adopted to preserve the anonymity feature for collaborating smart grid services. A delegation scheme for brokers to enforce policies is finally constructed based on attribute-based encryption, which also brings confidentiality for smart grid services."}, "conf/icsoc/ZhangC13": {"title": "Homomorphic-Encryption-Based Separation Approach for Outsourced Data Management.", "url": "https://doi.org/10.1007/978-3-642-37804-1_4", "year": "2013", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": "With the rapid application of cloud computing technologies, service and data outsourcing has become a practical and useful paradigm. In order to manage sensitive information in this outsourcing scenario, combined use of access control technologies and cryptography was proposed by many researchers. However, the rigid combination in existing approaches has difficulty in satisfying the flexible data management for diverse applications. In this paper, we advocate a separation methodology where an authorization policy is not required to be embedded into ciphertexts or keys during encrypting data, and can be linked to the ciphertexts at any time. Authorization is independently carried out as usually without involving encryption, and encryption plays a foundational mechanism without considering authorization. We propose a separation approach based on homomorphic encryption to realize outsourced data management, where an encryption procedure is separated from authorization, and dynamically integrated with authorization policy according to subjects’ attributes at any time.KeywordsOutsourced Data ServiceAccess ManagementHomomorphic Encryption"}, "conf/IEEEscc/ShiZCCQW12": {"title": "Summary Instance: Scalable Event Priority Determination Engine for Large Scale Distributed Event-Based System.", "url": "https://doi.org/10.1109/SCC.2012.44", "year": "2012", "author": {"Ruisheng Shi": "118/4779", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051", "Bo Cheng 0001": "05/2700-1", "Xiuquan Qiao": "66/4187", "Budan Wu": "80/6229"}, "abstract": " Abstract:With the advent of ubiquitous sensor-rich environments and location-based services, distributed event-based systems based on the publish/subscribe communication paradigm are becoming very important and crucial. In many large-scale distributed mission critical areas, publish/subscribe systems must support a large number of geographically distributed publishers and subscribers and ensure real-time event data to be delivered timely. The concern is that a large number of low priority events may clog the channel thereby causing high priority events to get delayed. The challenge raised for the event-based middleware in large-scale distributed system is that event priority determination engine must be efficient and scalable in term of priority rule size and event throughputs. Checking every rule for priority on-the-fly is not friendly to the cache. This paper proposed an innovative approach based on Bloom filter technique. This approach is cache friendly and the online computation time of event priority determination is independent of the rule size. This approach is based on two ideas: make the online queries as simple as possible and exploit the power of cache on the broker. The rule instantiation engine (RIE) is made offline while online part is the priority determination engine (PDE). A Bloom filter data structure is used by RIE to store the rule instances and their priorities. The complex rule evaluation is reduced to set membership testing as queries on Bloom filters. The PDE makes the querying simplified by event discretization. Results are then cached in the broker caches. Finally, we have an analysis on the system complexity and some open issues. The further evaluation with prototype experiments are under development and the results may be found in our later publication."}, "conf/icdcsw/ZhangC12": {"title": "Access Control as a Service for Public Cloud Storage.", "url": "https://doi.org/10.1109/ICDCSW.2012.65", "year": "2012", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the rapid application of service-oriented technologies, service and data outsourcing has become a practical and useful computing paradigm. Combined use of access control and cryptography was proposed by many researchers to protect sensitive information in this outsourcing scenario. However, the rigid combination in existing approaches has difficulty in satisfying the flexibility requirement of access control for diverse applications. In this paper, we propose an access control service for public cloud storage, where authorization is controlled by the data owner, and the PDP (Policy Decision Point) and PEP (Policy Enforcement Point) can be securely delegated. In order to implement the service, an attribute-full proxy re-encryption scheme is presented as its corner stone. The other features of our service are as follows: simple key management without the need of key derivation for users to decrypt cipher texts, composing attributes for accessing resources with subject attributes' having inner structures, and authorization relatively separating from encryption. We also give some proofs and analysis of our implementation."}, "conf/icsoc/ZhaoZC12": {"title": "An Ontology-Based IoT Resource Model for Resources Evolution and Reverse Evolution.", "url": "https://doi.org/10.1007/978-3-642-34321-6_62", "year": "2012", "author": {"Shuai Zhao 0001": "116/8682-1", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": "In view of the characteristics of Internet of Things (IoT), the current architectures could not effectively use and manage IoT resources and information. Numerous projects in the area of IoT have proposed architectures which aim at integrating geographically dispersed and internet interconnected heterogeneous Wireless Sensor and Actuator Networks (WSAN) systems into a homogeneous fabric for real world information and interaction. These architectures are faced with very similar problems in how to support the evolution of resources and maintain service continuity, how to integrate the data which comes from heterogeneous resources. To address these issues, this paper proposes a resource model supporting dynamic evolution and reverse evolution. The resource model uses Linked Data and extends the existing ontologies, such as W3C SSN, etc. This resource model can express domain knowledge, event rules, and support event-based reverse evolution. Based on the resource model, our SOA-based framework can automatically access resources, generate and interpret semantic context information, dynamically create resources, and interpret historical data and events. The validation of the resource model and framework is shown through the CCMWS (Coal mine comprehensive monitoring and early warning system).KeywordsSemantic ModelResource AccessResource ModelHeterogeneous ResourceReverse EvolutionThese keywords were added by machine and not by the authors. This process is experimental and the keywords may be updated as the learning algorithm improves."}, "conf/soca/ChaiZC12": {"title": "Push-style WS-Notification system based on semantic preserving.", "url": "https://doi.org/10.1109/SOCA.2012.6449465", "year": "2012", "author": {"Zhaohang Chai": "125/7031", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:The publish/subscribe pattern is widely applied in the message processing in distributed environment. Nowadays, applications based on Web service are frequently used in every field. However, the popular implementation of publish/subscribe system in the Web environment scarcely supports the push-style notifications forwarding based on message semantic preserving. In this paper, we are intent to provide an implement of WS-Notification system which supports that characteristic. Afterwards, we evaluate the performance of the push-style pattern as well as the precision of the semantic preserving by experiments."}, "conf/IEEEcloud/ZhangC11": {"title": "Flexible Authorization by Generating Public Re-decryption Trapdoor in Outsourced Scenarios.", "url": "https://doi.org/10.1109/CLOUD.2011.87", "year": "2011", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the rapid application of service-oriented technologies, service and data outsourcing has become a practical and useful computing paradigm. Combined use of access control and cryptography was proposed by many researchers to protect sensitive information in this outsourcing scenario. However, the rigid combination in existing approaches has difficulty in satisfying the flexibility requirement of access control for diverse applications. In this paper, we propose a flexible authorization by generating public re-decryption trapdoor. The features of our solution are as follows: simple key management without the need of key derivation for users to decrypt cipher texts, grouping users during authorization to reduce management workload, composing conditions for accessing new resources without generating new keys if the re-encryption keys for atomic conditions have been produced."}, "conf/IEEEscc/ZhuZCC11": {"title": "Towards a Flexible Event-Driven SOA Based Approach for Collaborating Interactive Business Processes.", "url": "https://doi.org/10.1109/SCC.2011.62", "year": "2011", "author": {"Da Zhu": "90/9078", "Yang Zhang 0015": "06/6785-15", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:This paper proposes Event-driven SOA as an extension of SOA for business process collaboration in Internet of Things (IoT). Compared with traditional SOA based service collaboration method, this approach will facilitate real-time event processing as well as decentralized and autonomous service coordination. We illustrate the collaboration process under the proposed architecture by applying it to a smart surgical management scenario."}, "conf/IEEEscc/ZhangC11": {"title": "Policy Consolidation and Privacy-Vital Information Flow Control in Composite Services.", "url": "https://doi.org/10.1109/SCC.2011.75", "year": "2011", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Privacy becomes an increasing concern in modern society because personal information is being collected by more and more online services on the Internet. Although many privacy-aware models and methods were proposed, the protection technology of privacy is underway. This paper aims at addressing privacy-aware access control in composite services. We introduce an automaton-based monitoring solution for privacy-vital information flow for a single execution of a composite service. In addition, this paper also gives a policy consolidation algorithm based on orchestration structures and attribute composition, which can also be used to combine privacy policies."}, "conf/msn/HuangZC11": {"title": "Research and Implementation of an Ontology-Based Semantic Reporting System.", "url": "https://doi.org/10.1109/MSN.2011.68", "year": "2011", "author": {"Liting Huang": "92/10695", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:To solve the problems of traditional reporting system, such as difficult manipulation, high levels of data coupling, this paper presents an ontology-based semantic reporting system. It builds a semantic layer between report designer and data source, where enterprise professional information, relevant properties and metadata about data source are described in ontology language. On the report designer interface, semantic information that saved in ontology library is shown and can be dragged to design the report. Ontology-based semantic layer greatly improves design efficiency and makes manipulation easy, because it seals the technical details of data source."}, "conf/msn/ChenZC11": {"title": "A Graph Configuration Method Based on UI Service Composition.", "url": "https://doi.org/10.1109/MSN.2011.61", "year": "2011", "author": {"Youyu Chen": "92/10696", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Traditional graph configuration software builds monitor screen by integrating user interface components in a block-building way. It is domain-specific, such as a graph configuration system for coal mine. And usually the control logic (also called business) of a graph configuration system for coal mine is not suitable for electricity, yet its user interface and control logic (also called business) are coupled together. In order to solve these problems this paper proposes a UI service composition method based on SCA (Service Component Architecture) and DTS (Domain, Task and Show) models. SCA is going to decouple business from user interface, while DTS is going to model user interface thinking about its reuse. Through experiments, we can see that this system not only can significantly reduce the cost of UI development by DTS, but also provide efficient support for users to participate in business processes."}, "conf/IEEEscc/ZhangC10": {"title": "Universal Identity Management Model Based on Anonymous Credentials.", "url": "https://doi.org/10.1109/SCC.2010.46", "year": "2010", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:The relationship-focused and credential-focused identity management are both user-centric notions in Service-oriented architecture (SOA). For composite services, pure user-centric identity management is inefficient because each sub-service may authenticate and authorize users and users need participate in every identity provisioning transaction. If the above two paradigms are unified into the universal identity management model where identity information and privileges are delegatable, user-centricity will be more feasible in SOA. This paper aims to extend WS-Federation to build a universal identity management model based on anonymous credentials, which provides the delegation of anonymous credentials and combines identity metasystem to support easy-to-use, consistent experience and transparent security. In addition, the concept of self-generated pseudonym is introduced to construct efficient anonymous delegation model."}, "conf/apscc/ZhuCZC10": {"title": "Future Service Provision: Towards a Flexible Hybrid Service Supporting Platform.", "url": "https://doi.org/10.1109/APSCC.2010.51", "year": "2010", "author": {"Da Zhu": "90/9078", "Bo Cheng 0001": "05/2700-1", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:As the convergence between telephony systems and data systems at all levels of the stack, provision of hybrid services that span multiple networks have attracted much more attentions from both academic and industry communities. The Internet of Things (IoT) is a novel paradigm that is rapidly gaining ground which needs to pay special attention to. In this paper, we present the Flexible Hybrid Service Supporting Platform (FHSSP) leverages on Service-Oriented Architecture (SOA) and Web services technologies. Aiming at the dynamic and flexible characteristics of the heterogeneous network environment, we introduced the template reuse based service creation, flexible service execution as well as resource adaptor methodologies, which ensure FHSSP to deliver “User-Centric” hybrid services in a rapid, cost-effective and highly scalable way. Specifically a typical communication Web services based multimedia conferencing system (MMCS) is presented as an illustrative example of applying FHSSP. Finally we conclude the paper with future work."}, "conf/icc/ZhuZCC10": {"title": "Enhancing ESB Based Execution Platform to Support Flexible Communication Web Services over Heterogeneous Networks.", "url": "https://doi.org/10.1109/ICC.2010.5502572", "year": "2010", "author": {"Da Zhu": "90/9078", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051", "Bo Cheng 0001": "05/2700-1"}, "abstract": " Abstract:The merging of telecommunication and Internet domains is a real challenge for supporting the evolution towards the next generation of Web services. Enterprise service bus (ESB) has been regarded as a promising way to support dynamic and agile service integration in distributed heterogeneous environments. As communication services have strong real-time requirements and are based on asynchronous interactions, generic ESB based service integration is no longer suitable. This paper proposes an enhanced ESB based execution platform in which a low-latency service engine has been seamlessly integrated to support flexible communication Web services over heterogeneous networks. The design and implementation of the enhancements, a novel communication Web services based multimedia conference system, the prototype, and some preliminary performance measurements are presented. The performance results are encouraging."}, "conf/icws/ChengZHZC10": {"title": "Design and Implementation for Communication Component Based Open Multimedia Conferencing Web Service over IP.", "url": "https://doi.org/10.1109/ICWS.2010.106", "year": "2010", "author": {"Bo Cheng 0001": "05/2700-1", "Yang Zhang 0015": "06/6785-15", "Xiaoxiao Hu": "75/7524", "Shicheng Zhang": "02/8326", "Junliang Chen": "63/6051"}, "abstract": " Abstract:Recent advances in Web services have made it practical to provide communication Web services to enable communication through SOA and package communication capability as services. This paper provides an appropriate implementation to deliver the multimedia conferencing communication components as Web services in order to be used simply by Web service clients in converged applications."}, "conf/icws/ChengHLZC09": {"title": "Web Services SIP Based Open Multimedia Conferencing on Internet.", "url": "https://doi.org/10.1109/ICWS.2009.153", "year": "2009", "author": {"Bo Cheng 0001": "05/2700-1", "Xiaoxiao Hu": "75/7524", "Xiangtao Lin": "43/7524", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:In this paper, we introduce the session initiation protocol (SIP) based multimedia conferencing on Internet, and mainly focus on the design and implementation for conferencing communication services model, such as SIP connection, session management, media control conferencing management, also we provide a prototype. Finally, we give the conclusions."}, "journals/eaai/LiuXSZLZS21": {"title": "MLANet: Multi-Layer Anchor-free Network for generic lesion detection.", "url": "https://doi.org/10.1016/j.engappai.2021.104255", "year": "2021", "author": {"Zhe Liu 0004": "70/1220-4", "Xi Xie": "21/196", "Yuqing Song 0001": "04/9659", "Yang Zhang 0015": "06/6785-15", "Xuesheng Liu": "178/6874", "Jiawen Zhang": "59/11040", "Victor S. Sheng": "36/4372"}, "abstract": "In medical image processing, detecting lesions from computed tomography (CT) scans becomes an important research problem with increasing attention. However, this problem is nontrivial because lesions from different organs and parts reflect different characteristics as well as different sizes. Most conventional methods only use a single-scale architecture to detect lesion areas. To get rid of the drawbacks above in medical imaging, a multi-scale framework called MLANet is proposed. To deal with the scale imbalance problem, we design a new backbone—a mixed hourglass network, in which each hourglass module share different input sizes and orders to extract features from different scales. And then the information is sent to the proposed Strengthen Weighted Feature Pyramid Network (SWFPN), a multi-layer weighted feature fusion module, to combine more semantic and spatial information, especially for the case where the number of layers is small. Finally, a Center-to-Corner (C2C) transformation is proposed to deal with the inaccurate size prediction of lesions. It is a non-linear transformation function, aiming to make the predictions more stable and accurate. MLANet is an end-to-end network and is easy to train. In our experiment, it achieves 65.2% AP50, as well as 88.3% in the sensitivity of FPs@4.0 on the DeepLesion dataset, which exceeds many state-of-the-art detectors."}, "journals/tsc/ZhangC21": {"title": "Declarative Construction of Distributed Event-Driven IoT Services Based on IoT Resource Models.", "url": "https://doi.org/10.1109/TSC.2017.2782794", "year": "2021", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:In Internet of Things (IoT)scenarios, the coordination of physical systems is often complex and rigid. Work to date has not comprehensively explored how to flexibly construct distributed IoT services to satisfy the coordination requirement. In our work, we propose a declarative approach to construct an event-driven IoT service system, where physical devices and systems are explicitly modeled as a service architecture foundation, the service behavior is flexibly declared based on distributed events, and it is step-by-step refined to have rigid service properties while allowing runtime adaptation. As an example, the controllability property of physical systems is discussed. Finally, we establish a distributed event-driven IoT service platform to test our method. Some experiments are performed to concept-prove our work."}, "journals/access/ShiWJZC20": {"title": "Topic-Oriented Bucket-Based Fast Multicast Routing in SDN-Like Publish/Subscribe Middleware.", "url": "https://doi.org/10.1109/ACCESS.2020.2994268", "year": "2020", "author": {"Yulong Shi": "02/7088", "Jonathon Wong": "211/9909", "Hans-Arno Jacobsen": "j/HansArnoJacobsen", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:In traditional IP-based publish/subscribe middlewares, a detour to overlay network is demanded to match events with defined filters, which introduces more latency overhead for delivering events from publishers to subscribers. The emerging Software Defined Networking (SDN) creates boundless possibilities to improve the efficiency of event delivery because of its centralized control and customized programmability. In this paper, we propose a topic-oriented bucket-based fast multicast routing to improve the efficiency of delivering events in SDN-like publish/subscribe middlewares. First, we design an SDN-like publish/subscribe middleware hierarchical architecture with an implementation framework in SDN controller to deliver events. Topic encoding, topic prefix matching, and the subscription coverage relationships between topics are considered to reduce the number of flow entries and improve the matching abilities of SDN switches. Then, a topic-oriented multicast tree construction algorithm is proposed to build publish/subscribe overlay networks with the minimal total link delay of event transmission and minimal switches in SDN controllers to deliver events fast. A topic-oriented bucket-based multicast forwarding algorithm is designed to achieve efficient multicast forwarding in SDN switches. Finally, experiments are conducted to verify that our construction algorithm has the minimal total delay of event transmission and our bucket-based multicast forwarding algorithm is effective."}, "journals/access/DuanSZNC19": {"title": "A Comprehensive Security Framework for Publish/Subscribe-Based IoT Services Communication.", "url": "https://doi.org/10.1109/ACCESS.2019.2899076", "year": "2019", "author": {"Li Duan": "72/6473", "Chang-Ai Sun": "205/8837", "Yang Zhang 0015": "06/6785-15", "Wei Ni 0001": "31/2597-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:The publish/subscribe paradigm provides a loosely-coupled and scalable communication model for the large-scale IoT service systems, such as supervisory control and data acquisition (SCADA). Data confidentiality and service privacy are two crucial security issues for the publish/subscribe model deployed in different domains. The existing access control schemes for such model cannot address both the issues at the same time. In this paper, we propose a comprehensive access control framework (CACF) to bridge this gap. The design principle of the proposed framework is twofold: (a) a bi-directional policy matching scheme for protecting the privacy of IoT services; and (b) a fully homomorphic encryption scheme for encrypting published events to protect data confidentiality. We analyze the correctness and security of the CACF, moreover, we prototype CACF based on Apache ActiveMQ, an open source message broker, and evaluate its performance. The experimental results indicate that our security system meets the latency requirements for very high-quality SCADA services."}, "journals/sensors/ShiZJTEZCC19": {"title": "Using Machine Learning to Provide Reliable Differentiated Services for IoT in SDN-Like Publish/Subscribe Middleware.", "url": "https://doi.org/10.3390/s19061449", "year": "2019", "author": {"Yulong Shi": "02/7088", "Yang Zhang 0015": "06/6785-15", "Hans-Arno Jacobsen": "j/HansArnoJacobsen", "Lulu Tang": "231/8652", "Geoffrey Elliott": "47/96", "Guanqun Zhang": "63/431", "Xiwei Chen": "76/7700", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/tkde/0015S19": {"title": "Fog-enabled Event Processing Based on IoT Resource Models.", "url": "https://doi.org/10.1109/TKDE.2018.2867504", "year": "2019", "author": {"Yang Zhang 0015": "06/6785-15", "Victor S. Sheng": "36/4372"}, "abstract": " Abstract:Complex Event Processing (CEP) systems extract interest situations from event flows based on event detection patterns. However, local event processing for distributed Internet of Things (IoT) has not been discussed yet. Besides, it is complex or impossible to discover such patterns in some applications of IoT. In this article, we design a complex event service to process event flows based on IoT resource models, which does not depend on existing patterns, and deals with both discrete events and continuous variables. To improve the CEP performance, local IoT resources are used for local event processing, and a lazy exchange method is designed to realize the collaborated event processing between network edges and a data center. Our evaluation shows that our solution is feasible and effective."}, "journals/saem/DuanZSC18": {"title": "Enforcing compliance of hierarchical business process with visual security constraints.", "url": "https://doi.org/10.1007/s13198-017-0653-1", "year": "2018", "author": {"Li Duan": "72/6473", "Yang Zhang 0015": "06/6785-15", "Chang-Ai Sun": "205/8837", "Junliang Chen": "63/6051"}, "abstract": "When modelling secure business processes, business analysts firstly specify security constraints and compliance properties that design-time processes should satisfy. Thus, it is a critical task to check whether the process model under security constraints complies with prospective security compliance properties. For some special tasks within a process, they may contain some internal business logics (named as sub-processes) that is a hierarchical process. In security compliance issues of a hierarchical process, security compliance properties are usually represented as complex logic formulas which are not easily understood by business analysts. This paper presents an approach for checking security properties compliance of the hierarchical process. We present the abstract process model and security constraints model respectively via BPMN graphic notation and resource assignments on process behaviours; the expected security compliance properties are modelled by a visual compliance rule graph, which is absorbed easily by a business analyst; model checking technology is applied to verify the security of the hierarchical process model."}, "journals/cm/ZhangCC17": {"title": "Integrating Events into SOA for IoT Services.", "url": "https://doi.org/10.1109/MCOM.2017.1600359", "year": "2017", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051", "Bo Cheng 0001": "05/2700-1"}, "abstract": " Abstract:In IoT scenarios, there are smart devices hosting web services and also very simple devices with external web services. Without unifying the access to different kinds of devices, the construction of IoT service systems would be cumbersome. In our work, integrating distributed events into SOA is the basic principle. The data accessing capability of physical entities is separated from their actuation capability, which acts as a foundation for ultra-scale and elastic IoT applications. We then establish a distributed event-based IoT service platform to support IoT service creation and allow for the hiding of service access complexity, where the IoT services are event-driven, and impedance matching between service computation and event communication is the design goal. The coordination logic of an IoT service system is extracted as an event composition, which supports the distributed execution of the system with scalability. We finally implement applications over the platform to show its effectiveness and applicability."}, "journals/access/DuanZCZWLLCC16": {"title": "Automated Policy Combination for Secure Data Sharing in Cross-Organizational Collaborations.", "url": "https://doi.org/10.1109/ACCESS.2016.2585185", "year": "2016", "author": {"Li Duan": "72/6473", "Yang Zhang 0015": "06/6785-15", "Shiping Chen 0001": "65/287", "Shuai Zhao 0001": "116/8682-1", "Shiyao Wang": "134/3369", "Dongxi Liu": "18/477", "Ren Ping Liu": "70/4241", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": " Abstract:During business collaborations, multiple participating organizations often need to share data for common interests. In such cases, it is necessary to combine local policies from different organizations into a global one in order to manage access to the shared data. However, local policies of organizations may be different or even conflicting, due to diverse rules and rule combining algorithms chosen. Few existing methods for policy combination are able to automatically combine multiple local policies into a global one. In this paper, we propose a bottom-up approach to address the issues of multiple policy combinations. The key idea is to first classify the rules based on attribute constraints in each policy, and then reduce the rules of the corresponding classes to one with the same attribute constraints. The reduced rules are then combined into a new global policy by choosing the appropriate rule combining algorithm in XACML. The latter ensures compliance with each of the local policies at syntax and semantic levels. To validate our approach, we develop a proof-of-concept implementation of the automated policy combination. Experimental results demonstrate that our approach is highly scalable and supports a number of attribute constraints in each local policy."}, "journals/ijdsn/MaoZC16": {"title": "A non-intrusive runtime enforcement on behaviors of open supervisory control and data acquisition systems.", "url": "https://doi.org/10.1177/1550147716664231", "year": "2016", "author": {"Yan-Fang Mao": "71/10583", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/jwsr/ZhaoCYHZC16": {"title": "Internet of Things Service Provisioning Platform for Cross-Application Cooperation.", "url": "https://doi.org/10.4018/IJWSR.2016010101", "year": "2016", "author": {"Shuai Zhao 0001": "116/8682-1", "Bo Cheng 0001": "05/2700-1", "Le Yu": "23/7122", "Shou-lu Hou": "176/2937", "Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/toit/DuanLZCLCC16": {"title": "Secure Data-Centric Access Control for Smart Grid Services Based on Publish/Subscribe Systems.", "url": "https://doi.org/10.1145/3007190", "year": "2016", "author": {"Li Duan": "72/6473", "Dongxi Liu": "18/477", "Yang Zhang 0015": "06/6785-15", "Shiping Chen 0001": "65/287", "Ren Ping Liu": "70/4241", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": "The communication systems in existing smart grids mainly take the request/reply interaction model, in which data access is under the direct control of data producers. This tightly controlled interaction model is not scalable to support complex interactions among smart grid services. On the contrary, the publish/subscribe system features a loose coupling communication infrastructure and allows indirect, anonymous and multicast interactions among smart grid services. The publish/subscribe system can thus support scalable and flexible collaboration among smart grid services. However, the access is not under the direct control of data producers, it might not be easy to implement an access control scheme for a publish/subscribe system. In this article, we propose a Data-Centric Access Control Framework (DCACF) to support secure access control in a publish/subscribe model. This framework helps to build scalable smart grid services, while keeping features of service interactions and data confidentiality at the same time. The data published in our DCACF is encrypted with a fully homomorphic encryption scheme, which allows in-grid homomorphic aggregation of the encrypted data. The encrypted data is accompanied by bloom-filter encoded control policies and access credentials to enable indirect access control. We have analyzed the correctness and security of our DCACF and evaluated its performance in a distributed environment."}, "journals/concurrency/ZhaoZYCJC15": {"title": "A multidimensional resource model for dynamic resource matching in internet of things.", "url": "https://doi.org/10.1002/cpe.3170", "year": "2015", "author": {"Shuai Zhao 0001": "116/8682-1", "Yang Zhang 0015": "06/6785-15", "Le Yu": "23/7122", "Bo Cheng 0001": "05/2700-1", "Yang Ji": "72/1056", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/concurrency/ZhangC15": {"title": "Constructing scalable Internet of Things services based on their event-driven models.", "url": "https://doi.org/10.1002/cpe.3469", "year": "2015", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/ijdsn/ShiZLLC15": {"title": "Summary Instance: Scalable Event Priority Determination Engine for Large-Scale Distributed Event-Based System.", "url": "https://doi.org/10.1155/2015/390329", "year": "2015", "author": {"Ruisheng Shi": "118/4779", "Yang Zhang 0015": "06/6785-15", "Lina Lan": "05/10049", "Fei Li 0002": "87/3534-2", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/ijccc/000100C14": {"title": "A Feedback-corrected Collaborative Filtering for Personalized Real-world Service Recommendation.", "url": "https://doi.org/10.15837/ijccc.2014.3.1085", "year": "2014", "author": {"Shuai Zhao 0001": "116/8682-1", "Yang Zhang 0015": "06/6785-15", "Bo Cheng 0001": "05/2700-1", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/iacr/ZhangC13": {"title": "Identity-based Aggregate Signatures with Verifiable Single Ones.", "url": "http://eprint.iacr.org/2013/221", "year": "2013", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/adt/ChengZYZC12": {"title": "Design and implementation for integrated services orchestration bus using SCA over heterogeneous networks.", "url": "https://doi.org/10.1007/s12243-011-0264-9", "year": "2012", "author": {"Bo Cheng 0001": "05/2700-1", "Yang Zhang 0015": "06/6785-15", "Bo Ye": "04/715", "Peng Zhou": "23/5823", "Junliang Chen": "63/6051"}, "abstract": "As the telecom and IT industries converge, pressure is mounting for convergence of service across the two domains, and future integrated services in the telecom domain are subject to specific requirements such as support for end-to-end communication sessions and mechanisms for service interaction across technological borders including telecom, enterprise, and Internet services. This paper provides an integrated services orchestration bus to handle the interoperation and compositions of services from the different domain and focus on the components lifecycle management, normalized message routing, normalized message parsing and mapping, events serialization processing, JNDI register management, and deploy unit. The multimedia conferencing-use case scenario is illustrated, and also the performance is measured and analyzed. Finally, we give the conclusions and future work."}, "journals/jcn/ZhangC12": {"title": "Wide-area SCADA system with distributed security framework.", "url": "https://doi.org/10.1109/JCN.2012.00025", "year": "2012", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:With the smart grid coming near, wide-area supervisory control and data acquisition (SCADA) becomes more and more important. However, traditional SCADA systems are not suitable for the openness and distribution requirements of smart grid. Distributed SCADA services should be openly composable and secure. Event-driven methodology makes service collaborations more realtime and flexible because of the space, time and control decoupling of event producer and consumer, which gives us an appropriate foundation. Our SCADA services are constructed and integrated based on distributed events in this paper. Unfortunately, an event-driven SCADA service does not know who consumes its events, and consumers do not know who produces the events either. In this environment, a SCADA service cannot directly control access because of anonymous and multicast interactions. In this paper, a distributed security framework is proposed to protect not only service operations but also data contents in smart grid environments. Finally, a security implementation scheme is given for SCADA services."}, "journals/tsc/ZhangC11": {"title": "A Delegation Solution for Universal Identity Management in SOA.", "url": "https://doi.org/10.1109/TSC.2010.9", "year": "2011", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": " Abstract:The relationship-focused and credential-focused identity managements are both user-centric notions in Service-oriented architecture (SOA). For composite services, pure user-centric identity management is inefficient because each subservice may authenticate and authorize users and users need participate in every identity provisioning transaction. If the above two paradigms are unified into the universal identity management where identity information and privileges are delegatable, user centricity will be more feasible in SOA. The credential-focused system is a good starting point for constructing a universal identity management system. However, how to implement a practical delegation scheme is still a challenge although there are some delegatable anonymous credential schemes that were theoretically constructed. This paper aims to propose a practical delegation solution for universal identity management. For this, a pseudonym-based signature scheme is first designed where pseudonyms are self-generated and unlinkable for realizing user's privacy. Next, a proxy signature is presented with the pseudonyms as public keys where delegation can be achieved through certificate chains. Finally, the security of our scheme is analyzed and proved in the random oracle model."}, "journals/jnca/ChengZZDHWC10": {"title": "Development of Web-Telecom based hybrid services orchestration and execution middleware over convergence networks.", "url": "https://doi.org/10.1016/j.jnca.2010.03.025", "year": "2010", "author": {"Bo Cheng 0001": "05/2700-1", "Yang Zhang 0015": "06/6785-15", "Peng Zhou": "23/5823", "Hua Duan": "53/6514", "Xiaoxiao Hu": "75/7524", "Zheng Wang": "181/2834", "Junliang Chen": "63/6051"}, "abstract": ""}, "journals/iacr/ZhangC10": {"title": "Efficient Access Control of Sensitive Data Service in Outsourcing Scenarios.", "url": "http://eprint.iacr.org/2010/242", "year": "2010", "author": {"Yang Zhang 0015": "06/6785-15", "Junliang Chen": "63/6051"}, "abstract": ""}}}