{"id": "65/4610", "name": "Yonghao Gu", "Article": {"conf/cscwd/ZhangGCQ22": {"title": "Research and Implementation of Host Behavior Anomaly Detection Technology Based on Deep Learning.", "url": "https://doi.org/10.1109/CSCWD54268.2022.9776180", "year": "2022", "author": {"Hang Zhang": "49/6156", "Yonghao Gu": "65/4610", "Xiaolin Chai": "305/2325", "Peng Qi": "59/9474"}, "abstract": " Abstract:In recent years, with the growth of network hosts and applications, Abnormal host behavior brings great challenges to the protection of user information privacy. Effective detection of abnormal host behavior is of great significance. Host anomaly detection technology can identify abnormal behaviors of the host by establishing the normal behavior benchmark, which is universal and capable of detecting new network attack behavior. However, the existing host behavior anomaly detection technology confronts with three problems(i.e., a large amount of data, difficulty in labeling, and strong manual dependence). To solve these problems, this paper proposes an unsupervised learning model based on BiGAN(Bidirectional Generative Adversarial Network) to detect abnormal host behavior. Our model introduces several loss functions and modifies them to apply to BiGAN. At the same time, we discuss which loss function is more suitable for host behavior anomaly detection. Experimental results show that the BiGAN model using the Hinge loss function is the most stable and has excellent anomaly detection performance."}, "conf/iciai/HuangGZ22": {"title": "One-Class Directed Heterogeneous Graph Neural Network for Intrusion Detection.", "url": "https://doi.org/10.1145/3529466.3529480", "year": "2022", "author": {"Zeqi Huang": "302/5412", "Yonghao Gu": "65/4610", "Qing Zhao": "78/6217"}, "abstract": "\n\t\tThe Host-based Intrusion Detection System (HIDS) is widely used to safeguard the security of the enterprise environment and the main detection target of HIDS is the provenance graph. HIDS makes extensive use of the provenance graph which models the interactions between processes and other system entities (e.g. files), to assign anomaly scores to the provenance graph based on expert experience. However, the nonlinear interactions on the provenance graph cannot be captured by expert experience. In addition, attack data is difficult to obtain in the field of intrusion detection. To tackle these problems, we propose OC-DHetGNN (One-Class Directed Heterogeneous Graph Neural Network), an unsupervised anomaly detection method for intrusion detection by combining heterogeneous graph neural networks with the one-class neural network. Specifically, we first model the provenance graph as the attributed heterogeneous graph. Then we propose a directed heterogeneous graph neural network module, which is used to obtain the embedding of the heterogeneous graph and the nodes. After that, the embedding of the heterogeneous graph and the embedding of the node are fed into two one-class neural network modules respectively to output the anomaly score. Extensive experiments on real enterprise data sets have verified OC-DHetGNN is superior to the baseline.\n\t"}, "conf/cikm/GuL21": {"title": "GraphEvolveDroid: Mitigate Model Degradation in the Scenario of Android Ecosystem Evolution.", "url": "https://doi.org/10.1145/3459637.3482118", "year": "2021", "author": {"Yonghao Gu": "65/4610", "Liangxun Li": "305/0638"}, "abstract": "\n\t\tMachine learning-based Android malware detection models suffer from model degradation over time due to ecosystem evolution, which means models trained on history data perform poorly on newly arrived data. Existing solutions to handle the above problem focus on sophisticated feature engineering to find stable features, which is labor-intensive. In this paper, we try to mitigate model degradation by substituting the representation paradigm from Euclidean (vector) to non-Euclidean (graph) without changing features and propose a graph-based Android malware detection model called GraphEvolveDroid. Specifically, we first construct a directed evolutionary network with the KNN model, where each node represents an APP and the starting APP node of each edge is the ancestor of the ending APP node. Then we use stacked GCN layers to transmit the information of ancestor nodes to child nodes so that the shift of the distribution of child nodes can be suppressed. Experimental results on a large real dataset spanning three years demonstrate that GraphEvolveDroid could significantly mitigate model degradation because of slowing down the shift of data distribution.\n\t"}, "conf/icycs/YangGTM08": {"title": "A New Wireless Mesh Network Authentication Scheme Based on Threshold Method.", "url": "https://doi.org/10.1109/ICYCS.2008.369", "year": "2008", "author": {"Yatao Yang": "98/6489", "Yonghao Gu": "65/4610", "Xi Tan": "03/1584", "Lina Ma": "57/4681"}, "abstract": " Abstract:Access authentication is one of the secure issues which are eager to be resolved in wireless mesh networking. This paper proposes new wireless mesh network authentication architecture based on threshold signature technology. First, we point out the weakness of single authentication server and the security risks of traditional AAA authentication method. Then we design a new authentication system with multiple authentication servers: N authentication servers (AS) compose a authentication server group, only if t or more than t authentication servers allow a certain mobile subscriber require to access to the network, this subscriber can join in the network. This approach solves the deficiencies of single authentication server and guarantees the whole security of the authentication systems in mesh network."}, "journals/corr/abs-2101-01306": {"title": "SG-PBFT: a Secure and Highly Efficient Blockchain PBFT Consensus Algorithm for Internet of Vehicles.", "url": "https://arxiv.org/abs/2101.01306", "year": "2021", "author": {"Guangquan Xu": "46/241", "Yihua Liu": "129/6020", "Jun Xing": "44/947", "Tao Luo": "43/4720", "Yonghao Gu": "65/4610", "Shaoying Liu": "99/4667", "Xi Zheng 0001": "224/0761", "Athanasios V. Vasilakos": "40/4747"}, "abstract": "\n      Abstract:  The Internet of Vehicles (IoV) is an application of the Internet of things\n(IoT). It faces two main security problems: (1) the central server of the IoV\nmay not be powerful enough to support the centralized authentication of the\nrapidly increasing connected vehicles, (2) the IoV itself may not be robust\nenough to single-node attacks. To solve these problems, this paper proposes\nSG-PBFT: a secure and highly efficient PBFT consensus algorithm for Internet of\nVehicles, which is based on a distributed blockchain structure. The distributed\nstructure can reduce the pressure on the central server and decrease the risk\nof single-node attacks. The SG-PBFT consensus algorithm improves the\ntraditional PBFT consensus algorithm by using a score grouping mechanism to\nachieve a higher consensus efficiency. The experimental result shows that our\nmethod can greatly improve the consensus efficiency and prevent single-node\nattacks. Specifically, when the number of consensus nodes reaches 1000, the\nconsensus time of our algorithm is only about 27% of what is required for the\nstate-of-the-art consensus algorithm (PBFT). Our proposed SG-PBFT is versatile\nand can be used in other application scenarios which require high consensus\nefficiency.\n\n    "}, "journals/jcc/GuX20": {"title": "Extended Koopmans' theorem at the second-order perturbation theory.", "url": "https://doi.org/10.1002/jcc.26163", "year": "2020", "author": {"Yonghao Gu": "65/4610", "Xin Xu 0004": "66/3874-4"}, "abstract": ""}, "journals/access/GuLGW19": {"title": "Semi-Supervised K-Means DDoS Detection Method Using Hybrid Feature Selection Algorithm.", "url": "https://doi.org/10.1109/ACCESS.2019.2917532", "year": "2019", "author": {"Yonghao Gu": "65/4610", "Kaiyue Li": "234/3560", "Zhenyang Guo": "242/1169", "Yongfei Wang": "135/7627"}, "abstract": " Abstract:Distributed denial of service (DDoS) attack is an attempt to make an online service unavailable by overwhelming it with traffic from multiple sources. Therefore, it is necessary to propose an effective method to detect DDoS attack from massive data traffics. However, the existing schemes have some limitations, including that supervised learning methods, need large numbers of labeled data and unsupervised learning algorithms have relatively low detection rate and high false positive rate. In order to tackle these issues, this paper presents a semi-supervised weighted k-means detection method. Specifically, we firstly present a Hadoop-based hybrid feature selection algorithm to find the most effective feature sets and propose an improved density-based initial cluster centers selection algorithm to solve the problem of outliers and local optimal. Then, we provide the Semi-supervised K-means algorithm using hybrid feature selection (SKM-HFS) to detect attacks. Finally, we exploit DARPA DDoS dataset, CAIDA “DDoS attack 2007” dataset, CICIDS “DDoS attack 2017” dataset and real-world dataset to carry out the verification experiment. The experiment results have demonstrated that the proposed method outperforms the benchmark in the respect of detection performance and technique for order preference by similarity to an ideal solution (TOPSIS) evaluation factor."}, "journals/itiis/GuWYG17": {"title": "A Distributed Privacy-Utility Tradeoff Method Using Distributed Lossy Source Coding with Side Information.", "url": "https://doi.org/10.3837/tiis.2017.05.026", "year": "2017", "author": {"Yonghao Gu": "65/4610", "Yongfei Wang": "135/7627", "Zhen Yang": "70/2539", "Yimu Gao": "216/3920"}, "abstract": ""}}}