{"id": "50/9488", "name": "Yuanyuan Zuo", "Article": {"conf/isnn/ZuoZ11": {"title": "Sparse Based Image Classification with Different Keypoints Descriptors.", "url": "https://doi.org/10.1007/978-3-642-21090-7_38", "year": "2011", "author": {"Yuanyuan Zuo": "50/9488", "Bo Zhang": "36/2259"}, "abstract": "In this paper, we apply the sparse representation based algorithm to the problem of generic image classification. Keypoints with different descriptors are used as the bases of the training matrix and test samples. A learning algorithm is also presented to select the most important keypoints as the bases of the training matrix. Experiments have been done on 25 object categories selected from Caltech101 dataset, with salient region detector and different descriptors. The results show that keypoints with histogram of oriented gradients descriptor can achieve good performance on image categories which have distinctive patterns detected as keypoints. Furthermore, the base learning algorithm is useful for improving the performance while reducing the computational complexity.KeywordsImage classificationsparse representationkeypoints"}, "conf/IEEEicci/ZuoZ10": {"title": "General image classification based on sparse representation.", "url": "https://doi.org/10.1109/COGINF.2010.5599735", "year": "2010", "author": {"Yuanyuan Zuo": "50/9488", "Bo Zhang": "36/2259"}, "abstract": " Abstract:Sparse representation based classification algorithm has been used to solve the problem of human face recognition. The image database is confined to human frontal faces with only illumination and slight expression changes. Cropping and normalization of the face need to be done in advance. In this paper, we apply the sparse representation based algorithm to the problem of general image classification, with a certain degree of intra-class variations and background clutter. Experiments have been done with the sparse representation based algorithm and SVM classifiers on 25 object categories selected from Caltech101 dataset. Experimental results show that without the time-consuming parameter optimization, the sparse representation based algorithm achieves comparable performance with SVM. We argue that the sparse representation based algorithm can also be applied to general image classification task when appropriate image feature is used."}, "conf/trecvid/YuanWX0DZTLXZLS05": {"title": "Tsinghua University at TRECVID 2005.", "url": "https://www-nlpir.nist.gov/projects/tvpubs/tv5.papers/tsinghua.pdf", "year": "2005", "author": {"Jinhui Yuan": "58/3397", "Huiyi Wang": "24/4232", "Lan Xiao": "76/4647", "Dong Wang 0022": "40/3934-22", "Dayong Ding": "83/2408", "Yuanyuan Zuo": "50/9488", "Zijan Tong": "263/9930", "Xiaobing Liu": "10/4090", "Shuping Xu": "131/9917", "Wujie Zheng": "44/2888", "Xirong Li 0001": "58/5856", "Zhangzhang Si": "81/6363", "Jianmin Li 0001": "71/5930-1", "Fuzong Lin": "87/2873", "Bo Zhang 0010": "36/2259-10"}, "abstract": ""}, "journals/remotesensing/YinHZLZ21": {"title": "Study on Radar Echo-Filling in an Occlusion Area by a Deep Learning Algorithm.", "url": "https://doi.org/10.3390/rs13091779", "year": "2021", "author": {"Xiaoyan Yin": "60/7912", "Zhiqun Hu": "147/5872", "Jiafeng Zheng": "206/5276", "Boyong Li": "293/3073", "Yuanyuan Zuo": "50/9488"}, "abstract": ""}, "journals/comcom/WuJZWZWLL20": {"title": "Application of image retrieval based on convolutional neural networks and Hu invariant moment algorithm in computer telecommunications.", "url": "https://doi.org/10.1016/j.comcom.2019.11.053", "year": "2020", "author": {"Zhuang Wu": "66/137", "Shanshan Jiang": "65/4185", "Xiaolei Zhou": "61/2206", "Yuanyuan Wang": "95/494", "Yuanyuan Zuo": "50/9488", "Zhewei Wu": "258/1776", "Lei Liang": "24/1476", "Qi Liu": "95/2446"}, "abstract": "Image recognition and retrieval is an important application field of digital image and it has a wide range of application scenarios in the computer telecommunications. Convolutional neural networks (CNN) is a kind of feed-forward neural networks which includes convolution calculation and which has a deep structure and it is one of the typical algorithms of deep learning. In recent years, it has become a highly efficient recognition algorithm which has been widely applied in such fields as pattern recognition and image processing. Its characteristics include few training parameters and strong adaptability. On the other hand, Hu invariant moment algorithm-a conventional algorithm, is also extensively used in various image processing fields due to its simple calculation and high efficiency. This paper analyzes the research background and significance of both CNN and Hu invariant moment algorithm, and introduces their research status. Besides, it also analyzes the results of color-, distance- and weight-based Hu invariant moment algorithm, and compares it with CNN to serve as a theoretical support for better achieving image classification, recognition and retrieval technology."}, "journals/ijssci/ZuoZ11": {"title": "Sparse Based Image Classification With Bag-of-Visual-Words Representations.", "url": "https://doi.org/10.4018/jssci.2011010101", "year": "2011", "author": {"Yuanyuan Zuo": "50/9488", "Bo Zhang": "36/2259"}, "abstract": ""}}}