{"id": "95/9457", "name": "Zhongbao Zhang", "Article": {"conf/aaai/SunZYP0SY22": {"title": "A Self-Supervised Mixed-Curvature Graph Neural Network.", "url": "https://ojs.aaai.org/index.php/AAAI/article/view/20333", "year": "2022", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Junda Ye": "308/7038", "Hao Peng": "69/7742", "Jiawei Zhang 0001": "10/239-1", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "Graph representation learning received increasing attentions in recent years. Most of the existing methods ignore the complexity of the graph structures and restrict graphs in a single constant-curvature representation space, which is only suitable to particular kinds of graph structure indeed. Additionally, these methods follow the supervised or semi-supervised learning paradigm, and thereby notably limit their deployment on the unlabeled graphs in real applications. To address these aforementioned limitations, we take the first attempt to study the self-supervised graph representation learning in the mixed-curvature spaces. In this paper, we present a novel Self-Supervised Mixed-Curvature Graph Neural Network (SelfMGNN). To capture the complex graph structures, we construct a mixed-curvature space via the Cartesian product of multiple Riemannian component spaces, and design hierarchical attention mechanisms for learning and fusing graph representations across these component spaces. To enable the self-supervised learning, we propose a novel dual contrastive approach. The constructed mixed-curvature space actually provides multiple Riemannian views for the contrastive learning. We introduce a Riemannian projector to reveal these views, and utilize a well-designed Riemannian discriminator for the single-view and cross-view contrastive learning within and across the Riemannian views. Finally, extensive experiments show that SelfMGNN captures the complex graph structures and outperforms state-of-the-art baselines.\n\t\t\t\t"}, "conf/naacl/YanYZW22": {"title": "AISFG: Abundant Information Slot Filling Generator.", "url": "https://doi.org/10.18653/v1/2022.naacl-main.308", "year": "2022", "author": {"Yang Yan": "58/5582", "Junda Ye": "308/7038", "Zhongbao Zhang": "95/9457", "Liwen Wang": "28/10219"}, "abstract": ""}, "conf/pakdd/ZhuZS22": {"title": "Few-Shot Knowledge Graph Entity Typing.", "url": "https://doi.org/10.1007/978-3-031-05933-9_26", "year": "2022", "author": {"Guozhen Zhu": "269/4635", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499"}, "abstract": "Knowledge graph entity typing, which is an important way to complete knowledge graphs (KGs), aims at predicting the associating type of certain given entities without any external knowledge. However, previous methods suppose that many (entity, entity type) pairs (ETPs) can be obtained for each entity type, performing poorly on entity types that only have a few associative entities and do not fully utilize the internal information in KGs. In this work, we propose a novel model named Meta Entity Typing (MET) for few-shot knowledge graph entity typing. In MET, we achieve knowledge graph entity typing by meta-learning with three sub-tasks formed by the hierarchical entity type tree in its meta-training stage. In this way, MET can focus on transferring type-specific meta information to learn the most important knowledge for entity typing. Besides, to fully employ the internal information in KGs given limited ETPs, inspired by Factorization Machines, we design a novel Relation To Relation Graph Convolutional Networks (R2R-GCN), in which we consider different relation combinations could have distinct influence on its corresponding entity, R2R-GCN can explicitly model the interactions between different relations. Empirically, our model achieves state-of-the-art results on few-shot entity typing KG benchmarks.KeywordsKnowledge graph entity typingFew-shot learningGraph convolutional networks"}, "conf/www/WangZSYY22": {"title": "DiriE: Knowledge Graph Embedding with Dirichlet Distribution.", "url": "https://doi.org/10.1145/3485447.3512028", "year": "2022", "author": {"Feiyang Wang": "161/8387", "Zhongbao Zhang": "95/9457", "Li Sun 0008": "57/2405-8", "Junda Ye": "308/7038", "Yang Yan": "58/5582"}, "abstract": "\n\t\t Knowledge graph embedding aims to learn representations of entities and relations in low-dimensional space. Recently, extensive studies combine the characteristics of knowledge graphs with different geometric spaces, including Euclidean space, complex space, hyperbolic space and others, which achieves significant progress in representation learning. However, existing methods are subject to at least one of the following limitations: 1) ignoring the uncertainty, 2) incapability of complex relation patterns. To address the above issues simultaneously, we propose a novel model named DiriE, which embeds entities as Dirichlet distributions and relations as multinomial distributions. DiriE employs Bayesian inference to measure the relations between entities and learns binary embeddings of knowledge graphs for modeling complex relation patterns. Additionally, we propose a two-step negative triple generation method that generates negative triples of both entities and relations. We conduct a solid theoretical analysis to demonstrate the effectiveness and robustness of our method, including the expressiveness of complex relation patterns and the ability to model uncertainty. Furthermore, extensive experiments show that our method outperforms state-of-the-art methods in link prediction on benchmark datasets.\n\t"}, "conf/aaai/SunZZWPSY21": {"title": "Hyperbolic Variational Graph Neural Network for Modeling Dynamic Graphs.", "url": "https://ojs.aaai.org/index.php/AAAI/article/view/16563", "year": "2021", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Jiawei Zhang 0001": "10/239-1", "Feiyang Wang": "161/8387", "Hao Peng": "69/7742", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "Learning representations for graphs plays a critical role in a wide spectrum of downstream applications. In this paper, we summarize the limitations of the prior works in three folds: representation space, modeling dynamics and modeling uncertainty. To bridge this gap, we propose to learn dynamic graph representations  in hyperbolic space, for the first time, which aims to infer stochastic node representations. Working with hyperbolic space, we present a novel Hyperbolic Variational Graph Neural Network, referred to as HVGNN. In particular, to model the dynamics, we introduce a Temporal GNN (TGNN) based on a theoretically grounded time encoding approach. To model the uncertainty, we devise a hyperbolic graph variational autoencoder built upon the proposed TGNN to generate stochastic node representations of hyperbolic normal distributions. Furthermore, we introduce a reparameterisable sampling algorithm for the hyperbolic normal distribution to enable the gradient-based learning of HVGNN.  Extensive experiments show that HVGNN outperforms state-of-the-art baselines on real-world datasets.\n\t\t\t\t"}, "conf/bigdataconf/RenZYWSY21": {"title": "HAMLET: Hierarchical Attention-based Model with muLti-task sElf-Training for user profiling.", "url": "https://doi.org/10.1109/BigData52589.2021.9671313", "year": "2021", "author": {"Fuxin Ren": "03/5403", "Zhongbao Zhang": "95/9457", "Yang Yan": "58/5582", "Zhi Wang": "95/6543", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": " Abstract:User profiling is playing an increasingly important role in real-world applications. Previous works have shown that integrating user information from multiple social networks helps to significantly improve the performance of user profiling. However, these studies either ignore the different contributions of various features in different profiling tasks or need to train one model for each task. What’s more, the assumption of the strong relatedness between user profiling tasks limits their application. These phenomena make inferring comprehensive user attributes still an open problem. In this paper, we propose a novel method, called Hierarchical Attention-based Model with sparse-sharing-based muLti-task sElf-Training algorithm (HAMLET), for comprehensive user profiling. More specifically, we first employ a hierarchical attention-based network as our base network to represent users. It assigns various features from different social networks with different weights for different users during the fusing procedure. Then, we propose a multi-task self-training algorithm that takes advantage of both task correlations and self-training to obtain better performance. We conduct extensive experiments on two real-world datasets and verify the superiority of HAMLET for user profiling."}, "conf/cikm/DiaoZSGC20": {"title": "UPON: User Profile Transferring across Networks.", "url": "https://doi.org/10.1145/3340531.3411964", "year": "2020", "author": {"Mengting Diao": "276/4994", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Shuai Gao": "03/4179", "Huafeng Cao": "181/3748"}, "abstract": "\n\t\tUser profiling has very important applications for many downstream tasks, such as recommender system, behavior prediction and market strategy. Most existing methods only focus on modeling user profiles of one social network with plenty of data. However, user profiles are difficult to acquire, especially when the data is scarce. Modeling user profiles under such conditions often leads to poor performance. Fortunately, we observed that not only user attributes but also user relationships are useful for user profiling and benefit the results. Meanwhile, similar users have similar behavior in different social networks. Finding user dependencies between social networks will help to infer user profiles. Motivated by such observations, in this paper, we for the first time propose to study the user profiling problem from the transfer learning perspective. We design an efficient User Profile transferring acrOss Networks (UPON) framework, which transfers knowledge of user relationship from one social network with plenty of data to facilitate the user profiling on the other social network with scarce data. In UPON, we first design a novel graph convolutional networks based characteristic-aware domain attention model (GCN-CDAM) to find user dependencies within and between domains (referring to social networks). We then design a dual-domain weighted adversarial learning method to solve the domain shift problem existing in the transferring procedure. Experimental results on Twitter-Foursquare dataset demonstrate that UPON outperforms the state-of-the-art models.\n\t"}, "conf/globecom/Wang0Z20": {"title": "Hyperbolic User Identity Linkage across Social Networks.", "url": "https://doi.org/10.1109/GLOBECOM42002.2020.9322242", "year": "2020", "author": {"Feiyang Wang": "161/8387", "Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457"}, "abstract": " Abstract:With the growing prosperity and diversity of social networks, more and more users participate in multiple social networks to enjoy their diverse services. Users can create different user identities in different social networks, but most networks are independent of each other. Hence, a fundamental question arises: can we align user identities across social networks? Related work mostly focuses on Euclidean geometry to learn representation vectors of social networks. However, motivated by recent advances in geometry representation learning, we find that hyperbolic geometry shows the advantage of expressing network hierarchical structure, while Euclidean geometry doesn't. Thus, in this paper, we first introduce the connection between hyperbolic space and social networks. Then we propose a novel hyperbolic geometry representation learning model for user identity linkage across social networks, which is called “HUIL”. Finally, we conduct comprehensive experiments on real-world datasets and verify the superiority of HUIL for user identity linkage."}, "conf/icdm/0008Z0WDSY20": {"title": "Perfect: A Hyperbolic Embedding for Joint User and Community Alignment.", "url": "https://doi.org/10.1109/ICDM50108.2020.00059", "year": "2020", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Jiawei Zhang 0001": "10/239-1", "Feiyang Wang": "161/8387", "Yang Du": "51/3199", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": " Abstract:Social network alignment shows fundamental importance in a wide spectrum of applications. To the best of our knowledge, existing studies mainly focus on network alignment at the individual user level, requiring abundant common information between shared individual users. For the networks that cannot meet such requirements, social community structures actually provide complementary and critical information at a slightly coarse-grained level, alignment of which will provide additional information for user alignment. In turn, user alignment also reveals more clues for community alignment. Hence, in this paper, we introduce the problem of joint social network alignment, which aims to align users and communities across social networks simultaneously. Key challenges lie in that (1) how to learn the representations of both users and communities, and (2) how to make user alignment and community alignment benefit from each other. To address these challenges, we first elaborate on the characteristics of real-world networks with the notion of δ-hyperbolicity, and show the superiority of hyperbolic space for representing social networks. Then, we present a novel hyperbolic embedding approach for the joint social network alignment, referred to as Perfect, in a unified optimization. Extensive experiments on real-world datasets show the superiority of Perfect in both user alignment and community alignment."}, "conf/ijcai/RenZZSSZG20": {"title": "BANANA: when Behavior ANAlysis meets social Network Alignment.", "url": "https://doi.org/10.24963/ijcai.2020/200", "year": "2020", "author": {"Fuxin Ren": "03/5403", "Zhongbao Zhang": "95/9457", "Jiawei Zhang 0001": "10/239-1", "Sen Su": "63/2499", "Li Sun 0008": "57/2405-8", "Guozhen Zhu": "269/4635", "Congying Guo": "269/4516"}, "abstract": ""}, "conf/bigdataconf/WenZYSSY19": {"title": "DeepBlue: Bi-layered LSTM for tweet popUlarity Estimation.", "url": "https://doi.org/10.1109/BigData47090.2019.9006102", "year": "2019", "author": {"Jian Wen": "03/3275", "Zhongbao Zhang": "95/9457", "Zichang Yin": "259/6793", "Li Sun 0008": "57/2405-8", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": " Abstract:In social networks, one of the most significant challenges is how to estimate the tweet popularity. Prior studies about this problem focus on leveraging different aspects of just a single tweet, while ignoring the impact of historical tweets. In this paper, we propose to leverage such historical information and rethink the problem of tweet popularity estimation. From historical information, there are two important factors that can be extracted: (1) user reputation feature, which can represent coarse-grained level of tweet popularity; (2) tweet related features, which can represent fine-grained level of tweet popularity. To incorporate two factors from historical information, we design a novel deep neural architecture, a Bi-layered LSTM for tweet popularity Estimation, called DeepBlue. Specifically, we first propose a user-reputation aware mechanism to combine coarse-grained and fine-grained level estimation into a unified LSTM model. We then propose a time aware mechanism to address the time interval irregularity issue in standard LSTM. Finally, we apply the Poisson regression model to obtain the overall loss for tweet popularity estimation. Extensive experiments demonstrate the superiority of our proposed approach to other state-of-the-arts in terms of MAE and SRC."}, "conf/bigdataconf/LiSZJSY19": {"title": "MC", "url": "https://doi.org/10.1109/BigData47090.2019.9005701", "year": "2019", "author": {"Gen Li": "28/538", "Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Pengxin Ji": "252/5246", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": " Abstract:Social network alignment, identifying social accounts of the same individual across different social networks, shows fundamental importance across a wide spectrum of applications. Individuals more often than not join in multiple social networks and it is in fact intractable or even impossible to acquiring supervision for guiding the alignment. However, to the best of our knowledge, none of existing methods can align multiple social networks without supervision. In this paper, we propose to study the problem of unsupervised multiple social network alignment. To address this problem, we propose a novel unsupervised model of Matrix factorization with diagonal Cone under orthogonal Constraint, referred to as MC\n2\n. Its core idea is to embed and align multiple social networks in the common subspace via an unsupervised approach. Specifically, in MC\n2\n model, we first design a matrix optimization to infer the common subspace from different social networks. To address the nonconvex optimization, we then design an efficient alternating algorithm by leveraging its inherent functional property. Through extensive experiments on real-world datasets, we demonstrate that the proposed MC\n2\n model significantly outperforms the state-of-the-art methods."}, "conf/bigdataconf/SunZJWSY19": {"title": "DNA: Dynamic Social Network Alignment.", "url": "https://doi.org/10.1109/BigData47090.2019.9006430", "year": "2019", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Pengxin Ji": "252/5246", "Jian Wen": "03/3275", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": " Abstract:Social network alignment, aligning different social networks on their common users, is receiving dramatic attention from both academic and industry. All existing studies consider the social network to be static and neglect its inherent dynamics. In fact, the dynamics of social networks contain the discriminative pattern of an individual, which can be leveraged to facilitate social network alignment. Hence, we for the first time propose to study the problem of aligning dynamic social networks. Towards this end, we propose a novel Dynamic social Network Alignment (DNA) framework, a unified optimization approach over deep neural architectures, to unfold the fruitful dynamics to perform alignment. However, it faces tremendous challenges in both modeling and optimization: (1) To model the intra-network dynamics, we explore the local dynamics of the latent pattern in friending evolvement and the global consistency of the representation similarity with neighbors. We design a novel deep neural architecture to obtain the dual embedding capturing local dynamics and global consistency for each user. (2) To model the inter-network alignment, we exploit the underlying identity of an individual from the dual embedding in each dynamic social network. We design a unified optimization approach interplaying proposed deep neural architectures to construct a common subspace of identity embeddings. (3) To address this optimization problem, we design an effective alternating algorithm with solid theoretical guarantees. We conduct extensive experiments on real-world datasets and show that the proposed DNA framework substantially outperforms the state-of-the-art methods."}, "conf/pakdd/WangZSZ19": {"title": "Topic-Level Bursty Study for Bursty Topic Detection in Microblogs.", "url": "https://doi.org/10.1007/978-3-030-16148-4_8", "year": "2019", "author": {"Yakun Wang": "30/3634", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Muhammad Azam Zia": "184/8330"}, "abstract": "Microblogging services, such as Twitter and Sina Weibo, have gained tremendous popularity in recent years. The huge amount of user-generated information is spread on microblogs. Such user-generated contents are a mixture of different bursty topics (e.g., breaking news) and general topics (e.g., user interests). However, it is challenging to discriminate between them due to the extremely diverse and noisy user-generated text. In this paper, we introduce a novel topic model to detect bursty topics from microblogs. Our model is based on an observation that different topics usually exhibit different bursty levels at a certain time. We propose to utilize the topic-level burstiness to differentiate bursty topics and non-bursty topics and particularly different bursty topics. Extensive experiments on a Sina Weibo Dataset show that our approach outperforms the baselines and the state-of-the-art method.KeywordsSina WeiboBursty topic detectionTopic modelHypothesis testing"}, "conf/sdm/WangWBSSZ19": {"title": "A Novel Regularizer for Temporally Stable Learning with an Application to Twitter Topic Classification.", "url": "https://doi.org/10.1137/1.9781611975673.25", "year": "2019", "author": {"Yakun Wang": "30/3634", "Ga Wu": "161/0064", "Mohamed Reda Bouadjenek": "64/8750", "Scott Sanner": "88/3374", "Sen Su": "63/2499", "Zhongbao Zhang": "95/9457"}, "abstract": ""}, "conf/IEEEcloud/XuSZ18": {"title": "Distributed Hybrid Cloud Management Platform Based on Rule Engine.", "url": "https://doi.org/10.1109/CLOUD.2018.00116", "year": "2018", "author": {"Peng Xu": "84/586", "Jingwei Su": "216/8838", "Zhongbao Zhang": "95/9457"}, "abstract": " Abstract:In the past few years, there has been a rapid growth in cloud computing, especially IaaS. It's a trend to use hybrid clouds that incorporate components of private and public clouds in order to achieve lower cost, higher availability and better security. Enterprises could get the benefits from it, including high elasticity, efficiency, flexibility, etc. In the meantime, they are faced with a set of challenges in cloud management. However, previous researches have primarily focused on single cloud platform, with lack of efficient management of hybrid clouds. To bridge this gap, in this paper, we propose a distributed hybrid cloud management platform based on rule engine. We design a succinct rule model to define rules and events. Combined with a distributed and reliable architecture, the demands of batch processing, automatic operation could be met, which make it more flexible and efficient to manage cloud resources from multiple IaaS cloud providers."}, "conf/globecom/ZhangSLGZ18": {"title": "Efficient Multi-Pair Active Friending in Online Social Networks.", "url": "https://doi.org/10.1109/GLOCOM.2018.8647329", "year": "2018", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Xu Liu": "93/3167", "Yutong Guo": "236/3066", "Jiaju Zhang": "236/3094"}, "abstract": " Abstract:In recent years, friending recommendation has played a crucial role on the explosive growth of online social networks. Prior studies on this problem have the following two limitations: i) they assume that there is only one pair of source and target at one time; and ii) the intermediate user can indefinitely forward friending requests. These two assumptions are impractical for online social networks. To bridge this gap, we study how to maximize the acceptance probability for multi-pair active friending in online social networks. In this paper, we first establish a probability model for the Multi-pair Active Friending with Tolerance and then propose two efficient algorithms: Multi-pair Active Friending algorithm for Conflict Resolution (MAFCR) and Group-based Multi-pair Active Friending algorithm for Conflict Resolution (MAFCR-G). Through extensive experiments, we show that the algorithm MAFCR significantly outperforms the baseline algorithm in terms of average acceptance probability, and the algorithm MAFCR-G greatly reduces the running time while obtaining similar average acceptance probability."}, "conf/ijcai/SuSZLQ18": {"title": "MASTER: across Multiple social networks, integrate Attribute and STructure Embedding for Reconciliation.", "url": "https://doi.org/10.24963/ijcai.2018/537", "year": "2018", "author": {"Sen Su": "63/2499", "Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Gen Li": "28/538", "Jielun Qu": "222/7923"}, "abstract": ""}, "conf/prcv/YangZZW18": {"title": "Research on Real-Time Vehicle Detection Algorithm Based on Deep Learning.", "url": "https://doi.org/10.1007/978-3-030-03341-5_11", "year": "2018", "author": {"Wei Yang": "03/1094", "Ji Zhang": "86/1953", "Zhongbao Zhang": "95/9457", "Hongyuan Wang": "17/203"}, "abstract": "At present, the demand for transportation is continuously increasing, and the consequent traffic congestion problem has become more and more prominent. How to automatically and timely detect vehicles to analyze road traffic information is an important issue for intelligent traffic monitoring systems (ITS). In some existing methods for to detect vehicles, real-time performance and precision cannot be taken into account at the same time. Hereby, a method of automatic vehicle detection, which has the high performance on real-time and precision, is proposed in this paper. This method improves the YOLOv2 framework model in following aspects: introducing a new loss function, expanding the grid size, and optimizing the number and size of anchors in the model to automatically learn vehicle characteristics. Compared with YOLOv2, YOLOv3 and Faster RCNN, both the precision and the real-time performance of this method are improved competitively.KeywordsVehicle detectionReal-time detectionYOLOv2Loss function"}, "conf/ecai/WangZSCZ16": {"title": "Topic-Level Influencers Identification in the Microblog Sphere.", "url": "https://doi.org/10.3233/978-1-61499-672-9-1559", "year": "2016", "author": {"Yakun Wang": "30/3634", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Cheng Chang": "41/4917", "Muhammad Azam Zia": "184/8330"}, "abstract": ""}, "conf/globecom/ZhangSSLZ16": {"title": "Energy Aware Virtual Network Migration.", "url": "https://doi.org/10.1109/GLOCOM.2016.7841788", "year": "2016", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Kai Shuang": "68/189", "Weitian Li": "194/6962", "Muhammad Azam Zia": "184/8330"}, "abstract": " Abstract:In network virtualization, one of the key problems is to embed a sequence of virtual networks with both node and link constraints onto the physical network, which is known to be NP-hard. When a virtual network arrives, the recent studies focus on designing a solution to minimize the energy cost while maximizing the revenue of the physical network at that time. However, after some time, due to the significant dynamics of the resources of the physical network, the previous solution may become less energy efficient. In this paper, we take a further step and study how to re-optimize the energy cost by leveraging the migration technique. In particular, we first model the pros (e.g., energy saving) and cons (e.g., interruption time and bandwidth waste) of migration. Then we design a heuristic energy aware virtual network migration algorithm called EA-VNM. It answers the following key questions: when performing migration, migrate which virtual nodes to where, and how to perform migration. Extensive simulations show that our algorithm significantly reduces the energy cost by up to 25% over the state-of-the-art algorithm while maintaining similar revenue."}, "conf/icc/ZhangSZSX15": {"title": "Energy aware virtual network embedding with dynamic demands.", "url": "https://doi.org/10.1109/ICC.2015.7249180", "year": "2015", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Junchi Zhang": "153/2859", "Kai Shuang": "68/189", "Peng Xu": "84/586"}, "abstract": " Abstract:In network virtualization, how to efficiently embed virtual networks with both node and link demands into a shared physical network, namely virtual network embedding, has attracted significant attention. Most of prior studies on this problem have the following two limitations: i) they assumed that the virtual network demands are constant values, which does not hold in real-world network since such demands may vary a lot over time; ii) their primary goal was to generate more revenues for the physical network, with no consideration of the energy cost, which has become a critical issue for the physical network. In this paper, we bridge the gap and study the energy aware virtual network embedding with dynamic demands. Specifically, we first model the dynamics of virtual network demands as a combination of following Gaussian distribution and exhibiting daily diurnal pattern. We then design an efficient heuristic algorithm by leveraging the dynamic characteristic of virtual network demands to minimize the energy consumption while keeping high revenue for the physical network. We implemented our algorithm in C++ and performed side-by-side comparison with prior algorithm. Extensive simulations show that our algorithm can significantly reduce the energy cost by up to 16% over the state-of-the-art algorithm, while maintaining near the same revenue."}, "conf/globecom/ZhangSNMCS12": {"title": "Minimizing electricity cost in geographical virtual network embedding.", "url": "https://doi.org/10.1109/GLOCOM.2012.6503510", "year": "2012", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Xinli Niu": "129/1141", "Jiao Ma": "94/7902", "Xiang Cheng 0003": "29/1059-3", "Kai Shuang": "68/189"}, "abstract": " Abstract:In light of rapid increase of electricity cost, many business organizations have to find new ways to cut the electricity bill. This paper studies how to reduce the electricity cost in geographical inter-domain virtual network embedding, which embeds virtual networks requested by users to multiple geographically distributed substrate networks run by an infrastructure provider. Previous researches have primarily focused on finding embedding methods to increase revenues by accommodating more virtual network requests, with little attention to reducing the electricity cost. To bridge this gap, we formulate an electricity cost model and design an efficient cost-aware virtual network embedding algorithm by exploiting the location-varying and time-varying diversities of the electricity price and optimizing the energy consumption. Through extensive simulations, we show that our algorithm can significantly reduce the electricity cost by up to 21% over the existing cost-oblivious algorithm, while maintaining nearly the same revenues for the infrastructure provider."}, "conf/icc/WangSJZS12": {"title": "Optimal routing and bandwidth allocation for multiple inter-datacenter bulk data transfers.", "url": "https://doi.org/10.1109/ICC.2012.6364679", "year": "2012", "author": {"Yiwen Wang": "00/4918", "Sen Su": "63/2499", "Sujuan Jiang": "122/4954", "Zhongbao Zhang": "95/9457", "Kai Shuang": "68/189"}, "abstract": " Abstract:Bulk data transfers account for a large portion of inter-datacenter traffic, such as backups, propagation of bulky updates and migration of data. These bulk data transfers not only consume massive inter-datacenter bandwidth, but also increase the transmission cost of datacenters. To solve this problem, we first employ the max-min fairness to the design of optimal multiple bulk data transfers scheduling algorithm, which leverages the delay tolerance nature of bulk data and reuses dynamic leftover bandwidth to complete multiple bulk data transfers. Then we apply time-expanded technique to transform the problem under a dynamic network into a static network multi-flow problem, and solve it simultaneously from both routing assignment and bandwidth allocation through iterative linear programming approach. Extensive simulations are conducted on a real datacenter topology to demonstrate that our solutions can: 1) improve the network resource utilization; 2) minimize the average bulk data transfer completion time."}, "conf/infocom/SuZCWLW12": {"title": "Energy-aware virtual network embedding through consolidation.", "url": "https://doi.org/10.1109/INFCOMW.2012.6193473", "year": "2012", "author": {"Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Xiang Cheng 0003": "29/1059-3", "Yiwen Wang": "00/4918", "Yan Luo": "25/2208", "Jie Wang 0002": "29/5259-2"}, "abstract": " Abstract:The rising cost of electricity has forced business organizations to find new ways to cut energy spending. This paper studies how to reduce energy consumption in virtual network embedding, which embeds virtual networks (VNs) requested by users to a shared substrate network (SN) run by an infrastructure provider (InP). Previous research has primarily focused on finding embedding methods to increase revenues by accommodating more VN requests in a fixed SN, with little attention to reducing the energy cost. To fill this gap we formulate an energy consumption model and devise an efficient energy-aware VN embedding algorithm using a consolidation technique. Through preliminary simulations we show that our algorithm can significantly reduce energy consumption by up to 30% over the existing energy-oblivious algorithm, while obtaining attractive revenues for the InPs."}, "conf/hpcc/LiSCHZ11": {"title": "Cost-Conscious Scheduling for Large Graph Processing in the Cloud.", "url": "https://doi.org/10.1109/HPCC.2011.147", "year": "2011", "author": {"Jian Li": "33/5448", "Sen Su": "63/2499", "Xiang Cheng 0003": "29/1059-3", "Qingjia Huang": "36/10372", "Zhongbao Zhang": "95/9457"}, "abstract": " Abstract:In recent years large graph processing has emerged to be a popular application for companies because of the increasing large Web graph and social networks. The ever growing scale of graphs and recent emergence of cloud computing poses challenges to their efficient and cost-conscious scheduling approach for processing tasks. In this paper, we focus on the use of cloud resources for dispatching large graph processing tasks. We design a novel framework EComer that can be easily integrated into existing cloud infrastructure. The key component of this framework is a cost-conscious scheduling heuristic, called CCSH, which is an extension of Heterogeneous Earliest Finish Time (HEFT). Our algorithm CCSH first constructs a priority list of tasks and then assigns the task with the highest priority value to the cost-efficient virtual machine in a cloud setting. The comparison study, based on randomly generated large graphs and a real-life astronomy application model, demonstrates that our algorithm outperforms HEFT by exhibiting significant monetary cost savings at a reasonable increase in overall execution time."}, "journals/isci/GaoZSY22": {"title": "REBORN: Transfer learning based social network alignment.", "url": "https://doi.org/10.1016/j.ins.2021.12.081", "year": "2022", "author": {"Shuai Gao": "03/4179", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "Social network alignment (SNA) aims to identify the same person across different social networks. Existing SNA methods can be categorized as supervised, semi-supervised and unsupervised. However, for supervised and semi-supervised methods, obtaining supervisions is expensive and time-consuming; for unsupervised methods, their performances will reach to a bottleneck due to the lack of supervisions. In the real world, there exist many social networks which have already been aligned spending money and time, and many social networks to be aligned. To bridge this gap, we study the SNA problem from the transfer learning perspective, and propose to leverage the knowledge of two aligned social networks (source domain) to facilitate the alignment of two unaligned social networks (target domain). Specifically, we first propose Ego-Transformer to align two social networks in the same domain. Then, we propose WWGAN to eliminate the shift between different domains. Finally, we propose REBORN which tactfully incorporates Ego-Transformer and WWGAN together. We conduct extensive experiments on the datasets of Facebook-Twitter and Weibo-Douban, and compare REBORN with 8 state-of-the-art SNA methods including SNNA, MSUIL, BRIGHT, DeepLink, IONE, PALE, WAlign, and UUILgan. The results demonstrate that REBORN can averagely achieve 20.02% higher Precision@k and 23.23% higher MAP@k compared with these methods."}, "journals/tcc/ZhangCSL22": {"title": "Energy Aware Virtual Network Migration.", "url": "https://doi.org/10.1109/TCC.2020.2976966", "year": "2022", "author": {"Zhongbao Zhang": "95/9457", "Huafeng Cao": "181/3748", "Sen Su": "63/2499", "Weitian Li": "194/6962"}, "abstract": " Abstract:In network virtualization, one of the key problems is to embed a sequence of virtual networks with both node and link constraints onto the physical network, which is known to be NP-hard. Recent studies focus on how to minimize the energy cost while maximizing the revenue of the physical network when the VN request arrives. However, after a period of time, due to the dramatic dynamics of the resources of the physical network, the previous solution may become less energy efficient. In this article, we study how to re-optimize the energy cost by leveraging the migration technique. In particular, we first give the problem model of virtual network migration. Then we design two energy aware virtual network migration algorithms called EA-VNM and EA-VNM-G. For EA-VNM, it answers the following key questions: when to perform migration, migrate which virtual nodes to where, and how to perform migration. Especially, for EA-VNM-G, it further reduces the high time complexity problem of EA-VNM by grouping the virtual nodes to be migrated with fewer conflicts. Extensive simulations show that EA-VNM significantly reduces the energy cost by up to 25 percent over the state-of-the-art algorithm while maintaining similar revenue and EA-VNM-G reduces the running time significantly."}, "journals/tkde/ZhangYWSSY22": {"title": "DeepBlue: Bi-Layered LSTM for Tweet popUlarity Estimation.", "url": "https://doi.org/10.1109/TKDE.2021.3049529", "year": "2022", "author": {"Zhongbao Zhang": "95/9457", "Zichang Yin": "259/6793", "Jian Wen": "03/3275", "Li Sun 0008": "57/2405-8", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": " Abstract:In social networks, one of the most significant challenges is how to estimate the tweet popularity. Prior studies focus on leveraging different aspects of just a single tweet, while ignoring the impact of historical tweets. In this article, we propose to leverage such historical information and rethink the problem of tweet popularity estimation. From historical information, there are two important factors that can be extracted: (1) user reputation feature, which can represent coarse-grained level of tweet popularity and (2) tweet related features, which can represent fine-grained level of tweet popularity. To incorporate these two factors from historical information, we design a novel deep neural architecture, a Bi-layered LSTM for tweet popUlarity Estimation, called DeepBlue. Specifically, we first propose a user-reputation aware mechanism to combine coarse-grained and fine-grained level estimation into a united LSTM model. We also design a content attention mechanism to consider different impacts of historical tweets in terms of content similarity. We then propose a time aware mechanism to address the time interval irregularity issue. Finally, we apply the Poisson regression model to obtain the overall loss for tweet popularity estimation. Extensive experiments demonstrate the superiority of our proposed approach to other state-of-the-arts in terms of MAE and SRC."}, "journals/corr/abs-2209-02908": {"title": "PERFECT: A Hyperbolic Embedding for Joint User and Community Alignment.", "url": "https://doi.org/10.48550/arXiv.2209.02908", "year": "2022", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Jiawei Zhang 0001": "10/239-1", "Feiyang Wang": "161/8387", "Yang Du": "51/3199", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "\n      Abstract:  Social network alignment shows fundamental importance in a wide spectrum of\napplications. To the best of our knowledge, existing studies mainly focus on\nnetwork alignment at the individual user level, requiring abundant common\ninformation between shared individual users. For the networks that cannot meet\nsuch requirements, social community structures actually provide complementary\nand critical information at a slightly coarse-grained level, alignment of which\nwill provide additional information for user alignment. In turn, user alignment\nalso reveals more clues for community alignment. Hence, in this paper, we\nintroduce the problem of joint social network alignment, which aims to align\nusers and communities across social networks simultaneously. Key challenges lie\nin that 1) how to learn the representations of both users and communities, and\n2) how to make user alignment and community alignment benefit from each other.\nTo address these challenges, we first elaborate on the characteristics of\nreal-world networks with the notion of delta-hyperbolicity, and show the\nsuperiority of hyperbolic space for representing social networks. Then, we\npresent a novel hyperbolic embedding approach for the joint social network\nalignment, referred to as PERFECT, in a unified optimization. Extensive\nexperiments on real-world datasets show the superiority of PERFECT in both user\nalignment and community alignment.\n\n    "}, "journals/kbs/CaoZSW21": {"title": "Inductive and irregular dynamic network representation based on ordinary differential equations.", "url": "https://doi.org/10.1016/j.knosys.2021.107271", "year": "2021", "author": {"Huafeng Cao": "181/3748", "Zhongbao Zhang": "95/9457", "Li Sun 0008": "57/2405-8", "Zhi Wang": "95/6543"}, "abstract": "Dynamic network representation has aroused increasing attention from researchers since it reflects the characteristics of real-world networks and has been widely used in various applications. Enormous efforts have been made to this problem. Existing studies often use fixed-time steps. However, in fact, the dynamics in real-world networks are usually irregular over time. To address this problem, in this paper, we employ ordinary differential equations and propose a novel graph representation approach for dynamic networks, namely Graph-ODE. The core idea lies in that it leverages ordinary differential equations to model the continuous latent dynamics of the network and therefore can naturally capture the evolution pattern. Specifically, to deal with the irregularity of node interactions, we first propose a differential form of GRU aggregator to aggregate the chronological neighbors. In addition, we employ neighbor sampling strategies for efficiency. Besides, our inductive algorithm owns the ability to deal with new emerging nodes. Experimental results on various real-world data sets demonstrate that our method significantly outperforms several state-of-the-art algorithms on downstream tasks."}, "journals/tkde/ZhangSSQL21": {"title": "Reconciling Multiple Social Networks Effectively and Efficiently: An Embedding Approach.", "url": "https://doi.org/10.1109/TKDE.2019.2929786", "year": "2021", "author": {"Zhongbao Zhang": "95/9457", "Li Sun 0008": "57/2405-8", "Sen Su": "63/2499", "Jielun Qu": "222/7923", "Gen Li": "28/538"}, "abstract": " Abstract:Recently, reconciling social networks, identifying the accounts belonging to the same individual across social networks, receives significant attention from both academic and industry. Most of the existing studies have limitations in the following three aspects: multiplicity, comprehensiveness and robustness. To address these limitations, we rethink this problem and, for the first time, robustly and comprehensively reconcile multiple social networks. In this paper, we propose two frameworks, MASTER and MASTER+, i.e., across Multiple social networks, integrate Attribute and STructure Embedding for Reconciliation. In MASTER, we first design a novel Constrained Dual Embedding model, simultaneously embedding and reconciling multiple social networks, to formulate this problem into a unified optimization. To address this optimization, we then design an effective NS-Alternating algorithm and prove it converges to KKT points. To further speed up MASTER, we propose a scalable framework, namely MASTER+. The core idea is to group accounts into clusters and then perform MASTER in each cluster in parallel. Specifically, we design an efficient Augmented Pre-Embedding model and Balance-aware Fuzzy Clustering algorithm for the high efficiency and the high accuracy. Extensive experiments demonstrate that both MASTER and MASTER+ outperform the state-of-the-art approaches. Moreover, MASTER+ inherits the effectiveness of MASTER and enjoys higher efficiency."}, "journals/corr/abs-2104-02228": {"title": "Hyperbolic Variational Graph Neural Network for Modeling Dynamic Graphs.", "url": "https://arxiv.org/abs/2104.02228", "year": "2021", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Jiawei Zhang 0001": "10/239-1", "Feiyang Wang": "161/8387", "Hao Peng": "69/7742", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "\n      Abstract:  Learning representations for graphs plays a critical role in a wide spectrum\nof downstream applications. In this paper, we summarize the limitations of the\nprior works in three folds: representation space, modeling dynamics and\nmodeling uncertainty. To bridge this gap, we propose to learn dynamic graph\nrepresentation in hyperbolic space, for the first time, which aims to infer\nstochastic node representations. Working with hyperbolic space, we present a\nnovel Hyperbolic Variational Graph Neural Network, referred to as HVGNN. In\nparticular, to model the dynamics, we introduce a Temporal GNN (TGNN) based on\na theoretically grounded time encoding approach. To model the uncertainty, we\ndevise a hyperbolic graph variational autoencoder built upon the proposed TGNN\nto generate stochastic node representations of hyperbolic normal distributions.\nFurthermore, we introduce a reparameterisable sampling algorithm for the\nhyperbolic normal distribution to enable the gradient-based learning of HVGNN.\nExtensive experiments show that HVGNN outperforms state-of-the-art baselines on\nreal-world datasets.\n\n    "}, "journals/corr/abs-2112-05393": {"title": "A Self-supervised Mixed-curvature Graph Neural Network.", "url": "https://arxiv.org/abs/2112.05393", "year": "2021", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Junda Ye": "308/7038", "Hao Peng": "69/7742", "Jiawei Zhang 0001": "10/239-1", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "\n      Abstract:  Graph representation learning received increasing attentions in recent years.\nMost of existing methods ignore the complexity of the graph structures and\nrestrict graphs in a single constant-curvature representation space, which is\nonly suitable to particular kinds of graph structure indeed. Additionally,\nthese methods follow the supervised or semi-supervised learning paradigm, and\nthereby notably limit their deployment on the unlabeled graphs in real\napplications. To address these aforementioned limitations, we take the first\nattempt to study the self-supervised graph representation learning in the\nmixed-curvature spaces. In this paper, we present a novel Self-supervised\nMixed-curvature Graph Neural Network (SelfMGNN). Instead of working on one\nsingle constant-curvature space, we construct a mixed-curvature space via the\nCartesian product of multiple Riemannian component spaces and design\nhierarchical attention mechanisms for learning and fusing the representations\nacross these component spaces. To enable the self-supervisd learning, we\npropose a novel dual contrastive approach. The mixed-curvature Riemannian space\nactually provides multiple Riemannian views for the contrastive learning. We\nintroduce a Riemannian projector to reveal these views, and utilize a\nwell-designed Riemannian discriminator for the single-view and cross-view\ncontrastive learning within and across the Riemannian views. Finally, extensive\nexperiments show that SelfMGNN captures the complicated graph structures in\nreality and outperforms state-of-the-art baselines.\n\n    "}, "journals/jips/MaZS20": {"title": "Energy-Aware Virtual Data Center Embedding.", "url": "https://doi.org/10.3745/JIPS.02.0112", "year": "2020", "author": {"Xiao Ma": "35/573", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499"}, "abstract": ""}, "journals/tnse/GaoZSWS20": {"title": "Fair-Aware Competitive Event Influence Maximization in Social Networks.", "url": "https://doi.org/10.1109/TNSE.2020.2997021", "year": "2020", "author": {"Siyuan Gao": "196/0809", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Jian Wen": "03/3275", "Li Sun 0008": "57/2405-8"}, "abstract": " Abstract:With the emergence and rapid development of event-based social networks (EBSNs), the problem of how to maximize the number of participants for social events has been widely studied. Most previous studies on this problem focus on a single social event. However, in real-world scenarios, there are multiple social events and they may compete for influential users to maximize the number of participants since they may be held during the same time period and in acceptable geographic locations. To bridge this gap, in this paper, we propose to study a novel problem of Fair-Aware Competitive Event Influence Maximization (FCE-IM). This problem is how to select influential users for each social event on the premise of fairness to maximize the number of participants per event in the competitive scenario. To solve this problem, we first propose a propagation model, named E-LT, to describe the information propagation process in competitive situation in EBSNs. Then, we propose a Randomized Algorithm based on Cross Entropy method, named RACE. It can optimally assign node selection probability for each node and thus effectively approach to the maxima. We conduct extensive experiments using two real-world datasets and experimental results demonstrate the efficiency and effectiveness of our algorithm."}, "journals/fcsc/XuLCZ19": {"title": "An efficient energy aware virtual network migration based on genetic algorithm.", "url": "https://doi.org/10.1007/s11704-019-8084-6", "year": "2019", "author": {"Peng Xu": "84/586", "Xu Liu": "93/3167", "Huafeng Cao": "181/3748", "Zhongbao Zhang": "95/9457"}, "abstract": ""}, "journals/jaciii/MaZS19": {"title": "Energy-Aware Virtual Data Center Migration.", "url": "https://doi.org/10.20965/jaciii.2019.p0209", "year": "2019", "author": {"Xiao Ma": "35/573", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499"}, "abstract": ""}, "journals/kbs/XuDZ19": {"title": "Predicting pipeline leakage in petrochemical system through GAN and LSTM.", "url": "https://doi.org/10.1016/j.knosys.2019.03.013", "year": "2019", "author": {"Peng Xu": "84/586", "Rui Du": "75/4745", "Zhongbao Zhang": "95/9457"}, "abstract": "In petrochemical system, how to predict the leakage of pipeline is one of the most critical problems due to its huge side effects. Prior studies are mostly based on statistical analysis and they focus on the healthiest state of the system. However, these approaches ignore the trend of changes among data and lead to low accuracies. In this paper, we conduct research on characteristic of petrochemical data and get four core findings. We find that the data are (1) noisy, (2) high dimension, (3) imbalanced, (4) temporal correlated. According to these findings, we propose a novel neural network based classification model using GAN and LSTM to predict the leakage of pipeline. Specifically, we firstly apply a sliding window and a key feature selecting method in data preparation stage to address the noise and high dimension problems. We then propose a GAN based data enhancement approach to synthesize fault data to address the imbalance problem. After that, we propose an LSTM based classifier approach to learn the temporal correlation of data and classify the state of pipeline to predict leakage. We conduct extensive experiments and they show that our approach achieves 2× F1 score (0.8166) and 3× AUC (0.8940) compared to the existing methods. Our proposed neural network based approach is more suitable for fault prediction of pipeline leakage in petrochemical system."}, "journals/corr/abs-1911-00067": {"title": "DNA: Dynamic Social Network Alignment.", "url": "http://arxiv.org/abs/1911.00067", "year": "2019", "author": {"Li Sun 0008": "57/2405-8", "Zhongbao Zhang": "95/9457", "Pengxin Ji": "252/5246", "Jian Wen": "03/3275", "Sen Su": "63/2499", "Philip S. Yu": "y/PhilipSYu"}, "abstract": "\n      Abstract:  Social network alignment, aligning different social networks on their common\nusers, is receiving dramatic attention from both academic and industry. All\nexisting studies consider the social network to be static and neglect its\ninherent dynamics. In fact, the dynamics of social networks contain the\ndiscriminative pattern of an individual, which can be leveraged to facilitate\nsocial network alignment. Hence, we for the first time propose to study the\nproblem of aligning dynamic social networks. Towards this end, we propose a\nnovel Dynamic social Network Alignment (DNA) framework, a unified optimization\napproach over deep neural architectures, to unfold the fruitful dynamics to\nperform alignment. However, it faces tremendous challenges in both modeling and\noptimization: (1) To model the intra-network dynamics, we explore the local\ndynamics of the latent pattern in friending evolvement and the global\nconsistency of the representation similarity with neighbors. We design a novel\ndeep neural architecture to obtain the dual embedding capturing local dynamics\nand global consistency for each user. (2) To model the inter-network alignment,\nwe exploit the underlying identity of an individual from the dual embedding in\neach dynamic social network. We design a unified optimization approach\ninterplaying proposed deep neural architectures to construct a common subspace\nof identity embeddings. (3) To address this optimization problem, we design an\neffective alternating algorithm with solid theoretical guarantees.We conduct\nextensive experiments on real-world datasets and show that the proposed DNA\nframework substantially outperforms the state-of-the-art methods.\n\n    "}, "journals/ijdsn/XuHLZ18": {"title": "An efficient load balancing algorithm for virtual machine allocation based on ant colony optimization.", "url": "https://doi.org/10.1177/1550147718793799", "year": "2018", "author": {"Peng Xu": "84/586", "Guimin He": "237/4217", "Zhenhao Li": "46/10202", "Zhongbao Zhang": "95/9457"}, "abstract": ""}, "journals/isci/GaoZSZ18": {"title": "Multi-role event organization in social networks.", "url": "https://doi.org/10.1016/j.ins.2018.03.017", "year": "2018", "author": {"Siyuan Gao": "196/0809", "Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Muhammad Azam Zia": "184/8330"}, "abstract": "Recently, event-based social networks (EBSNs) have become popular, hence how to organize a social event has received significant attention. Most of prior studies about social events organization usually consider the willingness of attendees and their relationships. However, they ignore the roles of attendees. In fact, many social events have requirement of attendees roles in the real world. In this paper, we propose to study the problem of Multi-Role Social Event Organization (MRSEO). Our goal is to maximize the overall harmony of the social event while considering multiple factors, such as attendees’ roles, willingness and their relationships. To solve the problem, we propose two algorithms. Firstly, we propose a continuous relaxation technique based algorithm, called MRSEO-CRA. It converts the problem of MRSEO to an equivalent unconstrained continuous problem, and then employs RatioDCA algorithm to solve the converted one. Secondly, to better trade off between performance and running time, we further propose the other algorithm based on improved PageRank, called MRSEO-IPR. We conduct extensive experiments on real-world datasets to evaluate these two proposed algorithms and experimental results show that our algorithms outperform the state-of-the-art algorithm in terms of performance and running time."}, "journals/jei/NiGWZCJ18": {"title": "Discriminative deep transfer metric learning for cross-scenario person re-identification.", "url": "https://doi.org/10.1117/1.JEI.27.4.043026", "year": "2018", "author": {"Tongguang Ni": "145/6051", "Xiaoqing Gu": "44/9370", "Hongyuan Wang": "17/203", "Zhongbao Zhang": "95/9457", "Shoubing Chen": "225/9591", "Cui Jin": "64/7668"}, "abstract": ""}, "journals/ml/SuWZCZ18": {"title": "Identifying and tracking topic-level influencers in the microblog streams.", "url": "https://doi.org/10.1007/s10994-017-5665-1", "year": "2018", "author": {"Sen Su": "63/2499", "Yakun Wang": "30/3634", "Zhongbao Zhang": "95/9457", "Cheng Chang": "41/4917", "Muhammad Azam Zia": "184/8330"}, "abstract": "Topic-level social influence analysis has been playing an important role in the online social networks like microblogs. Previous works usually use the cumulative number of links, such as the number of followers, to measure users’ topic-level influence in a static network. However, they ignore the dynamics of influence and the methods they proposed can not be applied to social streams. To address the limitations of prior works, we firstly propose a novel topic-level influence over time (TIT) model integrating the text, links and time to analyze the topic-level temporal influence of each user. We then design an influence decay based approach to measure users’ topic-level influence from the learned temporal influence. In order to track the influencers in data streams, we combine TIT and the influence decay method into a united online model (named oTIT), which is applicable to dynamic scenario. Through extensive experiments, we demonstrate the superiority of our approach, compared with the baseline and the state-of-the-art method. Moreover, we discover influence exhibits significantly different variation patterns over different topics, which verifies our viewpoint and gives us a new angle to understand its dynamic nature."}, "journals/ijdsn/LiuZLS17": {"title": "Clustering-based energy-aware virtual network embedding.", "url": "https://doi.org/10.1177/1550147717726714", "year": "2017", "author": {"Xu Liu": "93/3167", "Zhongbao Zhang": "95/9457", "Junning Li": "39/368", "Sen Su": "63/2499"}, "abstract": ""}, "journals/isci/ZhangGYS17": {"title": "Identifying the same person across two similar social networks in a unified way: Globally and locally.", "url": "https://doi.org/10.1016/j.ins.2017.02.008", "year": "2017", "author": {"Zhongbao Zhang": "95/9457", "Qihang Gu": "196/0058", "Tong Yue": "196/0202", "Sen Su": "63/2499"}, "abstract": "With the increasing popularity of online social networks, people today typically own several such accounts (e.g., Facebook, Twitter, and Flickr). In this scenario, it arises an interesting and challenging problem: how to identify the same person in different social networks, which is known as the network reconciliation problem. Prior work on this problem first assumes that the relationships between users are homogeneous, and then makes use of the local features (degree, common mapped neighbors) to achieve high precision. However, this assumption does not hold in reality since users usually have different tie strengths between each other. In this paper, we remodel the reconciliation problem by considering the users’ heterogeneous relationships and propose a unified framework called UniRank for incorporating the local features and global features together. Based on UniRank, we design an efficient two-stage network reconciliation algorithm. First, we design a global matching algorithm to explore more seeds with fast speed. Second, for each explored seed, we design a breadth-first strategy based local matching algorithm to match more seeds. Extensive simulations on real-world and synthetic social network datasets show that our algorithm significantly improves the state-of-art algorithm by up to 9X in terms of F1 score even under very rough conditions."}, "journals/jaciii/ZiaZLAS17": {"title": "Prediction of Rising Venues in Citation Networks.", "url": "https://doi.org/10.20965/jaciii.2017.p0650", "year": "2017", "author": {"Muhammad Azam Zia": "184/8330", "Zhongbao Zhang": "95/9457", "Guangda Li": "57/5701", "Haseeb Ahmad": "148/5888", "Sen Su": "63/2499"}, "abstract": ""}, "journals/jips/ZiaZCAS17": {"title": "Identifying Influential People Based on Interaction Strength.", "url": "https://doi.org/10.3745/JIPS.04.0041", "year": "2017", "author": {"Muhammad Azam Zia": "184/8330", "Zhongbao Zhang": "95/9457", "Liutong Chen": "206/2096", "Haseeb Ahmad": "148/5888", "Sen Su": "63/2499"}, "abstract": ""}, "journals/kbs/ZhangWSDSY17": {"title": "Efficient incremental dynamic link prediction algorithms in social network.", "url": "https://doi.org/10.1016/j.knosys.2017.06.035", "year": "2017", "author": {"Zhongbao Zhang": "95/9457", "Jian Wen": "03/3275", "Li Sun 0008": "57/2405-8", "Qiaoyu Deng": "204/9745", "Sen Su": "63/2499", "Pengyan Yao": "80/11191"}, "abstract": "To enhance customers’ loyalty and experience, link prediction in social networks can help service providers to predict the friendship between users in the future, according to the network structure and personal information. However, most of prior studies consider link prediction in the static scenario while ignoring that the social network generally is updated over time. In this paper, to address this problem, we design two efficient incremental dynamic algorithms that can predict the relationship between users according to the updated social network structure. The first one, instead of using classic prediction index, creates a latent space for each node in the network, and adopts the incremental calculation to predict the future links according to the position of each node in the latent space. The second one is a dynamic improved algorithm based on the resource allocation index, which only recalculates updated part of the social network structure instead of the whole social network. Extensive experiments show that our first algorithm has high prediction accuracy while the second algorithm incurs low running time cost at the expense of less prediction accuracy."}, "journals/ejwcn/LiuZLS16": {"title": "Optimal virtual network embedding based on artificial bee colony.", "url": "https://doi.org/10.1186/s13638-016-0766-2", "year": "2016", "author": {"Xu Liu": "93/3167", "Zhongbao Zhang": "95/9457", "Ximing Li": "130/1013", "Sen Su": "63/2499"}, "abstract": ""}, "journals/cn/ZhangSZSX15": {"title": "Energy aware virtual network embedding with dynamic demands: Online and offline.", "url": "https://doi.org/10.1016/j.comnet.2015.09.036", "year": "2015", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Junchi Zhang": "153/2859", "Kai Shuang": "68/189", "Peng Xu": "84/586"}, "abstract": "In Network as a Service model in cloud computing, how to efficiently embed virtual networks with both node and link demands into a shared physical network, namely virtual network embedding, has attracted significant attention. Most of prior studies on this problem have the following two limitations: (i) they assumed that the virtual network demands are constants, which does not hold in real-world network since such demands may vary a lot over time; (ii) their primary goal was to achieve more revenues for the physical network, with no consideration of the energy cost, which has become a more and more critical issue. In this paper, we bridge the gaps and study the energy aware virtual network embedding problem with dynamic demands. Specifically, we first model the dynamics of virtual network demands as a combination of a Gaussian distribution and a daily diurnal pattern. We then design two efficient heuristic algorithms by leveraging the dynamic characteristic of virtual network demands to minimize the energy consumption while keeping a high revenue for the physical network. One algorithm processes the virtual network requests one by one while the other one processes them group by group. We implemented these two algorithms in C++ and performed side-by-side comparisons with the prior algorithm. Extensive simulations show that our algorithms significantly reduce the energy cost by up to 25% over the state-of-the-art algorithm, while maintaining near the same revenue."}, "journals/jnca/ZhangSLCSX15": {"title": "Adaptive multi-objective artificial immune system based virtual network embedding.", "url": "https://doi.org/10.1016/j.jnca.2015.03.007", "year": "2015", "author": {"Zhongbao Zhang": "95/9457", "Sen Su": "63/2499", "Yikai Lin": "159/3922", "Xiang Cheng 0003": "29/1059-3", "Kai Shuang": "68/189", "Peng Xu": "84/586"}, "abstract": "In network virtualization, there are two decoupled roles involved: (i) infrastructure providers who manage the substrate network, and (ii) service providers who request virtual networks to the infrastructure providers. Embedding virtual networks to a shared substrate network, which is termed as virtual network embedding problem, is widely believed as one of the most significant challenges in such context. For this problem, prior work primarily focuses on either (i) maximizing the revenues by accommodating more virtual network requests or (ii) minimizing the energy consumption by consolidating the virtual networks into minimum number of substrate nodes. In this paper, we aim at achieving these two goals simultaneously. We first formulate the virtual network embedding problem into a multi-objective integer linear programming. We then design an artificial immune system based algorithm to solve this programming. In this algorithm, (i) we design a discrete approach to encode the virtual node mapping solution as an antibody; (ii) to initialize the antibodies, we design two adaptive revenue and energy aware strategies for the node and link mapping, respectively, to strike a balance between revenue and energy costs; (iii) we design corresponding customized strategies in the cloning, crossover and mutation process of artificial immune system in virtual network embedding context; (iv) for the generated antibodies, we leverage the Pareto optimality for evaluating their quality. Through extensive simulations, we show that our algorithm outperforms the state-of-the-art algorithms in terms of the revenue and the energy consumption."}, "journals/cn/WangSLZ14": {"title": "Multiple bulk data transfers scheduling among datacenters.", "url": "https://doi.org/10.1016/j.comnet.2014.02.017", "year": "2014", "author": {"Yiwen Wang": "00/4918", "Sen Su": "63/2499", "Alex X. Liu": "l/AlexXLiu", "Zhongbao Zhang": "95/9457"}, "abstract": "Bulk data migration between datacenters is often a critical step in deploying new services, improving reliability under failures, or implementing various cost reduction strategies for cloud companies. These bulk amounts of transferring data consume massive bandwidth, and further cause severe network congestion. Leveraging the temporal and spacial characteristics of inter-datacenter bulk data traffic, in this paper, we investigate the Multiple Bulk Data Transfers Scheduling (MBDTS) problem to reduce the network congestion. Temporally, we apply the store-and-forward transfer mode to reduce the peak traffic load on the link. Spatially, we propose to lexicographically minimize the congestion of all links among datacenters. To solve the MBDTS problem, we first model it as an optimization problem, and then propose a novel Elastic Time-Expanded Network technique to represent the time-varying network status as a static one with a reasonable expansion cost. Using this transformation, we reformulate the problem as a Linear Programming (LP) model, and obtain the optimal solution through iteratively solving the LP model. We have conducted extensive simulations on a real network topology. The results prove that our algorithm can significantly reduce the network congestion as well as balance the entire network traffic with practical computational costs."}, "journals/ton/SuZLCWZ14": {"title": "Energy-Aware Virtual Network Embedding.", "url": "https://doi.org/10.1109/TNET.2013.2286156", "year": "2014", "author": {"Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Alex X. Liu": "l/AlexXLiu", "Xiang Cheng 0003": "29/1059-3", "Yiwen Wang": "00/4918", "Xinchao Zhao": "53/6264"}, "abstract": " Abstract:Virtual network embedding, which means mapping virtual networks requested by users to a shared substrate network maintained by an Internet service provider, is a key function that network virtualization needs to provide. Prior work on virtual network embedding has primarily focused on maximizing the revenue of the Internet service provider and did not consider the energy cost in accommodating such requests. As energy cost is more than half of the operating cost of the substrate networks, while trying to accommodate more virtual network requests, minimizing energy cost is critical for infrastructure providers. In this paper, we make the first effort toward energy-aware virtual network embedding. We first propose an energy cost model and formulate the energy-aware virtual network embedding problem as an integer linear programming problem. We then propose two efficient energy-aware virtual network embedding algorithms: a heuristic-based algorithm and a particle-swarm-optimization-technique-based algorithm. We implemented our algorithms in C++ and performed side-by-side comparison with prior algorithms. The simulation results show that our algorithms significantly reduce the energy cost by up to 50% over the existing algorithm for accommodating the same sequence of virtual network requests."}, "journals/ijcomsys/ZhangCSWSL13": {"title": "A unified enhanced particle swarm optimization-based virtual network embedding algorithm.", "url": "https://doi.org/10.1002/dac.1399", "year": "2013", "author": {"Zhongbao Zhang": "95/9457", "Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Yiwen Wang": "00/4918", "Kai Shuang": "68/189", "Yan Luo": "25/2208"}, "abstract": ""}, "journals/cn/ChengSZSYLW12": {"title": "Virtual network embedding through topology awareness and optimization.", "url": "https://doi.org/10.1016/j.comnet.2012.01.022", "year": "2012", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Kai Shuang": "68/189", "Fangchun Yang": "06/5366", "Yan Luo": "25/2208", "Jie Wang 0002": "29/5259-2"}, "abstract": "Embedding a sequence of virtual networks (VNs) into a given physical network substrate to accommodate as many VN requests as possible is known to be NP-hard. This paper presents a new approach to studying this problem. In particular, we devise a topology-aware measure on node resources based on random walks and use it to rank a node’s resources and topological attributes. We then devise a greedy algorithm that matches nodes in the VN to nodes in the substrate network according to node ranks. In most situations there exist multiple embedding solutions, and so we want to find the best embedding that increases the possibility of accepting future VN requests and optimizes the revenue for the provider of the substrate network. We present an integer linear programming formulation for this optimization problem when path splitting is not allowed. We then devise a fast-convergent discrete Particle Swarm Optimization algorithm to approximate this problem. Extensive simulation results show that our algorithms produce near optimal solutions and significantly outperform existing algorithms in terms of the ratio of the long-term average revenue over the VN request acceptance."}, "journals/ccr/ChengSZWYLW11": {"title": "Virtual network embedding through topology-aware node ranking.", "url": "https://doi.org/10.1145/1971162.1971168", "year": "2011", "author": {"Xiang Cheng 0003": "29/1059-3", "Sen Su": "63/2499", "Zhongbao Zhang": "95/9457", "Hanchi Wang": "03/9458", "Fangchun Yang": "06/5366", "Yan Luo": "25/2208", "Jie Wang 0002": "29/5259-2"}, "abstract": "Virtualizing and sharing networked resources have become a growing trend that reshapes the computing and networking architectures. Embedding multiple virtual networks (VNs) on a shared substrate is a challenging problem on cloud computing platforms and large-scale sliceable network testbeds. In this paper we apply the Markov Random Walk (RW) model to rank a network node based on its resource and topological attributes. This novel topology-aware node ranking measure reflects the relative importance of the node. Using node ranking we devise two VN embedding algorithms. The first algorithm maps virtual nodes to substrate nodes according to their ranks, then embeds the virtual links between the mapped nodes by finding shortest paths with unsplittable paths and solving the multi-commodity flow problem with splittable paths. The second algorithm is a backtracking VN embedding algorithm based on breadth-first search, which embeds the virtual nodes and links during the same stage using node ranks. Extensive simulation experiments show that the topology-aware node rank is a better resource measure and the proposed RW-based algorithms increase the long-term average revenue and acceptance ratio compared to the existing embedding algorithms."}}}